{
  "episodeGuid": "03c300a5-56ee-4931-9d5d-65ce322c872f",
  "episodeTitle": "300社応募してもダメだったのに…帰国後20社で内定獲得！カナダ経験者が語る、日本転職の圧倒的な「勝ち筋」とは？（後半）#32",
  "transcribedAt": "2026-02-08T08:59:52.711Z",
  "duration": 2772,
  "fullText": "はいっじゃああの前半の終わりではですねまああのレイオフがちょっと起こってしまいましたよとちょっと悲しい感じであの終わってしまったんですけれどもまあ後半あのその詳細と言いますかちょっとまああの心境みたいなところも聞きながら進めていけたらなと思いますあとはまあ日本に帰ってきてからのこともそうですねでじゃあまず初めにはですねあのオファーをもらった1社目あのどれぐらいの条件だったのかなというところからお聞きできたらだと思うん。ですけれどもはい年収は65K当時のレートで言うと720から730万円でした。ねジュニアっていうことを考えると悪くないというかむしろ中の上よりぐらいの条件かなって思いますけどそんな感じですよねいやそうです。ね全然十分かなって周りの、。ゆうとさんのクラスメイトは就活とかどうでした?ゆうとさん1年間で他のクラスメイトも同じような経験をされてそうでしたか?結局僕のクラスメイト25から30人いたうち1回でも現地企業に就職したのは5人、6人ぐらいででえっとそれ彼らの条件はあんまり聞いてないんですけど多分僕高い方だったんじゃないかなあとその給料言ったら。と思いますねちなみに全部やめたんですかそこからはあのなんだろうあるあるバイトあのスタバだったりとか日本企業みたいな結構いらっしゃい前にちょうどいっすねっよ0にして幸せだもう。こんな生活には戻れないとなってもそのオファーをもらったのが12月半ばで1月の次の年の1月からスタートだったんで2週間のギャップがあったんですけどもその間はもう天国でしたね働かずに仕事が決まっててもう2,3年ぶりぐらいにこんなにゆっくりできると思って。確かにそうなんですよねやっぱ次の仕事が決まっててまだ働き始めてないっていう状態が一番幸せです。よね幸せです一生それでいたいと思いましたもん。なんかそこまで込ん詰めて就活とかバイトとか色々やってるとそのバーンアウトみたいなところがね特にストレス1回解放されたみたいな時になっちゃわないかどうかっていうのは聞いてて心配になったんですけど優斗さんの時はどうでした?ケアとかされてました?バーンアウトはその1年間の就活の時に1回なっていてその時はもうバーンアウトになったんで1回カナダの就活を辞めたっていうのはありますねでそこで何とかプレッシャーリリーフができたのでもう1回持ち直したっていうのがあるんですけどなんでそこをちゃんとセルフキアしなかったら絶対潰れてて就職も出てなかっただろうなとは思い。ますレイオフまではどのぐらい働かれたんですか結局?結局プロベーション終わる直前なんで3ヶ月も…3ヶ月いけないとこで終わりました。ねいや、そこまでの苦難を乗り越えて3ヶ月っていうのはなかなか辛いですよ。ね。ですね。その言われた後、どうやって家に帰ったかっていうのを全然覚えてないぐらい放信状態だったん。で。よくある感じの、ダンボール渡されて自分の荷物持って帰るみたいな感じなんです。か?僕はダンボールに入れるほどの量はなかったので、自分のバックパックだけで帰りまし。た。ちなみにその時のレイオフの背景みたいなのはどんなことが理由だったんですか会社のファイナンシャルシチュエーションがとかいろいろあると思うんです。けどなんかその後々そのチームメンバーから教えてもらったのはなんかそもそも僕を雇うフェーズの段階であのフルタイムのエンジニアを増やすか増やさないかみたいなすごく中途半端な状態で進んでいってしまったみたいででいざそれで雇ってみたら意外とが寝かかるねみたいな感じであのレイオフ対象になったって。聞きましたねなんかそれぐらいちゃんと検討してから進んでくれよって感じですよねちょっともう精神的に振り回されすぎて聞いて辛くなってきますよ本当に確かに。まあでもとはいえなんかそのレイオフできるのがこっちの会社のいいところでもあるのかなって僕は思っててまあね今それがゆうとくんに起きたって言うとちょっとすごい悲しい気持ちにはなりつつもやっぱりそのなんかレイオフできないとやっぱりそのなんか魔導義和族みたいな人とかやっぱ日本みたいに生まれちゃうわけじゃないですかですごい結構不才だと思うんですよねでそのレイアートでレイフできないからこそそのにエンジニアの給料を上げられないみたいなのエンジニアだけじゃないのかなあの今日まあすべての業界で多分そうだと思うんですけどそのこの先この人を一生養わないといけないっていうなんかある種結婚のようなあの誓いをして人を雇わないといけないわけじゃないですか。それに比べて、カナダってレイオフできるから、とりあえず取って、お金かかっちゃったな、ダメだ、切るみたいなのもできるから、簡単に採用できて、バッとそのプロダクトとかを伸ばしてみたいなのも可能ではあるのかなっていうのがあるから必ずしもあとはそのレイオフがなかったらその窓際族の人たちでスポットが埋まるからそのそうじゃない人たちが入りにくいみたいなのもあると思うんで必ずしもレイオフがずっと悪いものだとは思わないけど確かにそのコンテキストを聞くとその3ヶ月でわかるぐらいのことは予測しとけっていうのはちょっとありますよ。ねですねまあ僕も特にそのレイオフに対してはネガティブなイメージはなくてまあそのもちろんいい意味悪い意味があると思っててもちろんそれ対象になった人からしたらふざけんなってなると思うんですけど僕もその日本の1社目の会そのエンジニアじゃない会社でそういう丸際族とか働かんけど年収1000万円もらってるとすごく大量に行ったのででその人がいるから若手はモチベーション上がらずで僕みたいに辞める人も多くみたいなシチュエーションではあったのでそういうところを是正できるのがレイオフなのかなと思ってますね確かに。おっしゃるようにあれですよねあの従業員側のモチベーションもやっぱ上がりますよねそのレイオフっていうのが隣り合わせにあるとあのまあうかうかしてたらね食い切られちゃうわけです。から。なんかパフォーマンスだその仕事とかその自分のパフォーマンスについてはどう思いました結構うまいことやれてるなぁみたいな感じですかそれとも結構大変でしたまあ大変ももちろん一社目であのこっちの会社で大変だとは思うんですけどまあ一。社目で大変ではあったんですけどその中パフォーマンスについて指摘されたことはなかったですしなんかそのなんて言うんでしょう本当にみんなにオンブに抱っこ状態までもなかったのでで。も3ヶ月残ったってことは、たぶんパフォーマンス的には全然大丈夫だったんだろうなって思いますよね。こっちのプロベーション、使用期間みたいなのプロベーションって言うと思うんですけど、ダメだっていう人はもう本当に1ヶ月目、2ヶ月目とかから結構どんどん切られてて、3ヶ月ギリギリまでっていうこともあんまないと思うんで。結果はどうあれでもそのやっぱお金もらって働く経験っていうのもあるしあとはそのレファラル先っていう意味でもそのね次にはつながると思うのでまあレイオフ自体は残念だったけどまあ働かないよりは全然マシって感じですよねもちろん。そうですねもそのゼロゼロ1の経験できたらでかいですねすごく自信に今もつながってます。しじゃあそのレイオフの直後、方針状態でお家に帰られて、そこからもう一回就活するのかとか、いろいろその後のことについて考えるきっかけになったかなとは思うんですけど、そこから日本の帰国、本帰国を決意されるまではどんな経緯がありました。か?そうですねレイオフされた直後はさすがに1週間ぐらいはちょっとゆっくりしてたんですけどでも働かなかったらワンクーバーでは生活できないっていうのはもちろんあったのでまた就活を再開しました一社リンクドインで偶然面接までつながった会社があってワンクーバーの現地企業でその会社との先行が結構進んだんですよね最終まで行ってそこは最終で落ちてしまったんですけどそのあたりからさらに追い打ちかけるようにまたダメージが来てそこで本当にずっとこのままカナダでこの苦しい生活を続けるべきなのか日本に帰っちゃうのかってすごく考えて日本に帰る方を選んだってとこですね結構限界まで来てたっていうのが一番あり。ます就職活動は大変ですからねやっぱお金の心配もあるし、結構あと、こっちって最終面接とか、面接が何回もあるし、時間もかかるじゃないですか。1日2日で終わって、はい、あさってから当たりてくださいみたいな感じじゃないじゃないですか。で、結構ちゃんとして、会社とかだったら、4回5回こっちは当たり前だし、技術面接あっ。て、。で、そっからも落ちるし、ゴーストっていうかなんていうの連絡こないみたいなのもあるし。結構精神的ダメージは結構。きますよねですねそのレイオフされた後に面接した会社も結局最終面接から1ヶ月待ってそこで落ちたっていう連絡が来てもうそれ待ってる期間もだいぶ辛くてで逆に結果分かった後は逆に楽になったんですよね。やっとなんか解放されたみたい。ななんかその日本の就活だと結構なんか何週間以内に返事しますっていうので面接が終わったりすると思うんですけど海外の企業だとなんかそのその辺のなんですかね待ってる方の気持ちをあんま組んでくれないみたいなのはちょっとなんかあるような気がし。ますね確かにまあでもやっぱそれ多分売り手市場海外は売り切れ市場だからなのかなって思いますよね。もういくらでも来るし、みたいな。終わった人のことまでケアしてられないみたいなのも多分あると思うから逆に日本では改定市場だから受かってもゴーストする人たちゴーストっていうか連絡しない人たちも多分いるじゃないですかだからしょうがないのかなと思いつつそんなもんだよねって思って生きていくしかないのかなっていうのも。ありつつごめんなさい1個いいですか今これカットしていただいて全然大丈夫なんですけど売り手市場と買い手市場がちょうど逆になってたなと思いました企業が買う方なんで買い手市場というのは企業が強い方です僕も逆だと勘違いしてたんでちょっとあのこれ編集の時に売り手市場は応募者が強い方です。ね売り手市場は応募者そう。いうことね難しい日本はどちらかというと売り手市場です。ねOKですこのまま残してそういうことにしていき。ましょうOKですじゃあちょっとそれちゃいましたけど日本に帰って一発目はフリーランスでの就労だったんですかね。ユートさんそうですねこれは一発目というかそのカナダ行った時から働いてた企業にそのまま一旦はそのまま働き続けたという。流れですねもうそのままじゃあ。あのリモートでですねずっとリモート。で働いてましたそこではどれぐらい働かれたんですかフリーランスで。結局、1年近く働いてましたね。2024年の4月、5月ぐらいから、それも2025年の3月末までなの。で。フリーランスというと、その時の生活のリズムみたいなのはどんな感じでした。か?結構、カナダの時間に合わせることができて、なんかもう朝から働いてで夕方のそのミーティングその日本時間で言ったらデイリースクラムもちろん言ったら夕方5時6時のミーティングに出て終わりっていう感じでしたねじゃあ。そこのリモートの仕事日本の仕事を続けつつ帰国の準備をして日本に帰ってという感じになりますか。ねはいそう。ですそのリモートの日本の仕事内容はどんな感じだったんです。か?ウェブアプリケーションを作ってたんですけど主なクライアントは不動産業界で衛星写真と不動産の情報を書き合わせて土地探すのを簡単にしようみたいな事業をやってる感じです。ねじゃあまあ帰国の時にその日本向けの就活みたいなのは特にしなかったんですよ。ね?まだそうではしなかったです。ね。で、1年働かれて、1年経つぐらいのタイミングで転職活動というかをされたんですか。ね?そうですね。帰ってきてちょうど年、えっと2025年の1月ぐらいから転職活動を始めまし。た。まあカナダの生活と比べる。とあと先どうぞなんかその定職したくなった理由みたいなのはあるんですかちなみ。にまあそのちょうど日本に日本に帰ってきたしエンジニアとしても一応丸2年の経験がついたので自分自分の市場価値っていうのを知りたくてすごくあのカジュアルな気持ちで始めまし。たカナダの就活に比べると日本の就活ってそんなにやっぱ難易度としては比べると高くないかなと思うんですけれどもこれやっぱ帰国を考えている人とか今日本にいる人気になるポイントかと思うんですけれども海外でものすごく苦労しましたとそれでレイオフにはあったけども就職しました現地企業にっていう経験は現職への面接とか転職活動その他の転職活動でどういうふうに評価。されましたかそうですねそもそもその未経験からカナダにわざわざカナダに行ってエンジニアになって向こうの企業で就職したっていうのは結構評価してくれる企業さんが多くてその行動力とか実行力もそうですしあとは精神力もそうですねっていう軸ですごく評価してもらいまし。た今は勤められているのはベンチャー企業ですもんねベンチャー界隈ってフロンティア開拓精神を持った男みたいなのはやっぱ好きです。もんねそうですねうちの今の会社は結構カオスな環境って自分らで言ってるぐらいの環境なので本当そういう環境でも自ら進んでいける人っていうのは重宝されますしやっぱそういうカオスなそういう環境でもバンクーバーいたらそれが日常なのでそこへの耐性はかなりついてるなあって思い。ますねちなみにそれ以外のところなんか行動力とかそのソフトスキル的なところ以外まあソフトスキル他のソフトスキルでもいいんですけどでなんか評価されるところってあるんですか?これ答えるの広瀬くんもあれば聞きたいんですけど僕もやっぱりなんかそのやっぱ海外に出たらそのうち帰るかもしれないっていうのはやっぱみんな考えることじゃないですかでその時になんだろうその人たちの市場価値ってどうなんだろうみたいな、ある意味では学歴ロンダリングに近いような海外でエンジニアやってましたみたいなかっこいいみたいなとか行動力あるんだろうねソフトスキルとかそこら辺は評価されるのはすごいわかるんですけどそれ以外に何か評価されるポイントってあるのかなってこの頃ちょっとよく考えててそうなんかありますかもちろん英語喋れるとかっていうのがあの評価になるところまあ例えばねあの広志くんの働いている楽天とかだったらチームメンバーあの外国人の方いっぱいいますよみたいな英語をいろいろ使いますよみたいなのあると思うんですけどなんかそれ以外に評価してもらえるところのってなんかお二人ありますかじゃあまず。優斗さんからどうですかハードスキルみたいなとこですよ。ねまああのハードスキルにフォーカスを置くともハードスキルはもう持ってること前提っていうのはありますね基本的なエンジニアリング力だったりあとは自分の書いたコードとか設計をちゃんと自分の言葉で表現できるとかっていうのはもちろんあってその上にソフトスキルが乗ってくるなと思っててソフトスキルとかその経験カナダに行ったっていう経験が乗ってくるなと思ってて英語評価されるされないは正直もう会社によりけりなので必ずしもあったらいいけど別に必須ではないっていうイメージはありますねちなみに。ゆうとくんの会社では英語とかは使われるん。ですかチームによっては全員英語でやってるとかもありますしあとは日本人じゃないエンジニアもたくさんいるので彼らとコミュニケーション取るなら英語ですねちなみ。に、海外の…ゆうとくんの場合は、今もう日本の会社でも海外の会社でも働いたってことになると思うんですけど、技術的にはどうでした?海外で働いた会社以外でも、自分の周りのエンジニアとかでもいいんですけど、日本って結構技術力高いのかなって、僕なんとなく見てて思うんですけど、そこら辺に感じることってあり。ますか?は思えます9のまあその日本で働いた全部の会社によることですけど皆さんすごく優秀ですねその技術力も高いですしその人間性もすごくいいですしうーんまあ別にそれがなんか僕もそのカナダカナダの会社で長いこと働いたわけでもないので一概に比較はできないんですけどでも日本人はやっぱりあとプラス勤勉ですし真面目に確か間違いないただただ英語喋らないだけです。かねヤンヤン君はありますか深井僕はそうですね僕は日本で就活するときにエンジニアの求人とプロダクトマネジメント系の求人とITコンサルとかそっち系の求人も応募してたんですけれどもエンジニアの求人に関してはやっぱりゆうとさんのおっしゃるようにコーディングとかの知識があってで、そこから他の人間のコンフリクトどうしますか?みたいな話になってたかなと思いますけど、そのPDMとかそっち系のことになると、どっちかっていうとソフトスキル、コミュニケーションスキル先行、プラスあとなんかデータドリブン思考選考みたいな感じがありましたねあのなんか職場にすごい嫌いな人がいたらどういうふうに接しますかとかあとはあの直近今までのキャリアを振り返ってデータ取り分になんか意思決定をしてなんか成果が出たことをなんか定量的に話すことができますかとかなんかそういう会話が多かったように思います。ねちなみになんですけどあのなんとなく日本の会社は結構その技術力強い人がすごいみたいなのが、結構技術力重視みたいなのをすごい感じるような気がしてて、そういうのって感じますかこっちは結構技術力はもちろんないわけではないんだけどエンジニアの中でもプロジェクトマネジメント力みたいなのだったりこの人デリバリーめっちゃ早いよねとかだったりエンジニアって言っても評価ポイントがいろいろあってこの人はこういうエンジニアみたいなのが結構いろんな角度で評価されてその人の評価が決まるっていうのがなんとなく僕のイメージなんですけどでもなんか、日本で働いてた人とかの話を聞くと、結構なんか、エンジニアの強さ、コーディング力だったり、設計力だったり、そこがもう全てだみたいな、全てじゃないのかもしんないけど、結構そういうふうに聞こえてたのかな、今までですけど、なんかそこら辺で感じることってあり。ますか?僕の今の会社だと全然そんなことはなくてもちろんデリバリー早かったりとか技術にすごく強い人っていうのは評価されますけどそのエンジニアの中でも技術に強い人もいればマネジメントに強い人もいればあとはちょっとPDM寄りな考え方でプロジェクト回すのがすごく上手い人っていうのもいるので必ずしも技術一本で評価されるっていう環境ではない。ですねなんか会社による部分もあるのかなと思いますね特にベンチャー企業とかだとなんですかねエンジニアもなんかエンジニア以外のこともの仕事もしないといけなかったりするんで割とあのソフトスキルとかガッツみたいなところが重視されたりするところもあるのかなと思うんですけどとにかく技術だけあればいいよっていう会社もなんかなくは部署とかね大企業の部署とかだとあるような気もしますねなんか技術力がすごい、いわゆるブリリアントジャークみたいな話になってきますよね。そういう人はいるようないないようなという感じ。ですね、会社によっては。2人の会社が特に海外色が強いっていうのも、そこら辺がこっちの会社に似てるっていう要因なのかもしれない。ですね。確かにそう。ですね。ありがとう。ございます。ゆうとさん、日本での就活をするときにまずどこから始めましたか?どんな媒体とかエージェントを使われまし。たか?媒体は特にそもそも僕は転職エージェントと呼ばれるサービスは一切使ってなくてもう自分で直応募というのかっていうのをやってて使った媒体はファインディっていうプラットフォームを使いましたね本当にエンジニアの、あとはPDMもそうかなプロダクトを作る人にフォーカスした転職プラットフォームみたいなところでずっとやってました帰ってから転職活動を始めるってなった時にまずは履歴書とかあとは職務経歴書を作るところから始めまし。たねカナダでは300社送って面接が3、4社というぐらいの打率だったみたいですけども日本ではどうでし。たか?日本だと多分応募数とかは僕がピッキーってのもあるんですけど多分20社ほど20から25くらいだと思う確かそれぐらいで最終的に面接まで行ったのは7社、8社は行ったのであの3割4割。ぐらいはいやものすごい違いですね。やっぱりねびっくりしましたこれはカルチャーショックでしたねあと。後は全部の後ぞさっきあとファインディーとかみたいなサービスがあるのも結構びっくりですよねエンジニアが就職しやすいようにというかそのファインディーの中でそういう問題とかあるんでしたっけわかんないあんまり詳しくないですけどとか問いたらファインディーじゃなかったかなこれもしかしたら違ったらごめんなさいあれなんですけど問題とか解いてそれを採用側が見て会社が評価してくれる。じゃ。ないけど売り手指示を書いて指示を言いたくないんだけどわかんないし雇われる側がすごい楽できるようなプラットフォームが結構そこにあります。よねですね候補者に対するサポートがすごく手厚いなと思っててFINDYの例で言うとまず始める前に面談的なことをFINDYの人とすることができてそこで職務経歴書を見ながら強みとかを把握してあとは僕のやりたいこととかをすり合わせてじゃあこういう会社を受けてみようとかっていうのを決めてくれるのですごく良かったですしあとは専攻に進んでても結構そこでチェックインしてくれて結構それ彼らが候補者と採用担当者の間に入ってなんか意見をつなげてくれるとかこういうフィードバックありましたっていうのも教えてくれますしなんですごく便利です。ね手厚いユトさん日本での就活転職活動で応募されてた求人エンジニアだけだったんですかそれともPMとか措置系の求人も合わせてやられてた感じ。ですかもエンジニアにだけ応募してましたねあそう。なんだでまあ30社を送って7発車面接ででそのうちあの内定が出たのは何件くらい。でしたか結局は最終的にオフをいただいたのは今のアップサイダーだけ。ですねその他の企業さん、アップサイダーさんも含めてですけれども面接の流れ、カナダと比べてどうでした?コーディングインタビューとか課題とかいろんな形式があると。思うんですけど多分カナダと結構似たような流れでまずカジュアル面談なりその一時面接、ビヘビュアルインタビューをしてその後そのままテクニカルインタビューに行くかアサインメントもらってそれをもとにテクニカルインタビューに行くか最後はマネージャー陣と話をしてその後オファーって流れです。ねテックインタビューはどんな感じの。インタビューだったんですかもうカナダに比べて結構幅広い質問が飛んできてフロントエンドだけに限らず結構バックエンドの質問も来たりとかデータベースの話もあったりとかありまし。たねごめんなさいちょっと聞き飛ばしたかもしれないですけどアサインメントみたいなのもあってって感じ。ですか?企業によるんですけど今の会社に言えばアサインメントありでそれでインタビューし。ましたね言える範囲で何系のアサインメントだったん。ですか?これは今のポジションが結構フロントエンド寄りのフルスタックっていうジョブディスクリプションなのでなので本当にフロントエンドの簡単なコンポーネントを作るっていうアサインメント。でした日本の企業って結構そこら辺テックインタビューアサインメントみたいなのあんまりしないとかリード行動とかあんまりしないみたいなイメージだったけど割とカナダの企業みたいな感じでそういうアサインメントもあるしなんだろうテックインタビューでいろんな質問でその知識を確認するみたいなのもあるしみたいななんか半々ぐらいな。感じかなですねまあいずれにせよどちらかの方法で絶対技術力は深く問うっていうスタイルだと思いますね。確かにカナダでの仕事と日本でのフリーランスはフロントエンドだったんですが今はフルスタックでお勤めだと思うんです。けれどもカナダはもうフロントエンドでやってましてその後は日本の業務委託は初めフロントエンドで入って途中ちょっとバックエンドもやる。っていう流れでしたね今はフルスタックとして結構バックエンドの方とかも幅広く見られている感じ。ですか?今はそうですね本当にいろんなことを幅広くやっててであのまあフロントエンド入ったんですけどフロントエンドのタスクとバックエンドのタスクの割合で言ったらフロントエンドが最近ちょっとロックが7割になってきたなーっていう形でもっとどっちも。やるみたいな感じですね結構じゃあ幅広くなったんですね仕事さすがスタートアップという感じです。ねそうですねはいやっぱりやらないとやらないともう授業回らないんでもう自然と知識の幅は広がっている。感じがしますアップサイダーさんに入社を決められた決め手と言いますか何かここがいいなって思ったみたい。なところは何かありますか大きく2つあって1つはもう面接を通して分かったその人の良さっていうのはすごくあってもうなんて言うんでしょうすごく伝わってくるんですよねこの人たちと働いてたらこういう感じの未来とか働き方なんだろうなーっていうのは想像できるぐらい人が良かったのとあとは僕らのミッションっていうのがその世界的な金融プラットフォームを作るっていうのでいろんな事業をお金の面で支えるっていうミッションがあるんですけどそれにすごく共感をして入社を決めました。ちなみに今見たらあれですね支払い。\ncomとかもやられてるんですね何か使ってたことはありまし。た支払い。\ncomはうちの授業。もあるんですねお金って結構国の法律とかに関わってくるから海外展開みたいなのとかってしにくいのかなとは思うんですけど海外展開を目指してる授業とかもう既にしてる授業みたいなのはある。んですか今のところ、僕が把握してる中では海外展開を目指してる事業はないと思ってて、まずはもう国内を中心に目指してるっていう形。ですね。じゃあ本当にスタートアップの、地盤固めではないけど、そしてこれからって感じなんです。かね?そうですね。もちろんりょうさんが言ってくれた通り、お金に関しては国ごとに法律がすごくややこしくて違うので、そう簡単に展開できるものではない。でもなんか世界的にそういう通貨統一とか仮想通貨に統一するとかわかんないですけどそういう流れがあればもちろんそこには乗っていくと思うんです。けどね確かに個人的には別にあのすげえ今思い浮かんだだけなんですけどあの日本にもあのカナダでいうウェルスシンプルみたいなアプリとかあのねなんだろう投資しやすいよみたいなアプリがどんどんできたらいいなとかって思ったりするんですけどねぜひあのプロジェクト立ち上げて作ってください。アップサイダーさんはどっちかというと法人向けの金融のお話が多いんですか。ね多分ですよね個人は全くなくて法人ばかりですね法人向けのクレジットカードコーポレートクレジットカードっていうのがメインプロ。タクトですね最近僕はアップサイダーさんの名前をニュースで見ましてミズホのグループ入りしたんですよね確か。そうですね今年の夏に。しましたどうですかなんかミズホ結構な割合の株式を取得して多分ミズホの人たちもアプサイダーさんの事業の将来性を見込んでがっつり投資するというふうになったと思うんですけどそこから何か社内の雰囲気が変わったりとか何かありまし。たか?これもノートに出てるので特に隠すこともないんですけど全く変わってないですね一応グループ員したけど社内の雰囲気とか仕事の進め方とかやってる事業に関しては特に変わりなくやってるのでそれこそエンジニア目線で言ったら開発の体制が変わるかって言われたら全然そんなことない。です。しそうなんだなんかメガバンクが投資するってなるとそのなんかメガバンクの偉い人がなんかやってきていろいろ口出したりしてるのかなみたいなことを勝手に思ってたんですけどそれはなんかでもいいことですねあの元ある会社の色をちゃんと残してみたいな。ですねすごくそこは配慮してもらう配慮してもらってるのかリスペクトされてるのかですけどあの大事にしてもらってるのでとてもありがたい。ですねあとこれはまあお話しいただける範囲で大丈夫なんですけれども日本今の給与面ですね条件みたいなところだいたいどれぐらいのレンジになり。ますかレンジで言うとカナダと意外とカナダとあんま変わらなくてだいたい650から700の間でオファーいただけたのでちょっとこれは僕もびっくりし。ました確かに全然あれですねそんな見劣りするわけじゃない。ですねカナダで働いた経験があるからこそ、今なんか働き方として違うなみたいな、海外に出てないエンジニアメンバーとかもいると思うんですけど、なんかちょっと自分は違うなみたいなところとかってあり。ますか?ちょっと自分は違うな。考え方だったりとかなんかひろしくんの例で言うとやっぱりあのよくあの英語喋れる人っていうふうに認識されてるからやっぱりあのなんでしたっけファシリテーターみたいなのやらされたりだとかみたいなのがあるかなみたいなのが結構この間のインタビューで聞いたんですけどなんかそういうのってあったり。するのかなみたいな特に僕の場合は英語できるからこうとかっていうのはあんまりなくて何かなぁ特にだからといって特別なロールが与えられるわけではないですねCっていうなら英語できるのでそれを活かして社内の僕のチームとは違う英語場所のエンジニアと交流というか一つのプロジェクトを通して交流しているとかそれぐらいですか。ねちなみにチームの中には海外の方もいらっしゃるん。ですか?僕のチームには。いないですいないんだオフィスは一緒?それとも海外の人たちは海外のオフィスで働いてるん。ですか?僕らオフィスはあるんですけど基本的にフルリモートフルフレックスな。のででも、日本国内から海外の人が働い。てる感じ?国内にいる人もいれば、国外にいる。人も、両方いますね。次はかなりね、ざっくりした質問になっちゃうんですけれども、いろんな方も気になると思うんですけれども、日本に帰ってきてどうですかっていう質問ですね。まあ日本に帰ってきて良かったこともちろんちょっとネガティブなこととかもあると思うんですよね人が多いよとか僕もあるんでなんかその辺ちょっとポジネができるだけたくさん引けたらいいなと思ってますどう。ですかユウトさんユウトさんまあもうポジティブなことはこれも皆さんおっしゃると思うんですけどひたすら綺麗、治安がいいですねあとは僕個人で言うとやっぱこっちに友人とか家族もいるので日本になのでそれはいいですねその会いたい時に会えるとかコミュニケーション実話なしで撮れるとかっていうのはすごくいいなと思いますねでネガティブあとポジティブで言うとあの今冬じゃないですか冬でも晴れてるんですよね、日本って。太陽があるんですよ、バンクーバー達がって。それがすごく救われてて、あんまり寒さを感じない。みんな寒いとか言ってるんですけど、僕は全く寒くない。っていう。今、バンクーバー一番つらい時期です。よね。いや、僕、あの、2人僕の性格わかると思うんで、あの、わかると思うんですけど、あんま気にならないんですよね、そこ。まったく。まあ、年中僕運動してるんで、今もバレエ集さんとか、この間もなんか、あの、同僚がみんなで結構バトミントンやってるから、バトミントン行ったりとかするってのもあると思うんですけど、そもそもあんまり僕、あの、感情の起伏があんまりないというか、あんまり激しくないから、そもそもちょっとメンタルがあっていうとかっていうのも。ない。し、で、年中運動して、バレーボールは室内で運動してるっていうのもあるんで、あんまりなんか変わらないっていうのもあるのか、ちょっとなんか断固としてそこらへん、天気の影響なんかないよっていうのは反対していきたいところだけど、確かに結構言ってる人は多いから、まあそうなのかなっていうのはありますよね。多分きっとそうなん。でしょうね。りょうさん個人はそんなに。ですが、僕はバンクーバーはない。かな。じゃあちょっとひるがえって日本のちょっとネガティブなところですね。バンクーバーのこういうところがちょっと恋しいなとか、なんかこれがなくなって寂しいなみたいなところなんかあり。ますか?バンクーバーの恋しいものはたくさんありますね。一番初めに挙げるとしたらやっぱ大自然とかアクセスしやすい大自然ですかね。もうすぐそこに海とかでかい公園とかまあそんな綺麗ではないけどビーチもあるし自然との接点がすごく多かったなーっていうのはあって僕も結構その気持ち的につらかった時はその自然に触れてリフレッシュするってことをしてたのでやっぱそれがあんなアクセシブルなところにたくさんあるっていうのはすごく恵まれてた。なぁと思いますねでもさぁ、たかおさんとかなんか違う県とか行けばある。わけでしょ?ちょっと頑張ればちょっと頑張ればあるけどぐらいのなんかそれこそバンクーバならもう車すら使わずに歩けばそれなりのデカさの公園がポンって出てくるので。それはいいなぁと思いますねあとこの間、そうですね、夏登山とかちょっとしてたんですけど、やっぱね、人多いんですよね。頂上とか行ってもディズニーランドぐらい人いるんですよ。マジかね。それが確かちょっとバンクーバーと違いがありますね。自然がアクセスでき。たと。でも、それってやっぱさ、高尾さんと富士山ぐらいじゃない?そんなことない。分かんないけど。まだそれ以外のことしか言っ。てない。まあでも人混みはやっぱあのバンクーバーにいた時よりはやっぱついて回る悩みですよね日本に帰って。くるのね確かに人なんかコミュート?なんて言うんだっけ通勤?やっぱ通勤が怖いっていうのはあるかもしれないけどまあリモート?お二人ともリモートなのかなあ、ひろし君は会社行っ。てるんだっけそうですね、でも双子玉川なんでそんなに通信ラッシュがひどいところではないが、田園都市線とかですね、渋谷方面に行く通勤とかはパソコンが割れるかもみたいなこと言われてますね。僕結構、僕のパーソナルスペース広めなんで使ってない。ですね話いろいろ聞いてきましたけれどもちょっとまあね締めみたいなところに入っていけたらなと思うんですが最後にちょっとゆうとさんからですね今海外キャリアル語お聞きの皆さんに対してカナダに行くことを考えている人カナダにいて日本に帰国した方がいいのかなみたいなことを考えている人いろいろいらっしゃると思うんですけれどもゆうとさんから何かメッセージいただけ。ますか別々でいただきたいですねなんかあの期待これからカナダに行く人とこれから帰る人に向けて帰る人特に僕はやっぱ聞きたいんでちょっと別々にお願いします。じゃあまず初めにあのカナダに行くことを考えている人に対してメッセージは何か。ありますかカナダに行くことを考えている人に対しては行きたいと思ったら行ってくださいっていうのが一番のメッセージ特に行ったからってマイナスになるわけではなくて基本的にプラスにしかならないっていうのはほぼ確定してるようなもんなので行かなくて後々後悔してあの時行けばよかったなってうじうじするぐらいなら思い切って行った方が絶対いいと思いますその国とかはその人の人生によるんで分からないですけどバンクーバーに限って言えば素晴らしいコミュニティーはありますしすごくいい場所なので本当に行ってみてその後別に永住したいなら永住に向けて頑張ればいいですし帰ってきたいなら別に日本に帰ってこれば日本に帰ってこれるっていうのが一番でかいなと思ってるのでまずカナダに行きたい人に対してはとりあえず行きましょうって言ってから考えるのでもいいし今は情報とかすごい出てるので恵まれた時代なのでそれをうまく活かしてカナダに行ってくださいっていうのはありますカナダに住んでて日本に帰ってこいと思っている人もしくは帰ろうかなと考えている人に対してですねまず言いたいことはカナダに行ってる時点で聞きたいことはあれですねまず日本に帰ってきても居場所とか活躍できる場所がたくさんありますよっていうのは一つあって特に日本に帰るイコール別に負けとかネガティブなことではないですしそれはあくまで人生の1ステージであってバッタラタラに場所が変わるだけだなっていうのは思っていて特にそこに対してすごく消極的になる必要はないなと思ってますでまぁそもそもさっきも言った通りその国によっては母国に帰れない政治的に帰れない人がいると思うんでなんかそういう人と比べてすごく自分たちは恵まれているんだっていう意識を持っていていいなぁと思い。ますねいやそれめちゃくちゃ思いますねなんか帰るとなると、なんか給料とかもあるし、通勤なしかとかって、悩みが結構幸せですよね。それがなんか本当、南米の人たちからとか。する。と、うーん、帰るってできるかな、みたいなとか。命の危険みたいな危機みたいなのがあるじゃないですかそういうのに比べると僕たちの悩みはめちゃくちゃ幸せなんで確かに本当にそうだなっていうのとそのこれから来る人に関して優斗くんみたいにすげー苦労してる人でもプラスになるっていうのはめちゃくちゃいいアイディアじゃなくてなんでもアイディアで片付けようとしちゃう英語話者あらゆるマインドセットとかですかねいいですねぜひぜひみんな来てくれれ。ばって思いますねユートさんの辛い経験はですねノートにたくさん書いていてですね僕もすごい共感することが多かったんですが今日本に帰るか帰らないかと葛藤してる人に対してすごく響く内容かなと思うんでユートさんのツイッターのアカウントXのアカウントからも飛べると思うんで皆さんぜひ読んでみてくださいじゃあ今日ユートさんのインタビューはこんなところにしておきますか。ねありがとうございましたじゃあゆう。とさん今日はお時間いただきましてありがとうございましたまた。よろしくお願いしますということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうござい。",
  "utterances": [
    {
      "speaker": "A",
      "text": "はいっじゃああの前半の終わりではですねまああのレイオフがちょっと起こってしまいましたよとちょっと悲しい感じであの終わってしまったんですけれどもまあ後半あのその詳細と言いますかちょっとまああの心境みたいなところも聞きながら進めていけたらなと思いますあとはまあ日本に帰ってきてからのこともそうですねでじゃあまず初めにはですねあのオファーをもらった1社目あのどれぐらいの条件だったのかなというところからお聞きできたらだと思うん。",
      "start": 8,
      "end": 31075,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "ですけれどもはい年収は65K当時のレートで言うと720から730万円でした。",
      "start": 31075,
      "end": 41861,
      "timestamp": "00:31"
    },
    {
      "speaker": "A",
      "text": "ねジュニアっていうことを考えると悪くないというかむしろ中の上よりぐらいの条件かなって思いますけどそんな感じですよねいやそうです。",
      "start": 41861,
      "end": 53225,
      "timestamp": "00:41"
    },
    {
      "speaker": "C",
      "text": "ね全然十分かなって周りの、。",
      "start": 53225,
      "end": 56687,
      "timestamp": "00:53"
    },
    {
      "speaker": "A",
      "text": "ゆうとさんのクラスメイトは就活とかどうでした?ゆうとさん1年間で他のクラスメイトも同じような経験をされてそうでしたか?",
      "start": 56687,
      "end": 68226,
      "timestamp": "00:56"
    },
    {
      "speaker": "B",
      "text": "結局僕のクラスメイト25から30人いたうち1回でも現地企業に就職したのは5人、6人ぐらいででえっとそれ彼らの条件はあんまり聞いてないんですけど多分僕高い方だったんじゃないかなあとその給料言ったら。",
      "start": 68226,
      "end": 87175,
      "timestamp": "01:08"
    },
    {
      "speaker": "C",
      "text": "と思いますねちなみに全部やめたんですかそこからはあのなんだろうあるあるバイトあのスタバだったりとか日本企業みたいな結構いらっしゃい前にちょうどいっすねっよ0にして幸せだもう。",
      "start": 87175,
      "end": 103544,
      "timestamp": "01:27"
    },
    {
      "speaker": "B",
      "text": "こんな生活には戻れないとなってもそのオファーをもらったのが12月半ばで1月の次の年の1月からスタートだったんで2週間のギャップがあったんですけどもその間はもう天国でしたね働かずに仕事が決まっててもう2,3年ぶりぐらいにこんなにゆっくりできると思って。",
      "start": 103544,
      "end": 128062,
      "timestamp": "01:43"
    },
    {
      "speaker": "C",
      "text": "確かにそうなんですよねやっぱ次の仕事が決まっててまだ働き始めてないっていう状態が一番幸せです。",
      "start": 129112,
      "end": 138341,
      "timestamp": "02:09"
    },
    {
      "speaker": "B",
      "text": "よね幸せです一生それでいたいと思いましたもん。",
      "start": 138341,
      "end": 140222,
      "timestamp": "02:18"
    },
    {
      "speaker": "A",
      "text": "なんかそこまで込ん詰めて就活とかバイトとか色々やってるとそのバーンアウトみたいなところがね特にストレス1回解放されたみたいな時になっちゃわないかどうかっていうのは聞いてて心配になったんですけど優斗さんの時はどうでした?ケアとかされてました?",
      "start": 142703,
      "end": 161306,
      "timestamp": "02:22"
    },
    {
      "speaker": "B",
      "text": "バーンアウトはその1年間の就活の時に1回なっていてその時はもうバーンアウトになったんで1回カナダの就活を辞めたっていうのはありますねでそこで何とかプレッシャーリリーフができたのでもう1回持ち直したっていうのがあるんですけどなんでそこをちゃんとセルフキアしなかったら絶対潰れてて就職も出てなかっただろうなとは思い。",
      "start": 161306,
      "end": 185396,
      "timestamp": "02:41"
    },
    {
      "speaker": "C",
      "text": "ますレイオフまではどのぐらい働かれたんですか結局?",
      "start": 185396,
      "end": 191960,
      "timestamp": "03:05"
    },
    {
      "speaker": "B",
      "text": "結局プロベーション終わる直前なんで3ヶ月も…3ヶ月いけないとこで終わりました。",
      "start": 191960,
      "end": 200245,
      "timestamp": "03:11"
    },
    {
      "speaker": "A",
      "text": "ねいや、そこまでの苦難を乗り越えて3ヶ月っていうのはなかなか辛いですよ。",
      "start": 200245,
      "end": 208347,
      "timestamp": "03:20"
    },
    {
      "speaker": "B",
      "text": "ね。ですね。その言われた後、どうやって家に帰ったかっていうのを全然覚えてないぐらい放信状態だったん。",
      "start": 208347,
      "end": 216172,
      "timestamp": "03:28"
    },
    {
      "speaker": "C",
      "text": "で。よくある感じの、ダンボール渡されて自分の荷物持って帰るみたいな感じなんです。",
      "start": 216172,
      "end": 222837,
      "timestamp": "03:36"
    },
    {
      "speaker": "B",
      "text": "か?僕はダンボールに入れるほどの量はなかったので、自分のバックパックだけで帰りまし。",
      "start": 222837,
      "end": 229662,
      "timestamp": "03:42"
    },
    {
      "speaker": "A",
      "text": "た。ちなみにその時のレイオフの背景みたいなのはどんなことが理由だったんですか会社のファイナンシャルシチュエーションがとかいろいろあると思うんです。",
      "start": 229662,
      "end": 240926,
      "timestamp": "03:49"
    },
    {
      "speaker": "B",
      "text": "けどなんかその後々そのチームメンバーから教えてもらったのはなんかそもそも僕を雇うフェーズの段階であのフルタイムのエンジニアを増やすか増やさないかみたいなすごく中途半端な状態で進んでいってしまったみたいででいざそれで雇ってみたら意外とが寝かかるねみたいな感じであのレイオフ対象になったって。",
      "start": 240926,
      "end": 265018,
      "timestamp": "04:00"
    },
    {
      "speaker": "A",
      "text": "聞きましたねなんかそれぐらいちゃんと検討してから進んでくれよって感じですよねちょっともう精神的に振り回されすぎて聞いて辛くなってきますよ本当に確かに。",
      "start": 265018,
      "end": 277645,
      "timestamp": "04:25"
    },
    {
      "speaker": "C",
      "text": "まあでもとはいえなんかそのレイオフできるのがこっちの会社のいいところでもあるのかなって僕は思っててまあね今それがゆうとくんに起きたって言うとちょっとすごい悲しい気持ちにはなりつつもやっぱりそのなんかレイオフできないとやっぱりそのなんか魔導義和族みたいな人とかやっぱ日本みたいに生まれちゃうわけじゃないですかですごい結構不才だと思うんですよねでそのレイアートでレイフできないからこそそのにエンジニアの給料を上げられないみたいなのエンジニアだけじゃないのかなあの今日まあすべての業界で多分そうだと思うんですけどそのこの先この人を一生養わないといけないっていうなんかある種結婚のようなあの誓いをして人を雇わないといけないわけじゃないですか。それに比べて、カナダってレイオフできるから、とりあえず取って、お金かかっちゃったな、ダメだ、切るみたいなのもできるから、簡単に採用できて、バッとそのプロダクトとかを伸ばしてみたいなのも可能ではあるのかなっていうのがあるから必ずしもあとはそのレイオフがなかったらその窓際族の人たちでスポットが埋まるからそのそうじゃない人たちが入りにくいみたいなのもあると思うんで必ずしもレイオフがずっと悪いものだとは思わないけど確かにそのコンテキストを聞くとその3ヶ月でわかるぐらいのことは予測しとけっていうのはちょっとありますよ。",
      "start": 277645,
      "end": 363001,
      "timestamp": "04:37"
    },
    {
      "speaker": "B",
      "text": "ねですねまあ僕も特にそのレイオフに対してはネガティブなイメージはなくてまあそのもちろんいい意味悪い意味があると思っててもちろんそれ対象になった人からしたらふざけんなってなると思うんですけど僕もその日本の1社目の会そのエンジニアじゃない会社でそういう丸際族とか働かんけど年収1000万円もらってるとすごく大量に行ったのででその人がいるから若手はモチベーション上がらずで僕みたいに辞める人も多くみたいなシチュエーションではあったのでそういうところを是正できるのがレイオフなのかなと思ってますね確かに。",
      "start": 363001,
      "end": 403736,
      "timestamp": "06:03"
    },
    {
      "speaker": "A",
      "text": "おっしゃるようにあれですよねあの従業員側のモチベーションもやっぱ上がりますよねそのレイオフっていうのが隣り合わせにあるとあのまあうかうかしてたらね食い切られちゃうわけです。",
      "start": 403736,
      "end": 415620,
      "timestamp": "06:43"
    },
    {
      "speaker": "B",
      "text": "から。",
      "start": 415620,
      "end": 415700,
      "timestamp": "06:55"
    },
    {
      "speaker": "C",
      "text": "なんかパフォーマンスだその仕事とかその自分のパフォーマンスについてはどう思いました結構うまいことやれてるなぁみたいな感じですかそれとも結構大変でしたまあ大変ももちろん一社目であのこっちの会社で大変だとは思うんですけどまあ一。",
      "start": 418400,
      "end": 432782,
      "timestamp": "06:58"
    },
    {
      "speaker": "B",
      "text": "社目で大変ではあったんですけどその中パフォーマンスについて指摘されたことはなかったですしなんかそのなんて言うんでしょう本当にみんなにオンブに抱っこ状態までもなかったのでで。",
      "start": 432782,
      "end": 449100,
      "timestamp": "07:12"
    },
    {
      "speaker": "C",
      "text": "も3ヶ月残ったってことは、たぶんパフォーマンス的には全然大丈夫だったんだろうなって思いますよね。こっちのプロベーション、使用期間みたいなのプロベーションって言うと思うんですけど、ダメだっていう人はもう本当に1ヶ月目、2ヶ月目とかから結構どんどん切られてて、3ヶ月ギリギリまでっていうこともあんまないと思うんで。結果はどうあれでもそのやっぱお金もらって働く経験っていうのもあるしあとはそのレファラル先っていう意味でもそのね次にはつながると思うのでまあレイオフ自体は残念だったけどまあ働かないよりは全然マシって感じですよねもちろん。",
      "start": 449100,
      "end": 489654,
      "timestamp": "07:29"
    },
    {
      "speaker": "B",
      "text": "そうですねもそのゼロゼロ1の経験できたらでかいですねすごく自信に今もつながってます。",
      "start": 489654,
      "end": 494817,
      "timestamp": "08:09"
    },
    {
      "speaker": "A",
      "text": "しじゃあそのレイオフの直後、方針状態でお家に帰られて、そこからもう一回就活するのかとか、いろいろその後のことについて考えるきっかけになったかなとは思うんですけど、そこから日本の帰国、本帰国を決意されるまではどんな経緯がありました。",
      "start": 494817,
      "end": 516222,
      "timestamp": "08:14"
    },
    {
      "speaker": "B",
      "text": "か?そうですねレイオフされた直後はさすがに1週間ぐらいはちょっとゆっくりしてたんですけどでも働かなかったらワンクーバーでは生活できないっていうのはもちろんあったのでまた就活を再開しました一社リンクドインで偶然面接までつながった会社があってワンクーバーの現地企業でその会社との先行が結構進んだんですよね最終まで行ってそこは最終で落ちてしまったんですけどそのあたりからさらに追い打ちかけるようにまたダメージが来てそこで本当にずっとこのままカナダでこの苦しい生活を続けるべきなのか日本に帰っちゃうのかってすごく考えて日本に帰る方を選んだってとこですね結構限界まで来てたっていうのが一番あり。",
      "start": 516222,
      "end": 574000,
      "timestamp": "08:36"
    },
    {
      "speaker": "C",
      "text": "ます就職活動は大変ですからねやっぱお金の心配もあるし、結構あと、こっちって最終面接とか、面接が何回もあるし、時間もかかるじゃないですか。1日2日で終わって、はい、あさってから当たりてくださいみたいな感じじゃないじゃないですか。で、結構ちゃんとして、会社とかだったら、4回5回こっちは当たり前だし、技術面接あっ。",
      "start": 574000,
      "end": 602950,
      "timestamp": "09:34"
    },
    {
      "speaker": "A",
      "text": "て、。",
      "start": 602950,
      "end": 604351,
      "timestamp": "10:02"
    },
    {
      "speaker": "C",
      "text": "で、そっからも落ちるし、ゴーストっていうかなんていうの連絡こないみたいなのもあるし。結構精神的ダメージは結構。",
      "start": 604351,
      "end": 611996,
      "timestamp": "10:04"
    },
    {
      "speaker": "B",
      "text": "きますよねですねそのレイオフされた後に面接した会社も結局最終面接から1ヶ月待ってそこで落ちたっていう連絡が来てもうそれ待ってる期間もだいぶ辛くてで逆に結果分かった後は逆に楽になったんですよね。",
      "start": 611996,
      "end": 634911,
      "timestamp": "10:11"
    },
    {
      "speaker": "C",
      "text": "やっとなんか解放されたみたい。",
      "start": 634911,
      "end": 637172,
      "timestamp": "10:34"
    },
    {
      "speaker": "A",
      "text": "ななんかその日本の就活だと結構なんか何週間以内に返事しますっていうので面接が終わったりすると思うんですけど海外の企業だとなんかそのその辺のなんですかね待ってる方の気持ちをあんま組んでくれないみたいなのはちょっとなんかあるような気がし。",
      "start": 637172,
      "end": 659108,
      "timestamp": "10:37"
    },
    {
      "speaker": "C",
      "text": "ますね確かにまあでもやっぱそれ多分売り手市場海外は売り切れ市場だからなのかなって思いますよね。もういくらでも来るし、みたいな。終わった人のことまでケアしてられないみたいなのも多分あると思うから逆に日本では改定市場だから受かってもゴーストする人たちゴーストっていうか連絡しない人たちも多分いるじゃないですかだからしょうがないのかなと思いつつそんなもんだよねって思って生きていくしかないのかなっていうのも。",
      "start": 659108,
      "end": 694769,
      "timestamp": "10:59"
    },
    {
      "speaker": "A",
      "text": "ありつつごめんなさい1個いいですか今これカットしていただいて全然大丈夫なんですけど売り手市場と買い手市場がちょうど逆になってたなと思いました企業が買う方なんで買い手市場というのは企業が強い方です僕も逆だと勘違いしてたんでちょっとあのこれ編集の時に売り手市場は応募者が強い方です。",
      "start": 694769,
      "end": 718697,
      "timestamp": "11:34"
    },
    {
      "speaker": "C",
      "text": "ね売り手市場は応募者そう。",
      "start": 718697,
      "end": 721591,
      "timestamp": "11:58"
    },
    {
      "speaker": "A",
      "text": "いうことね難しい日本はどちらかというと売り手市場です。",
      "start": 721591,
      "end": 727313,
      "timestamp": "12:01"
    },
    {
      "speaker": "C",
      "text": "ねOKですこのまま残してそういうことにしていき。",
      "start": 727313,
      "end": 732154,
      "timestamp": "12:07"
    },
    {
      "speaker": "A",
      "text": "ましょうOKですじゃあちょっとそれちゃいましたけど日本に帰って一発目はフリーランスでの就労だったんですかね。",
      "start": 732154,
      "end": 743156,
      "timestamp": "12:12"
    },
    {
      "speaker": "B",
      "text": "ユートさんそうですねこれは一発目というかそのカナダ行った時から働いてた企業にそのまま一旦はそのまま働き続けたという。",
      "start": 743156,
      "end": 753464,
      "timestamp": "12:23"
    },
    {
      "speaker": "C",
      "text": "流れですねもうそのままじゃあ。",
      "start": 753464,
      "end": 757986,
      "timestamp": "12:33"
    },
    {
      "speaker": "B",
      "text": "あのリモートでですねずっとリモート。",
      "start": 757986,
      "end": 761148,
      "timestamp": "12:37"
    },
    {
      "speaker": "A",
      "text": "で働いてましたそこではどれぐらい働かれたんですかフリーランスで。",
      "start": 761148,
      "end": 768313,
      "timestamp": "12:41"
    },
    {
      "speaker": "B",
      "text": "結局、1年近く働いてましたね。2024年の4月、5月ぐらいから、それも2025年の3月末までなの。",
      "start": 769622,
      "end": 781689,
      "timestamp": "12:49"
    },
    {
      "speaker": "A",
      "text": "で。フリーランスというと、その時の生活のリズムみたいなのはどんな感じでした。",
      "start": 781689,
      "end": 790274,
      "timestamp": "13:01"
    },
    {
      "speaker": "B",
      "text": "か?結構、カナダの時間に合わせることができて、なんかもう朝から働いてで夕方のそのミーティングその日本時間で言ったらデイリースクラムもちろん言ったら夕方5時6時のミーティングに出て終わりっていう感じでしたねじゃあ。",
      "start": 790274,
      "end": 810722,
      "timestamp": "13:10"
    },
    {
      "speaker": "A",
      "text": "そこのリモートの仕事日本の仕事を続けつつ帰国の準備をして日本に帰ってという感じになりますか。",
      "start": 810722,
      "end": 819529,
      "timestamp": "13:30"
    },
    {
      "speaker": "B",
      "text": "ねはいそう。",
      "start": 819529,
      "end": 820890,
      "timestamp": "13:39"
    },
    {
      "speaker": "A",
      "text": "ですそのリモートの日本の仕事内容はどんな感じだったんです。",
      "start": 820890,
      "end": 827928,
      "timestamp": "13:40"
    },
    {
      "speaker": "B",
      "text": "か?ウェブアプリケーションを作ってたんですけど主なクライアントは不動産業界で衛星写真と不動産の情報を書き合わせて土地探すのを簡単にしようみたいな事業をやってる感じです。",
      "start": 827928,
      "end": 851020,
      "timestamp": "13:47"
    },
    {
      "speaker": "A",
      "text": "ねじゃあまあ帰国の時にその日本向けの就活みたいなのは特にしなかったんですよ。",
      "start": 851020,
      "end": 858959,
      "timestamp": "14:11"
    },
    {
      "speaker": "B",
      "text": "ね?まだそうではしなかったです。",
      "start": 858959,
      "end": 861000,
      "timestamp": "14:18"
    },
    {
      "speaker": "A",
      "text": "ね。で、1年働かれて、1年経つぐらいのタイミングで転職活動というかをされたんですか。",
      "start": 861000,
      "end": 872284,
      "timestamp": "14:21"
    },
    {
      "speaker": "B",
      "text": "ね?そうですね。帰ってきてちょうど年、えっと2025年の1月ぐらいから転職活動を始めまし。",
      "start": 872284,
      "end": 881848,
      "timestamp": "14:32"
    },
    {
      "speaker": "A",
      "text": "た。まあカナダの生活と比べる。",
      "start": 881848,
      "end": 886453,
      "timestamp": "14:41"
    },
    {
      "speaker": "C",
      "text": "とあと先どうぞなんかその定職したくなった理由みたいなのはあるんですかちなみ。",
      "start": 886453,
      "end": 891555,
      "timestamp": "14:46"
    },
    {
      "speaker": "B",
      "text": "にまあそのちょうど日本に日本に帰ってきたしエンジニアとしても一応丸2年の経験がついたので自分自分の市場価値っていうのを知りたくてすごくあのカジュアルな気持ちで始めまし。",
      "start": 891555,
      "end": 905781,
      "timestamp": "14:51"
    },
    {
      "speaker": "A",
      "text": "たカナダの就活に比べると日本の就活ってそんなにやっぱ難易度としては比べると高くないかなと思うんですけれどもこれやっぱ帰国を考えている人とか今日本にいる人気になるポイントかと思うんですけれども海外でものすごく苦労しましたとそれでレイオフにはあったけども就職しました現地企業にっていう経験は現職への面接とか転職活動その他の転職活動でどういうふうに評価。",
      "start": 905781,
      "end": 937884,
      "timestamp": "15:05"
    },
    {
      "speaker": "B",
      "text": "されましたかそうですねそもそもその未経験からカナダにわざわざカナダに行ってエンジニアになって向こうの企業で就職したっていうのは結構評価してくれる企業さんが多くてその行動力とか実行力もそうですしあとは精神力もそうですねっていう軸ですごく評価してもらいまし。",
      "start": 937884,
      "end": 962017,
      "timestamp": "15:37"
    },
    {
      "speaker": "A",
      "text": "た今は勤められているのはベンチャー企業ですもんねベンチャー界隈ってフロンティア開拓精神を持った男みたいなのはやっぱ好きです。",
      "start": 962017,
      "end": 974421,
      "timestamp": "16:02"
    },
    {
      "speaker": "B",
      "text": "もんねそうですねうちの今の会社は結構カオスな環境って自分らで言ってるぐらいの環境なので本当そういう環境でも自ら進んでいける人っていうのは重宝されますしやっぱそういうカオスなそういう環境でもバンクーバーいたらそれが日常なのでそこへの耐性はかなりついてるなあって思い。",
      "start": 974421,
      "end": 1000064,
      "timestamp": "16:14"
    },
    {
      "speaker": "C",
      "text": "ますねちなみにそれ以外のところなんか行動力とかそのソフトスキル的なところ以外まあソフトスキル他のソフトスキルでもいいんですけどでなんか評価されるところってあるんですか?これ答えるの広瀬くんもあれば聞きたいんですけど僕もやっぱりなんかそのやっぱ海外に出たらそのうち帰るかもしれないっていうのはやっぱみんな考えることじゃないですかでその時になんだろうその人たちの市場価値ってどうなんだろうみたいな、ある意味では学歴ロンダリングに近いような海外でエンジニアやってましたみたいなかっこいいみたいなとか行動力あるんだろうねソフトスキルとかそこら辺は評価されるのはすごいわかるんですけどそれ以外に何か評価されるポイントってあるのかなってこの頃ちょっとよく考えててそうなんかありますかもちろん英語喋れるとかっていうのがあの評価になるところまあ例えばねあの広志くんの働いている楽天とかだったらチームメンバーあの外国人の方いっぱいいますよみたいな英語をいろいろ使いますよみたいなのあると思うんですけどなんかそれ以外に評価してもらえるところのってなんかお二人ありますかじゃあまず。",
      "start": 1000064,
      "end": 1079442,
      "timestamp": "16:40"
    },
    {
      "speaker": "A",
      "text": "優斗さんからどうですかハードスキルみたいなとこですよ。",
      "start": 1079442,
      "end": 1082162,
      "timestamp": "17:59"
    },
    {
      "speaker": "B",
      "text": "ねまああのハードスキルにフォーカスを置くともハードスキルはもう持ってること前提っていうのはありますね基本的なエンジニアリング力だったりあとは自分の書いたコードとか設計をちゃんと自分の言葉で表現できるとかっていうのはもちろんあってその上にソフトスキルが乗ってくるなと思っててソフトスキルとかその経験カナダに行ったっていう経験が乗ってくるなと思ってて英語評価されるされないは正直もう会社によりけりなので必ずしもあったらいいけど別に必須ではないっていうイメージはありますねちなみに。",
      "start": 1082162,
      "end": 1124295,
      "timestamp": "18:02"
    },
    {
      "speaker": "C",
      "text": "ゆうとくんの会社では英語とかは使われるん。",
      "start": 1124295,
      "end": 1128037,
      "timestamp": "18:44"
    },
    {
      "speaker": "B",
      "text": "ですかチームによっては全員英語でやってるとかもありますしあとは日本人じゃないエンジニアもたくさんいるので彼らとコミュニケーション取るなら英語ですねちなみ。",
      "start": 1128037,
      "end": 1142056,
      "timestamp": "18:48"
    },
    {
      "speaker": "C",
      "text": "に、海外の…ゆうとくんの場合は、今もう日本の会社でも海外の会社でも働いたってことになると思うんですけど、技術的にはどうでした?海外で働いた会社以外でも、自分の周りのエンジニアとかでもいいんですけど、日本って結構技術力高いのかなって、僕なんとなく見てて思うんですけど、そこら辺に感じることってあり。",
      "start": 1142056,
      "end": 1165148,
      "timestamp": "19:02"
    },
    {
      "speaker": "B",
      "text": "ますか?は思えます9のまあその日本で働いた全部の会社によることですけど皆さんすごく優秀ですねその技術力も高いですしその人間性もすごくいいですしうーんまあ別にそれがなんか僕もそのカナダカナダの会社で長いこと働いたわけでもないので一概に比較はできないんですけどでも日本人はやっぱりあとプラス勤勉ですし真面目に確か間違いないただただ英語喋らないだけです。",
      "start": 1165148,
      "end": 1197117,
      "timestamp": "19:25"
    },
    {
      "speaker": "A",
      "text": "かねヤンヤン君はありますか深井僕はそうですね僕は日本で就活するときにエンジニアの求人とプロダクトマネジメント系の求人とITコンサルとかそっち系の求人も応募してたんですけれどもエンジニアの求人に関してはやっぱりゆうとさんのおっしゃるようにコーディングとかの知識があってで、そこから他の人間のコンフリクトどうしますか?みたいな話になってたかなと思いますけど、そのPDMとかそっち系のことになると、どっちかっていうとソフトスキル、コミュニケーションスキル先行、プラスあとなんかデータドリブン思考選考みたいな感じがありましたねあのなんか職場にすごい嫌いな人がいたらどういうふうに接しますかとかあとはあの直近今までのキャリアを振り返ってデータ取り分になんか意思決定をしてなんか成果が出たことをなんか定量的に話すことができますかとかなんかそういう会話が多かったように思います。",
      "start": 1197117,
      "end": 1271790,
      "timestamp": "19:57"
    },
    {
      "speaker": "C",
      "text": "ねちなみになんですけどあのなんとなく日本の会社は結構その技術力強い人がすごいみたいなのが、結構技術力重視みたいなのをすごい感じるような気がしてて、そういうのって感じますかこっちは結構技術力はもちろんないわけではないんだけどエンジニアの中でもプロジェクトマネジメント力みたいなのだったりこの人デリバリーめっちゃ早いよねとかだったりエンジニアって言っても評価ポイントがいろいろあってこの人はこういうエンジニアみたいなのが結構いろんな角度で評価されてその人の評価が決まるっていうのがなんとなく僕のイメージなんですけどでもなんか、日本で働いてた人とかの話を聞くと、結構なんか、エンジニアの強さ、コーディング力だったり、設計力だったり、そこがもう全てだみたいな、全てじゃないのかもしんないけど、結構そういうふうに聞こえてたのかな、今までですけど、なんかそこら辺で感じることってあり。",
      "start": 1271790,
      "end": 1334465,
      "timestamp": "21:11"
    },
    {
      "speaker": "B",
      "text": "ますか?僕の今の会社だと全然そんなことはなくてもちろんデリバリー早かったりとか技術にすごく強い人っていうのは評価されますけどそのエンジニアの中でも技術に強い人もいればマネジメントに強い人もいればあとはちょっとPDM寄りな考え方でプロジェクト回すのがすごく上手い人っていうのもいるので必ずしも技術一本で評価されるっていう環境ではない。",
      "start": 1334465,
      "end": 1362285,
      "timestamp": "22:14"
    },
    {
      "speaker": "A",
      "text": "ですねなんか会社による部分もあるのかなと思いますね特にベンチャー企業とかだとなんですかねエンジニアもなんかエンジニア以外のこともの仕事もしないといけなかったりするんで割とあのソフトスキルとかガッツみたいなところが重視されたりするところもあるのかなと思うんですけどとにかく技術だけあればいいよっていう会社もなんかなくは部署とかね大企業の部署とかだとあるような気もしますねなんか技術力がすごい、いわゆるブリリアントジャークみたいな話になってきますよね。そういう人はいるようないないようなという感じ。",
      "start": 1362285,
      "end": 1402200,
      "timestamp": "22:42"
    },
    {
      "speaker": "C",
      "text": "ですね、会社によっては。2人の会社が特に海外色が強いっていうのも、そこら辺がこっちの会社に似てるっていう要因なのかもしれない。",
      "start": 1402200,
      "end": 1413484,
      "timestamp": "23:22"
    },
    {
      "speaker": "A",
      "text": "ですね。確かにそう。",
      "start": 1413484,
      "end": 1415885,
      "timestamp": "23:33"
    },
    {
      "speaker": "C",
      "text": "ですね。ありがとう。",
      "start": 1415885,
      "end": 1416485,
      "timestamp": "23:35"
    },
    {
      "speaker": "A",
      "text": "ございます。ゆうとさん、日本での就活をするときにまずどこから始めましたか?どんな媒体とかエージェントを使われまし。",
      "start": 1416485,
      "end": 1426103,
      "timestamp": "23:36"
    },
    {
      "speaker": "B",
      "text": "たか?媒体は特にそもそも僕は転職エージェントと呼ばれるサービスは一切使ってなくてもう自分で直応募というのかっていうのをやってて使った媒体はファインディっていうプラットフォームを使いましたね本当にエンジニアの、あとはPDMもそうかなプロダクトを作る人にフォーカスした転職プラットフォームみたいなところでずっとやってました帰ってから転職活動を始めるってなった時にまずは履歴書とかあとは職務経歴書を作るところから始めまし。",
      "start": 1426103,
      "end": 1469247,
      "timestamp": "23:46"
    },
    {
      "speaker": "A",
      "text": "たねカナダでは300社送って面接が3、4社というぐらいの打率だったみたいですけども日本ではどうでし。",
      "start": 1469247,
      "end": 1480165,
      "timestamp": "24:29"
    },
    {
      "speaker": "B",
      "text": "たか?日本だと多分応募数とかは僕がピッキーってのもあるんですけど多分20社ほど20から25くらいだと思う確かそれぐらいで最終的に面接まで行ったのは7社、8社は行ったのであの3割4割。",
      "start": 1480165,
      "end": 1501436,
      "timestamp": "24:40"
    },
    {
      "speaker": "A",
      "text": "ぐらいはいやものすごい違いですね。",
      "start": 1501436,
      "end": 1503538,
      "timestamp": "25:01"
    },
    {
      "speaker": "B",
      "text": "やっぱりねびっくりしましたこれはカルチャーショックでしたねあと。",
      "start": 1503538,
      "end": 1508284,
      "timestamp": "25:03"
    },
    {
      "speaker": "C",
      "text": "後は全部の後ぞさっきあとファインディーとかみたいなサービスがあるのも結構びっくりですよねエンジニアが就職しやすいようにというかそのファインディーの中でそういう問題とかあるんでしたっけわかんないあんまり詳しくないですけどとか問いたらファインディーじゃなかったかなこれもしかしたら違ったらごめんなさいあれなんですけど問題とか解いてそれを採用側が見て会社が評価してくれる。",
      "start": 1508284,
      "end": 1537582,
      "timestamp": "25:08"
    },
    {
      "speaker": "B",
      "text": "じゃ。",
      "start": 1537582,
      "end": 1537682,
      "timestamp": "25:37"
    },
    {
      "speaker": "C",
      "text": "ないけど売り手指示を書いて指示を言いたくないんだけどわかんないし雇われる側がすごい楽できるようなプラットフォームが結構そこにあります。",
      "start": 1537682,
      "end": 1550573,
      "timestamp": "25:37"
    },
    {
      "speaker": "B",
      "text": "よねですね候補者に対するサポートがすごく手厚いなと思っててFINDYの例で言うとまず始める前に面談的なことをFINDYの人とすることができてそこで職務経歴書を見ながら強みとかを把握してあとは僕のやりたいこととかをすり合わせてじゃあこういう会社を受けてみようとかっていうのを決めてくれるのですごく良かったですしあとは専攻に進んでても結構そこでチェックインしてくれて結構それ彼らが候補者と採用担当者の間に入ってなんか意見をつなげてくれるとかこういうフィードバックありましたっていうのも教えてくれますしなんですごく便利です。",
      "start": 1550573,
      "end": 1597587,
      "timestamp": "25:50"
    },
    {
      "speaker": "A",
      "text": "ね手厚いユトさん日本での就活転職活動で応募されてた求人エンジニアだけだったんですかそれともPMとか措置系の求人も合わせてやられてた感じ。",
      "start": 1597587,
      "end": 1608997,
      "timestamp": "26:37"
    },
    {
      "speaker": "B",
      "text": "ですかもエンジニアにだけ応募してましたねあそう。",
      "start": 1608997,
      "end": 1615171,
      "timestamp": "26:48"
    },
    {
      "speaker": "A",
      "text": "なんだでまあ30社を送って7発車面接ででそのうちあの内定が出たのは何件くらい。",
      "start": 1615171,
      "end": 1624957,
      "timestamp": "26:55"
    },
    {
      "speaker": "B",
      "text": "でしたか結局は最終的にオフをいただいたのは今のアップサイダーだけ。",
      "start": 1624957,
      "end": 1629520,
      "timestamp": "27:04"
    },
    {
      "speaker": "A",
      "text": "ですねその他の企業さん、アップサイダーさんも含めてですけれども面接の流れ、カナダと比べてどうでした?コーディングインタビューとか課題とかいろんな形式があると。",
      "start": 1629520,
      "end": 1642205,
      "timestamp": "27:09"
    },
    {
      "speaker": "B",
      "text": "思うんですけど多分カナダと結構似たような流れでまずカジュアル面談なりその一時面接、ビヘビュアルインタビューをしてその後そのままテクニカルインタビューに行くかアサインメントもらってそれをもとにテクニカルインタビューに行くか最後はマネージャー陣と話をしてその後オファーって流れです。",
      "start": 1642205,
      "end": 1668021,
      "timestamp": "27:22"
    },
    {
      "speaker": "C",
      "text": "ねテックインタビューはどんな感じの。",
      "start": 1668021,
      "end": 1673263,
      "timestamp": "27:48"
    },
    {
      "speaker": "B",
      "text": "インタビューだったんですかもうカナダに比べて結構幅広い質問が飛んできてフロントエンドだけに限らず結構バックエンドの質問も来たりとかデータベースの話もあったりとかありまし。",
      "start": 1673263,
      "end": 1686770,
      "timestamp": "27:53"
    },
    {
      "speaker": "C",
      "text": "たねごめんなさいちょっと聞き飛ばしたかもしれないですけどアサインメントみたいなのもあってって感じ。",
      "start": 1686770,
      "end": 1694675,
      "timestamp": "28:06"
    },
    {
      "speaker": "B",
      "text": "ですか?企業によるんですけど今の会社に言えばアサインメントありでそれでインタビューし。",
      "start": 1694675,
      "end": 1702940,
      "timestamp": "28:14"
    },
    {
      "speaker": "C",
      "text": "ましたね言える範囲で何系のアサインメントだったん。",
      "start": 1702940,
      "end": 1708743,
      "timestamp": "28:22"
    },
    {
      "speaker": "B",
      "text": "ですか?これは今のポジションが結構フロントエンド寄りのフルスタックっていうジョブディスクリプションなのでなので本当にフロントエンドの簡単なコンポーネントを作るっていうアサインメント。",
      "start": 1708743,
      "end": 1722502,
      "timestamp": "28:28"
    },
    {
      "speaker": "C",
      "text": "でした日本の企業って結構そこら辺テックインタビューアサインメントみたいなのあんまりしないとかリード行動とかあんまりしないみたいなイメージだったけど割とカナダの企業みたいな感じでそういうアサインメントもあるしなんだろうテックインタビューでいろんな質問でその知識を確認するみたいなのもあるしみたいななんか半々ぐらいな。",
      "start": 1722502,
      "end": 1752037,
      "timestamp": "28:42"
    },
    {
      "speaker": "B",
      "text": "感じかなですねまあいずれにせよどちらかの方法で絶対技術力は深く問うっていうスタイルだと思いますね。",
      "start": 1752037,
      "end": 1760839,
      "timestamp": "29:12"
    },
    {
      "speaker": "A",
      "text": "確かにカナダでの仕事と日本でのフリーランスはフロントエンドだったんですが今はフルスタックでお勤めだと思うんです。",
      "start": 1760839,
      "end": 1773723,
      "timestamp": "29:20"
    },
    {
      "speaker": "B",
      "text": "けれどもカナダはもうフロントエンドでやってましてその後は日本の業務委託は初めフロントエンドで入って途中ちょっとバックエンドもやる。",
      "start": 1773723,
      "end": 1786953,
      "timestamp": "29:33"
    },
    {
      "speaker": "A",
      "text": "っていう流れでしたね今はフルスタックとして結構バックエンドの方とかも幅広く見られている感じ。",
      "start": 1786953,
      "end": 1795416,
      "timestamp": "29:46"
    },
    {
      "speaker": "B",
      "text": "ですか?今はそうですね本当にいろんなことを幅広くやっててであのまあフロントエンド入ったんですけどフロントエンドのタスクとバックエンドのタスクの割合で言ったらフロントエンドが最近ちょっとロックが7割になってきたなーっていう形でもっとどっちも。",
      "start": 1795416,
      "end": 1816864,
      "timestamp": "29:55"
    },
    {
      "speaker": "A",
      "text": "やるみたいな感じですね結構じゃあ幅広くなったんですね仕事さすがスタートアップという感じです。",
      "start": 1816864,
      "end": 1823988,
      "timestamp": "30:16"
    },
    {
      "speaker": "B",
      "text": "ねそうですねはいやっぱりやらないとやらないともう授業回らないんでもう自然と知識の幅は広がっている。",
      "start": 1823988,
      "end": 1831140,
      "timestamp": "30:23"
    },
    {
      "speaker": "A",
      "text": "感じがしますアップサイダーさんに入社を決められた決め手と言いますか何かここがいいなって思ったみたい。",
      "start": 1831140,
      "end": 1839762,
      "timestamp": "30:31"
    },
    {
      "speaker": "B",
      "text": "なところは何かありますか大きく2つあって1つはもう面接を通して分かったその人の良さっていうのはすごくあってもうなんて言うんでしょうすごく伝わってくるんですよねこの人たちと働いてたらこういう感じの未来とか働き方なんだろうなーっていうのは想像できるぐらい人が良かったのとあとは僕らのミッションっていうのがその世界的な金融プラットフォームを作るっていうのでいろんな事業をお金の面で支えるっていうミッションがあるんですけどそれにすごく共感をして入社を決めました。",
      "start": 1839762,
      "end": 1880987,
      "timestamp": "30:39"
    },
    {
      "speaker": "C",
      "text": "ちなみに今見たらあれですね支払い。\ncomとかもやられてるんですね何か使ってたことはありまし。",
      "start": 1880987,
      "end": 1889508,
      "timestamp": "31:20"
    },
    {
      "speaker": "B",
      "text": "た支払い。\ncomはうちの授業。",
      "start": 1889508,
      "end": 1890969,
      "timestamp": "31:29"
    },
    {
      "speaker": "C",
      "text": "もあるんですねお金って結構国の法律とかに関わってくるから海外展開みたいなのとかってしにくいのかなとは思うんですけど海外展開を目指してる授業とかもう既にしてる授業みたいなのはある。",
      "start": 1890969,
      "end": 1910366,
      "timestamp": "31:30"
    },
    {
      "speaker": "B",
      "text": "んですか今のところ、僕が把握してる中では海外展開を目指してる事業はないと思ってて、まずはもう国内を中心に目指してるっていう形。",
      "start": 1910366,
      "end": 1922469,
      "timestamp": "31:50"
    },
    {
      "speaker": "C",
      "text": "ですね。じゃあ本当にスタートアップの、地盤固めではないけど、そしてこれからって感じなんです。",
      "start": 1922469,
      "end": 1929993,
      "timestamp": "32:02"
    },
    {
      "speaker": "B",
      "text": "かね?そうですね。もちろんりょうさんが言ってくれた通り、お金に関しては国ごとに法律がすごくややこしくて違うので、そう簡単に展開できるものではない。でもなんか世界的にそういう通貨統一とか仮想通貨に統一するとかわかんないですけどそういう流れがあればもちろんそこには乗っていくと思うんです。",
      "start": 1929993,
      "end": 1949955,
      "timestamp": "32:09"
    },
    {
      "speaker": "C",
      "text": "けどね確かに個人的には別にあのすげえ今思い浮かんだだけなんですけどあの日本にもあのカナダでいうウェルスシンプルみたいなアプリとかあのねなんだろう投資しやすいよみたいなアプリがどんどんできたらいいなとかって思ったりするんですけどねぜひあのプロジェクト立ち上げて作ってください。",
      "start": 1949955,
      "end": 1977038,
      "timestamp": "32:29"
    },
    {
      "speaker": "A",
      "text": "アップサイダーさんはどっちかというと法人向けの金融のお話が多いんですか。",
      "start": 1977038,
      "end": 1981542,
      "timestamp": "32:57"
    },
    {
      "speaker": "B",
      "text": "ね多分ですよね個人は全くなくて法人ばかりですね法人向けのクレジットカードコーポレートクレジットカードっていうのがメインプロ。",
      "start": 1981542,
      "end": 1991152,
      "timestamp": "33:01"
    },
    {
      "speaker": "A",
      "text": "タクトですね最近僕はアップサイダーさんの名前をニュースで見ましてミズホのグループ入りしたんですよね確か。",
      "start": 1991152,
      "end": 2000658,
      "timestamp": "33:11"
    },
    {
      "speaker": "B",
      "text": "そうですね今年の夏に。",
      "start": 2000658,
      "end": 2002380,
      "timestamp": "33:20"
    },
    {
      "speaker": "A",
      "text": "しましたどうですかなんかミズホ結構な割合の株式を取得して多分ミズホの人たちもアプサイダーさんの事業の将来性を見込んでがっつり投資するというふうになったと思うんですけどそこから何か社内の雰囲気が変わったりとか何かありまし。",
      "start": 2002380,
      "end": 2022874,
      "timestamp": "33:22"
    },
    {
      "speaker": "B",
      "text": "たか?これもノートに出てるので特に隠すこともないんですけど全く変わってないですね一応グループ員したけど社内の雰囲気とか仕事の進め方とかやってる事業に関しては特に変わりなくやってるのでそれこそエンジニア目線で言ったら開発の体制が変わるかって言われたら全然そんなことない。",
      "start": 2022874,
      "end": 2047112,
      "timestamp": "33:42"
    },
    {
      "speaker": "C",
      "text": "です。",
      "start": 2047112,
      "end": 2047272,
      "timestamp": "34:07"
    },
    {
      "speaker": "A",
      "text": "しそうなんだなんかメガバンクが投資するってなるとそのなんかメガバンクの偉い人がなんかやってきていろいろ口出したりしてるのかなみたいなことを勝手に思ってたんですけどそれはなんかでもいいことですねあの元ある会社の色をちゃんと残してみたいな。",
      "start": 2047272,
      "end": 2065609,
      "timestamp": "34:07"
    },
    {
      "speaker": "B",
      "text": "ですねすごくそこは配慮してもらう配慮してもらってるのかリスペクトされてるのかですけどあの大事にしてもらってるのでとてもありがたい。",
      "start": 2065609,
      "end": 2073032,
      "timestamp": "34:25"
    },
    {
      "speaker": "A",
      "text": "ですねあとこれはまあお話しいただける範囲で大丈夫なんですけれども日本今の給与面ですね条件みたいなところだいたいどれぐらいのレンジになり。",
      "start": 2073032,
      "end": 2085686,
      "timestamp": "34:33"
    },
    {
      "speaker": "B",
      "text": "ますかレンジで言うとカナダと意外とカナダとあんま変わらなくてだいたい650から700の間でオファーいただけたのでちょっとこれは僕もびっくりし。",
      "start": 2085686,
      "end": 2098072,
      "timestamp": "34:45"
    },
    {
      "speaker": "A",
      "text": "ました確かに全然あれですねそんな見劣りするわけじゃない。",
      "start": 2098072,
      "end": 2104335,
      "timestamp": "34:58"
    },
    {
      "speaker": "C",
      "text": "ですねカナダで働いた経験があるからこそ、今なんか働き方として違うなみたいな、海外に出てないエンジニアメンバーとかもいると思うんですけど、なんかちょっと自分は違うなみたいなところとかってあり。",
      "start": 2104335,
      "end": 2123095,
      "timestamp": "35:04"
    },
    {
      "speaker": "B",
      "text": "ますか?ちょっと自分は違うな。",
      "start": 2123095,
      "end": 2127280,
      "timestamp": "35:23"
    },
    {
      "speaker": "C",
      "text": "考え方だったりとかなんかひろしくんの例で言うとやっぱりあのよくあの英語喋れる人っていうふうに認識されてるからやっぱりあのなんでしたっけファシリテーターみたいなのやらされたりだとかみたいなのがあるかなみたいなのが結構この間のインタビューで聞いたんですけどなんかそういうのってあったり。",
      "start": 2127280,
      "end": 2144693,
      "timestamp": "35:27"
    },
    {
      "speaker": "B",
      "text": "するのかなみたいな特に僕の場合は英語できるからこうとかっていうのはあんまりなくて何かなぁ特にだからといって特別なロールが与えられるわけではないですねCっていうなら英語できるのでそれを活かして社内の僕のチームとは違う英語場所のエンジニアと交流というか一つのプロジェクトを通して交流しているとかそれぐらいですか。",
      "start": 2144693,
      "end": 2173852,
      "timestamp": "35:44"
    },
    {
      "speaker": "C",
      "text": "ねちなみにチームの中には海外の方もいらっしゃるん。",
      "start": 2173852,
      "end": 2180595,
      "timestamp": "36:13"
    },
    {
      "speaker": "B",
      "text": "ですか?僕のチームには。",
      "start": 2180595,
      "end": 2182872,
      "timestamp": "36:20"
    },
    {
      "speaker": "C",
      "text": "いないですいないんだオフィスは一緒?それとも海外の人たちは海外のオフィスで働いてるん。",
      "start": 2182872,
      "end": 2190521,
      "timestamp": "36:22"
    },
    {
      "speaker": "B",
      "text": "ですか?僕らオフィスはあるんですけど基本的にフルリモートフルフレックスな。",
      "start": 2190521,
      "end": 2194846,
      "timestamp": "36:30"
    },
    {
      "speaker": "C",
      "text": "のででも、日本国内から海外の人が働い。",
      "start": 2194846,
      "end": 2201600,
      "timestamp": "36:34"
    },
    {
      "speaker": "B",
      "text": "てる感じ?国内にいる人もいれば、国外にいる。",
      "start": 2201600,
      "end": 2204763,
      "timestamp": "36:41"
    },
    {
      "speaker": "A",
      "text": "人も、両方いますね。次はかなりね、ざっくりした質問になっちゃうんですけれども、いろんな方も気になると思うんですけれども、日本に帰ってきてどうですかっていう質問ですね。まあ日本に帰ってきて良かったこともちろんちょっとネガティブなこととかもあると思うんですよね人が多いよとか僕もあるんでなんかその辺ちょっとポジネができるだけたくさん引けたらいいなと思ってますどう。",
      "start": 2204763,
      "end": 2230985,
      "timestamp": "36:44"
    },
    {
      "speaker": "B",
      "text": "ですかユウトさんユウトさんまあもうポジティブなことはこれも皆さんおっしゃると思うんですけどひたすら綺麗、治安がいいですねあとは僕個人で言うとやっぱこっちに友人とか家族もいるので日本になのでそれはいいですねその会いたい時に会えるとかコミュニケーション実話なしで撮れるとかっていうのはすごくいいなと思いますねでネガティブあとポジティブで言うとあの今冬じゃないですか冬でも晴れてるんですよね、日本って。太陽があるんですよ、バンクーバー達がって。それがすごく救われてて、あんまり寒さを感じない。みんな寒いとか言ってるんですけど、僕は全く寒くない。",
      "start": 2230985,
      "end": 2282523,
      "timestamp": "37:10"
    },
    {
      "speaker": "A",
      "text": "っていう。今、バンクーバー一番つらい時期です。",
      "start": 2282523,
      "end": 2285678,
      "timestamp": "38:02"
    },
    {
      "speaker": "C",
      "text": "よね。いや、僕、あの、2人僕の性格わかると思うんで、あの、わかると思うんですけど、あんま気にならないんですよね、そこ。まったく。まあ、年中僕運動してるんで、今もバレエ集さんとか、この間もなんか、あの、同僚がみんなで結構バトミントンやってるから、バトミントン行ったりとかするってのもあると思うんですけど、そもそもあんまり僕、あの、感情の起伏があんまりないというか、あんまり激しくないから、そもそもちょっとメンタルがあっていうとかっていうのも。",
      "start": 2285678,
      "end": 2319935,
      "timestamp": "38:05"
    },
    {
      "speaker": "B",
      "text": "ない。",
      "start": 2319935,
      "end": 2320716,
      "timestamp": "38:39"
    },
    {
      "speaker": "C",
      "text": "し、で、年中運動して、バレーボールは室内で運動してるっていうのもあるんで、あんまりなんか変わらないっていうのもあるのか、ちょっとなんか断固としてそこらへん、天気の影響なんかないよっていうのは反対していきたいところだけど、確かに結構言ってる人は多いから、まあそうなのかなっていうのはありますよね。多分きっとそうなん。",
      "start": 2320716,
      "end": 2343375,
      "timestamp": "38:40"
    },
    {
      "speaker": "A",
      "text": "でしょうね。りょうさん個人はそんなに。",
      "start": 2343375,
      "end": 2345916,
      "timestamp": "39:03"
    },
    {
      "speaker": "C",
      "text": "ですが、僕はバンクーバーはない。",
      "start": 2345916,
      "end": 2348257,
      "timestamp": "39:05"
    },
    {
      "speaker": "A",
      "text": "かな。じゃあちょっとひるがえって日本のちょっとネガティブなところですね。バンクーバーのこういうところがちょっと恋しいなとか、なんかこれがなくなって寂しいなみたいなところなんかあり。",
      "start": 2348257,
      "end": 2359741,
      "timestamp": "39:08"
    },
    {
      "speaker": "B",
      "text": "ますか?バンクーバーの恋しいものはたくさんありますね。一番初めに挙げるとしたらやっぱ大自然とかアクセスしやすい大自然ですかね。もうすぐそこに海とかでかい公園とかまあそんな綺麗ではないけどビーチもあるし自然との接点がすごく多かったなーっていうのはあって僕も結構その気持ち的につらかった時はその自然に触れてリフレッシュするってことをしてたのでやっぱそれがあんなアクセシブルなところにたくさんあるっていうのはすごく恵まれてた。",
      "start": 2359741,
      "end": 2393838,
      "timestamp": "39:19"
    },
    {
      "speaker": "C",
      "text": "なぁと思いますねでもさぁ、たかおさんとかなんか違う県とか行けばある。",
      "start": 2393838,
      "end": 2402032,
      "timestamp": "39:53"
    },
    {
      "speaker": "B",
      "text": "わけでしょ?ちょっと頑張ればちょっと頑張ればあるけどぐらいのなんかそれこそバンクーバならもう車すら使わずに歩けばそれなりのデカさの公園がポンって出てくるので。",
      "start": 2402032,
      "end": 2416101,
      "timestamp": "40:02"
    },
    {
      "speaker": "A",
      "text": "それはいいなぁと思いますねあとこの間、そうですね、夏登山とかちょっとしてたんですけど、やっぱね、人多いんですよね。頂上とか行ってもディズニーランドぐらい人いるんですよ。マジかね。それが確かちょっとバンクーバーと違いがありますね。自然がアクセスでき。",
      "start": 2416101,
      "end": 2436181,
      "timestamp": "40:16"
    },
    {
      "speaker": "C",
      "text": "たと。でも、それってやっぱさ、高尾さんと富士山ぐらいじゃない?そんなことない。分かんないけど。まだそれ以外のことしか言っ。",
      "start": 2436181,
      "end": 2443606,
      "timestamp": "40:36"
    },
    {
      "speaker": "A",
      "text": "てない。まあでも人混みはやっぱあのバンクーバーにいた時よりはやっぱついて回る悩みですよね日本に帰って。",
      "start": 2443606,
      "end": 2452887,
      "timestamp": "40:43"
    },
    {
      "speaker": "C",
      "text": "くるのね確かに人なんかコミュート?なんて言うんだっけ通勤?やっぱ通勤が怖いっていうのはあるかもしれないけどまあリモート?お二人ともリモートなのかなあ、ひろし君は会社行っ。",
      "start": 2452887,
      "end": 2466432,
      "timestamp": "40:52"
    },
    {
      "speaker": "A",
      "text": "てるんだっけそうですね、でも双子玉川なんでそんなに通信ラッシュがひどいところではないが、田園都市線とかですね、渋谷方面に行く通勤とかはパソコンが割れるかもみたいなこと言われてますね。",
      "start": 2466432,
      "end": 2482421,
      "timestamp": "41:06"
    },
    {
      "speaker": "C",
      "text": "僕結構、僕のパーソナルスペース広めなんで使ってない。",
      "start": 2482421,
      "end": 2487705,
      "timestamp": "41:22"
    },
    {
      "speaker": "A",
      "text": "ですね話いろいろ聞いてきましたけれどもちょっとまあね締めみたいなところに入っていけたらなと思うんですが最後にちょっとゆうとさんからですね今海外キャリアル語お聞きの皆さんに対してカナダに行くことを考えている人カナダにいて日本に帰国した方がいいのかなみたいなことを考えている人いろいろいらっしゃると思うんですけれどもゆうとさんから何かメッセージいただけ。",
      "start": 2487705,
      "end": 2515855,
      "timestamp": "41:27"
    },
    {
      "speaker": "C",
      "text": "ますか別々でいただきたいですねなんかあの期待これからカナダに行く人とこれから帰る人に向けて帰る人特に僕はやっぱ聞きたいんでちょっと別々にお願いします。",
      "start": 2515855,
      "end": 2528475,
      "timestamp": "41:55"
    },
    {
      "speaker": "A",
      "text": "じゃあまず初めにあのカナダに行くことを考えている人に対してメッセージは何か。",
      "start": 2528475,
      "end": 2533259,
      "timestamp": "42:08"
    },
    {
      "speaker": "B",
      "text": "ありますかカナダに行くことを考えている人に対しては行きたいと思ったら行ってくださいっていうのが一番のメッセージ特に行ったからってマイナスになるわけではなくて基本的にプラスにしかならないっていうのはほぼ確定してるようなもんなので行かなくて後々後悔してあの時行けばよかったなってうじうじするぐらいなら思い切って行った方が絶対いいと思いますその国とかはその人の人生によるんで分からないですけどバンクーバーに限って言えば素晴らしいコミュニティーはありますしすごくいい場所なので本当に行ってみてその後別に永住したいなら永住に向けて頑張ればいいですし帰ってきたいなら別に日本に帰ってこれば日本に帰ってこれるっていうのが一番でかいなと思ってるのでまずカナダに行きたい人に対してはとりあえず行きましょうって言ってから考えるのでもいいし今は情報とかすごい出てるので恵まれた時代なのでそれをうまく活かしてカナダに行ってくださいっていうのはありますカナダに住んでて日本に帰ってこいと思っている人もしくは帰ろうかなと考えている人に対してですねまず言いたいことはカナダに行ってる時点で聞きたいことはあれですねまず日本に帰ってきても居場所とか活躍できる場所がたくさんありますよっていうのは一つあって特に日本に帰るイコール別に負けとかネガティブなことではないですしそれはあくまで人生の1ステージであってバッタラタラに場所が変わるだけだなっていうのは思っていて特にそこに対してすごく消極的になる必要はないなと思ってますでまぁそもそもさっきも言った通りその国によっては母国に帰れない政治的に帰れない人がいると思うんでなんかそういう人と比べてすごく自分たちは恵まれているんだっていう意識を持っていていいなぁと思い。",
      "start": 2533259,
      "end": 2656216,
      "timestamp": "42:13"
    },
    {
      "speaker": "C",
      "text": "ますねいやそれめちゃくちゃ思いますねなんか帰るとなると、なんか給料とかもあるし、通勤なしかとかって、悩みが結構幸せですよね。それがなんか本当、南米の人たちからとか。",
      "start": 2656216,
      "end": 2670976,
      "timestamp": "44:16"
    },
    {
      "speaker": "B",
      "text": "する。",
      "start": 2670976,
      "end": 2671196,
      "timestamp": "44:30"
    },
    {
      "speaker": "C",
      "text": "と、うーん、帰るってできるかな、みたいなとか。命の危険みたいな危機みたいなのがあるじゃないですかそういうのに比べると僕たちの悩みはめちゃくちゃ幸せなんで確かに本当にそうだなっていうのとそのこれから来る人に関して優斗くんみたいにすげー苦労してる人でもプラスになるっていうのはめちゃくちゃいいアイディアじゃなくてなんでもアイディアで片付けようとしちゃう英語話者あらゆるマインドセットとかですかねいいですねぜひぜひみんな来てくれれ。",
      "start": 2671196,
      "end": 2710862,
      "timestamp": "44:31"
    },
    {
      "speaker": "A",
      "text": "ばって思いますねユートさんの辛い経験はですねノートにたくさん書いていてですね僕もすごい共感することが多かったんですが今日本に帰るか帰らないかと葛藤してる人に対してすごく響く内容かなと思うんでユートさんのツイッターのアカウントXのアカウントからも飛べると思うんで皆さんぜひ読んでみてくださいじゃあ今日ユートさんのインタビューはこんなところにしておきますか。",
      "start": 2710862,
      "end": 2737643,
      "timestamp": "45:10"
    },
    {
      "speaker": "C",
      "text": "ねありがとうございましたじゃあゆう。",
      "start": 2737643,
      "end": 2740263,
      "timestamp": "45:37"
    },
    {
      "speaker": "A",
      "text": "とさん今日はお時間いただきましてありがとうございましたまた。",
      "start": 2740263,
      "end": 2743424,
      "timestamp": "45:40"
    },
    {
      "speaker": "C",
      "text": "よろしくお願いしますということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうござい。",
      "start": 2743424,
      "end": 2764954,
      "timestamp": "45:43"
    }
  ],
  "highlight1": "カナダでフルタイムのエンジニアとして働いた経験を活かして、現在は日本のベンチャー企業でフルスタックエンジニアとして働いている優斗さん、海外のキャリアパスに興味がある方にぜひ聞いていただきたい話です。",
  "highlight2": "日本に帰国することにしたときの優斗さんの考え方は、就職活動での経験談とともにどう変わったのか、詳しくはPodcastで話しています。",
  "highlight3": "優斗さんがカナダで働いていた会社で得た経験や、海外での生活をいかした現在の仕事の内容はどうなっているのか、詳細はPodcastで話しています。"
}