{
  "episodeGuid": "04d2d59c-1b5b-4652-b02f-d697132d4570",
  "episodeTitle": "ただのフリーターからカナダでシニアエンジニアに！一発逆転、異色の経歴を持つケイさんのキャリア戦略（前半）#9",
  "transcribedAt": "2025-10-19T21:28:51.092Z",
  "duration": 3039,
  "fullText": "はい今回はゲストとしてKei君に来てもらいましたKei君はもともとカナダのバンクーバーで就職して今は日本の外資系企業に勤めてるってことなんですけどまず最初に簡単に経歴から教えていただいてもいいです。かはいみなさん初めましての方は初めまして系と申しますバンクーバーには2017年に投稿して2019年からソフトウェアエンジニアとしてキャリアを始めましたそこから5年ぐらいかな2024年までカナダでシニアフロントエンジニアになるまでキャリアを積んだ後2024年10月から現在の外資系企業で日本の東京で勤務していますというのが簡単な来歴ですよろしくお願いします。けいくんって言うと、あれですよね、YouTbeもやられてるし、なんか有名な人のYouTbeにも出てるし、なんかたぶんポッドキャストとかにも結構出てて、結構いろんな人が知ってくれてるのかなと思うんですけど、なんかあんまり僕、あとはまあ個人的にも僕、ずっと友達だったんで、結構いろいろ知ってるんだけど、カナダの渡航前のことにとか、英語について聞くのはあんまりないかったかな。すなさんあります?俺はもちろんだってね、あのもうそこをもう掘り下げに掘り下げてあのフロップでもうあの吸い上げるだけ吸い上げてこんなやつでも海外就職できたんやで言いまくったからいっぱいし。てますハードルを下げる役を務めさせてもらいましたありがとう。ございますそしたらまずはカナダに渡航するきっかけとかなんか海外に興味を持ったきっかけみたいなのから聞い。てもいいですかもちろんですバックグラウンド的にはそもそもエンジニア系じゃなかったんですよね理系でもなかったしそもそも大学すら行ってないみたいなとこから始まったんですけど高校卒業してフリーターを4年ぐらいやったのかなで20歳になるとし18で高校を卒業しそこから2年経ったぐらいで英会話教室のバイトっていうのがなんか募集してたので面白そうやと思って募集したらまあうまいこと滑り込むことができそこで英会話教室っていうグローバルな環境で、いろんな外国人の方と会ったり、一緒に働いている正社員の方々が、昔留学行ってたとか、親御さんがこういう海外関係で、みたいな人がすごい多かったから、環境の変化に伴って考えも変わりまして、海外ってフリーターでも行けんだみたいなハードルの低下が心理的に起こりまして、そこから海外を志すようになり、2年ぐらいかけてお金を貯めて、カナダ行くかというふうに思い立って、22歳の時に渡航したというのが簡単なバックグラウンドかな、カナダに行くまでの。その英会話までに準備とかは、なんか準備っていうか、なんか英語の、なんか基礎知識とかはあったんですか?なんか海外行きたいって思ったのが20歳のときで、実際に行ったのが22でしょ。で、。その2年間で、その英会話教室の福利構成で、週に1回40分、英語の授業を受けれるみたいなのがあったから、それをやっていたっていうのと、あともう一つは、あの、中学文法を収める本みたいななんか有名なやつがあってミスターブラウン先生だったかななんかちょっと忘れたんですけど青いやつそれでなんか1ヶ月で中学文法を収める本をなんか1年かけてやって中学文法を収め全然1ヶ月で終わらなかったですねこんなのあるんやとか全部知らんことばっかりやったみたいな読んだ時にで勉強しグダグダの英語を喋り、で、自信だけつけて海外に行ったっていう感じですね。だから英語力っていう文脈で言えば、渡航時点で勉強料に対してそんなに良くはなかったのかなと思います。なんかビビらなくはなってましたけど、具体的な英語力としては、東イクとかで言うとほんと600も行ってなかったんじゃないかな。ほんとなんかなんとかなんとかなんだろうセンテンスを作るしかし現場の人は何言ってるかわからんみたいなそんなイメージ感ですかね文法はわかってるけど言葉にはできないみたいな。そんなレベルだったねなんかねあのKさんといったらフロックのメンバーの中でも相当コミュ力が高い方みたいなイメージがねトガシさんもあったんじゃないかなと思うし俺前トガシさんと喋った時もねほらだってKさんはさ来た瞬間から英語むっちゃ喋れてたじゃんみたいな感じの話を一回したような気がしたからあれそういえばじゃあそうかKさんってこっち来た時ってまだまだ英語全然だったんだっていうのは今実は結構新鮮やねそうだっ。たんだそれで言うと、僕がKei君に出会ったのは2018年か19年のはずで、それはKei君、多分僕が言ったのは会った直後の話で、Kei君が来たのはそれよりも1年前だったはずなんで、そこで何かがあったのかな見てる感じとか自分でもそうなんですけど大学受験をちゃんとした人たちってすごいやっぱ基礎力とかあの特に単語力がすごいあるなって思っててそうじゃない人まあ僕も含め僕を含めたそうじゃない人は結構単語その喋れるようになったからもそのいろんな単語を使うのがあんまり得意じゃないみたいなのがあるのかなって思っててk君はえっとそういうまあ大学受験はしてないんだけどすごいボキャブラリーも多いしインプットがすごい多いのかなーって風にずっと感じたんですけどそこらへんってどうですかなんかその来た時はトイック600とかないからないぐらいできてまあ僕が出会った時の結構も喋れてた印象だったんですけどなんかその1年で結構じゃインプットも身につけたみたいな感じ。なんですかそうねインプットすごい質の良いインプットだったんじゃないかなと思っててやっぱり留学の仕方が普通のフロックさんとかエージェントを使って学校に入学するっていうルートと違ってたから結構英語を勉強する環境としては質が良かったのかなと思ってて僕が海外に行った時に一番英語のインプットとして役に立ったのはスターバックスでバイトしてたほどだなと思うんですよねそのスターバックスのバイトっていうのが当時は僕が働いてたお店っていうのはそのなんだろうネイティブスピーカーの方がすごい多かったりとかお客さんが地元の人ばっかりとか朝シフトで入ってたんでなんだそのツアリストがいっぱい来るみたいな時間帯でもなかったしその時間的にも用意だけしたらお客さんとしゃべる時間があったりとかで自分の英語のインプットっていう文脈で考えると生の英語を聞くチャンス機会っていうのが普通に学校に行ってクラスメイトと喋ったりあの先生からレクチャーを受けたりっていう状態よりもとても多かったでやっぱりなんだろう学校でレクチャーを受ける英語のインプットっていうのはその技術的な話を相手に伝えるためのインプットであって相手が自分の英語のレベルに合わせて喋ってくれるわけではないのでやっぱり英語の吸収という点だけを考えたらやっぱりその地で育って生まれ育って英語を喋ってその生の英語っていうのを自分なりに解釈して受け入れるっていうサイクルができていたっていうのは、僕の中のボキャブラリーとか言葉遣いにすごい貢献してくれたなっていうか、ここがすごい伸びる要因になったんじゃないかなと振り返れば思いますね。スターバックスはどのぐらいの期間働いてたんですか?週何回でどのぐらいとか。もうほぼ、なんだろ、バイトだったけどほぼフルタイムみたいな入り方してましたね。1日8時間、週5とか6とか。だからもう常に朝にいるやつみたいなイメージ感かな。はいはいはい。で、。それが輪掘りの期間1年間って感じですか?それともそれ以外のこともしました?なんか語学学校行ったりだとか。最初は語学学校に半年間行って、その後バンフに飛ばされてベッドメイキングするっていうコースでカナダに行ったんですけど、そのコースをカナダに行った後にキャンセルしまして、キャンセルしたのちスターバックスだったので、スターバックスに行ったタイミングで、カナダもうちょっと滞在延長したいなと思って、語学学校じゃなくて普通の専門学校に行こうと思ったんですよね。その専門学校に行くために150万ぐらいかな日本円換算でを稼ぐ必要があったのでその150万を稼ぐためにスタバそのフルタイムっぽい入り方しているスタバに合わせて12個常に回転させているみたいな3つ掛け持ち状態でずっと回しててそれが1年ぐらいかな続いてで晴れて入学という流れなのでそうですね他にやったことといえばバイトですね。これ多分前提だけ多分伝えといた方がいいかな視聴者のためにいいというふうに思ったのがそう計算はねもともとこっちにいらっしゃったときはねまあさっきも言った通り全然エンジニアのバックグラウンドもなくしかもワーキングホリデー一発目で使ってきてっていうのも別にねこっちでエンジニアに出会えていたのもこっち来てから決め。たんだもんねそうそうそうそうなんですよだから。本当になんか最初さっき言ったベッドメイキングとか突然ワードが出てきたけれどももともとだからこっち来た時っていうのはなんか一般的なって言ったら言い方悪いかもしれないけどホリデーワーキングホリデー組みたいななんかこっち来て英語圏で仕事ができればそれを日本に持ち帰ってちょっとそれが生きるかなみたいな印象が多分強かった。んですよねきっとそうです。ねそうするとタイムライン的にちょっと整理すると最初の半年間は学校に行ってバンフは行かずにバイトを。した感じえっともっとちゃんと詰めると1年間のコースを留学エージェントに提案されてカナダに行きましたとまあカナダ好くじゃないですかでその1年間の内容っていうのが半年小学学校半年コープって呼ばれるプログラムでベッドメイキングだったんですよねで最初の2ヶ月で語学学校をキャンセルしてこのコース自体をもうなかったことにしたとでこの2ヶ月で辞めた理由っていうのもやっぱ語学学校っていうのは自分のいたあの語学教室か英語教室のなんか英語の伸びと全然変わらんどころかなんか英会話教室の方が英語伸びたんじゃねって思うぐらい質が悪いものだったんでもうキャンセルして自分でやるわってなったのがきっかけですねでもバンフでベッドメイキングだから冷静に考えたらキャリアもクソもないやろと思って辞めたここでようやく冷静になったいやうまいんですよねなんかえでも海外海外でキラキラだよみたいな海外行ったら全部うまくいくよみたいな感じの口ぶりで喋るんで国際的経験だよ。みたいなあのイメージリゾートバイトみたいなのって結構日本人慣れてる気がするからなんかそんなイメージだったのなのかなーってちょっと思いましたけど聞いた時にはいや。もう本当ヤンヤンなんか言われた通りにこの1年のコース行ってたら今頃日本帰ってきて戦争時でツアーガイドでもしてたんじゃないですかねヤンヤン。なんか具体的すぎてちょっと怖いんだけどヤンヤンいやだから俺ねあれよどうなんだろうねいや俺だからねそういえば東海オンエアさんともこの間のフォットキャストにも喋ってた気がするんだけどアンチ語学学校になったのは割と俺実はKさんがきっかけやったねそういうインデビューだっ。たらヤンヤンマジですかもう光栄です。光栄ですかよかったただももちろん目的ねこの前前回だから誰かね出てきてくれた時にごはく学校割といいよみたいな話があった気がするんだけど目的別でねなんか会えるつもりですか上げるためとかやったらいいかなと思うけど純然たる英語を勉強するためっていうので俺計算のエピソードがすごいいつも。頭に引っかかってて正味、うん、費用対効果そんなよくない気がしますよね。なんか、正直、まあ、ニワトリ卵問題ですけど、語学学校って、平住権取ったらタダで行けるじゃないですか、。彼女と。いや、。そりゃあるよね、まあ間違いない。まあ、。それを取るために英語を勉強するんだよという話でもあるんですけど。いや、。そうそう。そう、無料でできるもんをあんな莫大なお金払って入学して、クラスメイト全員メキシコ人みたいな。そんな環境で英語うまくなるわけないじゃん?と思ったわけですよ、当時の僕は。そうだよね。でもほんと不思議なもんで、そのベッドメイキングとかこっちのなんかホテルのね、そういうとこで働いてとかっていうのも相当な人がやっぱり経験してると思うけど、Kさんみたいになんか、先々のキャリアってどうなるのかってイメージつけたら、なんか割と不安にならないのかなって正直思うとこあるんだけどね。そこを不安にさせないのが留学エージェントの営業の仕事なんですよ。僕も海外、海外渡航において3つアンチがありましてもう俺このポッドキャストもやすきで言いますけど一つが語学学校もう一つがあのコンサル的な経験もなんもないくせに知ったかぶりする留学エージェントで最後の一つがジャパリスでバイトするやつあーもう。なんか迷惑するやつだなぁこれ大丈夫かなぁ東海オンエアさん大丈夫ですかこれカットして。もらってえーと全然このまま流すけど僕の何だろう、多分、Kei君も、セナさんもそうかな、割と行動力があるタイプで、その語学学校に行かずとも、自分でどっかに行って、その語学力を身につけに行く人たちは、いいと思うんですよ。でも、僕みたいに言われたことだけをやりたいような人間はあの学校とかみたいな強制力があるとあーもうやだけど行くかみたいなそういう気持ちにもなったりするんでまあ全てが全て悪いわけではないのかなあとあのこの間のあのポッドキャストの話で言うとあのフィリピンみたいな留学で本当にもうマンツーマンでその自分の英語の恥ずかしさっていうのをみんなの前で喋る恥ずかしさっていうのをなくしてとりあえずベラベラ喋れるちゃんと通じる言葉で通じる英語ではないんだけどベラベラ喋れるようになるっていうその最初のステップみたいなのとかはまあアリなのかなって。思いますけどねいやー素晴らしい。もうちゃんと丸くまとめてくれるのが嬉しいですね。さすがホスト。もう英語における喋れる感ってもう60%は自信から来てますからね。いやー間違いないよね。喋ってる風になりますから。そう、いまだにブロークンな自信。めちゃくちゃ俺あるけれども普通に喋ろうと思って喋るんだよ。なんかよくわかんないねあれ。絶対俺より英語力あるはずのやつが全然ダメってたりするもんな。なんか結構みんなやっぱお酒飲むといいみたいなあります。よね俺はそうなん。だけどちょっとそのタガが外れてバラバラ出てみたいな別。に酒の力足りなくてもあってちょっと思うけどまあまあそうね確かにでもあるんでしょうね日本人ならではのとこもあるんだろう。ねきっとそしたらじゃあ技術力についていこうかなと思うんですけどでそれこそそのさっきのその専門学校っていうのがあのコナーストーンかなっていうカナダのバンクーバーにある学校だと思うんですけど、それこそ僕がクラスメイトで1年一緒に通ったんですけど、。じゃあ、。技術力はそこの学校の中でつけたみたいな感じですか?それともなんか自分でそれ以外にもやってた感じですか?一番大元の基礎っていうか始めたては独学でなんか専門学校行くって決まった時点でちょっとダッシュスタートしたいなと思って当時はその入学する人全員俺と一緒で全く経験ない奴ばっかりと思ってたからちょっとダッシュスタートしたいなと思っててプロゲートとかああいうなんだろう自分で勉強する系のサイトで基礎を抑えていたとHTML、。CS、。JavaScriptとJavaも触ってたかなだから具体的な概念としてはhtmlで振ったボディヘッダーのページが作れcsで若干型を成形できでjavascriptでボタンを押したらポップアップ出る程度できたしjavaを触ってたからクラスは何のこっちゃわかってなかったけど最低限の型インテージャーストリングとかあれいとかそこらへんはわかってる状態での入学でしょねじゃ経験。者だったってわけですねいや、。言い過ぎやろ。全然経験がないやろ。だから、けややさん、びっくりしたでしょ、ほんとに。CIC入ったら、もう、都経験者のなんか、それこそこう、僕らの友達だったりとか、東橋さんだったりとか、みたいなね。都経験者がバンバンいるっていう環境で、だいぶ困ったんじゃないですか?学校に入って一番驚いたのは、みんな、自分のカナダでの滞在期間を伸ばすために、その学校に行ってたっていうので、俺の最初の予想では、俺みたいに全くバックグラウンドない人が、一から勉強するぞ、エンジニア目指すぞ、。オー!みたいな環境で行ってるのかなと思ったら、クラス全体で二十人くらいいたのかな。全くの未経験、ほんと。3分の1とかそんなレベルでしたよね。なので、。なんか、。キックスタートとるつもりが、なんか、3、4年どころか、もう10年分ぐらい、ビハインドから始まってたみたいな状態でした。ごめんなさいね。フログのせいやね、それは。でも、それで言うと、今って、。その、。バンクーバーにそういう、なんか、学校に行って、学校の、ビザもらってその後1年ワークビザもらってワホリっていう人たち多分いっぱいいると思うんですけど今あんまり経験者って少ないのかなそれとも人数的にはあんまり変わんない感じですかいやフロック的。に言うんだったらもうむしろ経験者しか来てないよ。今なんかその当時結構いっぱいいましたよねその僕たちの周りでも結構何人かいたなーっていうイメージ。なんですけどとりあえずシンプルに今フロック使ってこっち来てる連中なんてもうほとんどはCICCCかCCTVかランガラかBCITかみたいなのに行くっていう業界経験2,3年がもう8割超えてますね多分。Kei君はじゃあその学校の間はなんかどんなことをして技術力というかその就職するための技術は身につけたんですかうん、。それが結構特殊なことやったんじゃないかなと思うのが、戦略的にやっぱり、初日から打ちのめされたわけですよ。あれ?俺全然無理やんみたいな。こんな人たちが就職する前提で来てんのやったら、自分無理じゃね?と思っ…たのもあってたまたまその無料のインターンシップみたいな売れ込みでなんか無料の労働をかき集めに来てた結構さんくさいスタートアップの人が学校に来ててその人のつながりで無償で働くみたいな履歴書に何か働いた経験とし載せれそうな系何場があったからそこに無料で行かせてもらってたみたいなのが始まりかなそこで学校終わったらインターンシップしつつ学校でも勉強をしつつっていうので2足のオーラ字を履きつつスタバは依然継続してっていうのが続いてそうねまぁでも3つバイトかけ持ちしてたのが一つ学校一つインターンシップ一つそのままのスタバになっただけやから別にその忙しさとしてはそんな変わらなかったですよねやる。ことは3つってやること。は3ついやむしろなんかクーラー利いてる部屋でパソコンいじってるだけでいいんやっていうのでむしろ気が楽ですねあの時はじゃあ2つ。と休憩ですね2つと休憩そういや、。絶対そんなことはないはずなんだけど、すごいですね。なるほど。でも、クラスメイトとしての印象は、もうめちゃくちゃ学校でも勉強してて、学校終わったらすぐどっか飛び出してって、すごい忙しそうな人っていうイメージだったけどね、当時。そういうことになるよね、きっと。そうか、トガシさんはそうよね。クラスメイトっていう立ち位置で、。俺、。ケイさんの話聞くの結構久しぶりやな。実はあんまり関わってなかったから卒業して1年ぐらい経ってからかな仲良くなったのはなんであんまり知らなかったっていうのはあるんだけどそうですね一応。クラスメイトそうパーソナルの時間がなさすぎても人間じゃなかったので学校行ってた時代。はとがしかったんじゃんそうするとあ、それってちなみに単純な気になるレベルなんだけどやっぱりとがしさん的にさやっぱりこうなんかやっぱり仲いい人たちってやっぱり経験者だっ。たんちなみにそうですね、ちょっと、今でもたぶん気持ちそうだとは思うんですけど、そんなに就職って難しくないだろうって、ちょっと思ってたんですよ。いや、難しかったんですよ、めちゃくちゃ。めちゃくちゃ難しかったんだけど、ちょっと経験もあるし、僕はその当時、けい君と同じ感じで、フィリピンにちょっと行って、英語を身につけてきて、ボロボロの英語しかしゃべれないのにちょっとしゃべれる気になってたんで僕英語もしゃべれるしちょっと技術もあるし楽勝でしょみたいな感じで思ってたんで僕は結構ほぼパーソナルの時間みたいな感じで遊んでましたねその1。年はそうそれってあれっすよそのりょうくんが日本にいるときから積み上げてきたものがそのままカナダでの環境にトランスファー持ってこれる環境だったからこそ生まれた余裕であって俺はもうそれ全くない状態からのスタートだったからそりゃ同じスタートラインに立とうと思ったらパーソナルライフ吹っ飛びますよねっていうまあまあそう。だよね間違いないとは。いえ僕もSIER出身だったんでウェブアプリを一人で作れるかって言ったら作れなかったし普通にAPIサーバー立てるのも厳しいぐらいだったんで全然僕も技術力はなかったんだけどなんかよくわからない自信だけあって。遊びほうけてましたね真逆のじゃあ学校生活ねだから経験未経験本来は経産みたいな本当に学習経験業界経験がない人っていうのが行くのが多分カレッジとか学校なんだろうから正しいのはもしは経産なのかもしれないけどねそうですねそういう多種多様なカレッジの使い方があるというところだと思うんですけど実際でも経産の話ちょっと戻らせてもらうんだったらやっぱり専門スキルっていう分が現地で就職するまでボランティアとプラス授業だけで何とかなるとは到底覚えないっていうのが一般論だと思っていてなんか他にはないの?なくて、むしろこのインターンシップが言うまい具合に働いたと思ってるんですよ。まあ変数としていろんな運があったって、月が回ってたっていうのもありますけど、はいその僕の場合は技術力で物言わせに行くというよりはカナダの現地の経験っていうのでレジュメに何か記入するものを足すっていうことを先んじてできていたのが就職にすごいプラスに働いたなと思っていますとで、先んじて一つ目の会社の話になるんですけど、当時、BC州ではエンジニアの数が足りてないみたいな風潮が出ていて、で、政府、BC州自体が、コープの学生を雇ったら補助金出しますよとか色々やってたわけですよ。で、バリバリのスタートアップでも人を雇いやすいみたいな、状況になっていたので今に比べるとだからその新しくスタートアップがバンクーバーでローカルで発足するってなった時知り合いづてでなんか学生でいい奴いないっていう話になった時にcicccでこういうスタートアップ発足するんですけど誰が興味ありませんかっていう話が出たんですよねその時に僕が行ってたインターンシップのテックスタックとほんとほぼ丸被りだったのであ僕もカナダの現地でスタートアップでやってますよっていう触れ込みでその会社でフルタイム正社員として入ることができたっていうのでいろいろな変数がありましたよねガバメントが補助してたのもそうだし景気という面でスタートが補足できるような状態っていうものがあったっていうのもそうだし僕がたまたまその無給のインターンシップで使った技術スタックがそのスタートアップシーンで人気のステックスタックだったとかいうなんかいろいろな月が回って何だろうも星が全部一直線に並んで入ることができたっていう感じですね多分ねあの初心者とか未経験者の人はこれぐらいなんか月が一斉に集まるぐらいのイベントが起こらないと少々きって難しいんじゃない。かなちなみにどんなテックスタックだったんですか僕は。リアクトネイティブとタイプスクリプトを使ってモバイルアプリを作ってたのとウェブアプリをリアクトを使って作っていたっていうフラントエンドのスタックだったんですけどこれがバンクーバーのテックシンドは結構人気のテックスタックなのでいろいろ後の転職とかにも役立ったしトランスファラブルなスキルだったなと今振り返れば思いますねそれ。はえっと学校ではえっと教えてなかったと思うんですけどそれはもう本当にじゃあボランティアのところで全部学んだって感じなんですかあーそうそう。ボランティアのところで学んだしも学校で学んだこと俺何も覚えてないですね正直。じゃあ結構内職してた感じ。ですか授業は授業でちゃんと受けてたけどなんかね気づいたらその無休のインターシップの方が就職につながってたのでそちらばっかりが頭に残ってたっていうイメージですかねだからその学校外の時間で自分で自習する時自分で勉強する時っていうのはやっぱり実務で使ってたスタックの方ばかり勉強しましたねリアクトの基本とかリアクトネイティブをどうやって動かすかとかなので学校の勉強という文脈で考えると結構必要最低限の頑張りだったのかなと授業を聞くし質問もするけどなんかそれに対してすごい突っ込んだような勉強それ以上のことは学んでなかったってイメージです学校はIOSのネイティブのモバイルの話とかしてたんで。そういうだよね富樫さんも多分同じこと思ってるんだろうけれどもやっぱこういう人は伸びるよねあの授業のレールをただ単純に歩んでいますよっていう人じゃなかったよね結局っていう部分だと多分思うんですけどやっぱりその辺のねボランティアの部分から見つけたリアクトネイティブだったりそのね重要だったりっていう部分に全振りできるのがすごいよね授業やんなくっていいんだっけみたいな宿題周りに名誉かけちゃうみたいななかったんですかいや、でも結構多いのよ。やっぱり宿題側とかさ。なかった?いや、。素晴らしいね。先生がいい先生だったっていうのもありますね。あの人は結構なんか深刻なこと言う人だったんで、お前の目標は就職であって授業を受けることじゃないよみたいなスタンスの人だったんで。学校っていう形態で考えると正解の人だったんだなと思いますやっぱ学校的には就職率が上がるっていうことはプレゼンできる数字の見た目が良くなるっていうことなんでそこを目指していた先生っていうのは僕とすごい相性良かったですね逆になんかルールルールでなんかこれはルールに記載されてないからやっちゃダメですっていうタイプの先生だったら多分俺は就職できなかったんじゃない。かなと思いますあそこの学校は未だにうちも結構あの計算とトガシさんが行った学校ですけどあの割とやりとりすることが多いですけど多分バンクーバーにある中で一番柔軟な格好よね相当緩いというか色々色々許してくれるので僕らとしてもありがたい学校ですねでも。なんかいい学びになったなと思いますの学校に行ってそういう経験をしたことでなんかシンクって本質的に自分が何をするべきかっていうことをちゃんとわかっていれば自然と自分のやるべきことってわかるんだなとなんかそうブラインドを目つぶってルールばっかりフォローしてたらやっぱりそのルール上での勝負になってしまってそのルールを守ることで実際にその自分が達成したいこととか本質的にやらないといけないことからどれぐらい離れているのかってわかんないじゃないですかだからまあルールは最低限守りつつ自分が今やっていることが本当に本質的にそっちに向いているのかどうかっていうメタ視点みたいな膝が1個上の状態から自分が何やってるかっていうのを見るっていう癖はつきましたねおかげでやっぱりなんかわけのわからない世の中の理不尽みたいなのにさらされた時に反発しがちになったっていうのもありますけど。反発できる分いいじゃんねそれに乗っかるしかない人たちってやっぱいるわけでその部分で言うんだったらもう俺だって未だにKさんみたいになりたいですっていう風に言うて相談来る人いるけど大体やめときっていうもん。そう。まあまあなにそのレールっていう部分で言うんだったらね最初からは掘り足完全経験なしでこっち来たしさっきKさんもおっしゃってたけどやっぱり全部の条件が揃わないと就職ができないっていうのはもうその通りだと思う。からそれちなみにセナーさん的にはそのKさんみたいになりたいですっていうのはどこのことをKさんっていうふうに言ってる?あーごめんそれで言うんだったらいやそうそれで言うんだったらねやっぱり完全に日本で経験なくて英語だけちょこっとだけ得意でで、カナダからカナダに行ったらすぐに就職して、Kさんみたいに外資系企業で日本で将来的にV言えるみたいなことを目標とする人たちですね。だから、もちろんあれよ、Kさんみたいにって言って、ど真ん中Kさんと同じパスワード提案はしないけど、とはいえ応援はもちろんしますよ。現地就職にしたってタイミングの部分考えて一緒にって計画はもちろんするんだけど、とはいえ、KSRのプランって最初からエンジニア目指してたわけじゃないってとこもそうやけど行き当たりばったりも相当多いので、なかなかどこまで歩めって言えるのかって難しいなっていうのが僕らの目線ですね。再現性はないっすよね。そのところどころはでもあるのかなって思って例えばそのスタバで働くだとか一時期ちょっと流行りましたよねあのフロックのコミュニティーの中で。もそうちょっとだけ話をさせてほしいんだけどさ俺相当反省して実はあのそれまでKさんと俺は話するまでっていやいや待て待てとエンジニアとしてこっち来たんだったらこっちでテクノソラ仕事するした方がプラスに決まってんじゃねーかレジュメ上もそっちの方が上に決まってんじゃねーか俺としては当たり前のこと言ってたつもりなんだけどやとはいえ確かに計算に1回フロックでいいあのイベントしてもらってあのまあこっちでスタバとかで働いた連中は確かにこっちの適用率でまあまあ高いなって思ってねそれでちょっとスタバで働くってどれだけ計算のねキャリアに生きたのかっていう部分をちょっとイベントしていただいてそれでそこから僕の考えは180度変わりまして今ではみんなにサバで働けって言ってますその。くらい変わったそこが大事なのかは分からないけどまあ確かにそこでスタバで働くってのは確かにそのコミュニケーションみたいなのを毎日取らないといけない人だったり英語も伸びるしいいのかなとは思いますね確かにそしたらじゃあ次の質問で就職活動っていう意味で言うと元々ボランティアをやっていて、その学校に来て、来た、なんかその知り合いの知り合いのツテみたいなところから就職した、あの就職したってことだったんですけど、それ以外に就職活動ってされましたか?それ以降ってことかな?それ2個目とかじゃない?それ以外、じゃあそれがもう一番最初?それが一番最初じゃあもうそれ。以外はアプライもしてないしって感じあーそれ以外の。アプライはリンクドインを通してやってたけどでもほか別に泣かず問わずだったかな面接何件か行ったけど別に最終まで行ったのはなかったかなってかその1個目がすごい話早かったんで多分2個目3個目の会社面接行ってたやつも途中で切り上げたとかだっ。たと思う確か確かちゃんと覚えてないんだけど学校のアカデミックのターンが終わらないうちから就職できたんだった。っけそうそうそうなんか最終ターンになってみんながプロジェクト1個作りましょうっていう時に就職が決まったので僕だけそれ免除になったみたいな形だったかなじゃあ。もう本当にその就職かってなんかその前にちゃんと就職活動してえっとそのオンラインのそのなんかアプライみたいなのはしてとかではなくもう本当にそれがその最初の何社とかでまあすごいいい感じになんだろうレファラルみたいな感じで決まったって感じだったのか。なそうね学校を始まって半年ぐらい経ってそろそろやるかーって動き出したぐらいでちょうどその話が出たのでタイミング良かったですよねK。君っていうとやっぱりあのカナダで何社か経験してるじゃないですか何社でしたっけちなみに3社だね3社でやっぱりなんかK君っていろんなイベントとかいろんな記事とかであのなんか年収とか公開しててうわっなんかすごい年収高い人だみたいな結構イメージがあると思うんだけど最初の年収っていくらだったんですか言えるまあ範囲とかで。いいんですけど39,000ドルよ一番最初は39,000ドル今で言う400万ぐらいかいや400いかんな400いかんぐらいかぐらいの勢い感でバンクーバーの物価でそれは頭おかしいっすよね頭おかしいっすね。日本の換算やとワンチャン250万くらいなんじゃない。のみたいないやでもめちゃくちゃお金もらってる気でいましたね当時はそれは。あれでしょだからあの日本出てくる瞬間までがすごい安かったからっていう話でしょ多分。ヤンヤンああそうそうなんか口座に20万があるだけでめっちゃ金持ちな世界観だったから。ヤンヤンいやすごいよヤンヤン。今まで3つ回さないといけなかったのが今一つになったみたいなヤン。ヤンああそうそうしかもクーラー効いた部屋やしめっちゃやみたいななんか周りに安みたいな言われたけどなんか自分的に何か安い自覚がなくてこのもらって安いみたいな。でもいいカルチャーがピギャップかもねなんかフロックのからいけないとこがもなって気がちょっとしてきてるけどなんかやたらとやっぱり高い練習の人が周りに多いからさなんかそれが当たり前って思っちゃうけどとはいえ日本で普通に働いて普通にしてる人たちって多分400万500万とかっていうのはおそらく普通なんだろうから今のね物価感だとおそらくまあ60系とかからはスタートってなるとわーきつそうだなーって思っちゃうけどあーでも日本にいた時からするんだったらねいやだいぶ伸びてるんですけどねって人は多分多いんだろうなーって思うので安静。ですねそこはあとはなんかカナダで言うとその一社目はねそんなっていうのはありますよね結構外国人でみたいなだからなんかKei君にその話聞いた時も確かにその他の人と比べたりすると安いのかなみたいなのあったけどでもなんかみんななんかその時の雰囲気としてはあの一社目働けてるのすごいみたいな。いやそのそうだねカナダの。会社で働けてるのすごいみたいな感じだったかなって僕は思いましたけどね。それで言うといやそうだよねこれでも本当にフロックに相談来る人たちも言ってあげてほしいんだよな本当に1社目からむちゃくちゃ高いと思ってくる人が本当に多くてたぶんそれはねyoutbeとかであのなんか見た年収がやれ1900万だとか2000万だとかっていうねあれを見てじゃあ私も多分1500万くらいからさとかなっていうふうに思ってくるんだろうけれども一社目はほんととがさんが言った通りねビザがあるだの文化のカルチャーギャップあるだの交渉することは多いだのでとにかくねちょっと低く見積もらいがちなのは間違いないからなかなか難しいよねそう。ですねでそこの会社はどのぐらい働いたんですか。そこから1年ちょっとぐらいかなビザギリギリまでだったんでそうね1年3ヶ月とか4ヶ月とかそんぐらい。かな結構この業界だとまあ割とみんな短めで2年ぐらいではっていう人が多いと思うんですけどそれと比べても少し短いですよねなんかそのきっかけみたいなのはあったんですか。ビザサポートができないっていう話になって次探さないとえらいこっちゃで次を探す必要があったのでまあ必要から来た転職。だったっていうそうするとK君確かその来た時点でワーホリを1年目で使ってでその学校に入学することでその学校のタームが終わった後の1年はワーキングビザがあったじゃあその1年だけ働けたみたいな感じかなそこはそうねはいはいはいでその次の会社にじゃあ入社した時点でえっとそこの会社にビザのサポートをしてもらえ。たって感じなのその話で進めてたんだけどフロックからroは掘りっていうのが出るっていう話も出ててだろうアフリーに何か応募したらやらせてくれるという話になったのであるは掘りが先になったのかなであろうは掘り中にpr取ってっていうのがビザ的な経歴なのでその時はroは掘りをアクティベートしつつ転職活動っていうある。でしょうねそうですねアロアフィラム知らない人もいると思うんだけど一応ですね30歳35歳まで一応取れるセカンドは吹いても言われていたねあれなんだけど最近ちょっとは掘りが2回申請できるなっちゃったからセカンドは吹いては言うとちょっとわけわかんなくなるんでアロは掘りっていうのが定着してまあ35まで使えるは掘りやと思ってもらえれば。いいと思いますそれそういえば僕が紹介したんだったねどうやったんですかとかって聞いたらそういえばなんかあのセナさんかなんかが言っててそれけいくんがなんかビザがなくなるらしいみたいなのを聞いて僕がそれあの紹介したんだそうか。あれそうかあれとがいすさんとがいすさん経由でそうけいさんはね最初からフログ使ってたわけじゃないしましてやNGでなるわけでもなくてこっち来た人だからフログ最初知らなかったんだよねもちろんそう。だから全てのきっかけはりょうで、それまで正直そんなに友達が日本人でいたとかもなかったし、なんかなんだろうコミュニティングどっぷり使うとかもなかったんで、マジでそのりょうがフロックに紹介してくれたおかげで今こんなにね、なんかいろいろ情報発信とかしてるっていう。流れができたので、そう、りょうがゲートだったんですよね。実は、全然僕も覚えてなかったけど、そういう感じだった。ありがてぇって感じ。だってあれですよ、俺が最近youtbeとかでゲストとして出してもらってるテックワールドとかもりょうの紹介だから、なんだかんだなんか起こるときは、。そう、。りょうの紹介だったりするんですよね。わぁ、なに、どうしたん、ドガシさんはなんかそういうキャラやったんか。助かるって感じ。そうなんだねいやそうだよねテックワールドさん俺もトカシさんに紹介してもらったからな市川さんねいや素晴らしい意外と爆心地だっ。たりするんですよねりょう。がね意外と意外とふわーっと僕多分ふわーっと紹介してるんですね実はあんまりそのつもりもなくなんか合いそうみたいな感じなのかな。わかんないけど素晴らしいいいじゃないですかそういういやでも。リョウ実際なんか嗅覚すごくてなんかそれこそさっき僕がさらっと触れたその本質的にシンクってることやってるかどうかとかのなんか見極め力みたいなすごい強いんですよ彼だからキャリア的に成功してもまあそうだろうなっていう感じがあるし彼がなんかこれこうこうこういう理由でやってるって聞いた時も納得感すごいっすもんねだから彼にこの人と会うといいよとか、この人とコラボしてみなよみたいな言われた時に結構素直に受け入れられる人の一人だなと。あれはあれ、俺もちょっと背筋ピンとなるもんね。トガシさんからこいつ会ったらって言われると。でもあれよ、言うんどんけど、俺未だにフロックにトガシさんが最初に連絡してきた時にどこの国に行くかすら決めていなかったトガシ寮、ちゃんと覚えてるから、その辺のフワッとシクワット。感は知ってるからな。これは僕のゲストの回かなってぐらいなんか褒められますね。お前とは割とっちゃう素晴らしいでもそうねケイさんのほうにちょっと戻らせていただくのであれば面接の話で俺もちょっと気にはなってたんだよね面接が仕事今話にあったのが多分2社目っていうことでいいのかなっていうふうには思うんですけどちなみに給与的にはその340万390万だっけ400万くらいかのところからのどんくらいだった。んですか先輩当時で80Kか85Kかそこら辺の給料帯だったんで実倍ですよね樋口。倍どころじゃないだって日本にいた時から比べるんだったら何倍やったんちなみ。にヤンヤン分からん何倍バイトなんか年収換算しない。じゃないですか樋口まあ。それもそうか時給やもん。ねヤンヤン300万っていうところから考えるとね2。\n7とか8倍ぐらいいったんじゃないですか樋口。うんでもあのバンクーバーにいる人にはまあバンクーバーだけじゃないとは思うんですけど特にあのここのところを結構聞いてほしいですね僕的にはやっぱりなんか1回就職するとちょっと落ち着いちゃってで次に行かずにでやっぱり一社目ってそんなまあ給料も良くないからそのでもやっぱ収穫とか転職ってすごい大変だからその1回目のそのあれをなんか苦しさを引きずって次に行けない人が多いんですけどあのそこをねちょっと頑張るとしかも1社目のなんだろう経験がありきだからそんなに多分転職もそこまで最初ほど難しくなくてでまあKei君みたいに2倍とかなんて結構ザラにあるっちゃあるじゃないですか。でもKさんの場合、やっぱりあれなんじゃない?外的要因でビザが切れちゃうとか、もうあろうしかないんだみたいな。やっぱりそこにケツ叩かれた感はあったんですか?転職って。全然ありましたね。もしそれがなかったら別に転職する理由なかったし、だって当時の給料で満足してましたから。でもそこで、そうね、給料2倍バグが発生して、あれ?転職した方が良くね?ってなったのが、僕のホッパー人生の始まりですね。転職した方が給料上がるっていうのって、その時のKさんって知らなかったんですか?逆に言うと。知らなかったっすね、なんか提示された時、え?なんか数字間違えてんちゃうかなと思って。いやーそうなるよね、でも。なんかあとは、知ってはいるけど、その体感してなかったっていうのもあるかもしれないですね。なんか就職してオファーされて。いやーこれどういうアレなんだろうね俺も未だにやっぱり転職した方だがいいですかってむちゃくちゃ毎日合わせだけど毎週の日に聞かれるけどさそれは給料を上げたいなったらステーションがいいじゃんに終わるんだけどみんなさあやっぱりケツ叩かれる要因がないのがビザだったりとかあとどうしても永住権欲しいとかって最近も減ってるし正直そう、だからなんかね、今のやっぱり1度目のその就職活動の大変さを引きずって、プラスね、ちょっとそのケツ叩かれる要因も少ないしで、2社目行くっていう人確かにちょっと少ないよなっていうのは、ちょっとした課題ですね、。私どもの。いやいやいや、ケツ叩かれる状況がない方がいいでしょ。そりゃそうなんだけどさ。叩かれるイコール、しくじったら終わりなんですから。でもほら、転職活動だけで言うんだったら別にやったところで失うものないじゃん感はあるのよね、別にっていう。そう、転職って基本的に自分の手に職がある状態でやった方がアウトカムも。いいですしねうーんそうそうなんだかみんなやらないんだよなっていうこの矛盾。よねいやでも僕理由わかりますよそれこそやっぱ日本でまぁ働くって大変じゃないですかいやこっちでももちろん仕事ってのは基本的には大変なものなんだけど就職活動はめちゃくちゃ、こっちの就職活動もめちゃくちゃ大変で、1社目は特に。で、そこ入ってからのホワイト感すごいんですよ、。カナダは特に。めちゃくちゃホワイトじゃないですか、給料はたくさんもらえるし、結構短い時間でみんな働くし、なんかオフィス、時期的にオフィスそもそもリモートって人も多かったと思うんですけど別になんかよく寝れなかったからオフィス行きませんとか今日ドクターアポイントメントありますとか今日配達きますとかの理由で別にオフィス行かなくてよくなるじゃ。ないですかますよねiPhoneのハズラビアから休むってやつい。たもんそうそうそう3時4時に仕事別に終わっても大丈夫ですでマイクロマネジメントもされませんみたいなそんな環境なんでやっぱりね落ち着いちゃいますよねそれは。なるほどねいやなのでまあなかなかねちょっと個人的にはフロックのメンツにもいろいろ転職いっぱいしてほしいとは思いつつお尻叩く要因がないほうがそれいいんだろうなっていうケーサーの話は戻りつつなかなか難しいやだなと。知り教えていただく要因はカナダにいる限りずっとあるべきなんですけどね、あるはずなんですよ。だって、あっと見るでレイオフが起こるような国と法律性なんで、ヨーロッパとか日本みたいに入ったらしばらく法律に守られるとかもないし、だからこそ会社の雰囲気がいいとか、働きやすいっていう、バイクライフバランスが取りやすいっていうのもあるんですけど、それ以上にやっぱり不足の事態が起こり得るっていう、日本人は不安を感じやすいっていうところと一番相性の悪いシステムのはずなので自分がいつ急に災害に巻き込まれるみたいな形でいきなりレイオフになっても動けるようにしておくっていうのをやっとかないとカナダで真に気持ち的に安定感を持つことってできないはずなんですけどね一回やっぱりレイオフを見たり目の当たりにしたり体験しないと身近に感じないっていうのはあるかもしれないですね。うーん確かに確かにじゃあ働きながらその辺を体感していただくしかないということです。ねきっとそこでケツを叩かれている感覚でいることによってそう今の会社でなんかなめたことされてもはじゃあやめるみたいなその考えがプロフェッショナルかどうかは知らないですけど、そういったメンタリズムで働けるようになるので、それもそれでやっぱり、一個人としては幸福の実現っていう上では結構大事なことなんじゃないかなと思うので。転職する気があるない関係なしに、転職できるできないっていう観点で言うと、やっぱりできる状態にしておいた方が絶対にいいですよね。これは日本人とも一緒だと思います。そう会社とのやっぱり本当に平等な関係ってそういうことだと俺も思うしねだからそこはぜひ徹底していきたいなっていうふう。に思うんだけど特にエンジニアはなんか会社と個人の契約みたいな感じの気持ちになりますよねエンプロイーとして働いて社員として一応働いてそのグループの中にいるんだけどなんか別にそっちがそういう悪い対応してくるんだったらこっちも別に辞めますよみたいななんかその対等な関係を保てるというかそういうのはありますよねだ。からこそレイオフするし、会社もね、ちょっとヤバくなったらすごい人厳しいって、なんかその日本で言うとこの人情みたいなのってなかなかちょっと感じにくいとこがね、むしろいいとこかもしれないね。そうですね、あとはあのさっきのケツ叩かれる流れで言うと、僕はあのK君の転職に結構ケツ叩かれたところはありましたよね。そう、。その話もぜひ聞きたかったのよ。それが起こり得るのが北米圏ちょっとおもろいよね。明らかに東橋さんの方が経験は上だったはずのに、なんかいつの間にかKさんの方がちょっと上行かれてどうしようみたいな話でしょ。そうそうそう、。その多分、80何とかの時、その次かな、その次の転職とかで、多分、僕としては、僕は経験者で来て、K君は未経験で来て、で、同じところから、用意始め!でやって、なんだろう始めたのにk君の練習がなんか聞いたところによると抜かれてるぞみたいなのがあってヤバいみたいななんか別にねk君がすごい優秀だしまあ今でこそエンジニアとしての力全然k君の方が多分知識とかも上だと思うんだけど喧騒しすぎだろいやいやまああのインプットとかねやっぱすごいしまあまあそこは置いといて、でもその時はなんかちょっとライバル意識を燃やしてやっぱ僕も転職していくかなみたいな僕も今で3社目なんですけど結構それはありましたね。これ逆にさ、東海オンエアさんはじゃあ何、Kさんっていう存在がいなかったらワンチャン転職してなかった可能性あんのか。などうかな、そうそれで言うと僕1社目で永住権取れちゃったんだよねうん落ち着こうと思ったら一番落ち着ける人っていうそう、全然、僕、あんまり散財するタイプでもなかったから、お金とかはなかったし、そうですね、たぶん、結構、当時よく、せなさんもいたけど、けいくんも、僕も、せなさんも、すごい家が近かったじゃないですか。そうだね。一駅、二駅の間で、で、結構よく飲みに行ってたじゃないですか、そこらへんのグループで。で、そのときにやっぱけいくんが、ま、給料だけではなく、けいくんのその、なんていうの、のびみたいな、成長率みたいなのがすごくて、なんかどんどんどんどん技術身につけてって、なんか、よくわかんないTL回みたいな、あの、。LT?ライトニングトークだからLT回みたいなので、なんか、何言ってるかわかんないことを発表してるぞ、みたいなのもあって、なんか、すごい置いてかれる気がしたっていうのはまあなんか別に給料だけに限らずあってで、やばいやばいちょっと僕も自分の技術身につけたりまあ転職のための勉強しようみたいなうーんすごいあったかなだからそうですねK君がやっぱりあれだったのか。ないやそうなんじゃない今考えてみるといやだしね俺ちょっと今発見等まで言わないけどさ確かに転職ガンガンする組と全然しない組俺の頭の中にはたくさん派閥があるんだけどさやっぱ転職しない組の派閥って多分だけどそんなにアウトゴーイングじゃないというかあんまりなんか人と会うっていうことに重きを置いてないもしくはそういう環境にいらっしゃらない人が多いのかなとはちょっと正直思っててそう、Kさんにしてもね、そのメトロタウンっていう僕らが住んでいた界隈の人たちにしても、なんかよくいろんな人たちと会って、その人たちが今現状どういうことしてるのかっていう情報収集をしてる人たちのやっぱり転職だったり、そのモチベーションは高いなっていうのはちょっとした発見かな、。もしかしたら今。確かに。あとお金の話も結構してましたよね、みんな。してたねー、むっちゃしてた。そう。いい意味でオープンコミュニティでしたね、そこは。そうだねすごい俺も情報収集としてというか皆さんのお話を聞きながらへえ今そうなんだっていうのをねフログで相談来る人たちにもいろいろ伝えさせていただいてでもしてたのですごいいい場合だったわ。ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "はい今回はゲストとしてKei君に来てもらいましたKei君はもともとカナダのバンクーバーで就職して今は日本の外資系企業に勤めてるってことなんですけどまず最初に簡単に経歴から教えていただいてもいいです。",
      "start": 8,
      "end": 14065,
      "timestamp": "00:00"
    },
    {
      "speaker": "Kei",
      "text": "かはいみなさん初めましての方は初めましてKeiと申しますバンクーバーには2017年に投稿して2019年からソフトウェアエンジニアとしてキャリアを始めましたそこから5年ぐらいかな2024年までカナダでシニアフロントエンジニアになるまでキャリアを積んだ後2024年10月から現在の外資系企業で日本の東京で勤務していますというのが簡単な来歴ですよろしくお願いします。",
      "start": 14065,
      "end": 42572,
      "timestamp": "00:14"
    },
    {
      "speaker": "Ryo",
      "text": "けいくんって言うと、あれですよね、YouTbeもやられてるし、なんか有名な人のYouTbeにも出てるし、なんかたぶんポッドキャストとかにも結構出てて、結構いろんな人が知ってくれてるのかなと思うんですけど、なんかあんまり僕、あとはまあ個人的にも僕、ずっと友達だったんで、結構いろいろ知ってるんだけど、カナダの渡航前のことにとか、英語について聞くのはあんまりないかったかな。すなさんあります?",
      "start": 42572,
      "end": 69975,
      "timestamp": "00:42"
    },
    {
      "speaker": "Senna",
      "text": "俺はもちろんだってね、あのもうそこをもう掘り下げに掘り下げてあのフロップでもうあの吸い上げるだけ吸い上げてこんなやつでも海外就職できたんやで言いまくったからいっぱいし。",
      "start": 69985,
      "end": 80954,
      "timestamp": "01:09"
    },
    {
      "speaker": "Kei",
      "text": "てますハードルを下げる役を務めさせてもらいましたありがとう。",
      "start": 80954,
      "end": 85717,
      "timestamp": "01:20"
    },
    {
      "speaker": "Ryo",
      "text": "ございますそしたらまずはカナダに渡航するきっかけとかなんか海外に興味を持ったきっかけみたいなのから聞い。",
      "start": 85717,
      "end": 94904,
      "timestamp": "01:25"
    },
    {
      "speaker": "Kei",
      "text": "てもいいですかもちろんですバックグラウンド的にはそもそもエンジニア系じゃなかったんですよね理系でもなかったしそもそも大学すら行ってないみたいなとこから始まったんですけど高校卒業してフリーターを4年ぐらいやったのかなで20歳になるとし18で高校を卒業しそこから2年経ったぐらいで英会話教室のバイトっていうのがなんか募集してたので面白そうやと思って募集したらまあうまいこと滑り込むことができそこで英会話教室っていうグローバルな環境で、いろんな外国人の方と会ったり、一緒に働いている正社員の方々が、昔留学行ってたとか、親御さんがこういう海外関係で、みたいな人がすごい多かったから、環境の変化に伴って考えも変わりまして、海外ってフリーターでも行けんだみたいなハードルの低下が心理的に起こりまして、そこから海外を志すようになり、2年ぐらいかけてお金を貯めて、カナダ行くかというふうに思い立って、22歳の時に渡航したというのが簡単なバックグラウンドかな、カナダに行くまでの。",
      "start": 94904,
      "end": 163237,
      "timestamp": "01:34"
    },
    {
      "speaker": "Ryo",
      "text": "その英会話までに準備とかは、なんか準備っていうか、なんか英語の、なんか基礎知識とかはあったんですか?",
      "start": 163247,
      "end": 170802,
      "timestamp": "02:43"
    },
    {
      "speaker": "Kei",
      "text": "なんか海外行きたいって思ったのが20歳のときで、実際に行ったのが22でしょ。",
      "start": 170802,
      "end": 174824,
      "timestamp": "02:50"
    },
    {
      "speaker": "Ryo",
      "text": "で、。",
      "start": 174824,
      "end": 174934,
      "timestamp": "02:54"
    },
    {
      "speaker": "Kei",
      "text": "その2年間で、その英会話教室の福利構成で、週に1回40分、英語の授業を受けれるみたいなのがあったから、それをやっていたっていうのと、あともう一つは、あの、中学文法を収める本みたいななんか有名なやつがあってミスターブラウン先生だったかななんかちょっと忘れたんですけど青いやつそれでなんか1ヶ月で中学文法を収める本をなんか1年かけてやって中学文法を収め全然1ヶ月で終わらなかったですねこんなのあるんやとか全部知らんことばっかりやったみたいな読んだ時にで勉強しグダグダの英語を喋り、で、自信だけつけて海外に行ったっていう感じですね。だから英語力っていう文脈で言えば、渡航時点で勉強料に対してそんなに良くはなかったのかなと思います。なんかビビらなくはなってましたけど、具体的な英語力としては、東イクとかで言うとほんと600も行ってなかったんじゃないかな。ほんとなんかなんとかなんとかなんだろうセンテンスを作るしかし現場の人は何言ってるかわからんみたいなそんなイメージ感ですかね文法はわかってるけど言葉にはできないみたいな。",
      "start": 174934,
      "end": 250637,
      "timestamp": "02:54"
    },
    {
      "speaker": "Senna",
      "text": "そんなレベルだったねなんかねあのKさんといったらフロックのメンバーの中でも相当コミュ力が高い方みたいなイメージがねトガシさんもあったんじゃないかなと思うし俺前トガシさんと喋った時もねほらだってKさんはさ来た瞬間から英語むっちゃ喋れてたじゃんみたいな感じの話を一回したような気がしたからあれそういえばじゃあそうかKさんってこっち来た時ってまだまだ英語全然だったんだっていうのは今実は結構新鮮やねそうだっ。",
      "start": 253177,
      "end": 278622,
      "timestamp": "04:13"
    },
    {
      "speaker": "Ryo",
      "text": "たんだそれで言うと、僕がKei君に出会ったのは2018年か19年のはずで、それはKei君、多分僕が言ったのは会った直後の話で、Kei君が来たのはそれよりも1年前だったはずなんで、そこで何かがあったのかな見てる感じとか自分でもそうなんですけど大学受験をちゃんとした人たちってすごいやっぱ基礎力とかあの特に単語力がすごいあるなって思っててそうじゃない人まあ僕も含め僕を含めたそうじゃない人は結構単語その喋れるようになったからもそのいろんな単語を使うのがあんまり得意じゃないみたいなのがあるのかなって思っててk君はえっとそういうまあ大学受験はしてないんだけどすごいボキャブラリーも多いしインプットがすごい多いのかなーって風にずっと感じたんですけどそこらへんってどうですかなんかその来た時はトイック600とかないからないぐらいできてまあ僕が出会った時の結構も喋れてた印象だったんですけどなんかその1年で結構じゃインプットも身につけたみたいな感じ。",
      "start": 278622,
      "end": 347268,
      "timestamp": "04:38"
    },
    {
      "speaker": "Kei",
      "text": "なんですかそうねインプットすごい質の良いインプットだったんじゃないかなと思っててやっぱり留学の仕方が普通のフロックさんとかエージェントを使って学校に入学するっていうルートと違ってたから結構英語を勉強する環境としては質が良かったのかなと思ってて僕が海外に行った時に一番英語のインプットとして役に立ったのはスターバックスでバイトしてたほどだなと思うんですよねそのスターバックスのバイトっていうのが当時は僕が働いてたお店っていうのはそのなんだろうネイティブスピーカーの方がすごい多かったりとかお客さんが地元の人ばっかりとか朝シフトで入ってたんでなんだそのツアリストがいっぱい来るみたいな時間帯でもなかったしその時間的にも用意だけしたらお客さんとしゃべる時間があったりとかで自分の英語のインプットっていう文脈で考えると生の英語を聞くチャンス機会っていうのが普通に学校に行ってクラスメイトと喋ったりあの先生からレクチャーを受けたりっていう状態よりもとても多かったでやっぱりなんだろう学校でレクチャーを受ける英語のインプットっていうのはその技術的な話を相手に伝えるためのインプットであって相手が自分の英語のレベルに合わせて喋ってくれるわけではないのでやっぱり英語の吸収という点だけを考えたらやっぱりその地で育って生まれ育って英語を喋ってその生の英語っていうのを自分なりに解釈して受け入れるっていうサイクルができていたっていうのは、僕の中のボキャブラリーとか言葉遣いにすごい貢献してくれたなっていうか、ここがすごい伸びる要因になったんじゃないかなと振り返れば思いますね。",
      "start": 347268,
      "end": 454780,
      "timestamp": "05:47"
    },
    {
      "speaker": "Ryo",
      "text": "スターバックスはどのぐらいの期間働いてたんですか?週何回でどのぐらいとか。",
      "start": 454780,
      "end": 463345,
      "timestamp": "07:34"
    },
    {
      "speaker": "Kei",
      "text": "もうほぼ、なんだろ、バイトだったけどほぼフルタイムみたいな入り方してましたね。1日8時間、週5とか6とか。だからもう常に朝にいるやつみたいなイメージ感かな。",
      "start": 463387,
      "end": 474529,
      "timestamp": "07:43"
    },
    {
      "speaker": "Ryo",
      "text": "はいはいはい。",
      "start": 474529,
      "end": 475340,
      "timestamp": "07:54"
    },
    {
      "speaker": "Senna",
      "text": "で、。",
      "start": 475340,
      "end": 475481,
      "timestamp": "07:55"
    },
    {
      "speaker": "Ryo",
      "text": "それが輪掘りの期間1年間って感じですか?それともそれ以外のこともしました?なんか語学学校行ったりだとか。",
      "start": 475481,
      "end": 484888,
      "timestamp": "07:55"
    },
    {
      "speaker": "Kei",
      "text": "最初は語学学校に半年間行って、その後バンフに飛ばされてベッドメイキングするっていうコースでカナダに行ったんですけど、そのコースをカナダに行った後にキャンセルしまして、キャンセルしたのちスターバックスだったので、スターバックスに行ったタイミングで、カナダもうちょっと滞在延長したいなと思って、語学学校じゃなくて普通の専門学校に行こうと思ったんですよね。その専門学校に行くために150万ぐらいかな日本円換算でを稼ぐ必要があったのでその150万を稼ぐためにスタバそのフルタイムっぽい入り方しているスタバに合わせて12個常に回転させているみたいな3つ掛け持ち状態でずっと回しててそれが1年ぐらいかな続いてで晴れて入学という流れなのでそうですね他にやったことといえばバイトですね。",
      "start": 484898,
      "end": 538424,
      "timestamp": "08:04"
    },
    {
      "speaker": "Senna",
      "text": "これ多分前提だけ多分伝えといた方がいいかな視聴者のためにいいというふうに思ったのがそう計算はねもともとこっちにいらっしゃったときはねまあさっきも言った通り全然エンジニアのバックグラウンドもなくしかもワーキングホリデー一発目で使ってきてっていうのも別にねこっちでエンジニアに出会えていたのもこっち来てから決め。",
      "start": 540015,
      "end": 557452,
      "timestamp": "09:00"
    },
    {
      "speaker": "Kei",
      "text": "たんだもんねそうそうそうそうなんですよだから。",
      "start": 557452,
      "end": 560713,
      "timestamp": "09:17"
    },
    {
      "speaker": "Senna",
      "text": "本当になんか最初さっき言ったベッドメイキングとか突然ワードが出てきたけれどももともとだからこっち来た時っていうのはなんか一般的なって言ったら言い方悪いかもしれないけどホリデーワーキングホリデー組みたいななんかこっち来て英語圏で仕事ができればそれを日本に持ち帰ってちょっとそれが生きるかなみたいな印象が多分強かった。",
      "start": 560713,
      "end": 577902,
      "timestamp": "09:20"
    },
    {
      "speaker": "Kei",
      "text": "んですよねきっとそうです。",
      "start": 577902,
      "end": 579843,
      "timestamp": "09:37"
    },
    {
      "speaker": "Ryo",
      "text": "ねそうするとタイムライン的にちょっと整理すると最初の半年間は学校に行ってバンフは行かずにバイトを。",
      "start": 579843,
      "end": 589665,
      "timestamp": "09:39"
    },
    {
      "speaker": "Kei",
      "text": "した感じえっともっとちゃんと詰めると1年間のコースを留学エージェントに提案されてカナダに行きましたとまあカナダ好くじゃないですかでその1年間の内容っていうのが半年小学学校半年コープって呼ばれるプログラムでベッドメイキングだったんですよねで最初の2ヶ月で語学学校をキャンセルしてこのコース自体をもうなかったことにしたとでこの2ヶ月で辞めた理由っていうのもやっぱ語学学校っていうのは自分のいたあの語学教室か英語教室のなんか英語の伸びと全然変わらんどころかなんか英会話教室の方が英語伸びたんじゃねって思うぐらい質が悪いものだったんでもうキャンセルして自分でやるわってなったのがきっかけですねでもバンフでベッドメイキングだから冷静に考えたらキャリアもクソもないやろと思って辞めたここでようやく冷静になったいやうまいんですよねなんかえでも海外海外でキラキラだよみたいな海外行ったら全部うまくいくよみたいな感じの口ぶりで喋るんで国際的経験だよ。",
      "start": 589665,
      "end": 654324,
      "timestamp": "09:49"
    },
    {
      "speaker": "Ryo",
      "text": "みたいなあのイメージリゾートバイトみたいなのって結構日本人慣れてる気がするからなんかそんなイメージだったのなのかなーってちょっと思いましたけど聞いた時にはいや。",
      "start": 654324,
      "end": 665387,
      "timestamp": "10:54"
    },
    {
      "speaker": "Kei",
      "text": "もう本当ヤンヤンなんか言われた通りにこの1年のコース行ってたら今頃日本帰ってきて戦争時でツアーガイドでもしてたんじゃないですかねヤンヤン。",
      "start": 665387,
      "end": 673912,
      "timestamp": "11:05"
    },
    {
      "speaker": "Senna",
      "text": "なんか具体的すぎてちょっと怖いんだけどヤンヤンいやだから俺ねあれよどうなんだろうねいや俺だからねそういえば東海オンエアさんともこの間のフォットキャストにも喋ってた気がするんだけどアンチ語学学校になったのは割と俺実はKさんがきっかけやったねそういうインデビューだっ。",
      "start": 673912,
      "end": 690964,
      "timestamp": "11:13"
    },
    {
      "speaker": "Kei",
      "text": "たらヤンヤンマジですかもう光栄です。",
      "start": 690964,
      "end": 693026,
      "timestamp": "11:30"
    },
    {
      "speaker": "Senna",
      "text": "光栄ですかよかったただももちろん目的ねこの前前回だから誰かね出てきてくれた時にごはく学校割といいよみたいな話があった気がするんだけど目的別でねなんか会えるつもりですか上げるためとかやったらいいかなと思うけど純然たる英語を勉強するためっていうので俺計算のエピソードがすごいいつも。",
      "start": 693806,
      "end": 709806,
      "timestamp": "11:33"
    },
    {
      "speaker": "Kei",
      "text": "頭に引っかかってて正味、うん、費用対効果そんなよくない気がしますよね。なんか、正直、まあ、ニワトリ卵問題ですけど、語学学校って、平住権取ったらタダで行けるじゃないですか、。",
      "start": 709806,
      "end": 725282,
      "timestamp": "11:49"
    },
    {
      "speaker": "Senna",
      "text": "彼女と。",
      "start": 725282,
      "end": 725442,
      "timestamp": "12:05"
    },
    {
      "speaker": "Kei",
      "text": "いや、。",
      "start": 725442,
      "end": 725642,
      "timestamp": "12:05"
    },
    {
      "speaker": "Senna",
      "text": "そりゃあるよね、まあ間違いない。",
      "start": 725642,
      "end": 728354,
      "timestamp": "12:05"
    },
    {
      "speaker": "Ryo",
      "text": "まあ、。",
      "start": 728354,
      "end": 728474,
      "timestamp": "12:08"
    },
    {
      "speaker": "Kei",
      "text": "それを取るために英語を勉強するんだよという話でもあるんですけど。",
      "start": 728474,
      "end": 731847,
      "timestamp": "12:08"
    },
    {
      "speaker": "Ryo",
      "text": "いや、。",
      "start": 731847,
      "end": 732137,
      "timestamp": "12:11"
    },
    {
      "speaker": "Kei",
      "text": "そうそう。そう、無料でできるもんをあんな莫大なお金払って入学して、クラスメイト全員メキシコ人みたいな。そんな環境で英語うまくなるわけないじゃん?と思ったわけですよ、当時の僕は。",
      "start": 732137,
      "end": 745141,
      "timestamp": "12:12"
    },
    {
      "speaker": "Senna",
      "text": "そうだよね。でもほんと不思議なもんで、そのベッドメイキングとかこっちのなんかホテルのね、そういうとこで働いてとかっていうのも相当な人がやっぱり経験してると思うけど、Kさんみたいになんか、先々のキャリアってどうなるのかってイメージつけたら、なんか割と不安にならないのかなって正直思うとこあるんだけどね。",
      "start": 745141,
      "end": 763924,
      "timestamp": "12:25"
    },
    {
      "speaker": "Kei",
      "text": "そこを不安にさせないのが留学エージェントの営業の仕事なんですよ。僕も海外、海外渡航において3つアンチがありましてもう俺このポッドキャストもやすきで言いますけど一つが語学学校もう一つがあのコンサル的な経験もなんもないくせに知ったかぶりする留学エージェントで最後の一つがジャパリスでバイトするやつあーもう。",
      "start": 763924,
      "end": 794990,
      "timestamp": "12:43"
    },
    {
      "speaker": "Senna",
      "text": "なんか迷惑するやつだなぁこれ大丈夫かなぁ東海オンエアさん大丈夫ですかこれカットして。",
      "start": 794990,
      "end": 801258,
      "timestamp": "13:14"
    },
    {
      "speaker": "Ryo",
      "text": "もらってえーと全然このまま流すけど僕の何だろう、多分、Kei君も、セナさんもそうかな、割と行動力があるタイプで、その語学学校に行かずとも、自分でどっかに行って、その語学力を身につけに行く人たちは、いいと思うんですよ。でも、僕みたいに言われたことだけをやりたいような人間はあの学校とかみたいな強制力があるとあーもうやだけど行くかみたいなそういう気持ちにもなったりするんでまあ全てが全て悪いわけではないのかなあとあのこの間のあのポッドキャストの話で言うとあのフィリピンみたいな留学で本当にもうマンツーマンでその自分の英語の恥ずかしさっていうのをみんなの前で喋る恥ずかしさっていうのをなくしてとりあえずベラベラ喋れるちゃんと通じる言葉で通じる英語ではないんだけどベラベラ喋れるようになるっていうその最初のステップみたいなのとかはまあアリなのかなって。",
      "start": 801258,
      "end": 862951,
      "timestamp": "13:21"
    },
    {
      "speaker": "Senna",
      "text": "思いますけどねいやー素晴らしい。もうちゃんと丸くまとめてくれるのが嬉しいですね。さすがホスト。",
      "start": 862951,
      "end": 869390,
      "timestamp": "14:22"
    },
    {
      "speaker": "Kei",
      "text": "もう英語における喋れる感ってもう60%は自信から来てますからね。",
      "start": 869390,
      "end": 873244,
      "timestamp": "14:29"
    },
    {
      "speaker": "Senna",
      "text": "いやー間違いないよね。",
      "start": 873244,
      "end": 874781,
      "timestamp": "14:33"
    },
    {
      "speaker": "Kei",
      "text": "喋ってる風になりますから。",
      "start": 874781,
      "end": 876177,
      "timestamp": "14:34"
    },
    {
      "speaker": "Senna",
      "text": "そう、いまだにブロークンな自信。めちゃくちゃ俺あるけれども普通に喋ろうと思って喋るんだよ。なんかよくわかんないねあれ。絶対俺より英語力あるはずのやつが全然ダメってたりするもんな。",
      "start": 876177,
      "end": 886357,
      "timestamp": "14:36"
    },
    {
      "speaker": "Ryo",
      "text": "なんか結構みんなやっぱお酒飲むといいみたいなあります。",
      "start": 886367,
      "end": 889588,
      "timestamp": "14:46"
    },
    {
      "speaker": "Senna",
      "text": "よね俺はそうなん。",
      "start": 889588,
      "end": 890508,
      "timestamp": "14:49"
    },
    {
      "speaker": "Ryo",
      "text": "だけどちょっとそのタガが外れてバラバラ出てみたいな別。",
      "start": 890508,
      "end": 894690,
      "timestamp": "14:50"
    },
    {
      "speaker": "Senna",
      "text": "に酒の力足りなくてもあってちょっと思うけどまあまあそうね確かにでもあるんでしょうね日本人ならではのとこもあるんだろう。",
      "start": 894690,
      "end": 901912,
      "timestamp": "14:54"
    },
    {
      "speaker": "Ryo",
      "text": "ねきっとそしたらじゃあ技術力についていこうかなと思うんですけどでそれこそそのさっきのその専門学校っていうのがあのコナーストーンかなっていうカナダのバンクーバーにある学校だと思うんですけど、それこそ僕がクラスメイトで1年一緒に通ったんですけど、。",
      "start": 901912,
      "end": 925002,
      "timestamp": "15:01"
    },
    {
      "speaker": "Kei",
      "text": "じゃあ、。",
      "start": 925002,
      "end": 925192,
      "timestamp": "15:25"
    },
    {
      "speaker": "Ryo",
      "text": "技術力はそこの学校の中でつけたみたいな感じですか?それともなんか自分でそれ以外にもやってた感じですか?",
      "start": 925192,
      "end": 932507,
      "timestamp": "15:25"
    },
    {
      "speaker": "Kei",
      "text": "一番大元の基礎っていうか始めたては独学でなんか専門学校行くって決まった時点でちょっとダッシュスタートしたいなと思って当時はその入学する人全員俺と一緒で全く経験ない奴ばっかりと思ってたからちょっとダッシュスタートしたいなと思っててプロゲートとかああいうなんだろう自分で勉強する系のサイトで基礎を抑えていたとHTML、。",
      "start": 932517,
      "end": 955565,
      "timestamp": "15:32"
    },
    {
      "speaker": "Ryo",
      "text": "CS、。",
      "start": 955565,
      "end": 955718,
      "timestamp": "15:55"
    },
    {
      "speaker": "Kei",
      "text": "JavaScriptとJavaも触ってたかなだから具体的な概念としてはhtmlで振ったボディヘッダーのページが作れcsで若干型を成形できでjavascriptでボタンを押したらポップアップ出る程度できたしjavaを触ってたからクラスは何のこっちゃわかってなかったけど最低限の型インテージャーストリングとかあれいとかそこらへんはわかってる状態での入学でしょねじゃ経験。",
      "start": 955718,
      "end": 982199,
      "timestamp": "15:55"
    },
    {
      "speaker": "Ryo",
      "text": "者だったってわけですねいや、。",
      "start": 982199,
      "end": 984159,
      "timestamp": "16:22"
    },
    {
      "speaker": "Kei",
      "text": "言い過ぎやろ。",
      "start": 984159,
      "end": 984999,
      "timestamp": "16:24"
    },
    {
      "speaker": "Senna",
      "text": "全然経験がないやろ。だから、けややさん、びっくりしたでしょ、ほんとに。CIC入ったら、もう、都経験者のなんか、それこそこう、僕らの友達だったりとか、東橋さんだったりとか、みたいなね。都経験者がバンバンいるっていう環境で、だいぶ困ったんじゃないですか?",
      "start": 984999,
      "end": 1003345,
      "timestamp": "16:24"
    },
    {
      "speaker": "Kei",
      "text": "学校に入って一番驚いたのは、みんな、自分のカナダでの滞在期間を伸ばすために、その学校に行ってたっていうので、俺の最初の予想では、俺みたいに全くバックグラウンドない人が、一から勉強するぞ、エンジニア目指すぞ、。",
      "start": 1003355,
      "end": 1018929,
      "timestamp": "16:43"
    },
    {
      "speaker": "Senna",
      "text": "オー!",
      "start": 1018929,
      "end": 1019149,
      "timestamp": "16:58"
    },
    {
      "speaker": "Kei",
      "text": "みたいな環境で行ってるのかなと思ったら、クラス全体で二十人くらいいたのかな。全くの未経験、ほんと。3分の1とかそんなレベルでしたよね。なので、。",
      "start": 1019149,
      "end": 1029388,
      "timestamp": "16:59"
    },
    {
      "speaker": "Senna",
      "text": "なんか、。",
      "start": 1029388,
      "end": 1029648,
      "timestamp": "17:09"
    },
    {
      "speaker": "Kei",
      "text": "キックスタートとるつもりが、なんか、3、4年どころか、もう10年分ぐらい、ビハインドから始まってたみたいな状態でした。",
      "start": 1029648,
      "end": 1036542,
      "timestamp": "17:09"
    },
    {
      "speaker": "Senna",
      "text": "ごめんなさいね。フログのせいやね、それは。",
      "start": 1036542,
      "end": 1040105,
      "timestamp": "17:16"
    },
    {
      "speaker": "Ryo",
      "text": "でも、それで言うと、今って、。",
      "start": 1040105,
      "end": 1042417,
      "timestamp": "17:20"
    },
    {
      "speaker": "Kei",
      "text": "その、。",
      "start": 1042417,
      "end": 1042616,
      "timestamp": "17:22"
    },
    {
      "speaker": "Ryo",
      "text": "バンクーバーにそういう、なんか、学校に行って、学校の、ビザもらってその後1年ワークビザもらってワホリっていう人たち多分いっぱいいると思うんですけど今あんまり経験者って少ないのかなそれとも人数的にはあんまり変わんない感じですかいやフロック的。",
      "start": 1042616,
      "end": 1060204,
      "timestamp": "17:22"
    },
    {
      "speaker": "Senna",
      "text": "に言うんだったらもうむしろ経験者しか来てないよ。",
      "start": 1060204,
      "end": 1062446,
      "timestamp": "17:40"
    },
    {
      "speaker": "Ryo",
      "text": "今なんかその当時結構いっぱいいましたよねその僕たちの周りでも結構何人かいたなーっていうイメージ。",
      "start": 1062446,
      "end": 1071120,
      "timestamp": "17:42"
    },
    {
      "speaker": "Senna",
      "text": "なんですけどとりあえずシンプルに今フロック使ってこっち来てる連中なんてもうほとんどはCICCCかCCTVかランガラかBCITかみたいなのに行くっていう業界経験2,3年がもう8割超えてますね多分。",
      "start": 1071120,
      "end": 1087328,
      "timestamp": "17:51"
    },
    {
      "speaker": "Ryo",
      "text": "Kei君はじゃあその学校の間はなんかどんなことをして技術力というかその就職するための技術は身につけたんですかうん、。",
      "start": 1087328,
      "end": 1097157,
      "timestamp": "18:07"
    },
    {
      "speaker": "Kei",
      "text": "それが結構特殊なことやったんじゃないかなと思うのが、戦略的にやっぱり、初日から打ちのめされたわけですよ。あれ?俺全然無理やんみたいな。こんな人たちが就職する前提で来てんのやったら、自分無理じゃね?と思っ…たのもあってたまたまその無料のインターンシップみたいな売れ込みでなんか無料の労働をかき集めに来てた結構さんくさいスタートアップの人が学校に来ててその人のつながりで無償で働くみたいな履歴書に何か働いた経験とし載せれそうな系何場があったからそこに無料で行かせてもらってたみたいなのが始まりかなそこで学校終わったらインターンシップしつつ学校でも勉強をしつつっていうので2足のオーラ字を履きつつスタバは依然継続してっていうのが続いてそうねまぁでも3つバイトかけ持ちしてたのが一つ学校一つインターンシップ一つそのままのスタバになっただけやから別にその忙しさとしてはそんな変わらなかったですよねやる。",
      "start": 1097157,
      "end": 1164367,
      "timestamp": "18:17"
    },
    {
      "speaker": "Ryo",
      "text": "ことは3つってやること。",
      "start": 1164367,
      "end": 1166268,
      "timestamp": "19:24"
    },
    {
      "speaker": "Kei",
      "text": "は3ついやむしろなんかクーラー利いてる部屋でパソコンいじってるだけでいいんやっていうのでむしろ気が楽ですねあの時はじゃあ2つ。",
      "start": 1166268,
      "end": 1173953,
      "timestamp": "19:26"
    },
    {
      "speaker": "Ryo",
      "text": "と休憩ですね2つと休憩そういや、。",
      "start": 1173953,
      "end": 1177839,
      "timestamp": "19:33"
    },
    {
      "speaker": "Senna",
      "text": "絶対そんなことはないはずなんだけど、すごいですね。なるほど。",
      "start": 1177839,
      "end": 1180581,
      "timestamp": "19:37"
    },
    {
      "speaker": "Ryo",
      "text": "でも、クラスメイトとしての印象は、もうめちゃくちゃ学校でも勉強してて、学校終わったらすぐどっか飛び出してって、すごい忙しそうな人っていうイメージだったけどね、当時。",
      "start": 1180581,
      "end": 1193639,
      "timestamp": "19:40"
    },
    {
      "speaker": "Senna",
      "text": "そういうことになるよね、きっと。そうか、トガシさんはそうよね。クラスメイトっていう立ち位置で、。",
      "start": 1193639,
      "end": 1197972,
      "timestamp": "19:53"
    },
    {
      "speaker": "Ryo",
      "text": "俺、。",
      "start": 1197972,
      "end": 1198062,
      "timestamp": "19:57"
    },
    {
      "speaker": "Senna",
      "text": "ケイさんの話聞くの結構久しぶりやな。",
      "start": 1198062,
      "end": 1201074,
      "timestamp": "19:58"
    },
    {
      "speaker": "Ryo",
      "text": "実はあんまり関わってなかったから卒業して1年ぐらい経ってからかな仲良くなったのはなんであんまり知らなかったっていうのはあるんだけどそうですね一応。",
      "start": 1201084,
      "end": 1212870,
      "timestamp": "20:01"
    },
    {
      "speaker": "Kei",
      "text": "クラスメイトそうパーソナルの時間がなさすぎても人間じゃなかったので学校行ってた時代。",
      "start": 1212870,
      "end": 1217353,
      "timestamp": "20:12"
    },
    {
      "speaker": "Senna",
      "text": "はとがしかったんじゃんそうするとあ、それってちなみに単純な気になるレベルなんだけどやっぱりとがしさん的にさやっぱりこうなんかやっぱり仲いい人たちってやっぱり経験者だっ。",
      "start": 1217353,
      "end": 1231008,
      "timestamp": "20:17"
    },
    {
      "speaker": "Ryo",
      "text": "たんちなみにそうですね、ちょっと、今でもたぶん気持ちそうだとは思うんですけど、そんなに就職って難しくないだろうって、ちょっと思ってたんですよ。いや、難しかったんですよ、めちゃくちゃ。めちゃくちゃ難しかったんだけど、ちょっと経験もあるし、僕はその当時、けい君と同じ感じで、フィリピンにちょっと行って、英語を身につけてきて、ボロボロの英語しかしゃべれないのにちょっとしゃべれる気になってたんで僕英語もしゃべれるしちょっと技術もあるし楽勝でしょみたいな感じで思ってたんで僕は結構ほぼパーソナルの時間みたいな感じで遊んでましたねその1。",
      "start": 1231008,
      "end": 1267912,
      "timestamp": "20:31"
    },
    {
      "speaker": "Kei",
      "text": "年はそうそれってあれっすよそのりょうくんが日本にいるときから積み上げてきたものがそのままカナダでの環境にトランスファー持ってこれる環境だったからこそ生まれた余裕であって俺はもうそれ全くない状態からのスタートだったからそりゃ同じスタートラインに立とうと思ったらパーソナルライフ吹っ飛びますよねっていうまあまあそう。",
      "start": 1267912,
      "end": 1289311,
      "timestamp": "21:07"
    },
    {
      "speaker": "Senna",
      "text": "だよね間違いないとは。",
      "start": 1289311,
      "end": 1291567,
      "timestamp": "21:29"
    },
    {
      "speaker": "Ryo",
      "text": "いえ僕もSIER出身だったんでウェブアプリを一人で作れるかって言ったら作れなかったし普通にAPIサーバー立てるのも厳しいぐらいだったんで全然僕も技術力はなかったんだけどなんかよくわからない自信だけあって。",
      "start": 1291567,
      "end": 1307153,
      "timestamp": "21:31"
    },
    {
      "speaker": "Senna",
      "text": "遊びほうけてましたね真逆のじゃあ学校生活ねだから経験未経験本来は経産みたいな本当に学習経験業界経験がない人っていうのが行くのが多分カレッジとか学校なんだろうから正しいのはもしは経産なのかもしれないけどねそうですねそういう多種多様なカレッジの使い方があるというところだと思うんですけど実際でも経産の話ちょっと戻らせてもらうんだったらやっぱり専門スキルっていう分が現地で就職するまでボランティアとプラス授業だけで何とかなるとは到底覚えないっていうのが一般論だと思っていてなんか他にはないの?",
      "start": 1307153,
      "end": 1343730,
      "timestamp": "21:47"
    },
    {
      "speaker": "Kei",
      "text": "なくて、むしろこのインターンシップが言うまい具合に働いたと思ってるんですよ。まあ変数としていろんな運があったって、月が回ってたっていうのもありますけど、はいその僕の場合は技術力で物言わせに行くというよりはカナダの現地の経験っていうのでレジュメに何か記入するものを足すっていうことを先んじてできていたのが就職にすごいプラスに働いたなと思っていますとで、先んじて一つ目の会社の話になるんですけど、当時、BC州ではエンジニアの数が足りてないみたいな風潮が出ていて、で、政府、BC州自体が、コープの学生を雇ったら補助金出しますよとか色々やってたわけですよ。で、バリバリのスタートアップでも人を雇いやすいみたいな、状況になっていたので今に比べるとだからその新しくスタートアップがバンクーバーでローカルで発足するってなった時知り合いづてでなんか学生でいい奴いないっていう話になった時にcicccでこういうスタートアップ発足するんですけど誰が興味ありませんかっていう話が出たんですよねその時に僕が行ってたインターンシップのテックスタックとほんとほぼ丸被りだったのであ僕もカナダの現地でスタートアップでやってますよっていう触れ込みでその会社でフルタイム正社員として入ることができたっていうのでいろいろな変数がありましたよねガバメントが補助してたのもそうだし景気という面でスタートが補足できるような状態っていうものがあったっていうのもそうだし僕がたまたまその無給のインターンシップで使った技術スタックがそのスタートアップシーンで人気のステックスタックだったとかいうなんかいろいろな月が回って何だろうも星が全部一直線に並んで入ることができたっていう感じですね多分ねあの初心者とか未経験者の人はこれぐらいなんか月が一斉に集まるぐらいのイベントが起こらないと少々きって難しいんじゃない。",
      "start": 1343730,
      "end": 1465470,
      "timestamp": "22:23"
    },
    {
      "speaker": "Ryo",
      "text": "かなちなみにどんなテックスタックだったんですか僕は。",
      "start": 1465470,
      "end": 1470862,
      "timestamp": "24:25"
    },
    {
      "speaker": "Kei",
      "text": "リアクトネイティブとタイプスクリプトを使ってモバイルアプリを作ってたのとウェブアプリをリアクトを使って作っていたっていうフラントエンドのスタックだったんですけどこれがバンクーバーのテックシンドは結構人気のテックスタックなのでいろいろ後の転職とかにも役立ったしトランスファラブルなスキルだったなと今振り返れば思いますねそれ。",
      "start": 1470862,
      "end": 1493039,
      "timestamp": "24:30"
    },
    {
      "speaker": "Ryo",
      "text": "はえっと学校ではえっと教えてなかったと思うんですけどそれはもう本当にじゃあボランティアのところで全部学んだって感じなんですかあーそうそう。",
      "start": 1493039,
      "end": 1502378,
      "timestamp": "24:53"
    },
    {
      "speaker": "Kei",
      "text": "ボランティアのところで学んだしも学校で学んだこと俺何も覚えてないですね正直。",
      "start": 1502378,
      "end": 1505945,
      "timestamp": "25:02"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあ結構内職してた感じ。",
      "start": 1507688,
      "end": 1510350,
      "timestamp": "25:07"
    },
    {
      "speaker": "Kei",
      "text": "ですか授業は授業でちゃんと受けてたけどなんかね気づいたらその無休のインターシップの方が就職につながってたのでそちらばっかりが頭に残ってたっていうイメージですかねだからその学校外の時間で自分で自習する時自分で勉強する時っていうのはやっぱり実務で使ってたスタックの方ばかり勉強しましたねリアクトの基本とかリアクトネイティブをどうやって動かすかとかなので学校の勉強という文脈で考えると結構必要最低限の頑張りだったのかなと授業を聞くし質問もするけどなんかそれに対してすごい突っ込んだような勉強それ以上のことは学んでなかったってイメージです学校はIOSのネイティブのモバイルの話とかしてたんで。",
      "start": 1510350,
      "end": 1557536,
      "timestamp": "25:10"
    },
    {
      "speaker": "Senna",
      "text": "そういうだよね富樫さんも多分同じこと思ってるんだろうけれどもやっぱこういう人は伸びるよねあの授業のレールをただ単純に歩んでいますよっていう人じゃなかったよね結局っていう部分だと多分思うんですけどやっぱりその辺のねボランティアの部分から見つけたリアクトネイティブだったりそのね重要だったりっていう部分に全振りできるのがすごいよね授業やんなくっていいんだっけみたいな宿題周りに名誉かけちゃうみたいななかったんですかいや、でも結構多いのよ。やっぱり宿題側とかさ。なかった?",
      "start": 1557536,
      "end": 1589746,
      "timestamp": "25:57"
    },
    {
      "speaker": "Ryo",
      "text": "いや、。",
      "start": 1589746,
      "end": 1590076,
      "timestamp": "26:29"
    },
    {
      "speaker": "Senna",
      "text": "素晴らしいね。",
      "start": 1590076,
      "end": 1591547,
      "timestamp": "26:30"
    },
    {
      "speaker": "Kei",
      "text": "先生がいい先生だったっていうのもありますね。あの人は結構なんか深刻なこと言う人だったんで、お前の目標は就職であって授業を受けることじゃないよみたいなスタンスの人だったんで。学校っていう形態で考えると正解の人だったんだなと思いますやっぱ学校的には就職率が上がるっていうことはプレゼンできる数字の見た目が良くなるっていうことなんでそこを目指していた先生っていうのは僕とすごい相性良かったですね逆になんかルールルールでなんかこれはルールに記載されてないからやっちゃダメですっていうタイプの先生だったら多分俺は就職できなかったんじゃない。",
      "start": 1591547,
      "end": 1627871,
      "timestamp": "26:31"
    },
    {
      "speaker": "Senna",
      "text": "かなと思いますあそこの学校は未だにうちも結構あの計算とトガシさんが行った学校ですけどあの割とやりとりすることが多いですけど多分バンクーバーにある中で一番柔軟な格好よね相当緩いというか色々色々許してくれるので僕らとしてもありがたい学校ですねでも。",
      "start": 1627871,
      "end": 1647049,
      "timestamp": "27:07"
    },
    {
      "speaker": "Kei",
      "text": "なんかいい学びになったなと思いますの学校に行ってそういう経験をしたことでなんかシンクって本質的に自分が何をするべきかっていうことをちゃんとわかっていれば自然と自分のやるべきことってわかるんだなとなんかそうブラインドを目つぶってルールばっかりフォローしてたらやっぱりそのルール上での勝負になってしまってそのルールを守ることで実際にその自分が達成したいこととか本質的にやらないといけないことからどれぐらい離れているのかってわかんないじゃないですかだからまあルールは最低限守りつつ自分が今やっていることが本当に本質的にそっちに向いているのかどうかっていうメタ視点みたいな膝が1個上の状態から自分が何やってるかっていうのを見るっていう癖はつきましたねおかげでやっぱりなんかわけのわからない世の中の理不尽みたいなのにさらされた時に反発しがちになったっていうのもありますけど。",
      "start": 1647049,
      "end": 1704394,
      "timestamp": "27:27"
    },
    {
      "speaker": "Senna",
      "text": "反発できる分いいじゃんねそれに乗っかるしかない人たちってやっぱいるわけでその部分で言うんだったらもう俺だって未だにKさんみたいになりたいですっていう風に言うて相談来る人いるけど大体やめときっていうもん。",
      "start": 1704394,
      "end": 1717138,
      "timestamp": "28:24"
    },
    {
      "speaker": "Kei",
      "text": "そう。",
      "start": 1718970,
      "end": 1719690,
      "timestamp": "28:38"
    },
    {
      "speaker": "Senna",
      "text": "まあまあなにそのレールっていう部分で言うんだったらね最初からは掘り足完全経験なしでこっち来たしさっきKさんもおっしゃってたけどやっぱり全部の条件が揃わないと就職ができないっていうのはもうその通りだと思う。",
      "start": 1719690,
      "end": 1729655,
      "timestamp": "28:39"
    },
    {
      "speaker": "Ryo",
      "text": "からそれちなみにセナーさん的にはそのKさんみたいになりたいですっていうのはどこのことをKさんっていうふうに言ってる?",
      "start": 1729655,
      "end": 1738188,
      "timestamp": "28:49"
    },
    {
      "speaker": "Senna",
      "text": "あーごめんそれで言うんだったらいやそうそれで言うんだったらねやっぱり完全に日本で経験なくて英語だけちょこっとだけ得意でで、カナダからカナダに行ったらすぐに就職して、Kさんみたいに外資系企業で日本で将来的にV言えるみたいなことを目標とする人たちですね。だから、もちろんあれよ、Kさんみたいにって言って、ど真ん中Kさんと同じパスワード提案はしないけど、とはいえ応援はもちろんしますよ。現地就職にしたってタイミングの部分考えて一緒にって計画はもちろんするんだけど、とはいえ、KSRのプランって最初からエンジニア目指してたわけじゃないってとこもそうやけど行き当たりばったりも相当多いので、なかなかどこまで歩めって言えるのかって難しいなっていうのが僕らの目線ですね。",
      "start": 1738188,
      "end": 1789327,
      "timestamp": "28:58"
    },
    {
      "speaker": "Kei",
      "text": "再現性はないっすよね。",
      "start": 1789327,
      "end": 1791866,
      "timestamp": "29:49"
    },
    {
      "speaker": "Ryo",
      "text": "そのところどころはでもあるのかなって思って例えばそのスタバで働くだとか一時期ちょっと流行りましたよねあのフロックのコミュニティーの中で。",
      "start": 1791876,
      "end": 1799999,
      "timestamp": "29:51"
    },
    {
      "speaker": "Senna",
      "text": "もそうちょっとだけ話をさせてほしいんだけどさ俺相当反省して実はあのそれまでKさんと俺は話するまでっていやいや待て待てとエンジニアとしてこっち来たんだったらこっちでテクノソラ仕事するした方がプラスに決まってんじゃねーかレジュメ上もそっちの方が上に決まってんじゃねーか俺としては当たり前のこと言ってたつもりなんだけどやとはいえ確かに計算に1回フロックでいいあのイベントしてもらってあのまあこっちでスタバとかで働いた連中は確かにこっちの適用率でまあまあ高いなって思ってねそれでちょっとスタバで働くってどれだけ計算のねキャリアに生きたのかっていう部分をちょっとイベントしていただいてそれでそこから僕の考えは180度変わりまして今ではみんなにサバで働けって言ってますその。",
      "start": 1799999,
      "end": 1844671,
      "timestamp": "29:59"
    },
    {
      "speaker": "Ryo",
      "text": "くらい変わったそこが大事なのかは分からないけどまあ確かにそこでスタバで働くってのは確かにそのコミュニケーションみたいなのを毎日取らないといけない人だったり英語も伸びるしいいのかなとは思いますね確かにそしたらじゃあ次の質問で就職活動っていう意味で言うと元々ボランティアをやっていて、その学校に来て、来た、なんかその知り合いの知り合いのツテみたいなところから就職した、あの就職したってことだったんですけど、それ以外に就職活動ってされましたか?",
      "start": 1844671,
      "end": 1879297,
      "timestamp": "30:44"
    },
    {
      "speaker": "Kei",
      "text": "それ以降ってことかな?それ2個目とかじゃない?",
      "start": 1879297,
      "end": 1881298,
      "timestamp": "31:19"
    },
    {
      "speaker": "Ryo",
      "text": "それ以外、じゃあそれがもう一番最初?",
      "start": 1881298,
      "end": 1884170,
      "timestamp": "31:21"
    },
    {
      "speaker": "Kei",
      "text": "それが一番最初じゃあもうそれ。",
      "start": 1884170,
      "end": 1886620,
      "timestamp": "31:24"
    },
    {
      "speaker": "Ryo",
      "text": "以外はアプライもしてないしって感じあーそれ以外の。",
      "start": 1886620,
      "end": 1889941,
      "timestamp": "31:26"
    },
    {
      "speaker": "Kei",
      "text": "アプライはリンクドインを通してやってたけどでもほか別に泣かず問わずだったかな面接何件か行ったけど別に最終まで行ったのはなかったかなってかその1個目がすごい話早かったんで多分2個目3個目の会社面接行ってたやつも途中で切り上げたとかだっ。",
      "start": 1889941,
      "end": 1909668,
      "timestamp": "31:29"
    },
    {
      "speaker": "Ryo",
      "text": "たと思う確か確かちゃんと覚えてないんだけど学校のアカデミックのターンが終わらないうちから就職できたんだった。",
      "start": 1909668,
      "end": 1917892,
      "timestamp": "31:49"
    },
    {
      "speaker": "Kei",
      "text": "っけそうそうそうなんか最終ターンになってみんながプロジェクト1個作りましょうっていう時に就職が決まったので僕だけそれ免除になったみたいな形だったかなじゃあ。",
      "start": 1917892,
      "end": 1932479,
      "timestamp": "31:57"
    },
    {
      "speaker": "Ryo",
      "text": "もう本当にその就職かってなんかその前にちゃんと就職活動してえっとそのオンラインのそのなんかアプライみたいなのはしてとかではなくもう本当にそれがその最初の何社とかでまあすごいいい感じになんだろうレファラルみたいな感じで決まったって感じだったのか。",
      "start": 1932479,
      "end": 1950632,
      "timestamp": "32:12"
    },
    {
      "speaker": "Kei",
      "text": "なそうね学校を始まって半年ぐらい経ってそろそろやるかーって動き出したぐらいでちょうどその話が出たのでタイミング良かったですよねK。",
      "start": 1950632,
      "end": 1960526,
      "timestamp": "32:30"
    },
    {
      "speaker": "Ryo",
      "text": "君っていうとやっぱりあのカナダで何社か経験してるじゃないですか何社でしたっけちなみに3社だね3社でやっぱりなんかK君っていろんなイベントとかいろんな記事とかであのなんか年収とか公開しててうわっなんかすごい年収高い人だみたいな結構イメージがあると思うんだけど最初の年収っていくらだったんですか言えるまあ範囲とかで。",
      "start": 1960536,
      "end": 1983043,
      "timestamp": "32:40"
    },
    {
      "speaker": "Kei",
      "text": "いいんですけど39,000ドルよ一番最初は39,000ドル今で言う400万ぐらいかいや400いかんな400いかんぐらいかぐらいの勢い感でバンクーバーの物価でそれは頭おかしいっすよね頭おかしいっすね。",
      "start": 1983043,
      "end": 2001156,
      "timestamp": "33:03"
    },
    {
      "speaker": "Senna",
      "text": "日本の換算やとワンチャン250万くらいなんじゃない。",
      "start": 2001156,
      "end": 2004557,
      "timestamp": "33:21"
    },
    {
      "speaker": "Kei",
      "text": "のみたいないやでもめちゃくちゃお金もらってる気でいましたね当時はそれは。",
      "start": 2004557,
      "end": 2010700,
      "timestamp": "33:24"
    },
    {
      "speaker": "Senna",
      "text": "あれでしょだからあの日本出てくる瞬間までがすごい安かったからっていう話でしょ多分。",
      "start": 2010700,
      "end": 2015282,
      "timestamp": "33:30"
    },
    {
      "speaker": "Kei",
      "text": "ヤンヤンああそうそうなんか口座に20万があるだけでめっちゃ金持ちな世界観だったから。",
      "start": 2015845,
      "end": 2020692,
      "timestamp": "33:35"
    },
    {
      "speaker": "Senna",
      "text": "ヤンヤンいやすごいよヤンヤン。",
      "start": 2020692,
      "end": 2023616,
      "timestamp": "33:40"
    },
    {
      "speaker": "Ryo",
      "text": "今まで3つ回さないといけなかったのが今一つになったみたいなヤン。",
      "start": 2023616,
      "end": 2026840,
      "timestamp": "33:43"
    },
    {
      "speaker": "Kei",
      "text": "ヤンああそうそうしかもクーラー効いた部屋やしめっちゃやみたいななんか周りに安みたいな言われたけどなんか自分的に何か安い自覚がなくてこのもらって安いみたいな。",
      "start": 2026840,
      "end": 2038889,
      "timestamp": "33:46"
    },
    {
      "speaker": "Senna",
      "text": "でもいいカルチャーがピギャップかもねなんかフロックのからいけないとこがもなって気がちょっとしてきてるけどなんかやたらとやっぱり高い練習の人が周りに多いからさなんかそれが当たり前って思っちゃうけどとはいえ日本で普通に働いて普通にしてる人たちって多分400万500万とかっていうのはおそらく普通なんだろうから今のね物価感だとおそらくまあ60系とかからはスタートってなるとわーきつそうだなーって思っちゃうけどあーでも日本にいた時からするんだったらねいやだいぶ伸びてるんですけどねって人は多分多いんだろうなーって思うので安静。",
      "start": 2038889,
      "end": 2072793,
      "timestamp": "33:58"
    },
    {
      "speaker": "Ryo",
      "text": "ですねそこはあとはなんかカナダで言うとその一社目はねそんなっていうのはありますよね結構外国人でみたいなだからなんかKei君にその話聞いた時も確かにその他の人と比べたりすると安いのかなみたいなのあったけどでもなんかみんななんかその時の雰囲気としてはあの一社目働けてるのすごいみたいな。",
      "start": 2072793,
      "end": 2092710,
      "timestamp": "34:32"
    },
    {
      "speaker": "Senna",
      "text": "いやそのそうだねカナダの。",
      "start": 2092710,
      "end": 2094632,
      "timestamp": "34:52"
    },
    {
      "speaker": "Ryo",
      "text": "会社で働けてるのすごいみたいな感じだったかなって僕は思いましたけどね。",
      "start": 2094632,
      "end": 2098556,
      "timestamp": "34:54"
    },
    {
      "speaker": "Senna",
      "text": "それで言うといやそうだよねこれでも本当にフロックに相談来る人たちも言ってあげてほしいんだよな本当に1社目からむちゃくちゃ高いと思ってくる人が本当に多くてたぶんそれはねyoutbeとかであのなんか見た年収がやれ1900万だとか2000万だとかっていうねあれを見てじゃあ私も多分1500万くらいからさとかなっていうふうに思ってくるんだろうけれども一社目はほんととがさんが言った通りねビザがあるだの文化のカルチャーギャップあるだの交渉することは多いだのでとにかくねちょっと低く見積もらいがちなのは間違いないからなかなか難しいよねそう。",
      "start": 2098556,
      "end": 2132864,
      "timestamp": "34:58"
    },
    {
      "speaker": "Ryo",
      "text": "ですねでそこの会社はどのぐらい働いたんですか。",
      "start": 2132864,
      "end": 2136546,
      "timestamp": "35:32"
    },
    {
      "speaker": "Kei",
      "text": "そこから1年ちょっとぐらいかなビザギリギリまでだったんでそうね1年3ヶ月とか4ヶ月とかそんぐらい。",
      "start": 2136546,
      "end": 2145251,
      "timestamp": "35:36"
    },
    {
      "speaker": "Ryo",
      "text": "かな結構この業界だとまあ割とみんな短めで2年ぐらいではっていう人が多いと思うんですけどそれと比べても少し短いですよねなんかそのきっかけみたいなのはあったんですか。",
      "start": 2145251,
      "end": 2157337,
      "timestamp": "35:45"
    },
    {
      "speaker": "Kei",
      "text": "ビザサポートができないっていう話になって次探さないとえらいこっちゃで次を探す必要があったのでまあ必要から来た転職。",
      "start": 2158444,
      "end": 2170798,
      "timestamp": "35:58"
    },
    {
      "speaker": "Ryo",
      "text": "だったっていうそうするとK君確かその来た時点でワーホリを1年目で使ってでその学校に入学することでその学校のタームが終わった後の1年はワーキングビザがあったじゃあその1年だけ働けたみたいな感じかなそこはそうねはいはいはいでその次の会社にじゃあ入社した時点でえっとそこの会社にビザのサポートをしてもらえ。",
      "start": 2170798,
      "end": 2196572,
      "timestamp": "36:10"
    },
    {
      "speaker": "Kei",
      "text": "たって感じなのその話で進めてたんだけどフロックからroは掘りっていうのが出るっていう話も出ててだろうアフリーに何か応募したらやらせてくれるという話になったのであるは掘りが先になったのかなであろうは掘り中にpr取ってっていうのがビザ的な経歴なのでその時はroは掘りをアクティベートしつつ転職活動っていうある。",
      "start": 2196572,
      "end": 2223031,
      "timestamp": "36:36"
    },
    {
      "speaker": "Senna",
      "text": "でしょうねそうですねアロアフィラム知らない人もいると思うんだけど一応ですね30歳35歳まで一応取れるセカンドは吹いても言われていたねあれなんだけど最近ちょっとは掘りが2回申請できるなっちゃったからセカンドは吹いては言うとちょっとわけわかんなくなるんでアロは掘りっていうのが定着してまあ35まで使えるは掘りやと思ってもらえれば。",
      "start": 2223031,
      "end": 2241779,
      "timestamp": "37:03"
    },
    {
      "speaker": "Ryo",
      "text": "いいと思いますそれそういえば僕が紹介したんだったねどうやったんですかとかって聞いたらそういえばなんかあのセナさんかなんかが言っててそれけいくんがなんかビザがなくなるらしいみたいなのを聞いて僕がそれあの紹介したんだそうか。",
      "start": 2241779,
      "end": 2257571,
      "timestamp": "37:21"
    },
    {
      "speaker": "Senna",
      "text": "あれそうかあれとがいすさんとがいすさん経由でそうけいさんはね最初からフログ使ってたわけじゃないしましてやNGでなるわけでもなくてこっち来た人だからフログ最初知らなかったんだよねもちろんそう。",
      "start": 2257571,
      "end": 2268893,
      "timestamp": "37:37"
    },
    {
      "speaker": "Kei",
      "text": "だから全てのきっかけはりょうで、それまで正直そんなに友達が日本人でいたとかもなかったし、なんかなんだろうコミュニティングどっぷり使うとかもなかったんで、マジでそのりょうがフロックに紹介してくれたおかげで今こんなにね、なんかいろいろ情報発信とかしてるっていう。流れができたので、そう、りょうがゲートだったんですよね。",
      "start": 2268893,
      "end": 2293690,
      "timestamp": "37:48"
    },
    {
      "speaker": "Ryo",
      "text": "実は、全然僕も覚えてなかったけど、そういう感じだった。",
      "start": 2293690,
      "end": 2297524,
      "timestamp": "38:13"
    },
    {
      "speaker": "Kei",
      "text": "ありがてぇって感じ。だってあれですよ、俺が最近youtbeとかでゲストとして出してもらってるテックワールドとかもりょうの紹介だから、なんだかんだなんか起こるときは、。",
      "start": 2297524,
      "end": 2306462,
      "timestamp": "38:17"
    },
    {
      "speaker": "Ryo",
      "text": "そう、。",
      "start": 2306462,
      "end": 2306812,
      "timestamp": "38:26"
    },
    {
      "speaker": "Kei",
      "text": "りょうの紹介だったりするんですよね。",
      "start": 2306812,
      "end": 2309045,
      "timestamp": "38:26"
    },
    {
      "speaker": "Senna",
      "text": "わぁ、なに、どうしたん、ドガシさんはなんかそういうキャラやったんか。",
      "start": 2309045,
      "end": 2312458,
      "timestamp": "38:29"
    },
    {
      "speaker": "Ryo",
      "text": "助かるって感じ。",
      "start": 2312458,
      "end": 2314110,
      "timestamp": "38:32"
    },
    {
      "speaker": "Senna",
      "text": "そうなんだねいやそうだよねテックワールドさん俺もトカシさんに紹介してもらったからな市川さんねいや素晴らしい意外と爆心地だっ。",
      "start": 2314120,
      "end": 2322309,
      "timestamp": "38:34"
    },
    {
      "speaker": "Kei",
      "text": "たりするんですよねりょう。",
      "start": 2322309,
      "end": 2323030,
      "timestamp": "38:42"
    },
    {
      "speaker": "Ryo",
      "text": "がね意外と意外とふわーっと僕多分ふわーっと紹介してるんですね実はあんまりそのつもりもなくなんか合いそうみたいな感じなのかな。",
      "start": 2323030,
      "end": 2331039,
      "timestamp": "38:43"
    },
    {
      "speaker": "Senna",
      "text": "わかんないけど素晴らしいいいじゃないですかそういういやでも。",
      "start": 2331039,
      "end": 2333982,
      "timestamp": "38:51"
    },
    {
      "speaker": "Kei",
      "text": "リョウ実際なんか嗅覚すごくてなんかそれこそさっき僕がさらっと触れたその本質的にシンクってることやってるかどうかとかのなんか見極め力みたいなすごい強いんですよ彼だからキャリア的に成功してもまあそうだろうなっていう感じがあるし彼がなんかこれこうこうこういう理由でやってるって聞いた時も納得感すごいっすもんねだから彼にこの人と会うといいよとか、この人とコラボしてみなよみたいな言われた時に結構素直に受け入れられる人の一人だなと。",
      "start": 2333982,
      "end": 2365619,
      "timestamp": "38:53"
    },
    {
      "speaker": "Senna",
      "text": "あれはあれ、俺もちょっと背筋ピンとなるもんね。トガシさんからこいつ会ったらって言われると。でもあれよ、言うんどんけど、俺未だにフロックにトガシさんが最初に連絡してきた時にどこの国に行くかすら決めていなかったトガシ寮、ちゃんと覚えてるから、その辺のフワッとシクワット。",
      "start": 2365619,
      "end": 2379656,
      "timestamp": "39:25"
    },
    {
      "speaker": "Ryo",
      "text": "感は知ってるからな。これは僕のゲストの回かなってぐらいなんか褒められますね。",
      "start": 2379656,
      "end": 2386148,
      "timestamp": "39:39"
    },
    {
      "speaker": "Senna",
      "text": "お前とは割とっちゃう素晴らしいでもそうねケイさんのほうにちょっと戻らせていただくのであれば面接の話で俺もちょっと気にはなってたんだよね面接が仕事今話にあったのが多分2社目っていうことでいいのかなっていうふうには思うんですけどちなみに給与的にはその340万390万だっけ400万くらいかのところからのどんくらいだった。",
      "start": 2386158,
      "end": 2407284,
      "timestamp": "39:46"
    },
    {
      "speaker": "Kei",
      "text": "んですか先輩当時で80Kか85Kかそこら辺の給料帯だったんで実倍ですよね樋口。",
      "start": 2407284,
      "end": 2415220,
      "timestamp": "40:07"
    },
    {
      "speaker": "Senna",
      "text": "倍どころじゃないだって日本にいた時から比べるんだったら何倍やったんちなみ。",
      "start": 2415220,
      "end": 2419242,
      "timestamp": "40:15"
    },
    {
      "speaker": "Kei",
      "text": "にヤンヤン分からん何倍バイトなんか年収換算しない。",
      "start": 2419242,
      "end": 2422743,
      "timestamp": "40:19"
    },
    {
      "speaker": "Ryo",
      "text": "じゃないですか樋口まあ。",
      "start": 2422743,
      "end": 2423264,
      "timestamp": "40:22"
    },
    {
      "speaker": "Senna",
      "text": "それもそうか時給やもん。",
      "start": 2423264,
      "end": 2424664,
      "timestamp": "40:23"
    },
    {
      "speaker": "Kei",
      "text": "ねヤンヤン300万っていうところから考えるとね2。\n7とか8倍ぐらいいったんじゃないですか樋口。",
      "start": 2424664,
      "end": 2432508,
      "timestamp": "40:24"
    },
    {
      "speaker": "Ryo",
      "text": "うんでもあのバンクーバーにいる人にはまあバンクーバーだけじゃないとは思うんですけど特にあのここのところを結構聞いてほしいですね僕的にはやっぱりなんか1回就職するとちょっと落ち着いちゃってで次に行かずにでやっぱり一社目ってそんなまあ給料も良くないからそのでもやっぱ収穫とか転職ってすごい大変だからその1回目のそのあれをなんか苦しさを引きずって次に行けない人が多いんですけどあのそこをねちょっと頑張るとしかも1社目のなんだろう経験がありきだからそんなに多分転職もそこまで最初ほど難しくなくてでまあKei君みたいに2倍とかなんて結構ザラにあるっちゃあるじゃないですか。",
      "start": 2432508,
      "end": 2475699,
      "timestamp": "40:32"
    },
    {
      "speaker": "Senna",
      "text": "でもKさんの場合、やっぱりあれなんじゃない?外的要因でビザが切れちゃうとか、もうあろうしかないんだみたいな。やっぱりそこにケツ叩かれた感はあったんですか?",
      "start": 2478238,
      "end": 2486661,
      "timestamp": "41:18"
    },
    {
      "speaker": "Kei",
      "text": "転職って。全然ありましたね。もしそれがなかったら別に転職する理由なかったし、だって当時の給料で満足してましたから。でもそこで、そうね、給料2倍バグが発生して、あれ?転職した方が良くね?ってなったのが、僕のホッパー人生の始まりですね。",
      "start": 2486661,
      "end": 2502656,
      "timestamp": "41:26"
    },
    {
      "speaker": "Senna",
      "text": "転職した方が給料上がるっていうのって、その時のKさんって知らなかったんですか?",
      "start": 2502656,
      "end": 2507118,
      "timestamp": "41:42"
    },
    {
      "speaker": "Ryo",
      "text": "逆に言うと。",
      "start": 2507118,
      "end": 2508417,
      "timestamp": "41:47"
    },
    {
      "speaker": "Kei",
      "text": "知らなかったっすね、なんか提示された時、え?なんか数字間違えてんちゃうかなと思って。",
      "start": 2508427,
      "end": 2514050,
      "timestamp": "41:48"
    },
    {
      "speaker": "Senna",
      "text": "いやーそうなるよね、でも。",
      "start": 2514050,
      "end": 2516601,
      "timestamp": "41:54"
    },
    {
      "speaker": "Ryo",
      "text": "なんかあとは、知ってはいるけど、その体感してなかったっていうのもあるかもしれないですね。なんか就職してオファーされて。",
      "start": 2516601,
      "end": 2526218,
      "timestamp": "41:56"
    },
    {
      "speaker": "Senna",
      "text": "いやーこれどういうアレなんだろうね俺も未だにやっぱり転職した方だがいいですかってむちゃくちゃ毎日合わせだけど毎週の日に聞かれるけどさそれは給料を上げたいなったらステーションがいいじゃんに終わるんだけどみんなさあやっぱりケツ叩かれる要因がないのがビザだったりとかあとどうしても永住権欲しいとかって最近も減ってるし正直そう、だからなんかね、今のやっぱり1度目のその就職活動の大変さを引きずって、プラスね、ちょっとそのケツ叩かれる要因も少ないしで、2社目行くっていう人確かにちょっと少ないよなっていうのは、ちょっとした課題ですね、。",
      "start": 2526228,
      "end": 2559854,
      "timestamp": "42:06"
    },
    {
      "speaker": "Kei",
      "text": "私どもの。いやいやいや、ケツ叩かれる状況がない方がいいでしょ。",
      "start": 2559854,
      "end": 2564457,
      "timestamp": "42:39"
    },
    {
      "speaker": "Senna",
      "text": "そりゃそうなんだけどさ。",
      "start": 2564457,
      "end": 2565187,
      "timestamp": "42:44"
    },
    {
      "speaker": "Kei",
      "text": "叩かれるイコール、しくじったら終わりなんですから。",
      "start": 2565187,
      "end": 2568299,
      "timestamp": "42:45"
    },
    {
      "speaker": "Senna",
      "text": "でもほら、転職活動だけで言うんだったら別にやったところで失うものないじゃん感はあるのよね、別にっていう。",
      "start": 2568299,
      "end": 2574831,
      "timestamp": "42:48"
    },
    {
      "speaker": "Kei",
      "text": "そう、転職って基本的に自分の手に職がある状態でやった方がアウトカムも。",
      "start": 2574841,
      "end": 2579104,
      "timestamp": "42:54"
    },
    {
      "speaker": "Senna",
      "text": "いいですしねうーんそうそうなんだかみんなやらないんだよなっていうこの矛盾。",
      "start": 2579104,
      "end": 2583846,
      "timestamp": "42:59"
    },
    {
      "speaker": "Ryo",
      "text": "よねいやでも僕理由わかりますよそれこそやっぱ日本でまぁ働くって大変じゃないですかいやこっちでももちろん仕事ってのは基本的には大変なものなんだけど就職活動はめちゃくちゃ、こっちの就職活動もめちゃくちゃ大変で、1社目は特に。で、そこ入ってからのホワイト感すごいんですよ、。",
      "start": 2583846,
      "end": 2603853,
      "timestamp": "43:03"
    },
    {
      "speaker": "Senna",
      "text": "カナダは特に。",
      "start": 2603853,
      "end": 2605273,
      "timestamp": "43:23"
    },
    {
      "speaker": "Ryo",
      "text": "めちゃくちゃホワイトじゃないですか、給料はたくさんもらえるし、結構短い時間でみんな働くし、なんかオフィス、時期的にオフィスそもそもリモートって人も多かったと思うんですけど別になんかよく寝れなかったからオフィス行きませんとか今日ドクターアポイントメントありますとか今日配達きますとかの理由で別にオフィス行かなくてよくなるじゃ。",
      "start": 2605273,
      "end": 2629607,
      "timestamp": "43:25"
    },
    {
      "speaker": "Senna",
      "text": "ないですかますよねiPhoneのハズラビアから休むってやつい。",
      "start": 2629607,
      "end": 2632949,
      "timestamp": "43:49"
    },
    {
      "speaker": "Ryo",
      "text": "たもんそうそうそう3時4時に仕事別に終わっても大丈夫ですでマイクロマネジメントもされませんみたいなそんな環境なんでやっぱりね落ち着いちゃいますよねそれは。",
      "start": 2632949,
      "end": 2647740,
      "timestamp": "43:52"
    },
    {
      "speaker": "Senna",
      "text": "なるほどねいやなのでまあなかなかねちょっと個人的にはフロックのメンツにもいろいろ転職いっぱいしてほしいとは思いつつお尻叩く要因がないほうがそれいいんだろうなっていうケーサーの話は戻りつつなかなか難しいやだなと。",
      "start": 2647740,
      "end": 2662249,
      "timestamp": "44:07"
    },
    {
      "speaker": "Kei",
      "text": "知り教えていただく要因はカナダにいる限りずっとあるべきなんですけどね、あるはずなんですよ。だって、あっと見るでレイオフが起こるような国と法律性なんで、ヨーロッパとか日本みたいに入ったらしばらく法律に守られるとかもないし、だからこそ会社の雰囲気がいいとか、働きやすいっていう、バイクライフバランスが取りやすいっていうのもあるんですけど、それ以上にやっぱり不足の事態が起こり得るっていう、日本人は不安を感じやすいっていうところと一番相性の悪いシステムのはずなので自分がいつ急に災害に巻き込まれるみたいな形でいきなりレイオフになっても動けるようにしておくっていうのをやっとかないとカナダで真に気持ち的に安定感を持つことってできないはずなんですけどね一回やっぱりレイオフを見たり目の当たりにしたり体験しないと身近に感じないっていうのはあるかもしれないですね。",
      "start": 2662249,
      "end": 2717142,
      "timestamp": "44:22"
    },
    {
      "speaker": "Senna",
      "text": "うーん確かに確かにじゃあ働きながらその辺を体感していただくしかないということです。",
      "start": 2717483,
      "end": 2723330,
      "timestamp": "45:17"
    },
    {
      "speaker": "Kei",
      "text": "ねきっとそこでケツを叩かれている感覚でいることによってそう今の会社でなんかなめたことされてもはじゃあやめるみたいなその考えがプロフェッショナルかどうかは知らないですけど、そういったメンタリズムで働けるようになるので、それもそれでやっぱり、一個人としては幸福の実現っていう上では結構大事なことなんじゃないかなと思うので。転職する気があるない関係なしに、転職できるできないっていう観点で言うと、やっぱりできる状態にしておいた方が絶対にいいですよね。",
      "start": 2723330,
      "end": 2754933,
      "timestamp": "45:23"
    },
    {
      "speaker": "Senna",
      "text": "これは日本人とも一緒だと思います。そう会社とのやっぱり本当に平等な関係ってそういうことだと俺も思うしねだからそこはぜひ徹底していきたいなっていうふう。",
      "start": 2754933,
      "end": 2762956,
      "timestamp": "45:54"
    },
    {
      "speaker": "Ryo",
      "text": "に思うんだけど特にエンジニアはなんか会社と個人の契約みたいな感じの気持ちになりますよねエンプロイーとして働いて社員として一応働いてそのグループの中にいるんだけどなんか別にそっちがそういう悪い対応してくるんだったらこっちも別に辞めますよみたいななんかその対等な関係を保てるというかそういうのはありますよねだ。",
      "start": 2762956,
      "end": 2785255,
      "timestamp": "46:02"
    },
    {
      "speaker": "Senna",
      "text": "からこそレイオフするし、会社もね、ちょっとヤバくなったらすごい人厳しいって、なんかその日本で言うとこの人情みたいなのってなかなかちょっと感じにくいとこがね、むしろいいとこかもしれないね。",
      "start": 2785255,
      "end": 2795676,
      "timestamp": "46:25"
    },
    {
      "speaker": "Ryo",
      "text": "そうですね、あとはあのさっきのケツ叩かれる流れで言うと、僕はあのK君の転職に結構ケツ叩かれたところはありましたよね。そう、。",
      "start": 2795686,
      "end": 2804679,
      "timestamp": "46:35"
    },
    {
      "speaker": "Senna",
      "text": "その話もぜひ聞きたかったのよ。それが起こり得るのが北米圏ちょっとおもろいよね。明らかに東橋さんの方が経験は上だったはずのに、なんかいつの間にかKさんの方がちょっと上行かれてどうしようみたいな話でしょ。そうそうそう、。",
      "start": 2804679,
      "end": 2819715,
      "timestamp": "46:44"
    },
    {
      "speaker": "Ryo",
      "text": "その多分、80何とかの時、その次かな、その次の転職とかで、多分、僕としては、僕は経験者で来て、K君は未経験で来て、で、同じところから、用意始め!でやって、なんだろう始めたのにk君の練習がなんか聞いたところによると抜かれてるぞみたいなのがあってヤバいみたいななんか別にねk君がすごい優秀だしまあ今でこそエンジニアとしての力全然k君の方が多分知識とかも上だと思うんだけど喧騒しすぎだろいやいやまああのインプットとかねやっぱすごいしまあまあそこは置いといて、でもその時はなんかちょっとライバル意識を燃やしてやっぱ僕も転職していくかなみたいな僕も今で3社目なんですけど結構それはありましたね。",
      "start": 2819715,
      "end": 2875587,
      "timestamp": "46:59"
    },
    {
      "speaker": "Senna",
      "text": "これ逆にさ、東海オンエアさんはじゃあ何、Kさんっていう存在がいなかったらワンチャン転職してなかった可能性あんのか。",
      "start": 2875587,
      "end": 2881190,
      "timestamp": "47:55"
    },
    {
      "speaker": "Ryo",
      "text": "などうかな、そうそれで言うと僕1社目で永住権取れちゃったんだよねうん落ち着こうと思ったら一番落ち着ける人っていうそう、全然、僕、あんまり散財するタイプでもなかったから、お金とかはなかったし、そうですね、たぶん、結構、当時よく、せなさんもいたけど、けいくんも、僕も、せなさんも、すごい家が近かったじゃないですか。",
      "start": 2881190,
      "end": 2907958,
      "timestamp": "48:01"
    },
    {
      "speaker": "Senna",
      "text": "そうだね。",
      "start": 2907958,
      "end": 2908779,
      "timestamp": "48:27"
    },
    {
      "speaker": "Ryo",
      "text": "一駅、二駅の間で、で、結構よく飲みに行ってたじゃないですか、そこらへんのグループで。で、そのときにやっぱけいくんが、ま、給料だけではなく、けいくんのその、なんていうの、のびみたいな、成長率みたいなのがすごくて、なんかどんどんどんどん技術身につけてって、なんか、よくわかんないTL回みたいな、あの、。",
      "start": 2908779,
      "end": 2928691,
      "timestamp": "48:28"
    },
    {
      "speaker": "Kei",
      "text": "LT?",
      "start": 2928691,
      "end": 2928770,
      "timestamp": "48:48"
    },
    {
      "speaker": "Ryo",
      "text": "ライトニングトークだからLT回みたいなので、なんか、何言ってるかわかんないことを発表してるぞ、みたいなのもあって、なんか、すごい置いてかれる気がしたっていうのはまあなんか別に給料だけに限らずあってで、やばいやばいちょっと僕も自分の技術身につけたりまあ転職のための勉強しようみたいなうーんすごいあったかなだからそうですねK君がやっぱりあれだったのか。",
      "start": 2928770,
      "end": 2956191,
      "timestamp": "48:48"
    },
    {
      "speaker": "Senna",
      "text": "ないやそうなんじゃない今考えてみるといやだしね俺ちょっと今発見等まで言わないけどさ確かに転職ガンガンする組と全然しない組俺の頭の中にはたくさん派閥があるんだけどさやっぱ転職しない組の派閥って多分だけどそんなにアウトゴーイングじゃないというかあんまりなんか人と会うっていうことに重きを置いてないもしくはそういう環境にいらっしゃらない人が多いのかなとはちょっと正直思っててそう、Kさんにしてもね、そのメトロタウンっていう僕らが住んでいた界隈の人たちにしても、なんかよくいろんな人たちと会って、その人たちが今現状どういうことしてるのかっていう情報収集をしてる人たちのやっぱり転職だったり、そのモチベーションは高いなっていうのはちょっとした発見かな、。",
      "start": 2956191,
      "end": 2998570,
      "timestamp": "49:16"
    },
    {
      "speaker": "Ryo",
      "text": "もしかしたら今。確かに。あとお金の話も結構してましたよね、みんな。",
      "start": 2998570,
      "end": 3002622,
      "timestamp": "49:58"
    },
    {
      "speaker": "Senna",
      "text": "してたねー、むっちゃしてた。",
      "start": 3002622,
      "end": 3004503,
      "timestamp": "50:02"
    },
    {
      "speaker": "Kei",
      "text": "そう。いい意味でオープンコミュニティでしたね、そこは。",
      "start": 3004503,
      "end": 3007535,
      "timestamp": "50:04"
    },
    {
      "speaker": "Senna",
      "text": "そうだねすごい俺も情報収集としてというか皆さんのお話を聞きながらへえ今そうなんだっていうのをねフログで相談来る人たちにもいろいろ伝えさせていただいてでもしてたのですごいいい場合だったわ。",
      "start": 3007545,
      "end": 3017230,
      "timestamp": "50:07"
    },
    {
      "speaker": "Ryo",
      "text": "ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 3020066,
      "end": 3038173,
      "timestamp": "50:20"
    }
  ],
  "highlight1": "カナダで英語を勉強するために語学学校に行った結果、英語力はあまり向上しなかったと実体験で感じた。",
  "highlight2": "そうだと思ってたけど、実際はスタバでバイトしながら英語を学ぶ方が、学校で学ぶよりも実践的で효과的だったと言うKei君の話は意外だ。",
  "highlight3": "Kei君のようにカナダで外資系企業に就職するために、英語力だけでなく、現地での経験や人脈作りが重要だと気づかされる。"
}