{
  "episodeGuid": "170e584c-f2b8-42a2-926c-0a93b3336781",
  "episodeTitle": "カナダ経験を武器に日本でPMへ！エンジニアからのキャリアチェンジで年収2000万を目指すHiroshiさんのキャリア論（後半）#16",
  "transcribedAt": "2025-10-19T06:25:09.333Z",
  "duration": 2781,
  "fullText": "はいそれでは今回も前回に引き続き広瀬さんに来ていただきました前回はこっちカナダにいた時の練習とか働き方について聞いてきたんですけど広瀬君ってあれですよね日本に帰るタイミングってエンジニアからBDMに変えてるじゃないですかまずちょっとそこから聞いていきたいんですけどざっくりなんでエンジニア辞めちゃったんですか。まあそれはもちろんまず第一にその別にネガティブな思いがあったわけじゃないとエンジニア面白くねーなみたいなことは思ってたことは絶対にないむしろもう面白くていい仕事だとは思ってたっていうのが大前提としてあるんですけれどもまあ初めはあの日本にじゃあちょっと帰ろうかなっていうところから始まったでその中であの日本に帰るんだったらpdプロダクトマネジメント系で働くのがいいかもしれないっていうのがまあ一番大きなざっくりとした流れですねでなんでまあ日本に帰ろうと思ったかというところではあるんですけどあのそうですねえっと20203年の末とかだったかなあの8エクスプレスエントリーかあのの点数があのいいとこまで行っていわゆるあのあれなんてitaかitaをもらったんです。よであついにエキスプレスエントリーは永住県のエクスプレスエントリーかなあそういうのはいはい。で、ITAというのはインビテーションとアプライですね。それをもって永住権を申請すれば9割ぐらいの確率でちゃんとカナダの永住権が取れますよというものでしたよね、確か。それもらって、じゃあここまで来たかみたいな感じで、よしよしみたいな感じで思ってたんですけど、永住するってなると、ちょっとこう自分の人生をちょっとロングタームで考えるきっかけになったというか、じゃあパラダに永住するのかでまぁ一番うまくあのキャリアがうまくいったパターンとしてそのビッグテックでエンジニアとしてバリバリやる感じだよなぁみたいなそれはそれで魅力的だけどなんかこうどうなんだろうこれってなんか本当に自分がときめく人生のプランなのかなぁみたいなことぼんやり思ってあんですよでそのタイミングで1回その日本に帰国することがあってであの僕のお姉ちゃんがあの子供ができましたって言って追いっこができるってなってであの父親も親もあの70歳とか超えてきてなんかあのもうちょっとこの身の回りの人たちとあの一緒に過ごす時間ってこれから大事になっていくのかもなぁみたいなことを思ったりもしたとそういった中で日本の本曲に対する思いが強くなってそんな中で森岡剛さんという方今ちょっと沖縄のテーマパークのジャングリアの文脈で話題になっているとマーケターの人なんですけどその人が将来の若者の日本人の食い口を作るために私は仕事をしている日本をもっと強くしたいんだみたいなことを熱く語っていてですねなんか僕もなんかそういう思いを持って働くことができたらあの自分としてはなんかちょっとワクワクするプランだなっていうふうに思ったんですよねだからまあだとしたら日本に帰ってそのまあ海外でやりたいことは今一通りできたっちゃできたんで日本に帰って日本のためにたらくみたいなあのことをするのがまあ総合的に考えて自分にとってはあの豊かな選択かなって思ったのがまあ日本に帰ったきっかけでしたねもちろんその辛かったですよそのカナダを後にするっていうのはまあ量産始めそのそっちでできた友達もねたくさんいたんであのまあこれはこれでつらいなとあの思ってたんですけどまああの方法的に見たらっていうまず一生会えなくなるわけでもないねありますけどまあというのがまあ日本をに本気かけでしたで8なぜまああのエンジニアを辞めてそのプロダクトマネジメントの界隈に足を踏み入れようとなったというきっかけで言うとですね初めはまあじゃあ日本でさが仕事を探そうってなった時にあのエンジニアの仕事で探してたんですよでえっとそんな中でまあとあるキャリアエージェントキャリアコンサルタントの人と話す機会があってあのエンジニアしか選択肢にありませんかみたいな話をされてですまあ正直それはめちゃめちゃこだわりがあったわけじゃないんですよ実際そのエンジニアとして働いた時もなんかそのタスクを整理したりとかあのお前のタスクの定義は甘いから俺が書き直すみたいなそういう場面があったりとかドキュメンテーションを書いたりとかっていうことはあったのでマネジメント系の仕事になるってなっても全然抵抗感はあったわけではないという中でですねじゃあどんな選択肢がありますかねって僕から聞くとですねもちろんそのエンジニアとしてのキャリアエンジニアリングマネージャーとしてのキャリアプロジェクトマネージャーとしてのキャリアプロダクトマネージャーとしてのキャリアそしてITコンサルとしてのキャリアこの辺が選択肢としてありますよというふうに提示してもらって今言った順に年収レンジとしては高くなっていくとITコンサルが一番高くてエンジニアリングマネージャーが一般的に言うと一番年収レンジとしては低いとエンジニアはそれよりももうちょっと日本の国内で言うと年収レンジが低いですよねみたいな話をした中でプロダクトマネージャーが磯部さんに一番合ってると思いますっていうふうに言われたんででそれはなぜかというとまあプロダクトマネージャーってそのもうめちゃめちゃコミュニケーションを取らないといけないんですよいろんな部署の人たちとで、まあ僕営業をやってたっていうこともあってそのコミュニケーション能力みたいなところの素地もありそうですしで、あのウェブマーケティングもやっていたとプロダクトマネージャーってプロダクトをグロースさせる仕事なのでどうやって人に知ってもらおうかみたいなあのところの観点も必要なので今までのイソベさんの経歴を見るとこの中だとプロダクトマネージャーが一番あってそうだと思いますっていうのが詰めていただいてそれがきっかけでしたか?ちなみにPDMがエンジニアより年収低かったらそのままエンジニアになってたんですか?それともやっぱり合ってるなって感じはあったんですか?いや僕から見てやっぱヒロシ君はめちゃくちゃPDM合ってると思いますよあのまあ結構ね長い付き合いだったし結構いろんなこと一緒にやったりもしてやっぱそのいろんな人とコミュニケーション取ったりなんかファシリテートするっていうんですか?みたいなのめちゃくちゃ得意だしあんまり何だろうその技術に興味があるとかそういう系のエンジニアってわけでもなかったんでなんかすごい合ってる。なとは思うんですけど。その年収多いのをプッシュしてくるじゃないですかあのリクルーターの人たちってそれってまあやっぱりその紹介した時にその人たちに入るお金とかのこともあるからやっぱり年収高いのの順にプッシュしたくなるのはまあしょうがないと思うんですよ確かに広瀬くん的にはそこはなんかどうだったのかなってちょっと。思っていやーそこ難しいですねその観点で考えたことはなかったんだけどまあスタートの練習が例えばプロダクトマネージャーの方が将来的には上がりますよみたいな感じだったらまだプロダクトマネージャーだったかもしれないですけどなんかどうあがいてもエンジニアの方が練習レンジ高いっしょみたいな感じだとちょっと考えたか。もしれないね結構フレキシブルそこら辺はフレキシブルだったかなって感じなんですね。そうですねはい疑問に思ったのがそういうふうにPMだとかITコンサルとかのこれからのキャリアの選択肢を上げてもらっていく中で日本で転職するってなった時にそのスペシフィックな業種に対して職種に対して経歴なくても飛び込めちゃう本なんですかなんかこっちだと、カナダだとあんまり経歴重視されちゃうから、いきなりPMになりたいって思ってもなれないことの方が多いんじゃないかなって思ったんですけど。まあそうですね、そこは難しいポイントだと思います。でも、あのそうですね、おっしゃる通り、あの経験がないと、僕の肌感でもこう、カナダだとなかなか箸にも棒にもかからんみたいな可能性は高いような気はするんですけど、日本の方がまだその、ポテンシャルを買ってくれるような雰囲気があるような気がしますねあとはそのエージェントを通してだとこの人はこういう措置を持っていてプロダクトマネージャーとしての素養は確実にあると思いますとかそういう推薦をしてくれたりするんですよでレジュメの添削とかもしてくれますしまずはここを訴求していくこの軸で訴求してくださいとかいうのがあるで僕もそのプロダクトマネージャーの仕事に対してきちんと理解してたわけじゃないんでなんか何が僕と僕の何が合ってるんですかとか具体的にプロダクトマネージャーってどんな仕事をするんですかみたいなことを聞いていく中で確かにできそうだな経験はないけど、自分の強みとか今までの経験がめっちゃいい形でお金に変えられるなっていう感覚がどんどんどんどん話を聞いていく中で積み上がってきたみたいな。それで、受からなければ辞めればいいし、エンジニアとして専属すればいいし、とりあえずPDM軸で1回やってみるか。キャリアコンサルタント、複数のキャリアコンサルタントの方から、アリスベストさん絶対PDMになったほうがいいですよ、みたいなことを、まぁ、あの、まぁその、りょうさんの言うように、その、Pのバックグラウンドみたいなのがちょっとあったのかもしんないですけど、まぁちょっとお勧めいただいたっていうのがあって、まぁ信じてみようというので、あの、挑戦したという感じですかね。答えになってます。りょうさんいやぁ、。はい。え、じゃあその、お会いしたコンサルタントの、キャリアコンサルタントの何人かお会いしたっておっしゃってたんですか?アリスベストはい、そうですね。だいぶ自分のそのなんですか今後のキャリープランをちょっと整理するのにだいぶお話しして助けてもらって良かったっていう感じですかあんまりキャリーあーそうですね転職エージェントって私あんまり良い印象なかったんですけどその話を聞くと私もなんかちょっと自分のキャリアとか誰かに一緒に考えてもらいたいな。とか思っちゃう転職エージェントは使いようですねおっしゃるように自分の職業選びのハンドルを向こうに握らせるとやられますねでも複数の転職エージェントに話を聞きつつ自分で情報収集もしつつあくまで転職エージェントを情報源として使うっていうスタンスだと僕は転職エージェントはもうむちゃくちゃいいサービスだと思ってます。僕も結構日本の転職エージェントはありだなって思ってて、日本ってそこら辺多分特別で、転職エージェントを使った時に会社からのキックバックが30%から50%、年収の30%から50%をその入るんですよね他の国だとそういうのってないじゃないですかだから結構もともとあの日本に行った時に外資系のitのコンサルみたいな会社にいたんですけどそういうの稀らしくて結構いつもそのだから海外からそこにそこの費用について続かれるみたいなのを聞いてて確かにそうだなって思いますよねなんだろうそのその転職の人たちはサポートして結構その年収の30%から50%だと結構いいお金が動くわけじゃないですかだから何だろう熱心に聞いて色々教えてくれたりだとかレジュメの添削してくれたりだとかやってくれると思うんで確かにそのひろし君の言うように相手にその自分の行くところだとあったりとかのなんかハンドルを握られたら確かにそのね高い順にやっていけば自分の年収上がるみたいなまあ自分のそのお金入ってくるやつマージンじゃないけどまあいいやまあ自責でいいかになると思うんでありだけどあのそこらへんが握られなければね確かにいろんな情報をくれるだろうしアドバイスもしてくれるしこういうなんか聞くところによるとこういう問題が出るんでみたいなのを結構教えてくれたりする面接で何が出るかみたいなのを教えてくれたりするみたいな話なんでまぁなんか日本でね転職するならどんどん使っていきたいなって思いますねそうですねそしたら、せっかくなんで、日本に帰ってきて1社目、日産だったと思うんですけど、仕事内容とか、カナダで働いて、その経験を踏まえて、カルチャーギャップみたいなのとかあったらちょっと教えてください。まあそうですねカルチャーギャップから行くとそのまあもともと日本で働いてたことあったんでまああのそんなもんだろうなという感じはありましたけどまあやっぱみんな仕事頑張りますよねめっちゃあの残業とかも全然するしでもだからといってなんかやらされている空気はなかったんでまぁみんなその熱心に仕事をしましたねモチベーション高かったと思いますあの僕らの部署あの今アプリを作る部署なのでそのまにさんにもいろんな巨大な組織なのでいろんな部署があって中には本当になんかダラダラやってるだけど部署とかもまああるかもしれないとあのまあカナダとの違いこそありましたけど自分の中で思ってたのとちげーよみたいなそういうネガティブなギャップみたいなのは特になかったなと思いますねで仕事内容で言うとあの日産コネクトというですねあのコネクテッドカーのアプリがありましてでそれはどういう内容かというとまああの遠隔で車を施錠できますとかあの乗る前に暑い日だったらあのあらかじめエアコンをつけておいてあのだな乗った時に涼しいでみたいなそういう盗難防止とかそういうのそういう系のアプリですねアプリのプロダクトオーナーというタイトルでしたけれどもプロダクトマネージャーと割と似通った内容かなと思いますまずはビジネス部署みたいなところがあってこういうことやりたいんだよねっていう大きな要望が来てそれを開発の要件に落としていくという感じですねじゃあこういう要件があって技術的に今のインフラでできるんですかとか何か導入するんだとしたらどれぐらいのコストがかかりそうかなとかっていうのをエンジニアのプロジェクトマネージャーの人たちと揉みながら要件定義書なりを作っていって最終的には仕様書を作るアプリはこの画面はここのボタンを押したらこういう挙動をしてこういうエラーが出た時はこんなリアクションを出してくださいとかそんな仕事内容でしたね最終的なアウトプットは仕様書を作ってデベロッパーに開発要件をインプットするとそんな内容でしたね。なんかさっきあの違いは結構あったっていうふうに言われてたと思うんですけど具体的にどんな違いがあったんです。かまあこれ言うとちょっとやっぱネガティブに響いちゃうなんかなかなか言葉を選ばないといけないなと思うんですけどで。もそれもリアルだと思うんでいいんじゃないです。かまあそうですねなかなかまあ上の人たちが言ったことをちゃんと聞きましょうっていうのとかあとはまあその夕方6時から7時までの会議が簡単に入るとかそういう労働時間に対する捉え方60時間ぐらい残業してる人がいても何も言われないみたいな短くしようという動きがあまりないこれやんなくても死なない会議だよなっていうのをこっから僕がその提案してこれちょっと短くしてもいいんじゃないですかとか最悪なくしても死なないんじゃないですか今こういう状況だしみたいなこと言ってもなんかでも前からやってるしなかなか歴史のあるやつだしとか言ってなんかこうちょっとお茶を濁されるみたいなのはまあなんかいわゆる、西さんも言うて、アプリ開発の部署はすごい先進的な部署だとは思うんですけど、なんだかんだJT、avaJapanesTraditonalCompanyなので、そういう制約の大きい部分はあって感じですかね。そこはじゃあ、ひろしくん的にはそんなにネガティブには捉えてはいないって感じなんですね。まあそうですねあのこういう問題はなってまあもともとその日本のメガバンクっていうそのjtcのゴンゲみたいなところにいたんでまあなんかそういうとこもんだよねっていう感じちなみにあの細かい。ところなんですけど8時から6時働くの?9時から6時?えーと定時はフレックスだったんですけど一応9時から6時ですねやっぱりそうなん。ですねあのそれこそちょっと前にあのK君あの多分知ってると思うんですけどのあのインタビューをしたときに、彼の会社でも、外資なんだけど、9時、6時で、そこの1時間について結構、やだなーって言ってたんで。やっぱ日本の会社は6時までなんですね。そうですね。プロダクトマネージャーになったときって、外部の人、お客さんと関わる機会とかも、プレゼンする機会とかありそうだなと思ったんですけど、割合としては、1日中ミーティングしてるイメージが私はあるんですけどどんな具体的にミーティングの量だったり社内か社外かどれくらいの割合でコミュニケーションしたり。するんですかそうですね日産コネクトのアプリの場合はエンドユーザーとの接点ってディーラーなんですよねで僕たち開発部はディーラーに出向いてなんかプレゼンするってことはほぼなかった全くありませんでしたたまに過去にあったっていうのは聞いてるんですけどでも車のメーカーってその販売会社とその本社って別の会社なんですよ日産とその日産のディーラーって別の会社なんでなんかその本社の人が来るとなんかちょっとなんか嫌にちょっとなんか怖いねみたいな何言われんだみたいな感じもありますし日産コネクトを売っても彼らのモチベーションにはならないんですよねなんでそこのモチベーション設計というかまあ構造的な問題はあるにしてもあのまあ僕たちがそのエンドユーザーに対してその日産コネクト買ってくださいっていうふうなプレゼンをすることはあのありませんでしたがあの日産コネクトあるいは日産コネクトファンコミュニティみたいなのがあって日産の車大好きですよみたいな人たちに向けてその休日にイベントをやってあの日産コネクトいつも使ってくださってありがとうございますちなみに何かあの使いにくいとこってありますかね実はこういう機能を考えているんですよとかっていうあのプレゼントよりはあのお客さんと一緒になってあのアプリの未来について考えようみたいなイベントはありましたねそこがまあエンドユーザーとの方々と話す機会だったかと思いますでまぁミーティングが多いっていうのはまぁ実際そうですねあの特に僕の肌感ですけど楽天と比べて日産はあのミーティングが多かったなと思いますねもうマジで1日中やってるみたいなときもあっいましたしいるのかなみたいな必要なのかなみたいなのもまああっなんで、エンドユーザーの方々と外部の方々と話す機会というのと内部の方々と話す機会を割合で言うと、ほんと99対1みたいな、95対5みたいな、。そのレベルでしたね。ちょっと流れ的には戻っちゃうんですけど、聞きたかったのが、英語を使うんですか?そう、それどういう形で生きるかみたいな話ちょっとあって、なんかスキップしたいですね。そうそう、。あのカナダ、ぶっちゃけカナダの経験、生きたの?それとも別に日本から行けたんじゃないの?みたいな、日本にいた時から、そもそもそもそもそのまま転職できたんじゃないの?みたいなのが聞きたくて。おっしゃる通りです。お願いします。あの、カナダの経験が生きたか生きてないかで言うと、もう死ぬほど生きてると思ってます。あの、もう日産でもそうですし、今もう生きてます。であの英語ももうガンガン使ってましたし今も使ってますねであのプロダクトマネージャーってあのほんとなんですかね仕事の抽象度が上がっていくにつれて知っておかないといけない領域って多くなっていくんですよね世の中で最も抽象的な仕事って社長さんだと思うんですよじゃああなたの売り上げ上げてくださいみたいだと思うんですけどやっぱりいろんなことを知ってないといけないとプロダクトマネージャーも比較的中小レイヤーの高い仕事なので新卒からプロダクトマネージャーになるってむっちゃむずいんですよねなんで営業やったことあるしエンジニアとして働いたことあるしっていうのはやっぱりプロダクトマネージャーとしての土俵に上がるにあたってめちゃくちゃ強い武器だったんですよそういう評価もリードワークもいただいてましたし日産ってなんだかんだ超絶グローバルな会社なんですよね160カ国ぐらいでサービスを展開してるのでアプリの仕様を一旦変えるってなったら日本はこれヨーロッパはこれ東南アジアはこれとか全部のリージョンを見ないといけないんでヨーロッパの人たちと会議しないといけないとかインドの開発部隊に支持をしないといけないとかめちゃくちゃあるんですよなんで僕が日本にいたウェブマーケティング会社から日産自動車のプロダクトオーナーに転職できたかっていうと不可能ではなかったかもしれないですけどイメージはつきづらいですよね。ちなみに何%ぐらい英語で話して、何%ぐらい日本語で話すんですか?結構その、もうその携わっていた案件にもよるんですけど、僕はなんかそのドイツのコンサル会社と一緒に進めている、なんかPOCのプロジェクトとかが日産にいたときにあったんで、まあ4、37か46ぐらいで、まあ4が英語。ぐらいの割合で話してましたね英語でミーティングをファシリティとすることもありましたし英語でドキュメントを書いたりするも全然あったって感じ。それってなんかみんな英語話せるんですかそれともひろし君だけ特別で結構だからみんなの助けなんか助けになってるみたいな感じなんです。かそれは正直、僕の英語力をよく買っていただいてたっていうのはありますね。みんなベース英語はできるんですけど、トイック700、800ぐらいは取れるんですけど、トイックって喋れる能力と全く別じゃないですか。だからやっぱり英語…理解はできるけどニガティ意識があるっていう人は多かったねなんであのー磯部さん英語できるからちょっとあのプロジェクトの背景はまた後で教えるから一旦会議入ってみたいなそういうのはまああったんで英語ができたことによって掴めたチャンスというか前に出ることができた機会っていうのはたくさんありましたねあとまあエンジニアの経験がある人ばかりではないんでそのエンジニアとのコミュニケーションでもなんか間に入らせてもらうことがたくさんあってエンジニアの人たちもなんか磯井さんみたいにエンジニアリングわかってる人がいると話が早いなはははみたいなこともまああったっていうのがあるのでそういった意味でカナダでのエンジニアの経験と英語をあのいっぱい使った経験っていうのはあのしっかり生きているそしたら。えっとまあそろそろ次の楽天の話を聞いていきたいなと思うんで最後に練習。聞いてもいいですかもちろんです。日産に初めて転職した時は700ちょいぐらいでした。700万ちょいぐらいだったと思います。楽天では900ぐらいです。じゃあ700ってことは、カナダから行く時にもう既に多分就職を決めてから行かれたんですよね。その時点ではちょっと落とした感じになるんですね。まあそうですね。やっぱその、言うてプロダクトマネージャーとしては未経験だったんでできるだけ、やっぱ高い年収を提示しすぎると落ちちゃうみたいなこともあるんで、そこはなかなか難しいんですけど現年収みたいな格乱があったんですけど、いや一旦ここは気にしないでいいですよみたいなことを言いながら面接とか。やってたちなみにpdmってどういう感じのなんだろうレンジというか今のひろし君の楽天とかその日産とかのレベルだとどのぐらいの給料がジュニアインターミネートシニアみたいなでもらえるんです。かまずジュニアでも多分600は全然狙えると思うんですよね。日本って平均年収400とか。平均年収って、あの統計ってその非正規とかも入っているんで、あまりこう実情と表しているかとかちょっとわかんないけど、エンジニアよりは少なくとも高く、レンジとしては高くて。1000万とかのレンジはまだ余裕で狙えると思うんですよね、プロダクトマネージャーは。で、僕が目標として持ってるのは40歳までに年収2000万に行きたいなっていうふうに思ってるんですで、これは簡単な目標ではないんですけど逆に非現実的でもないと思ってるんですよ今のたくさんの低成熟エージェントの話を聞いたりとか普段もプロダクトマネジメント系の本とか読んだりしたりしてるんですけど肌感的には死ぬ気で頑張ったら多分2000万いけるなっていう感じですね、。年収的にはそれはちなみになんか広瀬くんこっちで働いたことあるんでわかると思うんですけどあのこっちのビッグテックみたいなそのぐらいのイメージなんですかそれともなんだろう本当結構なんだろうそんなになかなかそのぐらいの人は見かけないぐらいのレベルのまあなかなか2000もらえる人。っていうのは難しいと思います。プロダクトマネージャーになったら2000万は硬いよねってことは決してないと思いますが、楽天でも多分いけるっちゃいけると思う。楽天はそこそこ払いがいい会社だと思うんですよね。僕まだプロダクトマネージャーとして2年目とかでそれだけの給料をもらえるってなかなかないと思うんですよ。で年収の話とかも面接の中でしていく中でなんか磯吹さんどれぐらい稼ぎたいんですかみたいな話あった時にいやーなんかこれぐらい欲しいんですよねみたいなあーいけると思いますよみたいな感じだったんでまあ簡単ではないとは思いますしその割合としても低いとは思いますけど可能ではないなんかちゃんと頑張ればみんな1000万はいけんじゃないかなっていう感じはしますね。結構夢ありますね日本で。EDMで2000万かいいと思いますよ狙うべきって言うとちょっとあれですけどいい選択肢だと思います。ちなみになんかあの楽天以外でどういうところがpdmではなんか強いというかこういうところ行きたいみたいなってある。んですかそうですねまあ。今転職したばっかりだと思うんであんまりないかも。しれないですけど業界プロダクトマネジメント強いっていうとなんだろうな、まあメルカリとかはやっぱいいと思いますねやっぱ強いんだラクテンもなんだかんだラクテンって70個ぐらいのサービスがあるんですよねそのラクテン銀行とかラクテン証券とかそういった意味でいろんなEDMがいるんですよでラクテンもラクテンプロジェクトマネジメントメソッドみたいなのがあったりとかで、プロダクトマネジメントとプロジェクトマネジメントって結構違うにしてもちょっと重複する部分があったりとかするので、結構ノウハウを学ぶには良い環境かなというふうに思いますね。あとはAmazonとかそういうの、AmazonJapanとかももちろん選択肢に入ると思うんだけど、日本で言うとやっぱメガベンチャーに類似されるところっていうのはいいんじゃないですかね、サイバーエージェントとかも。エンジニアとしてもいいところがPDMとしても働きやすかったり結構いい金額が狙えるって感じなんですねどう。なんですかねそこ楽天はですねエンジニアに対してあのもう給料そこそこいいんですけど社長がエンジニアじゃないんでそのデベロッパーエクスペリエンスがいい話はあんまり聞いたことないんですよ僕みたいにそのビジネス属性が強い人間だとあの面白いんですよねあのやっぱなんかすごいスピードでサービスが出来上がってなくなってでなんかあのすごいスピードで意思決定がなされてみたいなのあるんですけどそこにそのなんですかねデベロッパー向けの環境が整い切ってないとかっていうのはまあもしかしたらちょっとあるかもないですがあのデベロッパーエクスペリエンスの高い会社みたいなのがたまにランキングとして出たりするんですけどでもあんまり上にいなかった逆にサイバーエージェントとか上にいてレイヤーエックスとかもあまりトップだようなであのプロダクトマネージャーとしてそのちょうどの高い領域であの力をつきたい面白い仕事がしたいっていうのとまああのまあエンジニアとしてもどこに重きを置くかによってあると思うんですけどデベロッパーエクスペリエンスはちょっとまああのやや違う地区かなというふうに。思いそうなんですねそしたらさっきちょっと楽天でも全然英語を使うよみたいな感じで聞いたんですけど具体的にはどんな感じの業務されててどのぐらい英語を使って仕事され。てるんですかえっとまあ仕事内容としては結構あの日産と似てるんですよねそのビジネス部署からの要件があってそれをあのテクニカルに分解をしてであのエンジニアチームを動かしていくというところがあるんですけどあの一つ違うのはそのkpiに対するあの認識の重さというかあのに車ってなんかも超絶複雑な機械なんでその仕様を理解するだけでももうむちゃくちゃ大変なんですよなんでそのプロダクトオーナーがkpiを追ってる暇なんてないわけなんですよねなんかなんでその鳥まあめちゃめちゃ乱暴に言うとその車の部品を作る部署とまあ扱い的には同じタイヤを作ったりしている部署を作ったりしている部署とアプリを作っている部署はあの基本的にはそんなに認識としては変わらない僕らはkpa責任はなかったわけであの加入者がどれだけ減ってるとかあんまり何も言われなかった僕はやってましたけどやってなかったでもあの楽天のプロダクトマネージャーはあの物流業あの分野のあのプロダクトマネージャーなんですねなので1ピースあたりに買ったコストがどれぐらい下がりましたこのプロジェクトをやると1ピースあたり0。\n2円下がる予定ですというのをちゃんと部署単位で共有して少しずつ前に進むというところがまあ違いですね楽天全体としてもやっぱり数字でもノートを考えて前に進めていこうという文化が非常に強いのでそこが違いかなと思いますがまあ大まかに言うと仕事内容はあの日産でやっていたことの延長線あるとは思います英語をどんな場面で使っているかというとですね、楽天ってその非日本人の方々を無茶無茶積極的に採用しているんですよ。我々の部署は中でも外国人比率、非日本人比率が高い部署でして、エンジニアは日本人ほぼいないんですよね。でその中で僕たちはエンジニアの人たちに開発要件をインプットしてコミュニケーションをたくさん取らないというミーティングももちろんそうですけど行っていけないとでインドの開発部隊とかもあるのでそういったコミュニケーションの場がたくさんありますで仕様書を書くのも今は担当しているプロダクトにもよるんですけど今はほぼ英語ですね。そのさっき聞いた感じだとやっぱなんかサースの会社だからってなんかkpiのあたりはサースの会社だからってのもありそうな感じですよねこっちのなんかサースの会社とかもやっぱkpiとかまぁ結構追いながらプロダクトオーナーとかえっとpdプロダクトマネージャーとかが結構そこらへんを追いながら仕事してるって感じだと思うんでなんかそうですねそれが業界によりっていうのはありそうです日本。内で転職した時とかにあの面接たくさんあると思うんですけど具体的にどういう内容だったのか気になるのであと英語力ってどういうふうに証明していくんですか?なんか英語力はなんか正直あんま聞かれなかったですねまぁでもカナダで就活してされてました。っていうと日本はそれで信じてもらえますよね。信じてもらえる。でも正直、英語ないと死にますよとかっていうことを聞かれたことはほとんどなくて、まくまで英語はツールであるっていうの。英語を使ってどんなことしてましたかっていうのを聞かれる前に僕は言ってたっていうのはありますけど、そこに重点が置かれてたような気がしますね。なんで聞かれる内容としては、日産の時はそうですね、チームを動かすためにどんなことを心がけてますかなんか職場に嫌いな人がいたらどうしますかとかやっぱステークホルダーマネジメントってそのプロダクトプロジェクトマネージャーもそうだと思うけどそのプロダクトマネジメントの中でもっともあの重要と言って過言ではないぐらいのものなんですよねそっち系の話を聞かれることが多かったんですね楽天だとデータに基づいてデータドリブンで何か意思決定をして定量的な形で測れる形で出た成果に関するなんかエピソードってありますかとかあとは英語について言うとちなみに英語は健在ですかみたいなはいって言ったら終わりみたいな。業務をする中でずっと英語を使うから、カナダで使っていたものもキープしつつ、もちろんその業種やってる内容によって違うボキャブラリーが必要だったりとかするから、ちょっとずつアップデートしていってっていう感じですか?そうですね。カナダにいてもアップデート全然。できてない気がする。英語が…もちろんネイティブの人とかも楽天、隣にいるインドネシア人は英語ネイティブの人なんで、いまだになんか教えてもらったりするんですけど、でも英語が自由に話せるっていう人ばっかりじゃないんで、僕が引っ張っていかないといけないという場面が体にカナダに行った時よりも多いような気がするんです。日産の時もそうでしたけど、だからこそ、ちゃんと勉強しないといけないなっていうので、カナダに行った時よりも英語の勉強の習慣は根付いてるような気もします。それすごいですね。やっぱり思います。カナダにいれば、何もしなくても入ってくるじゃないですか、英語が自動的に。だからちょっとそれで満足しちゃって、やらないとかって、私も実際、意識しないで、本当に何もやってないなって危機感を覚えることがあるんですけど、それって日本にいると、やっぱりその意識がちゃんとやらなきゃってなって、やる人が多いって聞くので、すごいいいことだなって思います、むしろ。ちなみに、やっぱりとはいえ、日本に行くと英語を使う機会は減るじゃないですか。英語はまだやっぱり健在なんですか?でも正直、カナダにいた時より上達してると思います。おーすごい。やっぱじゃあそれはもう自分で勉強するからって感じなんですか?自分で勉強もしますし、そのやっぱカナダの職場って、カナダにもいろんな職場があるんで、その一概に言うという意味ではないんですけど、僕が行った職場もなんか超絶緩かったんで、そのなんかあのまあなんかストリートイングリッシュみたいな感じでも、まあなんとかなるみたいな。で、。そのコミュニケーションをたくさん取らないといけないポジションでもなかったので、今の方がみんなの前で英語を喋るし、偉い人に対してそのなんかなんじゃ英語でプレゼンしないといけないもうよりプロフェッショナルな場面でプロフェッショナルな英語を話さないといけないっていう場面が増えた感覚があるんでやっぱなんかそこでなんかあの陽明みたいな感じの英語喋れねぇなみたいなとかあるってちょっとなんかちゃんとビジネスっぽい英語を話せるようにならないとなぁもっと上を目指すんだったらそのプロフェッショナルな英語をもっとちゃんと運用できるようにならないとなっていう意識が日本に帰ってきたからより強くなった感覚がある。っていうのはあります個人的に気になるんですけど、どういう風に勉強されたとかあります?私、最近の経験で、エンジニアなんで、そこまで常に英語で発表するとかなかったんですけど、今チームが変わって、ディスカバリーフェイズみたいなので、リサーチしたりするのが増えて、それを発表しないといけない機会が、この1ヶ月すごい増えて、すごいストレスなんですよ。プレゼンの場が。今までも多かったんですけど、格段に増えて、失業等とかもあって、私結構緊張シーンなんで、そういうのすごいストレスに思っちゃって、あ、うまくいかなかったなとかストレスになるんですけど、そのスキルを上げたとか、いろいろ打ち勝っていったスキル、何だろう、。術とかあります?自ら進んで恥ずかしい思いをして血を流すというのはすごくいい勉強だと思うんで、そういう機会を経て学ぶっていうのはあるんですけど、僕毎日情報収集の習慣というかニュースレターとかRSとかでいろいろ記事を読んだりニュースキャッチアップしたりするんですけど、その中で英語を毎日読むっていうのと、あと耳が空いている時は基本的にずっと英語系のポッドキャストを聞いて、ずっとシャドウイングしてるっていうのがありますね。いろんなポッドキャストがありますけど、シャドウイングする中でですね、ちゃんと自分が意味を理解しながらできる、シャドウイングできるスピードの限界みたいなのを探るっていく。それがもしかしたら1。\n5倍かもしれないし2倍かもしれないんですけど、それでなんかそのギリギリの線を攻めながら歩きながらシャドウイングする、そういうなんかそのマルチタスクで負荷をかけるっていう、これがなんか結構僕の英語能をうまく刺激してる感じがあるんですよね。そんな感じですね。すごい。しゃべる練習とかはしないんですか?しゃべる練習は普段仕事でやるって感じですね。実践で。そうですね。実践でこれなんて言うといいんだろうなみたいな場面とかってあると思うんですけど、なんか英語の記事をたくさん読んだりそのビジネス系の英語のポッドキャストを聞いたりしてるとなんかこういうフレーズがあるんだじゃあこれ次から使ってみようとかって言って実際に使ったりとか実際に使ってみてなんかそれちょっと違うよみたいな指摘があったらうわなんかミスった恥ずかしいみたいなそれも一生一生忘れないみたいなそんな繰り返し。ですかね確かにちょっと話戻っちゃうんだけど、そういえばPMってめっちゃ喋りますもんね。確かにこっちの英語で、こっちでエンジニアやるよりも日本の英語環境でPMやる方が確かに英語喋ってるかもしれないけど。絶対その方が喋るし、プレッシャーかかる場面もたくさんあると思うし、その方が絶対。伸びてるんだろうなって思い。ますエンジニアの方々ってその作ったものに対して熱い思いを持っているんでそのなんかプレゼンする場所でもそうなんかわーっ喋っちゃうとかってあるんですけどそれをなんかうまくそのなんかビジネス側の人たちはそんな具体のとこって興味がないないわけじゃないんですけどそこにあの注意を払ってる時間はないんでこのコミュニケーションの交通整理をするっていうかねエンジニアの人たちの気を悪くしない程度になんかまあちょっと今はこのフェーズじゃないですよねみたいな感じでうまくその会話会議の場を取り持つみたいなことを英語でやらないといけない場面があるんですよそういうことってやっぱあのエンジニアとして働いている中ではなかった気がするのでやっぱなんだか意外とあるって感じですねその英語を使える場面は。そしたら、あと質問2つあるんですけど、1つ目は今後のキャリアの展望、さっきなんかちょっと40代までに2000万みたいなのはあったと思うんですけど、なんかやりたいこととか、あとあの日本に帰るときにやっぱりその日本のためになるようなことみたいな感じで思ってたと思うんですけど、なんかどういうふうにいこうかなみたいなのはあるんですか、これから。そうですね40歳で2000万みたいなのがすごい分かりやすいハードの目標として持ってるっていう感じなんですけどじゃあ中身はどうなんだところで言うとですねプロダクトマネジメントということと英語っていうのは掛け算としてずっと向こう4,5年は高めていきたいなところがありますねそれに加えてもう1個専門分野が掛け合わさったようなプロダクトマネージャーとしてだから掛け算をいろいろ増やすことによって希少性を上げるという意味ですね今でいうと楽天の物流分野のプロダクトマネージャーなので英語とプロダクトマネジメントと物流っていう掛け算が今の僕にはあるんですねそういう、その3つ目の掛け算の専門分野っていうのは今後4,5年とかで変わっていくかもしれないんですけど、その3つの掛け算っていうのは今のところちょっとずっと高めていきたいと、もっともっとその自分の仕事の抽象度を上げていきたいっていうのはありますね。えっとまぁもしまあねそのチャットgptっても5年前とかまだ存在をしてなかったくらいの感覚かなと思うんでまあ4-5年たちともしかしたらプロダクトマネージャーがもうなんかいらないみたいになっている可能性もまあゼロではいうのはあると思うのでその4-5年の状況4-5年先の状況ってのはわかんないけど今あの持ってるビジョンというかあのし向こうし5年でやりたいことっていうのはあのそういうことですかねであのまあ物流ってあのまあ入ってみて気づいたんですまあ学んだんですけど結構その日本でもホットな分野というかあのまあecがすごい高成長していってですね宅配暗いしともあったりとかであの物流をいかにその効率化していくかであのは物流現場ってやっぱ労働環境がまだまだ改善のうちがあってトラックドライバーの人たちも基本的に残業80時間してるよみたいなそういう環境なんで僕たちがその効率化できるようなそのプロデュクトプロダクトをたくさん作っていくことによってそのなんだろうなあの働いている人たちがもっと楽しくであの日本の物流をもっともっとそのよくいうあのことができていきそうできてい楽天ではできそうだなという感覚が今のところはあるんであのまずはここでそういう結果を出していくっていうのがまああの自分の中の目標ですかそしたら、。広瀬くん的にはやっぱ海外での経験が生きての今のPDMの仕事だったり、今の楽天でのとか、前者での実績があると思うんですけど、なんか広瀬くんみたいに留学とか渡航を考える人になんかアドバイスがあればお願いします。そうですねまずその気になるちょっとじゃあカナダ気になるなって言うんだったらその超具体的に資金計画とかあの立ててみるっていうのをなんかおすすめしたいですね計画立てること自体はノーリスクだと思うんでその具体的に学校行ってそこをそこをして学校行って就職っていうことをあの具体的に計画立てようとなるともうなんか考えないといけないこととか調べないといけないことめっちゃあるじゃないですかめんどくさいことがたくさんあると思うんですよそのめんどくさいことを目の前にしてやっぱいいかなってなる人も結構多いと思うんでまずはなんかそこでもういいやってなったらそれまでのことなんで多分行かない方がいいんですよであのそういった意味でまずはちょっとスモールスタートで何か具体的に計画を立ててみてそれで本当に自分の心がワクワクするのかなみたいなあのところから始めるというのがあのおすすめしたいところですかねすごく広。しくらしくていいアドバイスだなぁ僕は割とあもうとりあえず言っちゃえばみたいな感じだなぁでもね、計画すごい大切だし、今は特にね、ビザとか、英住権とかカナダでも難しくなってきてるから、やっぱりそこらへんの計画はね、日本にいるうちにやってほしいなと思いますね。はい、。ありがとうございました。ありがとうございました。ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "はいそれでは今回も前回に引き続き広瀬さんに来ていただきました前回はこっちカナダにいた時の練習とか働き方について聞いてきたんですけど広瀬君ってあれですよね日本に帰るタイミングってエンジニアからBDMに変えてるじゃないですかまずちょっとそこから聞いていきたいんですけどざっくりなんでエンジニア辞めちゃったんですか。",
      "start": 168,
      "end": 26639,
      "timestamp": "00:00"
    },
    {
      "speaker": "Hiroshi",
      "text": "まあそれはもちろんまず第一にその別にネガティブな思いがあったわけじゃないとエンジニア面白くねーなみたいなことは思ってたことは絶対にないむしろもう面白くていい仕事だとは思ってたっていうのが大前提としてあるんですけれどもまあ初めはあの日本にじゃあちょっと帰ろうかなっていうところから始まったでその中であの日本に帰るんだったらpdプロダクトマネジメント系で働くのがいいかもしれないっていうのがまあ一番大きなざっくりとした流れですねでなんでまあ日本に帰ろうと思ったかというところではあるんですけどあのそうですねえっと20203年の末とかだったかなあの8エクスプレスエントリーかあのの点数があのいいとこまで行っていわゆるあのあれなんてitaかitaをもらったんです。",
      "start": 27759,
      "end": 79683,
      "timestamp": "00:27"
    },
    {
      "speaker": "Ryo",
      "text": "よであついにエキスプレスエントリーは永住県のエクスプレスエントリーかなあそういうのはいはい。",
      "start": 79683,
      "end": 85590,
      "timestamp": "01:19"
    },
    {
      "speaker": "Hiroshi",
      "text": "で、ITAというのはインビテーションとアプライですね。それをもって永住権を申請すれば9割ぐらいの確率でちゃんとカナダの永住権が取れますよというものでしたよね、確か。それもらって、じゃあここまで来たかみたいな感じで、よしよしみたいな感じで思ってたんですけど、永住するってなると、ちょっとこう自分の人生をちょっとロングタームで考えるきっかけになったというか、じゃあパラダに永住するのかでまぁ一番うまくあのキャリアがうまくいったパターンとしてそのビッグテックでエンジニアとしてバリバリやる感じだよなぁみたいなそれはそれで魅力的だけどなんかこうどうなんだろうこれってなんか本当に自分がときめく人生のプランなのかなぁみたいなことぼんやり思ってあんですよでそのタイミングで1回その日本に帰国することがあってであの僕のお姉ちゃんがあの子供ができましたって言って追いっこができるってなってであの父親も親もあの70歳とか超えてきてなんかあのもうちょっとこの身の回りの人たちとあの一緒に過ごす時間ってこれから大事になっていくのかもなぁみたいなことを思ったりもしたとそういった中で日本の本曲に対する思いが強くなってそんな中で森岡剛さんという方今ちょっと沖縄のテーマパークのジャングリアの文脈で話題になっているとマーケターの人なんですけどその人が将来の若者の日本人の食い口を作るために私は仕事をしている日本をもっと強くしたいんだみたいなことを熱く語っていてですねなんか僕もなんかそういう思いを持って働くことができたらあの自分としてはなんかちょっとワクワクするプランだなっていうふうに思ったんですよねだからまあだとしたら日本に帰ってそのまあ海外でやりたいことは今一通りできたっちゃできたんで日本に帰って日本のためにたらくみたいなあのことをするのがまあ総合的に考えて自分にとってはあの豊かな選択かなって思ったのがまあ日本に帰ったきっかけでしたねもちろんその辛かったですよそのカナダを後にするっていうのはまあ量産始めそのそっちでできた友達もねたくさんいたんであのまあこれはこれでつらいなとあの思ってたんですけどまああの方法的に見たらっていうまず一生会えなくなるわけでもないねありますけどまあというのがまあ日本をに本気かけでしたで8なぜまああのエンジニアを辞めてそのプロダクトマネジメントの界隈に足を踏み入れようとなったというきっかけで言うとですね初めはまあじゃあ日本でさが仕事を探そうってなった時にあのエンジニアの仕事で探してたんですよでえっとそんな中でまあとあるキャリアエージェントキャリアコンサルタントの人と話す機会があってあのエンジニアしか選択肢にありませんかみたいな話をされてですまあ正直それはめちゃめちゃこだわりがあったわけじゃないんですよ実際そのエンジニアとして働いた時もなんかそのタスクを整理したりとかあのお前のタスクの定義は甘いから俺が書き直すみたいなそういう場面があったりとかドキュメンテーションを書いたりとかっていうことはあったのでマネジメント系の仕事になるってなっても全然抵抗感はあったわけではないという中でですねじゃあどんな選択肢がありますかねって僕から聞くとですねもちろんそのエンジニアとしてのキャリアエンジニアリングマネージャーとしてのキャリアプロジェクトマネージャーとしてのキャリアプロダクトマネージャーとしてのキャリアそしてITコンサルとしてのキャリアこの辺が選択肢としてありますよというふうに提示してもらって今言った順に年収レンジとしては高くなっていくとITコンサルが一番高くてエンジニアリングマネージャーが一般的に言うと一番年収レンジとしては低いとエンジニアはそれよりももうちょっと日本の国内で言うと年収レンジが低いですよねみたいな話をした中でプロダクトマネージャーが磯部さんに一番合ってると思いますっていうふうに言われたんででそれはなぜかというとまあプロダクトマネージャーってそのもうめちゃめちゃコミュニケーションを取らないといけないんですよいろんな部署の人たちとで、まあ僕営業をやってたっていうこともあってそのコミュニケーション能力みたいなところの素地もありそうですしで、あのウェブマーケティングもやっていたとプロダクトマネージャーってプロダクトをグロースさせる仕事なのでどうやって人に知ってもらおうかみたいなあのところの観点も必要なので今までのイソベさんの経歴を見るとこの中だとプロダクトマネージャーが一番あってそうだと思いますっていうのが詰めていただいてそれがきっかけでしたか?",
      "start": 87518,
      "end": 382011,
      "timestamp": "01:27"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみにPDMがエンジニアより年収低かったらそのままエンジニアになってたんですか?それともやっぱり合ってるなって感じはあったんですか?いや僕から見てやっぱヒロシ君はめちゃくちゃPDM合ってると思いますよあのまあ結構ね長い付き合いだったし結構いろんなこと一緒にやったりもしてやっぱそのいろんな人とコミュニケーション取ったりなんかファシリテートするっていうんですか?みたいなのめちゃくちゃ得意だしあんまり何だろうその技術に興味があるとかそういう系のエンジニアってわけでもなかったんでなんかすごい合ってる。",
      "start": 382011,
      "end": 413993,
      "timestamp": "06:22"
    },
    {
      "speaker": "Hiroshi",
      "text": "なとは思うんですけど。",
      "start": 413993,
      "end": 415314,
      "timestamp": "06:53"
    },
    {
      "speaker": "Ryo",
      "text": "その年収多いのをプッシュしてくるじゃないですかあのリクルーターの人たちってそれってまあやっぱりその紹介した時にその人たちに入るお金とかのこともあるからやっぱり年収高いのの順にプッシュしたくなるのはまあしょうがないと思うんですよ確かに広瀬くん的にはそこはなんかどうだったのかなってちょっと。",
      "start": 415314,
      "end": 432602,
      "timestamp": "06:55"
    },
    {
      "speaker": "Hiroshi",
      "text": "思っていやーそこ難しいですねその観点で考えたことはなかったんだけどまあスタートの練習が例えばプロダクトマネージャーの方が将来的には上がりますよみたいな感じだったらまだプロダクトマネージャーだったかもしれないですけどなんかどうあがいてもエンジニアの方が練習レンジ高いっしょみたいな感じだとちょっと考えたか。",
      "start": 432602,
      "end": 458352,
      "timestamp": "07:12"
    },
    {
      "speaker": "Ryo",
      "text": "もしれないね結構フレキシブルそこら辺はフレキシブルだったかなって感じなんですね。",
      "start": 458352,
      "end": 461815,
      "timestamp": "07:38"
    },
    {
      "speaker": "Ayaka",
      "text": "そうですねはい疑問に思ったのがそういうふうにPMだとかITコンサルとかのこれからのキャリアの選択肢を上げてもらっていく中で日本で転職するってなった時にそのスペシフィックな業種に対して職種に対して経歴なくても飛び込めちゃう本なんですかなんかこっちだと、カナダだとあんまり経歴重視されちゃうから、いきなりPMになりたいって思ってもなれないことの方が多いんじゃないかなって思ったんですけど。",
      "start": 461815,
      "end": 500167,
      "timestamp": "07:41"
    },
    {
      "speaker": "Hiroshi",
      "text": "まあそうですね、そこは難しいポイントだと思います。でも、あのそうですね、おっしゃる通り、あの経験がないと、僕の肌感でもこう、カナダだとなかなか箸にも棒にもかからんみたいな可能性は高いような気はするんですけど、日本の方がまだその、ポテンシャルを買ってくれるような雰囲気があるような気がしますねあとはそのエージェントを通してだとこの人はこういう措置を持っていてプロダクトマネージャーとしての素養は確実にあると思いますとかそういう推薦をしてくれたりするんですよでレジュメの添削とかもしてくれますしまずはここを訴求していくこの軸で訴求してくださいとかいうのがあるで僕もそのプロダクトマネージャーの仕事に対してきちんと理解してたわけじゃないんでなんか何が僕と僕の何が合ってるんですかとか具体的にプロダクトマネージャーってどんな仕事をするんですかみたいなことを聞いていく中で確かにできそうだな経験はないけど、自分の強みとか今までの経験がめっちゃいい形でお金に変えられるなっていう感覚がどんどんどんどん話を聞いていく中で積み上がってきたみたいな。それで、受からなければ辞めればいいし、エンジニアとして専属すればいいし、とりあえずPDM軸で1回やってみるか。キャリアコンサルタント、複数のキャリアコンサルタントの方から、アリスベストさん絶対PDMになったほうがいいですよ、みたいなことを、まぁ、あの、まぁその、りょうさんの言うように、その、Pのバックグラウンドみたいなのがちょっとあったのかもしんないですけど、まぁちょっとお勧めいただいたっていうのがあって、まぁ信じてみようというので、あの、挑戦したという感じですかね。答えになってます。",
      "start": 500167,
      "end": 600189,
      "timestamp": "08:20"
    },
    {
      "speaker": "Ayaka",
      "text": "りょうさんいやぁ、。",
      "start": 600189,
      "end": 601349,
      "timestamp": "10:00"
    },
    {
      "speaker": "Hiroshi",
      "text": "はい。",
      "start": 601349,
      "end": 601760,
      "timestamp": "10:01"
    },
    {
      "speaker": "Ayaka",
      "text": "え、じゃあその、お会いしたコンサルタントの、キャリアコンサルタントの何人かお会いしたっておっしゃってたんですか?",
      "start": 601760,
      "end": 606822,
      "timestamp": "10:01"
    },
    {
      "speaker": "Hiroshi",
      "text": "アリスベストはい、そうですね。",
      "start": 606822,
      "end": 608510,
      "timestamp": "10:06"
    },
    {
      "speaker": "Ayaka",
      "text": "だいぶ自分のそのなんですか今後のキャリープランをちょっと整理するのにだいぶお話しして助けてもらって良かったっていう感じですかあんまりキャリーあーそうですね転職エージェントって私あんまり良い印象なかったんですけどその話を聞くと私もなんかちょっと自分のキャリアとか誰かに一緒に考えてもらいたいな。",
      "start": 608520,
      "end": 631959,
      "timestamp": "10:08"
    },
    {
      "speaker": "Hiroshi",
      "text": "とか思っちゃう転職エージェントは使いようですねおっしゃるように自分の職業選びのハンドルを向こうに握らせるとやられますねでも複数の転職エージェントに話を聞きつつ自分で情報収集もしつつあくまで転職エージェントを情報源として使うっていうスタンスだと僕は転職エージェントはもうむちゃくちゃいいサービスだと思ってます。",
      "start": 631959,
      "end": 658637,
      "timestamp": "10:31"
    },
    {
      "speaker": "Ryo",
      "text": "僕も結構日本の転職エージェントはありだなって思ってて、日本ってそこら辺多分特別で、転職エージェントを使った時に会社からのキックバックが30%から50%、年収の30%から50%をその入るんですよね他の国だとそういうのってないじゃないですかだから結構もともとあの日本に行った時に外資系のitのコンサルみたいな会社にいたんですけどそういうの稀らしくて結構いつもそのだから海外からそこにそこの費用について続かれるみたいなのを聞いてて確かにそうだなって思いますよねなんだろうそのその転職の人たちはサポートして結構その年収の30%から50%だと結構いいお金が動くわけじゃないですかだから何だろう熱心に聞いて色々教えてくれたりだとかレジュメの添削してくれたりだとかやってくれると思うんで確かにそのひろし君の言うように相手にその自分の行くところだとあったりとかのなんかハンドルを握られたら確かにそのね高い順にやっていけば自分の年収上がるみたいなまあ自分のそのお金入ってくるやつマージンじゃないけどまあいいやまあ自責でいいかになると思うんでありだけどあのそこらへんが握られなければね確かにいろんな情報をくれるだろうしアドバイスもしてくれるしこういうなんか聞くところによるとこういう問題が出るんでみたいなのを結構教えてくれたりする面接で何が出るかみたいなのを教えてくれたりするみたいな話なんでまぁなんか日本でね転職するならどんどん使っていきたいなって思いますねそうですねそしたら、せっかくなんで、日本に帰ってきて1社目、日産だったと思うんですけど、仕事内容とか、カナダで働いて、その経験を踏まえて、カルチャーギャップみたいなのとかあったらちょっと教えてください。",
      "start": 660215,
      "end": 774081,
      "timestamp": "11:00"
    },
    {
      "speaker": "Hiroshi",
      "text": "まあそうですねカルチャーギャップから行くとそのまあもともと日本で働いてたことあったんでまああのそんなもんだろうなという感じはありましたけどまあやっぱみんな仕事頑張りますよねめっちゃあの残業とかも全然するしでもだからといってなんかやらされている空気はなかったんでまぁみんなその熱心に仕事をしましたねモチベーション高かったと思いますあの僕らの部署あの今アプリを作る部署なのでそのまにさんにもいろんな巨大な組織なのでいろんな部署があって中には本当になんかダラダラやってるだけど部署とかもまああるかもしれないとあのまあカナダとの違いこそありましたけど自分の中で思ってたのとちげーよみたいなそういうネガティブなギャップみたいなのは特になかったなと思いますねで仕事内容で言うとあの日産コネクトというですねあのコネクテッドカーのアプリがありましてでそれはどういう内容かというとまああの遠隔で車を施錠できますとかあの乗る前に暑い日だったらあのあらかじめエアコンをつけておいてあのだな乗った時に涼しいでみたいなそういう盗難防止とかそういうのそういう系のアプリですねアプリのプロダクトオーナーというタイトルでしたけれどもプロダクトマネージャーと割と似通った内容かなと思いますまずはビジネス部署みたいなところがあってこういうことやりたいんだよねっていう大きな要望が来てそれを開発の要件に落としていくという感じですねじゃあこういう要件があって技術的に今のインフラでできるんですかとか何か導入するんだとしたらどれぐらいのコストがかかりそうかなとかっていうのをエンジニアのプロジェクトマネージャーの人たちと揉みながら要件定義書なりを作っていって最終的には仕様書を作るアプリはこの画面はここのボタンを押したらこういう挙動をしてこういうエラーが出た時はこんなリアクションを出してくださいとかそんな仕事内容でしたね最終的なアウトプットは仕様書を作ってデベロッパーに開発要件をインプットするとそんな内容でしたね。",
      "start": 774091,
      "end": 911431,
      "timestamp": "12:54"
    },
    {
      "speaker": "Ryo",
      "text": "なんかさっきあの違いは結構あったっていうふうに言われてたと思うんですけど具体的にどんな違いがあったんです。",
      "start": 913732,
      "end": 920056,
      "timestamp": "15:13"
    },
    {
      "speaker": "Hiroshi",
      "text": "かまあこれ言うとちょっとやっぱネガティブに響いちゃうなんかなかなか言葉を選ばないといけないなと思うんですけどで。",
      "start": 920056,
      "end": 927860,
      "timestamp": "15:20"
    },
    {
      "speaker": "Ryo",
      "text": "もそれもリアルだと思うんでいいんじゃないです。",
      "start": 927860,
      "end": 929501,
      "timestamp": "15:27"
    },
    {
      "speaker": "Hiroshi",
      "text": "かまあそうですねなかなかまあ上の人たちが言ったことをちゃんと聞きましょうっていうのとかあとはまあその夕方6時から7時までの会議が簡単に入るとかそういう労働時間に対する捉え方60時間ぐらい残業してる人がいても何も言われないみたいな短くしようという動きがあまりないこれやんなくても死なない会議だよなっていうのをこっから僕がその提案してこれちょっと短くしてもいいんじゃないですかとか最悪なくしても死なないんじゃないですか今こういう状況だしみたいなこと言ってもなんかでも前からやってるしなかなか歴史のあるやつだしとか言ってなんかこうちょっとお茶を濁されるみたいなのはまあなんかいわゆる、西さんも言うて、アプリ開発の部署はすごい先進的な部署だとは思うんですけど、なんだかんだJT、avaJapanesTraditonalCompanyなので、そういう制約の大きい部分はあって感じですかね。",
      "start": 929501,
      "end": 1001279,
      "timestamp": "15:29"
    },
    {
      "speaker": "Ryo",
      "text": "そこはじゃあ、ひろしくん的にはそんなにネガティブには捉えてはいないって感じなんですね。",
      "start": 1001279,
      "end": 1006007,
      "timestamp": "16:41"
    },
    {
      "speaker": "Hiroshi",
      "text": "まあそうですねあのこういう問題はなってまあもともとその日本のメガバンクっていうそのjtcのゴンゲみたいなところにいたんでまあなんかそういうとこもんだよねっていう感じちなみにあの細かい。",
      "start": 1006017,
      "end": 1017204,
      "timestamp": "16:46"
    },
    {
      "speaker": "Ryo",
      "text": "ところなんですけど8時から6時働くの?9時から6時?",
      "start": 1017204,
      "end": 1022687,
      "timestamp": "16:57"
    },
    {
      "speaker": "Hiroshi",
      "text": "えーと定時はフレックスだったんですけど一応9時から6時ですねやっぱりそうなん。",
      "start": 1022687,
      "end": 1029491,
      "timestamp": "17:02"
    },
    {
      "speaker": "Ryo",
      "text": "ですねあのそれこそちょっと前にあのK君あの多分知ってると思うんですけどのあのインタビューをしたときに、彼の会社でも、外資なんだけど、9時、6時で、そこの1時間について結構、やだなーって言ってたんで。やっぱ日本の会社は6時までなんですね。",
      "start": 1029491,
      "end": 1049041,
      "timestamp": "17:09"
    },
    {
      "speaker": "Hiroshi",
      "text": "そうですね。",
      "start": 1049041,
      "end": 1050782,
      "timestamp": "17:29"
    },
    {
      "speaker": "Ayaka",
      "text": "プロダクトマネージャーになったときって、外部の人、お客さんと関わる機会とかも、プレゼンする機会とかありそうだなと思ったんですけど、割合としては、1日中ミーティングしてるイメージが私はあるんですけどどんな具体的にミーティングの量だったり社内か社外かどれくらいの割合でコミュニケーションしたり。",
      "start": 1050782,
      "end": 1076888,
      "timestamp": "17:30"
    },
    {
      "speaker": "Hiroshi",
      "text": "するんですかそうですね日産コネクトのアプリの場合はエンドユーザーとの接点ってディーラーなんですよねで僕たち開発部はディーラーに出向いてなんかプレゼンするってことはほぼなかった全くありませんでしたたまに過去にあったっていうのは聞いてるんですけどでも車のメーカーってその販売会社とその本社って別の会社なんですよ日産とその日産のディーラーって別の会社なんでなんかその本社の人が来るとなんかちょっとなんか嫌にちょっとなんか怖いねみたいな何言われんだみたいな感じもありますし日産コネクトを売っても彼らのモチベーションにはならないんですよねなんでそこのモチベーション設計というかまあ構造的な問題はあるにしてもあのまあ僕たちがそのエンドユーザーに対してその日産コネクト買ってくださいっていうふうなプレゼンをすることはあのありませんでしたがあの日産コネクトあるいは日産コネクトファンコミュニティみたいなのがあって日産の車大好きですよみたいな人たちに向けてその休日にイベントをやってあの日産コネクトいつも使ってくださってありがとうございますちなみに何かあの使いにくいとこってありますかね実はこういう機能を考えているんですよとかっていうあのプレゼントよりはあのお客さんと一緒になってあのアプリの未来について考えようみたいなイベントはありましたねそこがまあエンドユーザーとの方々と話す機会だったかと思いますでまぁミーティングが多いっていうのはまぁ実際そうですねあの特に僕の肌感ですけど楽天と比べて日産はあのミーティングが多かったなと思いますねもうマジで1日中やってるみたいなときもあっいましたしいるのかなみたいな必要なのかなみたいなのもまああっなんで、エンドユーザーの方々と外部の方々と話す機会というのと内部の方々と話す機会を割合で言うと、ほんと99対1みたいな、95対5みたいな、。",
      "start": 1076888,
      "end": 1200646,
      "timestamp": "17:56"
    },
    {
      "speaker": "Ayaka",
      "text": "そのレベルでしたね。",
      "start": 1200646,
      "end": 1205341,
      "timestamp": "20:00"
    },
    {
      "speaker": "Ryo",
      "text": "ちょっと流れ的には戻っちゃうんですけど、聞きたかったのが、英語を使うんですか?",
      "start": 1205341,
      "end": 1212402,
      "timestamp": "20:05"
    },
    {
      "speaker": "Hiroshi",
      "text": "そう、それどういう形で生きるかみたいな話ちょっとあって、なんかスキップしたいですね。そうそう、。",
      "start": 1212412,
      "end": 1217264,
      "timestamp": "20:12"
    },
    {
      "speaker": "Ryo",
      "text": "あのカナダ、ぶっちゃけカナダの経験、生きたの?それとも別に日本から行けたんじゃないの?みたいな、日本にいた時から、そもそもそもそもそのまま転職できたんじゃないの?みたいなのが聞きたくて。",
      "start": 1217264,
      "end": 1229629,
      "timestamp": "20:17"
    },
    {
      "speaker": "Hiroshi",
      "text": "おっしゃる通りです。",
      "start": 1229629,
      "end": 1230189,
      "timestamp": "20:29"
    },
    {
      "speaker": "Ryo",
      "text": "お願いします。",
      "start": 1230189,
      "end": 1230790,
      "timestamp": "20:30"
    },
    {
      "speaker": "Hiroshi",
      "text": "あの、カナダの経験が生きたか生きてないかで言うと、もう死ぬほど生きてると思ってます。あの、もう日産でもそうですし、今もう生きてます。であの英語ももうガンガン使ってましたし今も使ってますねであのプロダクトマネージャーってあのほんとなんですかね仕事の抽象度が上がっていくにつれて知っておかないといけない領域って多くなっていくんですよね世の中で最も抽象的な仕事って社長さんだと思うんですよじゃああなたの売り上げ上げてくださいみたいだと思うんですけどやっぱりいろんなことを知ってないといけないとプロダクトマネージャーも比較的中小レイヤーの高い仕事なので新卒からプロダクトマネージャーになるってむっちゃむずいんですよねなんで営業やったことあるしエンジニアとして働いたことあるしっていうのはやっぱりプロダクトマネージャーとしての土俵に上がるにあたってめちゃくちゃ強い武器だったんですよそういう評価もリードワークもいただいてましたし日産ってなんだかんだ超絶グローバルな会社なんですよね160カ国ぐらいでサービスを展開してるのでアプリの仕様を一旦変えるってなったら日本はこれヨーロッパはこれ東南アジアはこれとか全部のリージョンを見ないといけないんでヨーロッパの人たちと会議しないといけないとかインドの開発部隊に支持をしないといけないとかめちゃくちゃあるんですよなんで僕が日本にいたウェブマーケティング会社から日産自動車のプロダクトオーナーに転職できたかっていうと不可能ではなかったかもしれないですけどイメージはつきづらいですよね。",
      "start": 1230790,
      "end": 1330117,
      "timestamp": "20:30"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみに何%ぐらい英語で話して、何%ぐらい日本語で話すんですか?",
      "start": 1332765,
      "end": 1338097,
      "timestamp": "22:12"
    },
    {
      "speaker": "Hiroshi",
      "text": "結構その、もうその携わっていた案件にもよるんですけど、僕はなんかそのドイツのコンサル会社と一緒に進めている、なんかPOCのプロジェクトとかが日産にいたときにあったんで、まあ4、37か46ぐらいで、まあ4が英語。ぐらいの割合で話してましたね英語でミーティングをファシリティとすることもありましたし英語でドキュメントを書いたりするも全然あったって感じ。",
      "start": 1338097,
      "end": 1367993,
      "timestamp": "22:18"
    },
    {
      "speaker": "Ryo",
      "text": "それってなんかみんな英語話せるんですかそれともひろし君だけ特別で結構だからみんなの助けなんか助けになってるみたいな感じなんです。",
      "start": 1367993,
      "end": 1374561,
      "timestamp": "22:47"
    },
    {
      "speaker": "Hiroshi",
      "text": "かそれは正直、僕の英語力をよく買っていただいてたっていうのはありますね。みんなベース英語はできるんですけど、トイック700、800ぐらいは取れるんですけど、トイックって喋れる能力と全く別じゃないですか。だからやっぱり英語…理解はできるけどニガティ意識があるっていう人は多かったねなんであのー磯部さん英語できるからちょっとあのプロジェクトの背景はまた後で教えるから一旦会議入ってみたいなそういうのはまああったんで英語ができたことによって掴めたチャンスというか前に出ることができた機会っていうのはたくさんありましたねあとまあエンジニアの経験がある人ばかりではないんでそのエンジニアとのコミュニケーションでもなんか間に入らせてもらうことがたくさんあってエンジニアの人たちもなんか磯井さんみたいにエンジニアリングわかってる人がいると話が早いなはははみたいなこともまああったっていうのがあるのでそういった意味でカナダでのエンジニアの経験と英語をあのいっぱい使った経験っていうのはあのしっかり生きているそしたら。",
      "start": 1374561,
      "end": 1444909,
      "timestamp": "22:54"
    },
    {
      "speaker": "Ryo",
      "text": "えっとまあそろそろ次の楽天の話を聞いていきたいなと思うんで最後に練習。",
      "start": 1444909,
      "end": 1451454,
      "timestamp": "24:04"
    },
    {
      "speaker": "Hiroshi",
      "text": "聞いてもいいですかもちろんです。日産に初めて転職した時は700ちょいぐらいでした。700万ちょいぐらいだったと思います。楽天では900ぐらいです。",
      "start": 1451454,
      "end": 1469445,
      "timestamp": "24:11"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあ700ってことは、カナダから行く時にもう既に多分就職を決めてから行かれたんですよね。その時点ではちょっと落とした感じになるんですね。",
      "start": 1469445,
      "end": 1480053,
      "timestamp": "24:29"
    },
    {
      "speaker": "Hiroshi",
      "text": "まあそうですね。やっぱその、言うてプロダクトマネージャーとしては未経験だったんでできるだけ、やっぱ高い年収を提示しすぎると落ちちゃうみたいなこともあるんで、そこはなかなか難しいんですけど現年収みたいな格乱があったんですけど、いや一旦ここは気にしないでいいですよみたいなことを言いながら面接とか。",
      "start": 1480053,
      "end": 1503412,
      "timestamp": "24:40"
    },
    {
      "speaker": "Ryo",
      "text": "やってたちなみにpdmってどういう感じのなんだろうレンジというか今のひろし君の楽天とかその日産とかのレベルだとどのぐらいの給料がジュニアインターミネートシニアみたいなでもらえるんです。",
      "start": 1503412,
      "end": 1515685,
      "timestamp": "25:03"
    },
    {
      "speaker": "Hiroshi",
      "text": "かまずジュニアでも多分600は全然狙えると思うんですよね。日本って平均年収400とか。平均年収って、あの統計ってその非正規とかも入っているんで、あまりこう実情と表しているかとかちょっとわかんないけど、エンジニアよりは少なくとも高く、レンジとしては高くて。1000万とかのレンジはまだ余裕で狙えると思うんですよね、プロダクトマネージャーは。で、僕が目標として持ってるのは40歳までに年収2000万に行きたいなっていうふうに思ってるんですで、これは簡単な目標ではないんですけど逆に非現実的でもないと思ってるんですよ今のたくさんの低成熟エージェントの話を聞いたりとか普段もプロダクトマネジメント系の本とか読んだりしたりしてるんですけど肌感的には死ぬ気で頑張ったら多分2000万いけるなっていう感じですね、。",
      "start": 1515685,
      "end": 1572437,
      "timestamp": "25:15"
    },
    {
      "speaker": "Ryo",
      "text": "年収的にはそれはちなみになんか広瀬くんこっちで働いたことあるんでわかると思うんですけどあのこっちのビッグテックみたいなそのぐらいのイメージなんですかそれともなんだろう本当結構なんだろうそんなになかなかそのぐらいの人は見かけないぐらいのレベルのまあなかなか2000もらえる人。",
      "start": 1572437,
      "end": 1594353,
      "timestamp": "26:12"
    },
    {
      "speaker": "Hiroshi",
      "text": "っていうのは難しいと思います。プロダクトマネージャーになったら2000万は硬いよねってことは決してないと思いますが、楽天でも多分いけるっちゃいけると思う。楽天はそこそこ払いがいい会社だと思うんですよね。僕まだプロダクトマネージャーとして2年目とかでそれだけの給料をもらえるってなかなかないと思うんですよ。で年収の話とかも面接の中でしていく中でなんか磯吹さんどれぐらい稼ぎたいんですかみたいな話あった時にいやーなんかこれぐらい欲しいんですよねみたいなあーいけると思いますよみたいな感じだったんでまあ簡単ではないとは思いますしその割合としても低いとは思いますけど可能ではないなんかちゃんと頑張ればみんな1000万はいけんじゃないかなっていう感じはしますね。",
      "start": 1594353,
      "end": 1642175,
      "timestamp": "26:34"
    },
    {
      "speaker": "Ryo",
      "text": "結構夢ありますね日本で。",
      "start": 1643936,
      "end": 1647139,
      "timestamp": "27:23"
    },
    {
      "speaker": "Hiroshi",
      "text": "EDMで2000万かいいと思いますよ狙うべきって言うとちょっとあれですけどいい選択肢だと思います。",
      "start": 1647139,
      "end": 1655366,
      "timestamp": "27:27"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみになんかあの楽天以外でどういうところがpdmではなんか強いというかこういうところ行きたいみたいなってある。",
      "start": 1657332,
      "end": 1664616,
      "timestamp": "27:37"
    },
    {
      "speaker": "Hiroshi",
      "text": "んですかそうですねまあ。",
      "start": 1664616,
      "end": 1666997,
      "timestamp": "27:44"
    },
    {
      "speaker": "Ryo",
      "text": "今転職したばっかりだと思うんであんまりないかも。",
      "start": 1666997,
      "end": 1669458,
      "timestamp": "27:46"
    },
    {
      "speaker": "Hiroshi",
      "text": "しれないですけど業界プロダクトマネジメント強いっていうとなんだろうな、まあメルカリとかはやっぱいいと思いますねやっぱ強いんだラクテンもなんだかんだラクテンって70個ぐらいのサービスがあるんですよねそのラクテン銀行とかラクテン証券とかそういった意味でいろんなEDMがいるんですよでラクテンもラクテンプロジェクトマネジメントメソッドみたいなのがあったりとかで、プロダクトマネジメントとプロジェクトマネジメントって結構違うにしてもちょっと重複する部分があったりとかするので、結構ノウハウを学ぶには良い環境かなというふうに思いますね。あとはAmazonとかそういうの、AmazonJapanとかももちろん選択肢に入ると思うんだけど、日本で言うとやっぱメガベンチャーに類似されるところっていうのはいいんじゃないですかね、サイバーエージェントとかも。",
      "start": 1669458,
      "end": 1721596,
      "timestamp": "27:49"
    },
    {
      "speaker": "Ryo",
      "text": "エンジニアとしてもいいところがPDMとしても働きやすかったり結構いい金額が狙えるって感じなんですねどう。",
      "start": 1721606,
      "end": 1728905,
      "timestamp": "28:41"
    },
    {
      "speaker": "Hiroshi",
      "text": "なんですかねそこ楽天はですねエンジニアに対してあのもう給料そこそこいいんですけど社長がエンジニアじゃないんでそのデベロッパーエクスペリエンスがいい話はあんまり聞いたことないんですよ僕みたいにそのビジネス属性が強い人間だとあの面白いんですよねあのやっぱなんかすごいスピードでサービスが出来上がってなくなってでなんかあのすごいスピードで意思決定がなされてみたいなのあるんですけどそこにそのなんですかねデベロッパー向けの環境が整い切ってないとかっていうのはまあもしかしたらちょっとあるかもないですがあのデベロッパーエクスペリエンスの高い会社みたいなのがたまにランキングとして出たりするんですけどでもあんまり上にいなかった逆にサイバーエージェントとか上にいてレイヤーエックスとかもあまりトップだようなであのプロダクトマネージャーとしてそのちょうどの高い領域であの力をつきたい面白い仕事がしたいっていうのとまああのまあエンジニアとしてもどこに重きを置くかによってあると思うんですけどデベロッパーエクスペリエンスはちょっとまああのやや違う地区かなというふうに。",
      "start": 1728905,
      "end": 1802797,
      "timestamp": "28:48"
    },
    {
      "speaker": "Ryo",
      "text": "思いそうなんですねそしたらさっきちょっと楽天でも全然英語を使うよみたいな感じで聞いたんですけど具体的にはどんな感じの業務されててどのぐらい英語を使って仕事され。",
      "start": 1802797,
      "end": 1818089,
      "timestamp": "30:02"
    },
    {
      "speaker": "Hiroshi",
      "text": "てるんですかえっとまあ仕事内容としては結構あの日産と似てるんですよねそのビジネス部署からの要件があってそれをあのテクニカルに分解をしてであのエンジニアチームを動かしていくというところがあるんですけどあの一つ違うのはそのkpiに対するあの認識の重さというかあのに車ってなんかも超絶複雑な機械なんでその仕様を理解するだけでももうむちゃくちゃ大変なんですよなんでそのプロダクトオーナーがkpiを追ってる暇なんてないわけなんですよねなんかなんでその鳥まあめちゃめちゃ乱暴に言うとその車の部品を作る部署とまあ扱い的には同じタイヤを作ったりしている部署を作ったりしている部署とアプリを作っている部署はあの基本的にはそんなに認識としては変わらない僕らはkpa責任はなかったわけであの加入者がどれだけ減ってるとかあんまり何も言われなかった僕はやってましたけどやってなかったでもあの楽天のプロダクトマネージャーはあの物流業あの分野のあのプロダクトマネージャーなんですねなので1ピースあたりに買ったコストがどれぐらい下がりましたこのプロジェクトをやると1ピースあたり0。\n2円下がる予定ですというのをちゃんと部署単位で共有して少しずつ前に進むというところがまあ違いですね楽天全体としてもやっぱり数字でもノートを考えて前に進めていこうという文化が非常に強いのでそこが違いかなと思いますがまあ大まかに言うと仕事内容はあの日産でやっていたことの延長線あるとは思います英語をどんな場面で使っているかというとですね、楽天ってその非日本人の方々を無茶無茶積極的に採用しているんですよ。我々の部署は中でも外国人比率、非日本人比率が高い部署でして、エンジニアは日本人ほぼいないんですよね。でその中で僕たちはエンジニアの人たちに開発要件をインプットしてコミュニケーションをたくさん取らないというミーティングももちろんそうですけど行っていけないとでインドの開発部隊とかもあるのでそういったコミュニケーションの場がたくさんありますで仕様書を書くのも今は担当しているプロダクトにもよるんですけど今はほぼ英語ですね。",
      "start": 1818089,
      "end": 1964458,
      "timestamp": "30:18"
    },
    {
      "speaker": "Ryo",
      "text": "そのさっき聞いた感じだとやっぱなんかサースの会社だからってなんかkpiのあたりはサースの会社だからってのもありそうな感じですよねこっちのなんかサースの会社とかもやっぱkpiとかまぁ結構追いながらプロダクトオーナーとかえっとpdプロダクトマネージャーとかが結構そこらへんを追いながら仕事してるって感じだと思うんでなんかそうですねそれが業界によりっていうのはありそうです日本。",
      "start": 1966201,
      "end": 1989427,
      "timestamp": "32:46"
    },
    {
      "speaker": "Ayaka",
      "text": "内で転職した時とかにあの面接たくさんあると思うんですけど具体的にどういう内容だったのか気になるのであと英語力ってどういうふうに証明していくんですか?",
      "start": 1989427,
      "end": 2002280,
      "timestamp": "33:09"
    },
    {
      "speaker": "Hiroshi",
      "text": "なんか英語力はなんか正直あんま聞かれなかったですねまぁでもカナダで就活してされてました。",
      "start": 2002280,
      "end": 2009541,
      "timestamp": "33:22"
    },
    {
      "speaker": "Ayaka",
      "text": "っていうと日本はそれで信じてもらえますよね。",
      "start": 2009541,
      "end": 2012666,
      "timestamp": "33:29"
    },
    {
      "speaker": "Hiroshi",
      "text": "信じてもらえる。でも正直、英語ないと死にますよとかっていうことを聞かれたことはほとんどなくて、まくまで英語はツールであるっていうの。英語を使ってどんなことしてましたかっていうのを聞かれる前に僕は言ってたっていうのはありますけど、そこに重点が置かれてたような気がしますね。なんで聞かれる内容としては、日産の時はそうですね、チームを動かすためにどんなことを心がけてますかなんか職場に嫌いな人がいたらどうしますかとかやっぱステークホルダーマネジメントってそのプロダクトプロジェクトマネージャーもそうだと思うけどそのプロダクトマネジメントの中でもっともあの重要と言って過言ではないぐらいのものなんですよねそっち系の話を聞かれることが多かったんですね楽天だとデータに基づいてデータドリブンで何か意思決定をして定量的な形で測れる形で出た成果に関するなんかエピソードってありますかとかあとは英語について言うとちなみに英語は健在ですかみたいなはいって言ったら終わりみたいな。",
      "start": 2012666,
      "end": 2085945,
      "timestamp": "33:32"
    },
    {
      "speaker": "Ayaka",
      "text": "業務をする中でずっと英語を使うから、カナダで使っていたものもキープしつつ、もちろんその業種やってる内容によって違うボキャブラリーが必要だったりとかするから、ちょっとずつアップデートしていってっていう感じですか?",
      "start": 2089735,
      "end": 2105182,
      "timestamp": "34:49"
    },
    {
      "speaker": "Hiroshi",
      "text": "そうですね。",
      "start": 2105182,
      "end": 2106052,
      "timestamp": "35:05"
    },
    {
      "speaker": "Ayaka",
      "text": "カナダにいてもアップデート全然。",
      "start": 2106052,
      "end": 2108636,
      "timestamp": "35:06"
    },
    {
      "speaker": "Hiroshi",
      "text": "できてない気がする。英語が…もちろんネイティブの人とかも楽天、隣にいるインドネシア人は英語ネイティブの人なんで、いまだになんか教えてもらったりするんですけど、でも英語が自由に話せるっていう人ばっかりじゃないんで、僕が引っ張っていかないといけないという場面が体にカナダに行った時よりも多いような気がするんです。日産の時もそうでしたけど、だからこそ、ちゃんと勉強しないといけないなっていうので、カナダに行った時よりも英語の勉強の習慣は根付いてるような気もします。",
      "start": 2108636,
      "end": 2146642,
      "timestamp": "35:08"
    },
    {
      "speaker": "Ayaka",
      "text": "それすごいですね。やっぱり思います。カナダにいれば、何もしなくても入ってくるじゃないですか、英語が自動的に。だからちょっとそれで満足しちゃって、やらないとかって、私も実際、意識しないで、本当に何もやってないなって危機感を覚えることがあるんですけど、それって日本にいると、やっぱりその意識がちゃんとやらなきゃってなって、やる人が多いって聞くので、すごいいいことだなって思います、むしろ。",
      "start": 2146642,
      "end": 2176326,
      "timestamp": "35:46"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみに、やっぱりとはいえ、日本に行くと英語を使う機会は減るじゃないですか。英語はまだやっぱり健在なんですか?",
      "start": 2176326,
      "end": 2187698,
      "timestamp": "36:16"
    },
    {
      "speaker": "Hiroshi",
      "text": "でも正直、カナダにいた時より上達してると思います。",
      "start": 2187708,
      "end": 2191190,
      "timestamp": "36:27"
    },
    {
      "speaker": "Ryo",
      "text": "おーすごい。やっぱじゃあそれはもう自分で勉強するからって感じなんですか?",
      "start": 2191190,
      "end": 2195323,
      "timestamp": "36:31"
    },
    {
      "speaker": "Hiroshi",
      "text": "自分で勉強もしますし、そのやっぱカナダの職場って、カナダにもいろんな職場があるんで、その一概に言うという意味ではないんですけど、僕が行った職場もなんか超絶緩かったんで、そのなんかあのまあなんかストリートイングリッシュみたいな感じでも、まあなんとかなるみたいな。",
      "start": 2195323,
      "end": 2214301,
      "timestamp": "36:35"
    },
    {
      "speaker": "Ryo",
      "text": "で、。",
      "start": 2214301,
      "end": 2214561,
      "timestamp": "36:54"
    },
    {
      "speaker": "Hiroshi",
      "text": "そのコミュニケーションをたくさん取らないといけないポジションでもなかったので、今の方がみんなの前で英語を喋るし、偉い人に対してそのなんかなんじゃ英語でプレゼンしないといけないもうよりプロフェッショナルな場面でプロフェッショナルな英語を話さないといけないっていう場面が増えた感覚があるんでやっぱなんかそこでなんかあの陽明みたいな感じの英語喋れねぇなみたいなとかあるってちょっとなんかちゃんとビジネスっぽい英語を話せるようにならないとなぁもっと上を目指すんだったらそのプロフェッショナルな英語をもっとちゃんと運用できるようにならないとなっていう意識が日本に帰ってきたからより強くなった感覚がある。",
      "start": 2214561,
      "end": 2253588,
      "timestamp": "36:54"
    },
    {
      "speaker": "Ayaka",
      "text": "っていうのはあります個人的に気になるんですけど、どういう風に勉強されたとかあります?私、最近の経験で、エンジニアなんで、そこまで常に英語で発表するとかなかったんですけど、今チームが変わって、ディスカバリーフェイズみたいなので、リサーチしたりするのが増えて、それを発表しないといけない機会が、この1ヶ月すごい増えて、すごいストレスなんですよ。プレゼンの場が。今までも多かったんですけど、格段に増えて、失業等とかもあって、私結構緊張シーンなんで、そういうのすごいストレスに思っちゃって、あ、うまくいかなかったなとかストレスになるんですけど、そのスキルを上げたとか、いろいろ打ち勝っていったスキル、何だろう、。",
      "start": 2253588,
      "end": 2302382,
      "timestamp": "37:33"
    },
    {
      "speaker": "Hiroshi",
      "text": "術とかあります?自ら進んで恥ずかしい思いをして血を流すというのはすごくいい勉強だと思うんで、そういう機会を経て学ぶっていうのはあるんですけど、僕毎日情報収集の習慣というかニュースレターとかRSとかでいろいろ記事を読んだりニュースキャッチアップしたりするんですけど、その中で英語を毎日読むっていうのと、あと耳が空いている時は基本的にずっと英語系のポッドキャストを聞いて、ずっとシャドウイングしてるっていうのがありますね。いろんなポッドキャストがありますけど、シャドウイングする中でですね、ちゃんと自分が意味を理解しながらできる、シャドウイングできるスピードの限界みたいなのを探るっていく。それがもしかしたら1。\n5倍かもしれないし2倍かもしれないんですけど、それでなんかそのギリギリの線を攻めながら歩きながらシャドウイングする、そういうなんかそのマルチタスクで負荷をかけるっていう、これがなんか結構僕の英語能をうまく刺激してる感じがあるんですよね。そんな感じですね。",
      "start": 2302382,
      "end": 2374185,
      "timestamp": "38:22"
    },
    {
      "speaker": "Ayaka",
      "text": "すごい。しゃべる練習とかはしないんですか?",
      "start": 2374185,
      "end": 2379054,
      "timestamp": "39:34"
    },
    {
      "speaker": "Hiroshi",
      "text": "しゃべる練習は普段仕事でやるって感じですね。実践で。そうですね。実践でこれなんて言うといいんだろうなみたいな場面とかってあると思うんですけど、なんか英語の記事をたくさん読んだりそのビジネス系の英語のポッドキャストを聞いたりしてるとなんかこういうフレーズがあるんだじゃあこれ次から使ってみようとかって言って実際に使ったりとか実際に使ってみてなんかそれちょっと違うよみたいな指摘があったらうわなんかミスった恥ずかしいみたいなそれも一生一生忘れないみたいなそんな繰り返し。",
      "start": 2379054,
      "end": 2416346,
      "timestamp": "39:39"
    },
    {
      "speaker": "Ryo",
      "text": "ですかね確かにちょっと話戻っちゃうんだけど、そういえばPMってめっちゃ喋りますもんね。確かにこっちの英語で、こっちでエンジニアやるよりも日本の英語環境でPMやる方が確かに英語喋ってるかもしれないけど。",
      "start": 2416346,
      "end": 2430213,
      "timestamp": "40:16"
    },
    {
      "speaker": "Ayaka",
      "text": "絶対その方が喋るし、プレッシャーかかる場面もたくさんあると思うし、その方が絶対。伸びてるんだろうなって思い。",
      "start": 2430213,
      "end": 2437545,
      "timestamp": "40:30"
    },
    {
      "speaker": "Hiroshi",
      "text": "ますエンジニアの方々ってその作ったものに対して熱い思いを持っているんでそのなんかプレゼンする場所でもそうなんかわーっ喋っちゃうとかってあるんですけどそれをなんかうまくそのなんかビジネス側の人たちはそんな具体のとこって興味がないないわけじゃないんですけどそこにあの注意を払ってる時間はないんでこのコミュニケーションの交通整理をするっていうかねエンジニアの人たちの気を悪くしない程度になんかまあちょっと今はこのフェーズじゃないですよねみたいな感じでうまくその会話会議の場を取り持つみたいなことを英語でやらないといけない場面があるんですよそういうことってやっぱあのエンジニアとして働いている中ではなかった気がするのでやっぱなんだか意外とあるって感じですねその英語を使える場面は。",
      "start": 2437545,
      "end": 2482311,
      "timestamp": "40:37"
    },
    {
      "speaker": "Ryo",
      "text": "そしたら、あと質問2つあるんですけど、1つ目は今後のキャリアの展望、さっきなんかちょっと40代までに2000万みたいなのはあったと思うんですけど、なんかやりたいこととか、あとあの日本に帰るときにやっぱりその日本のためになるようなことみたいな感じで思ってたと思うんですけど、なんかどういうふうにいこうかなみたいなのはあるんですか、これから。",
      "start": 2484587,
      "end": 2508297,
      "timestamp": "41:24"
    },
    {
      "speaker": "Hiroshi",
      "text": "そうですね40歳で2000万みたいなのがすごい分かりやすいハードの目標として持ってるっていう感じなんですけどじゃあ中身はどうなんだところで言うとですねプロダクトマネジメントということと英語っていうのは掛け算としてずっと向こう4,5年は高めていきたいなところがありますねそれに加えてもう1個専門分野が掛け合わさったようなプロダクトマネージャーとしてだから掛け算をいろいろ増やすことによって希少性を上げるという意味ですね今でいうと楽天の物流分野のプロダクトマネージャーなので英語とプロダクトマネジメントと物流っていう掛け算が今の僕にはあるんですねそういう、その3つ目の掛け算の専門分野っていうのは今後4,5年とかで変わっていくかもしれないんですけど、その3つの掛け算っていうのは今のところちょっとずっと高めていきたいと、もっともっとその自分の仕事の抽象度を上げていきたいっていうのはありますね。えっとまぁもしまあねそのチャットgptっても5年前とかまだ存在をしてなかったくらいの感覚かなと思うんでまあ4-5年たちともしかしたらプロダクトマネージャーがもうなんかいらないみたいになっている可能性もまあゼロではいうのはあると思うのでその4-5年の状況4-5年先の状況ってのはわかんないけど今あの持ってるビジョンというかあのし向こうし5年でやりたいことっていうのはあのそういうことですかねであのまあ物流ってあのまあ入ってみて気づいたんですまあ学んだんですけど結構その日本でもホットな分野というかあのまあecがすごい高成長していってですね宅配暗いしともあったりとかであの物流をいかにその効率化していくかであのは物流現場ってやっぱ労働環境がまだまだ改善のうちがあってトラックドライバーの人たちも基本的に残業80時間してるよみたいなそういう環境なんで僕たちがその効率化できるようなそのプロデュクトプロダクトをたくさん作っていくことによってそのなんだろうなあの働いている人たちがもっと楽しくであの日本の物流をもっともっとそのよくいうあのことができていきそうできてい楽天ではできそうだなという感覚が今のところはあるんであのまずはここでそういう結果を出していくっていうのがまああの自分の中の目標ですかそしたら、。",
      "start": 2508307,
      "end": 2653698,
      "timestamp": "41:48"
    },
    {
      "speaker": "Ryo",
      "text": "広瀬くん的にはやっぱ海外での経験が生きての今のPDMの仕事だったり、今の楽天でのとか、前者での実績があると思うんですけど、なんか広瀬くんみたいに留学とか渡航を考える人になんかアドバイスがあればお願いします。",
      "start": 2653698,
      "end": 2672181,
      "timestamp": "44:13"
    },
    {
      "speaker": "Hiroshi",
      "text": "そうですねまずその気になるちょっとじゃあカナダ気になるなって言うんだったらその超具体的に資金計画とかあの立ててみるっていうのをなんかおすすめしたいですね計画立てること自体はノーリスクだと思うんでその具体的に学校行ってそこをそこをして学校行って就職っていうことをあの具体的に計画立てようとなるともうなんか考えないといけないこととか調べないといけないことめっちゃあるじゃないですかめんどくさいことがたくさんあると思うんですよそのめんどくさいことを目の前にしてやっぱいいかなってなる人も結構多いと思うんでまずはなんかそこでもういいやってなったらそれまでのことなんで多分行かない方がいいんですよであのそういった意味でまずはちょっとスモールスタートで何か具体的に計画を立ててみてそれで本当に自分の心がワクワクするのかなみたいなあのところから始めるというのがあのおすすめしたいところですかねすごく広。",
      "start": 2672191,
      "end": 2732287,
      "timestamp": "44:32"
    },
    {
      "speaker": "Ryo",
      "text": "しくらしくていいアドバイスだなぁ僕は割とあもうとりあえず言っちゃえばみたいな感じだなぁでもね、計画すごい大切だし、今は特にね、ビザとか、英住権とかカナダでも難しくなってきてるから、やっぱりそこらへんの計画はね、日本にいるうちにやってほしいなと思いますね。",
      "start": 2732287,
      "end": 2753125,
      "timestamp": "45:32"
    },
    {
      "speaker": "Hiroshi",
      "text": "はい、。",
      "start": 2753125,
      "end": 2754057,
      "timestamp": "45:53"
    },
    {
      "speaker": "Ryo",
      "text": "ありがとうございました。",
      "start": 2754057,
      "end": 2755859,
      "timestamp": "45:54"
    },
    {
      "speaker": "Ayaka",
      "text": "ありがとうございました。",
      "start": 2755859,
      "end": 2759870,
      "timestamp": "45:55"
    },
    {
      "speaker": "Ryo",
      "text": "ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2760765,
      "end": 2778873,
      "timestamp": "46:00"
    }
  ]
}