{
  "episodeGuid": "1a7889de-76ea-4bf1-8eca-6aae3c089222",
  "episodeTitle": "給料未払いから年収1600万へ！1年で2度転職したエンジニアの記録（前半）#1",
  "transcribedAt": "2025-10-17T03:54:01.944Z",
  "duration": 3042,
  "fullText": "オッケーです始めますかはいじゃあそしたら今回は優吾くんがバンクーバーで就職を決めたということでインタビューしていきたいと思います国はカナダのバンクーバーで会社はスペアだと思いますそしたらじゃあまず簡単に経歴を。教えてくださいはい優吾ですプログラミング始めたのは大学生の時ですね大学はそもそも名古屋大学情報文化学部っていうなんか分離融合している学部みたいなところに、文系だけど入って、そこで授業でプログラミングやったのが始まり。まあはしょりますけど、いろいろバイトやら何やらやって、2019年卒にウェブフロントエンドエンジニアとして株式会社エウレカっていうマッチングアプリのペアで作ってる会社に新卒で入りました。で、2年間ちょっとそこで働いて転職して、スタンドFMって音声系のスタートアップに転職をしましてそこでフルスタックのエンジニアとしてそれもまた2年ちょっとぐらい働きました良い会社ですねでその後は半年ちょっとぐらいフリーランスで食いつないでカナダに来たでカナダに来たのが2024年の末2023年の末か3年3年の末ですね経歴的。には4年5年です。か5年ぐらい5年日本でエンジニアやった後にこっちに来ましてカレッジに通いましてで初めてカナダの会社で就職したのが2024年の10月まあいろいろあるっていう感じで転職を1回目してしたのが2025年の2月か1月ぐらいですねそこで働いてたんですけどちょっとその会社の会社のね給料が遅延してしまって給料見払い問題が発生してしまい家賃来月分払えるかどうかわからないという事件が。あり落ち込んでたからねそう。本当にこれ言ってもいいのあなたのyoutbeでボンボン公開。しますよねあの全然大丈夫です見ましょうフォトキャストの見。てるんでいや何ならあの時あのそれこそ僕と友達もう一人友達とセナさん呼んでちょっと1回ご飯でもいいって話だけ聞くわみたいなセナさん結局ね来なかっ。たけど来れなかったんだよなんでセミナー前に言うんだよ。で、なんかあれこの人もう帰るなぁみたいな感じだったけど。ギリギリギリギリギリそれがあったけど話聞いてもらってギリギリなんとかなり2025年の5月からまた新しい会社で働き始めましたっていうことなんでカナダ来て今1年半ちょっとですけどもう3社目で初めて働いてから半年ぐらいで3社目に突入する。すごいジョブホッパーみたいな仕方ないん。だけどジョブホッパーびっくりなホッパー。ぐらいホッパーしてますねいや。こんなことがやりたかったわけではないがまあでも落ち着いたからね、そんな感じですね。ちょっと高校前に戻って、何か渡航するきっかけとか経緯とか何か何でそもそも海外で働きたくなったのかみたいなことありますか?なんかまあ元々海外への漠然とした憧れみたいな、海外というか多分英語圏なのかな漠然とした憧れみたいなのがあって、多分たどるときっと高校生ぐらいに遡るけどまあそれはずっと漠然とした憧れではあったと。それはなんかエンジニアとして?それともただ英語で働きたいみたいな?英語を使って海外で生活して働く。人生長いから一回はやってみたいなぐらい。死ぬ前に?死ぬ前にっていうのが多分一番最初。ただなんか明確に行かなきゃってなったのはコロナの時の経験が大きいかもなって気がしていてそのコロナの経験するまでは僕の中では結構勝手に世界では結構グローバリズムが進んでいって、どんどんどんどん世界に出るハードルっていうのは下がっていくんだろうなぁとか勝手に思ってたんですけど、こういうのを経験してみると、いや別に世界ってそういう風に先見変化するっていうよりかは、突然自分の力ではどうしようもできない社会的な事件が起きて、自分がやりたかったことができなくなるタイミングってあるんだなと思って。っていうのを実感したら、ちょっと海外に行ってみたい、人生でいつかは行けたらいいなって思っていたところにそういうのが起きたんでまあなんか本当に行きたいんだったら行けるときに行かなきゃなっていうのをコロナ後で思い始めましたと年齢的にもあったんですかね年齢はその時に25歳ぐらい。そんなに若かったっけ?じゃあそうでもないのか。具体的に動き始めたというか、コロナの後ぐらいから、コロナに始まったから行かないといけないんだな、みたいな自分で。行かなきゃいけない。そこで気持ちが一段強まったっていうのが一つの理由で、で同時にそのさっき言ったスタンドFMっていう会社で働いていたけどそろそろ転職したいなと思ったのが20何年ですかね23年に入るか入らないかぐらいだったんですよで僕としてはまあどうせ会社転職するんだったらこのタイミングで海外行っておかないとまああのあまり新しく日本の会社に転職してしまうとまた2年3年潰すだろうなとここで会社辞めるんだったら海外行かなきゃっていうのを始めたのが2023年に入るか入らないかぐらいです同時に僕はそのITトリオっていうポッドキャストやってるんですけどそのエンジニア系のポッドキャストなんですよ。それの競合調査があっていろいろなエンジニア系のポッドキャストを聞き漁っていた時期があって、そこでフロックの瀬名さんも永遠のゲストとしてやっていたワンクーバーのエンジニアというものに出会い、同時に聞くようになったんですよ。聞いてみるとどうやらカナダのバンクーブはビザ的にも結構エンジニアとして行きやすいし長く住みやすいしなんなら永住権も取れてキャリアも作りやすいようだかついろんな人のエピソードを聞いてみるとどうやら別になんかめちゃくちゃ優秀な人が行っているっていうよりかはきちんと情報を集めてきちんと準備をした人がちゃんと現地の就職に成功してるんだなって結構再現戦があるんだなっていうことがわかってそういうのの組み合わせがちょうどあったのが2023年入った後ぐらいそこらへんは。それで言うと結構変わってきてますよね僕が来た時は2018年カナダに来た時は2018年でその時はなんか僕も含めてあんまり準備もしてないし計画的に来てた人は少なかったイメージなんですけどそんなことないですか?そんなことある。トガシさんが一番いい例じゃないですか。どこの国に行くかも。決めてないし、。何をしに行くかもよくわかってないんだけど。でも僕以外にも、そんなにこのビザ使ってこうやって行くみたいなのは決めてなくて、みんななんか永住権ないとなんか2社目って結構難しいらしいみたいな、なんかちょっと足元見られて金額落ちるらしいみたいなので永住権を考えるみたいなのが割と主流みたいな感じだったんですよ。あの時期はさ、ぶっちゃけ簡単だったんですよ。あったじゃないですかあのbcpbがあって要するに正直英語力がそんな高くなくてもa受験取れちゃってた。時代があったね噂に。聞くそうだからなんだろう割とやっぱり2018年9年あたりはエンジニアというキャリアがあればワンチャンこっちへなんとかなるっていうのがあったのが22年3年あたりからやっぱ厳しくなったですよね英語なんて絶対できなあかん飲んどったらフランス語も頑張るみたいなのが今なのでまあ無計画だとほぼ難しくなったのは間違いないですねそれも。あるんですかねなんかこの頃の人はやっぱりなんかそれこそなんか頭がいいというかちゃんと計画して英語も勉強してきてあの就職も1回まあ経験積んで2,3年してからみたいなまあタイプは結構多いというかまあほとんどそんな感じなのだって冷静。に考えてトカシさんが行ったカレッジとかさあそこも最初入るとき多分教育700点とか600点とかそのレベルで入れた時代だったのがもう今80090とか?じゃないと無理だから、てかTOEICじゃもう無理だ。からなんだろ、それもそんなにしっかりしてなくてTOEICのやつ出してなくて出すかテストやってって言われて、取り寄せるのめんどくさいからテストやりますよって言われて、じゃあテスト受けますって言ってテストの日風邪ひいて行かなかったのに普通にそこに入りましたからね今絶対に入らないじゃん、ありえないそうですよね。だからこう来るのがそもそもハードル上がったよね、。そういう時と比べるとそれで言うと別になんか僕めちゃくちゃ準備したっていうわけでもない海外トップのためにそのいろいろ重なって海外行きたいなと思った時に自分でも行けそうだと思ったのが良かったかななんかだからフロックに相談、一番最初の説明会に参加したのが2023年の2月か3月ぐらいだった気がするんですよ準備半年くらいかその時はまだスタンドエフェンスに働いていてまあもうちょっとしたら辞めるだろうから辞めたらまたしっかり考えるのかなと思っていたけどまあいろいろあってもうちょっと早めに辞めたいなという時期があり、実際に辞めたのが8月か7月ぐらいだったんですよ。それの時にまた個別の相談をさせてもらって、本当は最初めちゃくちゃ急いで9月からカナダに行けたらいいなとか思ってたんですけど、さすがに間に合わず1月、その次の2024年の1月からカレッジに通うっていう方向で準備をした。なるほど。なんかカナダを選んだ理由はポッドキャストを聞いてたからなんですか?それとも他の選択肢も一応考えてみてみたいな感じなんですか?ポッドキャスト聞いたのが一番大きくてそもそもその考える前はスタンドエフェムがフルリモートだったんで時差の少ない国でノマドというか住みながらリモートワークできたら嬉しいなっていうのがあったんですよねだから最初考えてたのはニュージーランドとかオーストラリアのワーキングオフィリビザ使えば時差って日本とそんなに変わらないしだったら別に英語を使って海外で働きながら働くってまあいけるかなというふうに思ってたんですよねそういう中でそのフロックというか砂さんがやってたポッドキャストを聞くとなんかワーホリのビザって別に将来で繋がるっていうよりかは現地の企業で働くんだったらいろいろ制約はあるし働かないんだったらまあそれで終わりだしただ使い道によってはカナダでさらに長く働ける選択肢があるということをポッドキャスト聞いて初めて知ったのかなそういうことですねその後、オトリアとかカナダとか、その2つしかほぼ見てなかったですけど調べてみると、カナダというかバンクーバンの方が色々やりやすそう何なら別にフロックがあるから色々聞けば教えてくれそうコミュニティ。があるのは大きいですよ。ねコミュニティもあるし成功事例が溜まってたんでその時でも結構インタビューの数って結構インタビュー記事たくさん出て。たと思うアメリカは試合入らんかった?アメリカは考えたことないアメリカに行きたい人ちょっと僕はあんまりそういう気持ちがないので給料が高くて目指したいという気持ちは分かるけど別になんかシリコンバレーがどうのこうのっていう憧れはあんまり僕は実は持ったことがないちょっと意外ですね。優吾くんの僕のイメージは割と技術強くてその技術強いってやっぱりサンフランシスコとかアメリカのメジャーリーグ目指そうみたいなそういうタイプが多くて僕全然どっちか言うとビジネスデベロッパーなんてないからちょっとなんか逆パターンなんだけど。確かに僕は結構技術が好きで、普通になんかOSの貢献とか色々コミュニティの登壇とか日本にいる時もちょっとだけしてたりとかして、そもそもエンジニアリングというかエンジニアっていう職自体が好きで技術自体が好きっていう施策ではあるんですけど、なんでそう思わないんですかね、別になんかプロダクトって見ると確かにシリコンバレーで生まれたものが多いかもしれないんですけど別に技術単体とかプログラミング言語とかフレームワーク単体を見ると別にシリコンバレーが中心という感じはあんまり僕感じたことなくてコミッター多いかもしれないですけどそうですねその根本はまあどこにあるかわかんないですけど例えば僕はReact使う前とかVue使ってたんですけどVueって別にシリコンバレー関係ないじゃないですかイーヴァンスさんがやってたのは、どっちかって言うとアジアの方がコミッター多かったり強かったりするとか、他にもなんかアフレマークとか色々見てると別にそう中心地がシリコンバレーにあるってことは多分今振り返ると感じたことがなかったんでまあ別に引っ掛けがなかったって感じですかね。そう考えるとすごいロジカルですねなんかその技術的なものを多分中心に置いてて多分シリコンバレー目指す人たちはどっちかというとFacebokとかAmazonとかGogleとかが生まれたその企業が生まれる地としての中心地みたいなイメージがあるのかな。そういうだけだよねあとは単純に結構バイアスかかってるかもしれないですけどアメリカ。治安悪そう怖いみたいな日本。の安全な環境で生まれて育ってしまったからそんなこう銃がバンバン撃たれるような地域に住みたい気持ちがあまり湧かないぜっていうまあ確かにね確かにそうです。ねそしたらちょっとまた戻ってちなみに英語学習について聞きたいんですけどどのくらいからなんだろう英語学習を始め具体的なんかちゃんと始めたかみたいなもちろん大学受験とかねいろいろやってきているとは思うんですけどなんかどんな感じで勉強し始めたか特に。なんかスピーキングとかあーいうとやっぱりその大学受験が一番大きいそれで結構土台ができた感じはインプットはじゃあそこで入れそうまずその後もせっかく勉強したから忘れたくないなーって思いで、たまに教育受けたりとかはしていて。それは英語だけですか?ちなみに数学とか忘れ?いや英語だけ英語だけ。英語はまあ絶対役に立つだろうなって時点で思ったんで、大学の時は統一を受けましたね、一回。で、ちょろちょろ何か気が乗りたら英語の文献読むとかしていて、で、ただ卒業する前にやっぱりあのもうちょっと英語、特にプログラミングに関することで英語のドキュメントとか読めた方、スムーズに読めた方が何か力になるなということを感じたので、いったいネイティブスクリプトっていうあの、JavaScriptを使ってもうアプリが書けるみたいな結構ニッチなフレームワークがあるんですけど、それのリュウ向けのドキュメントを一人でほぼ全部翻訳したことがあってソデカPRを作ってOSにいきなり送るみたいなことがあってそれがねなんか合計のページ数わかんないんですけど30ページとか40ページぐらいを結構長いドキュメントを一人でこの研究室が使えたのでそこに普通にこもってネットを使わせてもらいながらなんかたまにグーグル翻訳頼りながらも自力で翻訳をしてっていうのを一回やったことあるんですよねじゃあコミッターですかそうですね素晴らしいそれが多分リーディングにおいてはそれが一番大きかったなと思ってそれがあとは結構別にあの海外のフレームワークとかのドキュメントを英語で読むことに結構抵抗がなくなったっていうのが一番大きい。いや、それ大きいかもな。頼まれずにそれを自分でできるのはすごいですね。いや、でもね、俺ちょうど同じ事例を聞いたのよ。その人はインディーゲームをすごい好きで、アメリカで作られているインディーゲームの日本語版を無償でOSでコミッターでやったらすごいリーディングが伸びてっていう。のを全く同じこと聞いたから。いやでも確かに会社とかで読まないといけない例えば僕今の会社本当ドキュメント結構多いタイプの会社なんでめちゃくちゃ読むんですけど確かに本当に読むスピードも早くなったし理解も早くなったしいいなと思うんですけどそれは会社の時間で頼まれてというか仕方なくお金をもらいながらやるっていうのが結構大きくてそれなしになんだろう自分でやりたくてこもってわざわざ他の人のために書いて翻訳してあげるっていうのをできるのはすごいなぁ。と思ってまあね確かに。結構僕の性格がそっち向きなのもあるかもしれないそもそも何かを勉強するとか学習するっていうことが割と好きな性格っていうのもあるしその時は僕OSにコミットしたことがなかったんですよでその時点でなんかあんまりこう他の人が書いたプログラムに対してコミットを送るっていうことが僕の中ではそもそももうちょっとドキュメントの翻訳量よりもハードルが高いと感じていたのでOSの後継の中でその時の自分の視点で一番ハードルが低いものといったらまあ翻訳かななるほどでもなん。かよく言われますよねそれはなんかそのOS何から始めていいかわかんない人はとりあえず翻訳やって日本語版出せみたいなそれだと割とアプローブされやすい。し確かにそれで一石二鳥みたいなところがあったんででもそもそも翻訳すれば自分の英語のリーディング力身につくだろうなと思ってたんで、これをやれば英語の読解力もつくし、OSのコミット履歴もつくし、責任長じゃんって思ってやったのが多分理由な気がします。がインプットで、そしたらスピーキングだったり発音だったり、なんかアウトプットみたいなところ、特に日本人が苦手なところ。だと思うんですけど、。そこら辺は何かあります?スピーキング磨かなきゃな、みたいなことを思ったのは、新卒で入って絵売れ家。が大きいですね。絵売れ家はフェアズ運営している絵売れ家って日本生まれではあるんですけど、今は外資なんですよね。ティンダーの会社のマッチグループが年代忘れちゃいましたが買収してて、僕が入った時には結構外国籍のメンバーとかも結構いたんだ。たまにそのマッチグループの役員の人がオールハウスで来て、英語で話してなんかトランシーバー配られて同時通用とかもあったりして、それもあって社内のイベントで外国籍のメンバーと喋る時に英語を使おうと思ったら使える機会があったりとかしたし、そんなに多くなかったですけどあとは福利厚生でサービス忘れちゃいましたけど、オンライン英科学教室の一定の1ヶ月に15日以上受けたら全部会社が払ってくれるみたいなのがあったのでそれをちょろちょろ使ってたりはしましたただあんまりそれで向上した実感はないかもしれないそれでモチベーションをなんとか保っていたのが大きい気がしていてもうちょっと具体的なスピーキングの能力伸びたなっていうのはカナダに来る前にスタンダードフィルムで働いたりフリーランスしながらノマドでアジアを回っていた時期があるんですよ。本当に回ってたんだ?本当に回ってました。マレーシアとタイとかベトナムとかに行ったりして、そこで英語をちょろちょろ使い始めたっていうのがまず一つあったのと、プラスでそのノマドする中で外国人の彼女ができたので定期的に英語をしゃべる機会ができた遠距離なんですけど週1ぐらいで電話をしているのであとメッセージのテキストのやりとりも全部英語でしかやってないのでそれでカナダに来る前の半年以上前から結構英語を身近に使うという環境が出来上がってくれたのでカナダに来た時にそこそこスムーズだったり他の。国の英語の留学経験とかはあるんですか?はないですね。高校生の時に1週間くらいホームステイ、アメリカだったかな、アメリカだけど、まあそれはアメリカ楽しいぐらいの、。確かに2時間だったと。思うんだけど、旅行だよね。まあでもやっぱ本当に英語を使う国ってあるんだなぁみたいな学びはありましたが。なんか喋ることに抵抗がある時期ってあるじゃないですか。そこらへんを抜けたのってどのタイミングだったんですか?それはノマドをしてたのが大きいですかね。マレーシア行った時になんか英語を使ってやり取りしてみると別に相手が使う単語が別にわかんないわけでもないし、後から振り返ると自分が言いたかったことって別に難しい単語じゃないけどその場で言えないことが多いなっていうのをいろいろ回る中で自分で気づいて、なると自分に足らないのは語彙力とか文法の力よりももう慣れなんだなということを実感してそれが大きかったのもあるし、あと慣れもあるしなんかこう文化的な理解も重要なのかなみたいな根的性の理解も重要なのかなと思ってマレーシア行った時にまあマレーシアもちろんコンビニがあるんですよねコンビニで買い物した後にいきなり店員さんからプラスチックって聞かれたんですよプラスチック?プラスチックってちょっとやり取りしたらどうやらそれはビニール袋のことだったなるほどねうちにはあんまりそういうやりとりしないからわからないけどマレーシアではとりあえずプラスチックがプラスチックって言われるのがビニール袋入れますかって意味だったんですよでも別にそれってプラスチックって絶対日本人は誰も知ってるじゃないですかでも僕はその場でそれにすぐ反応できなかったんですよこれはプラ何?それは単語を知らなかったのが悪いんじゃなくて単純にその文化とかコンテキストが頭に入ってなかったし理解できてなかっただけなんだなっていうことを自分でいろいろ回りながら思っていろいろ振り返るとやっぱこれはなれるしかないんだなそれ。逆も多分あってエンジニアってやっぱ就職まあ他の業種に比べてしやすいのはなんか英語喋れないけどまぁjavascript話せるじゃないけどプログラミング言語とかでまあプログラミング言語基本はほぼほぼ英語じゃないですか日本語でもある言語もあるらしいけど基本的には英語でそれについて喋っている時は全部の単語が理解できなかったりセンテンスとして理解できなくてもこの人何言ってるかわかるみたいな瞬間ってやっぱりエンジニアだと結構あってそういうのはやっぱりコンテキストを理解しているから全部理解できてなくても理解できる伝わるみたいなのがあるんで功績を理解するのはすごい大切なことですよね。しかもそれを理解できると、自分の能力がないから悪いんじゃなくて、単純に慣れてないからなんだっていうふうに、別に自分は悪くないって冷静に分析できるようにもなるので、それもあってどんどん失敗した方がいいのは、いろんなところで言われてるけど実際そうなんだな、。みたいな。それで経験を積めば積むほど、もう一回同じような状況に出会った時に、よりスムーズにやり取りができるんだなっていうふうに思い始めたのが、マレーシアにいた頃だから、カナダ来る、やっぱりそれも半年ちょっと前ぐらいって感じですかね。プラスチックって言われたらね、。紙かな?プラスチックかな?って選ばせるかなっていう。最初俺そう思ったよ。こっちだとバックみたいな、プラスチックバックとか言われるから。バックなら一瞬で分かってた。バックだろうって思ったわ。プラスチックって聞かれるの何?みたいな。なんだろうねって。そういう日本語って結構あるから日本でも起こるんだろうなみたいな。バックは出てこないけど、。なんだろうね。いろいろあるじゃないですか、その同じ英語、英語をインポートされて日本語として英語を使ってるんだけど海外の人からしたら分かんないみたいなのって結構ないですか?だからなんかそんなもんな。のかなみたいなまあそうね、日本は略が多すぎるか。なそんなもんなのかなって思える立場に一早く行けたのは良かったですね、神奈川大島行くの素晴らしい。そしたら、渡航前のもう一つ聞きたいのは、日本にいる間にやっておいてよかったこと、来た後に役立ったな、これ先にやっておいてよかったな、みたいなことってありますか?難しいですね。情報収集。まあ僕がこっち来る時は別に日本から応募しても通んないだろうなっていうことは色々ちょっと調べたらわかったんで別に応募とかはしなかったんですけど調べようと思ったらなんか全体として何が必要になりそうかわかると思っていて、それこそそのフロックのインタビュー記事とか、あのポッドキャスト聞くとかもそうですし、なんかいろんな個人の人が書いているものをいろいろたくさん読んでみるとわかることもあるんですけど、ジェネラルにやっぱり英語は伸ばしておいたほうがいいなとか、なんかレジュメいるらしいから職歴の整理は多少ないともしておいたほうがいいなみたいなことがあって、そこらへんはちょろちょろ準備はしていたっていう感じですねたださっき言った通り僕割と日常的に何か技術を学ぶとか英語をちょろちょろ勉強するとかっていうのはまあずっとやってたのでカナダに来るために特別集中して何かやったかって言われるとそんなにないかも日頃の勉強の延長みたいな感じで聞い。た感じで言うとそのマレーシアとか行ってた期間はすごい良かったのかなって感じですけどね僕も来る前に来る前とか結構その結構2年ぐらい空いてましたけどフィリピン一回行ってそれはそれこそ留学券なんだろうホリデーみたいな感じで行ったんですけどなんかそのなんだろうね喋る気持ち悪さがなくなるだったりとかアジア圏の英語とこっちの英語、こっちの英語すごい早いから、アジア圏に比べて全然違うんだけど、まあなんかやっぱ近いって英語ちょっと喋れるようになるとか、まあなんか身振り手振りプラスちょっとした単語で言えるようになるとかはあると思うんです。それはなんかすごい聞いてて良かったのかなみたいな。それはめちゃくちゃ良かったですね。思い出したんですけど、そこでマレーシアでノマドした経験とかを、日本の英語を使うデザイナーとかが集まるイベントで登壇して話したりもしてて、それも結構良かったかもしれないですね。事前にそういうのをやっておくと、そういうのをやってない人がカナダに来て初めて経験することをすでに知っておけるんで、それで結構マインドセットが出来上がるというか。そこら辺知れたの良かったかも。それ言うと確かにマレーシアで行ったのも、マレーシアの人も英語ネイティブの人じゃない人が多いから、なんか一口に英語って言ってもいろんな英語があるんだなっていうのをあらかじめこう肌の身で実感できたのは大きかったかもだから別にネイティブじゃないことをなんかこうコンプレックスに思わなくていいというかそれぞれが別になんかそれぞれの鉛を持って別に発音はそんなに気にせず意図が通ればokぐらいの感じでコミュニケーションしてるんだなってことが分かった。のでそれをどれだけ英語学習の中でどれだけ早く気づけるかってすごい大切ですよねなんかこっち来て僕自分もそうだったんだけどすぐの人って割とすぐネイティブに聞くとかネイティブにレジュメ直してもらうとか自分もそうだったから本当に一言は言えないんだけどネイティブの人、うちのチーム例えばいないけどなとか全然あるじゃないですかそこをネイティブだからといって、技術に明るい人とか、いろんな要素があるうちのネイティブ一つでしかないし、読む人もネイティブじゃないから、そもそも文法、別に全部ちゃんと分かってない人だって読むかもしれないし、特にカナダはあんまりそこはすごい寛容じゃないですか、ファクトリーは特にいろんな国の人がいて。人口の半分が外国人だからね。早い段階でそれを築けたのはすごい良かった。そうですね、。それは結構運が良かった気がしますね。そしたら今度は就職活動についてした後に聞いていきたいんですけど具体的にこんなことしたよとか結構ブログとかね多分自身のポッドキャストでも言われてると思うんですけどちょっと説明してもらっ。てもいいですか?最初の1社目終わった時にノートにも書いたんですけど、僕は最初の1社目は結構レジュメを対象に最適化した上で、最適化した上でなるべくたくさん送るっていう方針でやりましたね。始めたのが、レジュメをそもそも準備してたのはカナダ来てからすぐにやってたりもしてたかもしれないですけど、応募し始めたのは2024年の6月?5月末?6月ぐらい。来たのがいつでしたっけ?来たのが2023年末。ほぼ2024年の1月。でまあ学校通いながらレジュメの対策というかレジュメを整えたりとかイベントをたくさん行ってたりしましたけど、実際に本当に応募し始めたのは学校の授業が終わるっていうのが近づいてきた6月ぐらいですね。ちなみにそのレジュメを準備するっていうのはどういう流れでしたんですか?モデル自分でですか?それともなんか僕の頃だとそれこそ学校に何かそれ用の人がいてその人にそれこそネイティブの人に見てもらってっていうのがあった。んですけどほぼ自分でやりました。そもそもなんか学校という存在はあんまり信用してない先生とかもまあ親切だけど言うて社会人経験学校だけでしょみたいにちょっと思ってしまうし。がそこまでは言わなくてもあのエンジニアのエンジニアっていうかあのこのit業界は特に結構あのレジュメのそのプロセスとか違ったりだとかその例えばカフェと比べて、カフェはもうそのまま人間が見てもらえるけど、僕たちの業界だと例えば機械に通して情報抜かれてみたいな、なんかそれの対策が必要だったりするから、確かにそのただただ英語がわかる人が読んだらいいっていう話ではないですよね。学校でもそういうのはあったけど一見お願いしたことはなくて、自分でなんかコミュニティのイベントとか行ったりしてなんかそうしてみるとやっぱレジュメについて話してる人とかもいるしいろいろアドバイス聞いたら答えてくれる人も結構いるんですよね覚えてるのはなんかGogleディベロッパーミートアップだったっけななんかGogleのコミュニティのイベントにそれはでも結構早い段階から2024年の3月ぐらいに行ったらちょうどその最近の採用プロセスとかレジュメの大切さとかについて話している現地のエンジニアの人がいてそこで結構全体感が分かったりもしたしあとは今日本で働いてますけどフロックのコミュニティの中では有名なKさんとかが動画出したりとかちょっと仲良かったりしたので色々聞いてみたりして自分で経歴を整理していろいろネットで調べた上でこれがいいかなと思って作ってみてちょっと人にレビューをしてもらってだいたい良さそうっていうのをもらったんであとはもう応募しながら改善していくみたいなことをやってて一応そのレジュメのアプリケーショントラッキングシステム対策サービスジョブスキャンというサービス結構高かったんですけど使っていて応募するときは必ず自分のレジュメをスキャンして読み込ませた読み込ませてジョブディスクレーションも貼って一応その中でちゃんとATSのスタイリティックができているかどうか点数がちゃんと上がっているかどうかっていうのを見ながらちまちまやりながらなんかコマコマと毎度毎度修正をしてやってたって感じ。ですねどのぐらい送ったん。ですかなんか一社年に書いたノートを見てみると90通くらいうんで。どのぐらいが反応あったりとかなんか進んだりとか。しましたちょっと待ってください。はいいい変化だよね昔はコープインストラクターしか一人なかったじゃんコープインストラクターとかのそれこそ東さんが2学校行っ。た時にコープインストラクターみたいな。今いろんな人が情報発信し。てくれてるからね確かにまあそれこそK君とかねみんなやってくれてそれはすごいありがたいですよねもうそれこそまあ古い僕の時代は手探りというかみんなが手探りでまだみんななんか情報発信するにはまだ早いみたい。な感じ時代の変化が本当にあるなぁ富樫さんのこっち来た時ってみんなまだAgencyに働き入れてたしねサース系いなかったもんな。そうですねそれこそK君とか僕、学校でもコーナーストーンという、当時の学校でも同期なんであれですけど、やっぱ自分がやって人に話してみて、他の人違うやり方してるみたいな、そんな感じだったからそれこそATSなんて言葉も全然知らなかったし。今見てみるとだいたい6月後半から9月ぐらいまで最初に1社目入るまでだとだいたい100通弱ぐらい送ってたそれで実際に面接書類が通ったのは9つ?9か10くらいって書いて。ありますそれはランダムに出すっていうのはなしにちゃんと興味ある会社に1個1個見てって感じなんですか?そうですね、そもそも応募する時点で自分の経験的にはウェブのフロントエンドかフルスタック、JavaScript系のフルスタックかReactNativeが自分の経験あったのでそこしか見てなかったですねそれのインターメディレートからシニアのポジションだけそもそも自分の技術がかすってないところは送ってないし見てもない。っていう感じですね送り方はインディードとかレファラル頑張っ。たとかあります?最初レファラル頑張った時期があったんですけどオープンしているポジションを見つけたらリンクドインでそこで働いている人を見つけて申請してメッセージを送るとかちょっとやってた時期はあるんですけど全然返信来ないなって思ったのでそこは諦めて単純にリンクドインからやりましたリンクドインのボタンで会社の採用サイトにつながっている場合はそこからやるしリンクドインのEasyApplyがある場合はそこからやるしみたいな人によってはなんかリンクドインのEasyApply使わずに会社のホームページからやるって言ってる人もいたんですけど僕はもうあんまりやってなかったですね。そこは僕が割とlinkedとかindeとか見て個人のページに行ってっていうタイプだったんですよなんかlinkedinどうなんでしょうね僕もそのシステムを見たことないから実際どうなってるのかわかんないけどなんとなくそっちから行った方が見やすいんじゃないかなみたいなイメージがあったんですけど。どうなんですかね僕はまあなんかどうせ統合されてるんだろうな裏のシステムだとか思ってそれは知ってるとはあとはまあバランスどこに動力兼ねるかの兼ね合いだと思うんですけど僕は結構リンクドインでオープンジョブポジションがオープンしたらすぐに応募するっていうことをやってたりしてのでそれ以外にあんまり頑張ってる時間と労力がないみたいな。なので割とLinkedI集中でやってたという感じですね。就職活動でやったのはレジュメ?ポートフォリオとか作ったりしました?そうですね。やったことを全体感で言うと、レジュメはもちろん前で対策してましたし、LinkedIのアカウントも結構充実させましたね。プロフィールを積もえるとか、レジュメをちゃんと載せるとか。あとはそのLinkedIのポストも定期的にできるように頑張ってもしてたしコミュニティのイベントもBurn。\njsっていうのに登壇して自撮りをしてなんかLinkedIにポストしていい感じっぽい人を演出したりとかあとはGitHubのReadMeあんまり自分のプロフィールページ整理しなかったんでそれをちょっときれいにしてみたりとかさっき言ってたポートフォリオのサイトも作って僕は割と個人開発結構やる人だったので綺麗に見せようと思えば結構それを使ってなんか結構プロフェッショナルな感じに見せれたのでちゃんとその個人開発しているプロダクトを5個とか6個ぐらいあったのでそれぞれのページを作って単純に書いているだけだとあまりつまらないかなと思ったんでなんで作ったかみたいなストーリーをうまく整理して書いたりとかしていってあとたまに後半はカバーレターとか送ってたりします。最初は送ってなかったんですけど。カバーレターで結構僕は個人かハヤツのことを絡めてやってみると結構受けが良かったりとかして。じゃあ結構そのポートフォリオだったりカバーレターとかそこら辺で手応えはあった感じですか?いやポートフォリオどうだったのかなでもそのできることは全部やる方針だったのでどれが明確に刺さって一番誘ったかっていうよりかはなんか全体的にやってたのでGitHubのリードミー見てすごいねって言ってくれることもあったしとりあえずサイトを見てたくさんやってて面白いねって言われることもあったしカバーレターで僕はそのコラ画像を作る個人会社のサイトがあるのでそれを絡めて会社のビジネスの内容を調べてそれに絡めたコラ画像を作るってみるとそれが後から聞いてみるとそれが刺さったようだっていうのがあったりしてどれかが一番刺さったっていうよりかはまんべんなくできることを全部やってたのでちょろちょろいろんな手法が刺さったかなって全体的に良くなったか。なみたいな結構話聞いた感じだとそのポートフォルトだったりGitHubをちゃんと見られてるということですねその採用側も見るときもあるし。見ないときもあるまあそう。だけど早いうちだと逆に見られてるかもしれないですよその投稿をリンクリンとかでまだアリアプライの時期だと100人とか来てないからまあなんかゆっくり見てるうちに一人一人時間かけても見れるけど100人とか200人300人になってくると見れなくなったりとか見なくなったりするとかもあるのかもしれないですね。インティードからも送るし、リンクドインからも送るし、会社のEメールアドレスからも送るし、いろんな窓口から送ってらっしゃる方も多いと思う。3個か4個くらい来。たら1個くらい引き上げてくれるんじゃない?みたいな。ありえるかな?人によっては多分僕はなんか感覚としてやっぱこれをやれば絶対一番うまくいくみたいなものがあるっていうかはなんかまんべんなくなんか確率が数パーセント上がるみたいなイメージでそれを考えるとなんか1回の応募でだけを見て絶対にうまくいくっていうのはないので、なんか統計的に見てそれぞれ数パーセントやってれば数パーセント上がるんだったら10回とか100回やれば差は歴然だろうなぐらいな風に考えて、あんまりこう一個一個の応募でどれが一番というよりかは10個とか100個の中で全体的に見て最適になればいいなぁという感じで分析。に分析よってそうですねアナライズですねなんか1回。の応募で絶対に通ろうと思うともう博打でしかないと思うんですけど100回の応募で3、4回通ろうだったら絶対に博打ではないじゃないですか。確率だけ、一度の打席を見て確実にうまくいくんではなくて、統計的に見てうまくいきそうみたいなのに、バランスよく頑張ってみた。素晴らしい。じゃあ調べて見つけたテクニックみたいなのは全部やって、満遍なく確率を上げていったみたいな感じが。そうですね。だから僕は割と就職とかの面接も学校の授業がある間にもちょろちょろ呼ばれ始めたりしてたので、その時通ってたカレッジの人たちにもなんかどうやったらいいみたいなことを聞かれたりしたので、僕はこうやっていうことを全部教えたりしてたんですよ。イベントに行って話聞くのもいいし、そこで人事の人がたまにいるから話してるといろいろアドバイスもらえるからいいと思うし、ネジメもこういうサービスがあるから手続けしたらいいと思うし、なんならポートフィルム作った方がいいしっていう風にいろんなことやってること伝えたんですけどあんまり何か伝えたからといってやってる人がいたかというとあんまりいない気がし。ていて何だろうね本当。に結局やるだけなんですよでもやるのが一番。大事なんですよっていうのは実感しましただから別にそれが簡単だとは言わないですし大変じゃ大変だと思いますけど何だろう一個一個のやるべきことは別に難しくなくて全体としてちゃんとやるみたいなことがなんか難しいというか、持続して頑張ることが難しいのかなと思ったり、思わなかったり。いやモチベーションの継続みたいなのは難しいですよね。あとその優吾くんの場合はその一つ一つ見つけてやる、見つけてやるだけだからなんかロードマップ的に道みたいな感じだけど聞いた人からしたら一気に全部情報を聞いて、なんかちょっとオーバーベルミッションみたいなのはありますよね。だからなんかやっぱ自分で見つけてってそのプロセスが結構大切なのかなって今聞いてて。間違いない、。そっちの方が実感として納得して取り組むことができるし今言ったこと全部1ヶ月なのでやろうとすると僕無理だと思うので確かに振り返ってみると僕もイベントに行き始めたのがカナダに来てからすぐだったしその後まずレジュメを対策したのが多分1ヶ月とかかかってたしその後レジュメが一旦落ち着いたらGitHubの整理をし始めたしその整理が終わってしばらくしてオートフリオも作り始めたしで最後の就職成功した時点で見ると大体結果的に全部やったなって感じだけど最初からすべてが揃っていたわけではもちろんないその。やっぱ一つずつやっていくことによりやっぱちょっと伸びたらちょっと伸びたなっていうのが自分の中で分かってこれは大切なんだってのは分かるけどやっぱ一つ一気にその情報をもらって全部やってもその何が良かったかとかそうどこでその増えたのかとかがわかんないからやっぱそのなんか耳しみないではないけど情報としてこれやったらいいよってのはわかっててもその自分のなんだろう体は血肉にはなってないみたいな感じはなるほどねちょっと面白いなここ。で広げていい話しかわかんないけどねユウゴさんはご自身のね就職活動の体験を自分のノートでしたっけ。あれそうですね放送の概要欄に貼っておいてください。はい貼っておきますので確かに。あれにしかも見ても見て、トワシさんもね、あの記事見て、この人すごいなのか。そう、。ちゃんと体系でやりなかったかな。あれが出合いをね、体系的にやってるな言うて、それでフロックのね、ちょっとレジュメなイベントも2人にちょっと実際やっていただいたのがあって、あの説はありがとうございました。いや、。ありがとうございます。僕も楽しかったです。こっちにフロックで新しく来た人からと話しとノート読みました参考になりますって言われることがちらほらあったりそうだねそれとかなめて自分のITトリオっていうポッドキャストでも体験などを話したりしてたんでそれは結構なんか聞きましたとか読みましたって言ってくれる人はちょくちょくいるかなっていう感じがあり。ますそしたら90社ぐらい。応募してどのぐらい通ってどのぐらいなんか実際面接みたいな。のがあった面接行ったのがその10社ぐらいだったと思います。ノートにも書いてあった。9社か10社ぐらい。ただ覚えてるのは1社目が一番ボロボロでしたね。1社目はいきなりリファローだったんですよね。それこそCS道場っていう有名なユーチュームがバンクーバで定期的にイベント開催してて、そこで新しく来た人のメンターを見つけるだったかなとりあえずそんなイベントに行ったらジンジンの人がいて、レジュメその時すでに持ってたので繋げてくれて面接1回やったことがあったんですけどそこで面接最初にしたリクルーターの人がそもそもアメリカの方でそれが5月くらいだったかな6月くらい去年のだから就職活動し始めたら結構すぐだと結構なんかやっぱアメリカの英語むずいなぁ激チンみたいなそれが始まり。それはリクルーター面接みたいなの。はスキップしてリクルーター面接?リクルーター面接で。でまぁそれが始まりですけどその後は大体そうですねカナダの会社だった気がしますねまあ一時面接やって最初の方やっぱ落ちる確率が僕は高かったのでだんだんだんだんでもやっていくうちに対策の仕方とかもわかってきたのでやっぱり事前に会社のことを調べておいた方がいいなとかもうちょっと慣れてくると面接する人のことも調べておいたほうがいいなとかいろいろあってそんなになんか特別なことを面接があったわけではない気がしますねリートコードのダイス君も一応やってましたけど1社目に入るまではリートコード的な問題はあんまり出会わなかったかも一社だけやって落ちましたね。Amazonもなんか書類だけ最初に通ったんですけど、あれ解けたんだけどな。解けたけど落ちたのがあって、よくわかんないけど、その一つぐらいしかリートコード的な問題は出会わずに、それ以外はWebのフロントエンドのJavaScriptとかHTMLの生のものを使ったものとか、Reactを使ったものとかっていうコーディング面接があったりとか。そっちはじゃあ割となんだろうその1回目の撃沈から学んでというかスムーズにいけるようになってきたんですかねそうですね。やっぱりやればやるほどめっちゃ慣れてくる感じがあって僕も今3周目ですけど合計したらその後もつろつろがエースしてたんで14とか15車ぐらいやってて平均すると2時3時とかはあると思うんで結構な数面接はなぜかやってしまったんですが。すごいよね。だって就活始めてからで考えたら1年くらいってことでしょ?そうっすね。1年経ってない。10年した面接は珍しいよね。僕より知ってるかもしれないね。上書いた?もしかして。だからもう結構その直近の転職した会社とかその他同時にやってた面接はもう結構僕の中ではもうすごい慣れてて、もうね余裕って言ったら叩かれるかもしれない余裕ではないです余裕ではないですけど方向性はだいたいわかるし受けがいい話の繋い方もわかるし結構余裕が出てきて単純な面接対策だけではなくてプラスアルファでもうちょっと自分の個性を出して引っかかることなんだろうとかを考えて結構そのビヘビアルクエスチョンでも最後の質問タイムでちょっと実は会社のウェブサイト壊れているところを見つけたんだけどとか言ってその場でなんかデバッグをウェブページしたりとか素晴らしい面接官の人がなんかプライベートで個人開発してるんだったらうまく自分も個人開発してることをアピールして実際にその場でアプリ触ってもらったりしておーって話が盛り上がったりとかあとは趣味が一致してたらその趣味の話をするようにしてカルチャーヒルってアピールしたりとかなんかそう僕はマーベル映画見るのが好きなんですけど美術館でマーベル映画見るのが好きな方がいて話題に出してみて最近のマーベル映画どう思う?みたいなドラマどう思う?みたいないうのを言うと大体ドラマね良くないよねって話になって盛り上がるみたい。ないやでも相手も人間なんでそうしたらすごい大切ですよね相手のことも調べたりできるなら調べて会社の中でも仕事の話ずっとコーディングについてずっとやってるわけじゃないんでやっぱりこの人を自分の隣の席に座ったらどうかなっていう視点で考えたりするんでそういうなんだろう趣味とか共通の話題とかを探して喋ってくれる人だと、一緒に働き始めてからイメージしやすいんで、すごい好印象になりますよね。一緒に働いてもらいたいと思えるように頑張って個性を出し方を探したのが。あるフロックやっててさ、俺割と感動した事例。が2つあって一つ。がさっきのヨグさんと全く一緒で面接ところですごい印象を残っている会社さんとかはもう絶対にクローンサイト作ってで、あなたたちの問題これやと思うからってプレゼンテーションするんだってすごいなって思ってもう一人は必ずインタビューの日程を選べるんだったら金曜日の夜にするんだっつって夕方かにするんだっつっ。て絶対にビール持って行く。んだって。今から飲もうぜっていう風に言って終わりにするっていうのをやってるとすごい仲良くなれるよって。いうのを実践してた奴がいたね確実に目立ちます僕は最近そういうのを振り返って思ったのは多分僕はやったことないですけどこれってできる営業の人の思考に近いのかなという気がして営業する人って単純に自分の伝えたいことをアピールするだけじゃなくて結構相手のことを調べた上で相手に一番支える方法で話しに行くような気がするんで別に営業したことないからYouTbeの切り取りとかが流れてくる程度の知識なんですけどなんか考え方としてはそれに似てるなって気はしていて、ちゃんと自分のアピールしたいことはするんだけどどういうふうに話し始めたら相手に一番刺さるなとかどういうふうに個性を出したら相手が一番自分のことを魅力的に思ってくれるかっていうことを事前にちゃんとした調べをする。そのために会社のこととか会社のビジョンとかミッションとか事業内容も調べるし、面接官個人の個性も調べるしっていうのは必要だなって思ってたんで結構なんか営業に近いのかなとか思ったり大事。かもね今日俺フロックでインタビューした人も三菱の営業からエンジニアになった人。なんだけどすごい喋りやすく。てさ下調べすごいしさやっぱこういうのって能力のひとつだよねちょっと思った。よねいや思いましたねなんかエンジニアだけ僕はエンジニアとしてしか経験がないので割とこっちに来て面接対策とか考えれば結構軽視してた感じなんですよね技術力あればええやろみたいな技術力高ければ伝わるやろ思ってたんですけどまぁそれ伝わる場合もあれば伝わらない場合もあってそうねどんなケースにおいても相手の伝え方を実際にちゃんと考えたりするとどんなケースにおいても刺さりやすくなるっていうのがあるなと思ううん素晴らしいそれはなん。か就職じゃない人生の話みたいな人生の深い話をそしたら前半結構長くなってきたので最後質問なんですけど、オファーを受けた時の流れだったり、どんな風に感じたかみたいなのを聞ければなと思います。1社目ですかね。どうしましょう。3社もあるからね。まあでも直近の3社目でいきますか。直近の3社目。オファーを受けた時。その時は、会社の面接フローがすごい早く進めてくれてて、それは実は今働いてる会社の給料が遅延してたっていうことを最初から話してたんで結構スムーズに進めてくれたっていうのもあってでまぁスミ面接は3時か4時くらいまでやって最後にまたリクルーターの人との最終確認みたいなので給料を提示されたっていう感じだったんですけどただステアはジョブポジションなんかそのジョブのなんて言うんですかそれジョブディスクリプションのページに給与のレンジがそもそも示されているので、あんまり僕は交渉はしなかったかなっていう。まあそうだよね、。東海オンエアさんのところもマトリックス決まってるもんね、。たぶん。そうですね、基本的にはマトリックス決まってて、あとは前の会社からのどのぐらいかみたいな、前の会社が例えばですけどすっごい低くて、次の会社がすっごい高ければやっぱまあもう多分マトリックスの一番下みたいな感じになるし、例えばお前の会社がアマゾンみたいなとか大きい会社来たらすると、もうそのその時点でちょっとマトリックスと合わなくなっちゃったりもするんで、そこの兼ね合いとかもあるけど基本的にはマトリックスにフォローしてって感じなんじゃないですかね。なるほどね。せやほど大きかったらね、。これ。そうですね。お金のことは後半という。ことで一番大事なところです。からね前半は就職するまでの流れ聞いたんでここまでにしようかなと思いますありがとうございました。",
  "utterances": [
    {
      "speaker": "A",
      "text": "オッケーです始めますかはいじゃあそしたら今回は優吾くんがバンクーバーで就職を決めたということでインタビューしていきたいと思います国はカナダのバンクーバーで会社はスペアだと思いますそしたらじゃあまず簡単に経歴を。",
      "start": 548,
      "end": 20371,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "教えてくださいはい優吾ですプログラミング始めたのは大学生の時ですね大学はそもそも名古屋大学情報文化学部っていうなんか分離融合している学部みたいなところに、文系だけど入って、そこで授業でプログラミングやったのが始まり。まあはしょりますけど、いろいろバイトやら何やらやって、2019年卒にウェブフロントエンドエンジニアとして株式会社エウレカっていうマッチングアプリのペアで作ってる会社に新卒で入りました。で、2年間ちょっとそこで働いて転職して、スタンドFMって音声系のスタートアップに転職をしましてそこでフルスタックのエンジニアとしてそれもまた2年ちょっとぐらい働きました良い会社ですねでその後は半年ちょっとぐらいフリーランスで食いつないでカナダに来たでカナダに来たのが2024年の末2023年の末か3年3年の末ですね経歴的。",
      "start": 20371,
      "end": 77888,
      "timestamp": "00:20"
    },
    {
      "speaker": "A",
      "text": "には4年5年です。",
      "start": 77888,
      "end": 79328,
      "timestamp": "01:17"
    },
    {
      "speaker": "B",
      "text": "か5年ぐらい5年日本でエンジニアやった後にこっちに来ましてカレッジに通いましてで初めてカナダの会社で就職したのが2024年の10月まあいろいろあるっていう感じで転職を1回目してしたのが2025年の2月か1月ぐらいですねそこで働いてたんですけどちょっとその会社の会社のね給料が遅延してしまって給料見払い問題が発生してしまい家賃来月分払えるかどうかわからないという事件が。",
      "start": 79328,
      "end": 114450,
      "timestamp": "01:19"
    },
    {
      "speaker": "A",
      "text": "あり落ち込んでたからねそう。",
      "start": 114450,
      "end": 116451,
      "timestamp": "01:54"
    },
    {
      "speaker": "C",
      "text": "本当にこれ言ってもいいのあなたのyoutbeでボンボン公開。",
      "start": 116451,
      "end": 120575,
      "timestamp": "01:56"
    },
    {
      "speaker": "B",
      "text": "しますよねあの全然大丈夫です見ましょうフォトキャストの見。",
      "start": 120575,
      "end": 124279,
      "timestamp": "02:00"
    },
    {
      "speaker": "A",
      "text": "てるんでいや何ならあの時あのそれこそ僕と友達もう一人友達とセナさん呼んでちょっと1回ご飯でもいいって話だけ聞くわみたいなセナさん結局ね来なかっ。",
      "start": 124279,
      "end": 134408,
      "timestamp": "02:04"
    },
    {
      "speaker": "B",
      "text": "たけど来れなかったんだよなんでセミナー前に言うんだよ。",
      "start": 134408,
      "end": 139714,
      "timestamp": "02:14"
    },
    {
      "speaker": "A",
      "text": "で、なんかあれこの人もう帰るなぁみたいな感じだったけど。",
      "start": 139714,
      "end": 144081,
      "timestamp": "02:19"
    },
    {
      "speaker": "B",
      "text": "ギリギリギリギリギリそれがあったけど話聞いてもらってギリギリなんとかなり2025年の5月からまた新しい会社で働き始めましたっていうことなんでカナダ来て今1年半ちょっとですけどもう3社目で初めて働いてから半年ぐらいで3社目に突入する。",
      "start": 144081,
      "end": 163552,
      "timestamp": "02:24"
    },
    {
      "speaker": "C",
      "text": "すごいジョブホッパーみたいな仕方ないん。",
      "start": 163552,
      "end": 167593,
      "timestamp": "02:43"
    },
    {
      "speaker": "B",
      "text": "だけどジョブホッパーびっくりなホッパー。",
      "start": 167593,
      "end": 170494,
      "timestamp": "02:47"
    },
    {
      "speaker": "C",
      "text": "ぐらいホッパーしてますねいや。",
      "start": 170494,
      "end": 172114,
      "timestamp": "02:50"
    },
    {
      "speaker": "B",
      "text": "こんなことがやりたかったわけではないがまあでも落ち着いたからね、そんな感じですね。",
      "start": 172114,
      "end": 177783,
      "timestamp": "02:52"
    },
    {
      "speaker": "A",
      "text": "ちょっと高校前に戻って、何か渡航するきっかけとか経緯とか何か何でそもそも海外で働きたくなったのかみたいなことありますか?",
      "start": 177783,
      "end": 188137,
      "timestamp": "02:57"
    },
    {
      "speaker": "B",
      "text": "なんかまあ元々海外への漠然とした憧れみたいな、海外というか多分英語圏なのかな漠然とした憧れみたいなのがあって、多分たどるときっと高校生ぐらいに遡るけどまあそれはずっと漠然とした憧れではあったと。",
      "start": 188137,
      "end": 203774,
      "timestamp": "03:08"
    },
    {
      "speaker": "C",
      "text": "それはなんかエンジニアとして?",
      "start": 203774,
      "end": 205235,
      "timestamp": "03:23"
    },
    {
      "speaker": "A",
      "text": "それともただ英語で働きたいみたいな?",
      "start": 205235,
      "end": 207896,
      "timestamp": "03:25"
    },
    {
      "speaker": "B",
      "text": "英語を使って海外で生活して働く。人生長いから一回はやってみたいなぐらい。",
      "start": 207896,
      "end": 214670,
      "timestamp": "03:27"
    },
    {
      "speaker": "A",
      "text": "死ぬ前に?",
      "start": 214670,
      "end": 215271,
      "timestamp": "03:34"
    },
    {
      "speaker": "B",
      "text": "死ぬ前にっていうのが多分一番最初。ただなんか明確に行かなきゃってなったのはコロナの時の経験が大きいかもなって気がしていてそのコロナの経験するまでは僕の中では結構勝手に世界では結構グローバリズムが進んでいって、どんどんどんどん世界に出るハードルっていうのは下がっていくんだろうなぁとか勝手に思ってたんですけど、こういうのを経験してみると、いや別に世界ってそういう風に先見変化するっていうよりかは、突然自分の力ではどうしようもできない社会的な事件が起きて、自分がやりたかったことができなくなるタイミングってあるんだなと思って。っていうのを実感したら、ちょっと海外に行ってみたい、人生でいつかは行けたらいいなって思っていたところにそういうのが起きたんでまあなんか本当に行きたいんだったら行けるときに行かなきゃなっていうのをコロナ後で思い始めましたと年齢的にもあったんですかね年齢はその時に25歳ぐらい。",
      "start": 215271,
      "end": 278662,
      "timestamp": "03:35"
    },
    {
      "speaker": "C",
      "text": "そんなに若かったっけ?じゃあそうでもないのか。",
      "start": 278662,
      "end": 281743,
      "timestamp": "04:38"
    },
    {
      "speaker": "A",
      "text": "具体的に動き始めたというか、コロナの後ぐらいから、コロナに始まったから行かないといけないんだな、みたいな自分で。",
      "start": 281743,
      "end": 292027,
      "timestamp": "04:41"
    },
    {
      "speaker": "B",
      "text": "行かなきゃいけない。そこで気持ちが一段強まったっていうのが一つの理由で、で同時にそのさっき言ったスタンドFMっていう会社で働いていたけどそろそろ転職したいなと思ったのが20何年ですかね23年に入るか入らないかぐらいだったんですよで僕としてはまあどうせ会社転職するんだったらこのタイミングで海外行っておかないとまああのあまり新しく日本の会社に転職してしまうとまた2年3年潰すだろうなとここで会社辞めるんだったら海外行かなきゃっていうのを始めたのが2023年に入るか入らないかぐらいです同時に僕はそのITトリオっていうポッドキャストやってるんですけどそのエンジニア系のポッドキャストなんですよ。それの競合調査があっていろいろなエンジニア系のポッドキャストを聞き漁っていた時期があって、そこでフロックの瀬名さんも永遠のゲストとしてやっていたワンクーバーのエンジニアというものに出会い、同時に聞くようになったんですよ。聞いてみるとどうやらカナダのバンクーブはビザ的にも結構エンジニアとして行きやすいし長く住みやすいしなんなら永住権も取れてキャリアも作りやすいようだかついろんな人のエピソードを聞いてみるとどうやら別になんかめちゃくちゃ優秀な人が行っているっていうよりかはきちんと情報を集めてきちんと準備をした人がちゃんと現地の就職に成功してるんだなって結構再現戦があるんだなっていうことがわかってそういうのの組み合わせがちょうどあったのが2023年入った後ぐらいそこらへんは。",
      "start": 292027,
      "end": 392071,
      "timestamp": "04:52"
    },
    {
      "speaker": "A",
      "text": "それで言うと結構変わってきてますよね僕が来た時は2018年カナダに来た時は2018年でその時はなんか僕も含めてあんまり準備もしてないし計画的に来てた人は少なかったイメージなんですけどそんなことないですか?",
      "start": 392071,
      "end": 407692,
      "timestamp": "06:32"
    },
    {
      "speaker": "C",
      "text": "そんなことある。トガシさんが一番いい例じゃないですか。どこの国に行くかも。",
      "start": 407702,
      "end": 410645,
      "timestamp": "06:47"
    },
    {
      "speaker": "B",
      "text": "決めてないし、。",
      "start": 410645,
      "end": 412606,
      "timestamp": "06:50"
    },
    {
      "speaker": "C",
      "text": "何をしに行くかもよくわかってないんだけど。",
      "start": 412606,
      "end": 414518,
      "timestamp": "06:52"
    },
    {
      "speaker": "A",
      "text": "でも僕以外にも、そんなにこのビザ使ってこうやって行くみたいなのは決めてなくて、みんななんか永住権ないとなんか2社目って結構難しいらしいみたいな、なんかちょっと足元見られて金額落ちるらしいみたいなので永住権を考えるみたいなのが割と主流みたいな感じだったんですよ。",
      "start": 414518,
      "end": 431722,
      "timestamp": "06:54"
    },
    {
      "speaker": "C",
      "text": "あの時期はさ、ぶっちゃけ簡単だったんですよ。あったじゃないですかあのbcpbがあって要するに正直英語力がそんな高くなくてもa受験取れちゃってた。",
      "start": 431722,
      "end": 439966,
      "timestamp": "07:11"
    },
    {
      "speaker": "B",
      "text": "時代があったね噂に。",
      "start": 439966,
      "end": 441486,
      "timestamp": "07:19"
    },
    {
      "speaker": "C",
      "text": "聞くそうだからなんだろう割とやっぱり2018年9年あたりはエンジニアというキャリアがあればワンチャンこっちへなんとかなるっていうのがあったのが22年3年あたりからやっぱ厳しくなったですよね英語なんて絶対できなあかん飲んどったらフランス語も頑張るみたいなのが今なのでまあ無計画だとほぼ難しくなったのは間違いないですねそれも。",
      "start": 441486,
      "end": 463958,
      "timestamp": "07:21"
    },
    {
      "speaker": "A",
      "text": "あるんですかねなんかこの頃の人はやっぱりなんかそれこそなんか頭がいいというかちゃんと計画して英語も勉強してきてあの就職も1回まあ経験積んで2,3年してからみたいなまあタイプは結構多いというかまあほとんどそんな感じなのだって冷静。",
      "start": 463958,
      "end": 478803,
      "timestamp": "07:43"
    },
    {
      "speaker": "C",
      "text": "に考えてトカシさんが行ったカレッジとかさあそこも最初入るとき多分教育700点とか600点とかそのレベルで入れた時代だったのがもう今80090とか?じゃないと無理だから、てかTOEICじゃもう無理だ。",
      "start": 478803,
      "end": 490747,
      "timestamp": "07:58"
    },
    {
      "speaker": "A",
      "text": "からなんだろ、それもそんなにしっかりしてなくてTOEICのやつ出してなくて出すかテストやってって言われて、取り寄せるのめんどくさいからテストやりますよって言われて、じゃあテスト受けますって言ってテストの日風邪ひいて行かなかったのに普通にそこに入りましたからね今絶対に入らないじゃん、ありえないそうですよね。",
      "start": 490747,
      "end": 509051,
      "timestamp": "08:10"
    },
    {
      "speaker": "C",
      "text": "だからこう来るのがそもそもハードル上がったよね、。",
      "start": 509051,
      "end": 511882,
      "timestamp": "08:29"
    },
    {
      "speaker": "B",
      "text": "そういう時と比べるとそれで言うと別になんか僕めちゃくちゃ準備したっていうわけでもない海外トップのためにそのいろいろ重なって海外行きたいなと思った時に自分でも行けそうだと思ったのが良かったかななんかだからフロックに相談、一番最初の説明会に参加したのが2023年の2月か3月ぐらいだった気がするんですよ準備半年くらいかその時はまだスタンドエフェンスに働いていてまあもうちょっとしたら辞めるだろうから辞めたらまたしっかり考えるのかなと思っていたけどまあいろいろあってもうちょっと早めに辞めたいなという時期があり、実際に辞めたのが8月か7月ぐらいだったんですよ。それの時にまた個別の相談をさせてもらって、本当は最初めちゃくちゃ急いで9月からカナダに行けたらいいなとか思ってたんですけど、さすがに間に合わず1月、その次の2024年の1月からカレッジに通うっていう方向で準備をした。なるほど。",
      "start": 511882,
      "end": 567449,
      "timestamp": "08:31"
    },
    {
      "speaker": "A",
      "text": "なんかカナダを選んだ理由はポッドキャストを聞いてたからなんですか?それとも他の選択肢も一応考えてみてみたいな感じなんですか?",
      "start": 567449,
      "end": 577986,
      "timestamp": "09:27"
    },
    {
      "speaker": "B",
      "text": "ポッドキャスト聞いたのが一番大きくてそもそもその考える前はスタンドエフェムがフルリモートだったんで時差の少ない国でノマドというか住みながらリモートワークできたら嬉しいなっていうのがあったんですよねだから最初考えてたのはニュージーランドとかオーストラリアのワーキングオフィリビザ使えば時差って日本とそんなに変わらないしだったら別に英語を使って海外で働きながら働くってまあいけるかなというふうに思ってたんですよねそういう中でそのフロックというか砂さんがやってたポッドキャストを聞くとなんかワーホリのビザって別に将来で繋がるっていうよりかは現地の企業で働くんだったらいろいろ制約はあるし働かないんだったらまあそれで終わりだしただ使い道によってはカナダでさらに長く働ける選択肢があるということをポッドキャスト聞いて初めて知ったのかなそういうことですねその後、オトリアとかカナダとか、その2つしかほぼ見てなかったですけど調べてみると、カナダというかバンクーバンの方が色々やりやすそう何なら別にフロックがあるから色々聞けば教えてくれそうコミュニティ。",
      "start": 577986,
      "end": 646277,
      "timestamp": "09:37"
    },
    {
      "speaker": "A",
      "text": "があるのは大きいですよ。",
      "start": 646277,
      "end": 647058,
      "timestamp": "10:46"
    },
    {
      "speaker": "B",
      "text": "ねコミュニティもあるし成功事例が溜まってたんでその時でも結構インタビューの数って結構インタビュー記事たくさん出て。",
      "start": 647058,
      "end": 653339,
      "timestamp": "10:47"
    },
    {
      "speaker": "C",
      "text": "たと思うアメリカは試合入らんかった?",
      "start": 653339,
      "end": 656590,
      "timestamp": "10:53"
    },
    {
      "speaker": "B",
      "text": "アメリカは考えたことないアメリカに行きたい人ちょっと僕はあんまりそういう気持ちがないので給料が高くて目指したいという気持ちは分かるけど別になんかシリコンバレーがどうのこうのっていう憧れはあんまり僕は実は持ったことがないちょっと意外ですね。",
      "start": 656590,
      "end": 674187,
      "timestamp": "10:56"
    },
    {
      "speaker": "A",
      "text": "優吾くんの僕のイメージは割と技術強くてその技術強いってやっぱりサンフランシスコとかアメリカのメジャーリーグ目指そうみたいなそういうタイプが多くて僕全然どっちか言うとビジネスデベロッパーなんてないからちょっとなんか逆パターンなんだけど。",
      "start": 674187,
      "end": 694101,
      "timestamp": "11:14"
    },
    {
      "speaker": "B",
      "text": "確かに僕は結構技術が好きで、普通になんかOSの貢献とか色々コミュニティの登壇とか日本にいる時もちょっとだけしてたりとかして、そもそもエンジニアリングというかエンジニアっていう職自体が好きで技術自体が好きっていう施策ではあるんですけど、なんでそう思わないんですかね、別になんかプロダクトって見ると確かにシリコンバレーで生まれたものが多いかもしれないんですけど別に技術単体とかプログラミング言語とかフレームワーク単体を見ると別にシリコンバレーが中心という感じはあんまり僕感じたことなくてコミッター多いかもしれないですけどそうですねその根本はまあどこにあるかわかんないですけど例えば僕はReact使う前とかVue使ってたんですけどVueって別にシリコンバレー関係ないじゃないですかイーヴァンスさんがやってたのは、どっちかって言うとアジアの方がコミッター多かったり強かったりするとか、他にもなんかアフレマークとか色々見てると別にそう中心地がシリコンバレーにあるってことは多分今振り返ると感じたことがなかったんでまあ別に引っ掛けがなかったって感じですかね。",
      "start": 697371,
      "end": 763130,
      "timestamp": "11:37"
    },
    {
      "speaker": "A",
      "text": "そう考えるとすごいロジカルですねなんかその技術的なものを多分中心に置いてて多分シリコンバレー目指す人たちはどっちかというとFacebokとかAmazonとかGogleとかが生まれたその企業が生まれる地としての中心地みたいなイメージがあるのかな。",
      "start": 763130,
      "end": 779132,
      "timestamp": "12:43"
    },
    {
      "speaker": "B",
      "text": "そういうだけだよねあとは単純に結構バイアスかかってるかもしれないですけどアメリカ。",
      "start": 779132,
      "end": 785874,
      "timestamp": "12:59"
    },
    {
      "speaker": "C",
      "text": "治安悪そう怖いみたいな日本。",
      "start": 785874,
      "end": 791256,
      "timestamp": "13:05"
    },
    {
      "speaker": "B",
      "text": "の安全な環境で生まれて育ってしまったからそんなこう銃がバンバン撃たれるような地域に住みたい気持ちがあまり湧かないぜっていうまあ確かにね確かにそうです。",
      "start": 791256,
      "end": 803037,
      "timestamp": "13:11"
    },
    {
      "speaker": "A",
      "text": "ねそしたらちょっとまた戻ってちなみに英語学習について聞きたいんですけどどのくらいからなんだろう英語学習を始め具体的なんかちゃんと始めたかみたいなもちろん大学受験とかねいろいろやってきているとは思うんですけどなんかどんな感じで勉強し始めたか特に。",
      "start": 803037,
      "end": 818981,
      "timestamp": "13:23"
    },
    {
      "speaker": "B",
      "text": "なんかスピーキングとかあーいうとやっぱりその大学受験が一番大きいそれで結構土台ができた感じはインプットはじゃあそこで入れそうまずその後もせっかく勉強したから忘れたくないなーって思いで、たまに教育受けたりとかはしていて。",
      "start": 818981,
      "end": 835369,
      "timestamp": "13:38"
    },
    {
      "speaker": "A",
      "text": "それは英語だけですか?ちなみに数学とか忘れ?",
      "start": 835369,
      "end": 837799,
      "timestamp": "13:55"
    },
    {
      "speaker": "B",
      "text": "いや英語だけ英語だけ。英語はまあ絶対役に立つだろうなって時点で思ったんで、大学の時は統一を受けましたね、一回。で、ちょろちょろ何か気が乗りたら英語の文献読むとかしていて、で、ただ卒業する前にやっぱりあのもうちょっと英語、特にプログラミングに関することで英語のドキュメントとか読めた方、スムーズに読めた方が何か力になるなということを感じたので、いったいネイティブスクリプトっていうあの、JavaScriptを使ってもうアプリが書けるみたいな結構ニッチなフレームワークがあるんですけど、それのリュウ向けのドキュメントを一人でほぼ全部翻訳したことがあってソデカPRを作ってOSにいきなり送るみたいなことがあってそれがねなんか合計のページ数わかんないんですけど30ページとか40ページぐらいを結構長いドキュメントを一人でこの研究室が使えたのでそこに普通にこもってネットを使わせてもらいながらなんかたまにグーグル翻訳頼りながらも自力で翻訳をしてっていうのを一回やったことあるんですよねじゃあコミッターですかそうですね素晴らしいそれが多分リーディングにおいてはそれが一番大きかったなと思ってそれがあとは結構別にあの海外のフレームワークとかのドキュメントを英語で読むことに結構抵抗がなくなったっていうのが一番大きい。いや、それ大きいかもな。",
      "start": 837799,
      "end": 923155,
      "timestamp": "13:57"
    },
    {
      "speaker": "A",
      "text": "頼まれずにそれを自分でできるのはすごいですね。",
      "start": 923155,
      "end": 925405,
      "timestamp": "15:23"
    },
    {
      "speaker": "C",
      "text": "いや、でもね、俺ちょうど同じ事例を聞いたのよ。その人はインディーゲームをすごい好きで、アメリカで作られているインディーゲームの日本語版を無償でOSでコミッターでやったらすごいリーディングが伸びてっていう。",
      "start": 925405,
      "end": 936938,
      "timestamp": "15:25"
    },
    {
      "speaker": "B",
      "text": "のを全く同じこと聞いたから。",
      "start": 936938,
      "end": 938708,
      "timestamp": "15:36"
    },
    {
      "speaker": "A",
      "text": "いやでも確かに会社とかで読まないといけない例えば僕今の会社本当ドキュメント結構多いタイプの会社なんでめちゃくちゃ読むんですけど確かに本当に読むスピードも早くなったし理解も早くなったしいいなと思うんですけどそれは会社の時間で頼まれてというか仕方なくお金をもらいながらやるっていうのが結構大きくてそれなしになんだろう自分でやりたくてこもってわざわざ他の人のために書いて翻訳してあげるっていうのをできるのはすごいなぁ。",
      "start": 938718,
      "end": 972009,
      "timestamp": "15:38"
    },
    {
      "speaker": "C",
      "text": "と思ってまあね確かに。",
      "start": 972009,
      "end": 973469,
      "timestamp": "16:12"
    },
    {
      "speaker": "B",
      "text": "結構僕の性格がそっち向きなのもあるかもしれないそもそも何かを勉強するとか学習するっていうことが割と好きな性格っていうのもあるしその時は僕OSにコミットしたことがなかったんですよでその時点でなんかあんまりこう他の人が書いたプログラムに対してコミットを送るっていうことが僕の中ではそもそももうちょっとドキュメントの翻訳量よりもハードルが高いと感じていたのでOSの後継の中でその時の自分の視点で一番ハードルが低いものといったらまあ翻訳かななるほどでもなん。",
      "start": 973469,
      "end": 1006667,
      "timestamp": "16:13"
    },
    {
      "speaker": "A",
      "text": "かよく言われますよねそれはなんかそのOS何から始めていいかわかんない人はとりあえず翻訳やって日本語版出せみたいなそれだと割とアプローブされやすい。",
      "start": 1006667,
      "end": 1016817,
      "timestamp": "16:46"
    },
    {
      "speaker": "B",
      "text": "し確かにそれで一石二鳥みたいなところがあったんででもそもそも翻訳すれば自分の英語のリーディング力身につくだろうなと思ってたんで、これをやれば英語の読解力もつくし、OSのコミット履歴もつくし、責任長じゃんって思ってやったのが多分理由な気がします。",
      "start": 1016817,
      "end": 1039095,
      "timestamp": "16:56"
    },
    {
      "speaker": "A",
      "text": "がインプットで、そしたらスピーキングだったり発音だったり、なんかアウトプットみたいなところ、特に日本人が苦手なところ。",
      "start": 1039105,
      "end": 1045892,
      "timestamp": "17:19"
    },
    {
      "speaker": "B",
      "text": "だと思うんですけど、。",
      "start": 1045892,
      "end": 1046952,
      "timestamp": "17:25"
    },
    {
      "speaker": "A",
      "text": "そこら辺は何かあります?",
      "start": 1046952,
      "end": 1049326,
      "timestamp": "17:26"
    },
    {
      "speaker": "B",
      "text": "スピーキング磨かなきゃな、みたいなことを思ったのは、新卒で入って絵売れ家。",
      "start": 1049326,
      "end": 1053360,
      "timestamp": "17:29"
    },
    {
      "speaker": "C",
      "text": "が大きいですね。",
      "start": 1053360,
      "end": 1054942,
      "timestamp": "17:33"
    },
    {
      "speaker": "B",
      "text": "絵売れ家はフェアズ運営している絵売れ家って日本生まれではあるんですけど、今は外資なんですよね。ティンダーの会社のマッチグループが年代忘れちゃいましたが買収してて、僕が入った時には結構外国籍のメンバーとかも結構いたんだ。たまにそのマッチグループの役員の人がオールハウスで来て、英語で話してなんかトランシーバー配られて同時通用とかもあったりして、それもあって社内のイベントで外国籍のメンバーと喋る時に英語を使おうと思ったら使える機会があったりとかしたし、そんなに多くなかったですけどあとは福利厚生でサービス忘れちゃいましたけど、オンライン英科学教室の一定の1ヶ月に15日以上受けたら全部会社が払ってくれるみたいなのがあったのでそれをちょろちょろ使ってたりはしましたただあんまりそれで向上した実感はないかもしれないそれでモチベーションをなんとか保っていたのが大きい気がしていてもうちょっと具体的なスピーキングの能力伸びたなっていうのはカナダに来る前にスタンダードフィルムで働いたりフリーランスしながらノマドでアジアを回っていた時期があるんですよ。",
      "start": 1054942,
      "end": 1126836,
      "timestamp": "17:34"
    },
    {
      "speaker": "A",
      "text": "本当に回ってたんだ?",
      "start": 1126836,
      "end": 1127836,
      "timestamp": "18:46"
    },
    {
      "speaker": "B",
      "text": "本当に回ってました。マレーシアとタイとかベトナムとかに行ったりして、そこで英語をちょろちょろ使い始めたっていうのがまず一つあったのと、プラスでそのノマドする中で外国人の彼女ができたので定期的に英語をしゃべる機会ができた遠距離なんですけど週1ぐらいで電話をしているのであとメッセージのテキストのやりとりも全部英語でしかやってないのでそれでカナダに来る前の半年以上前から結構英語を身近に使うという環境が出来上がってくれたのでカナダに来た時にそこそこスムーズだったり他の。",
      "start": 1127836,
      "end": 1167284,
      "timestamp": "18:47"
    },
    {
      "speaker": "A",
      "text": "国の英語の留学経験とかはあるんですか?",
      "start": 1167284,
      "end": 1170348,
      "timestamp": "19:27"
    },
    {
      "speaker": "B",
      "text": "はないですね。高校生の時に1週間くらいホームステイ、アメリカだったかな、アメリカだけど、まあそれはアメリカ楽しいぐらいの、。",
      "start": 1170348,
      "end": 1182802,
      "timestamp": "19:30"
    },
    {
      "speaker": "A",
      "text": "確かに2時間だったと。",
      "start": 1182802,
      "end": 1183883,
      "timestamp": "19:42"
    },
    {
      "speaker": "C",
      "text": "思うんだけど、旅行だよね。",
      "start": 1183883,
      "end": 1185564,
      "timestamp": "19:43"
    },
    {
      "speaker": "B",
      "text": "まあでもやっぱ本当に英語を使う国ってあるんだなぁみたいな学びはありましたが。",
      "start": 1185564,
      "end": 1190108,
      "timestamp": "19:45"
    },
    {
      "speaker": "A",
      "text": "なんか喋ることに抵抗がある時期ってあるじゃないですか。そこらへんを抜けたのってどのタイミングだったんですか?",
      "start": 1190108,
      "end": 1197684,
      "timestamp": "19:50"
    },
    {
      "speaker": "B",
      "text": "それはノマドをしてたのが大きいですかね。マレーシア行った時になんか英語を使ってやり取りしてみると別に相手が使う単語が別にわかんないわけでもないし、後から振り返ると自分が言いたかったことって別に難しい単語じゃないけどその場で言えないことが多いなっていうのをいろいろ回る中で自分で気づいて、なると自分に足らないのは語彙力とか文法の力よりももう慣れなんだなということを実感してそれが大きかったのもあるし、あと慣れもあるしなんかこう文化的な理解も重要なのかなみたいな根的性の理解も重要なのかなと思ってマレーシア行った時にまあマレーシアもちろんコンビニがあるんですよねコンビニで買い物した後にいきなり店員さんからプラスチックって聞かれたんですよプラスチック?プラスチックってちょっとやり取りしたらどうやらそれはビニール袋のことだったなるほどねうちにはあんまりそういうやりとりしないからわからないけどマレーシアではとりあえずプラスチックがプラスチックって言われるのがビニール袋入れますかって意味だったんですよでも別にそれってプラスチックって絶対日本人は誰も知ってるじゃないですかでも僕はその場でそれにすぐ反応できなかったんですよこれはプラ何?それは単語を知らなかったのが悪いんじゃなくて単純にその文化とかコンテキストが頭に入ってなかったし理解できてなかっただけなんだなっていうことを自分でいろいろ回りながら思っていろいろ振り返るとやっぱこれはなれるしかないんだなそれ。",
      "start": 1197684,
      "end": 1293325,
      "timestamp": "19:57"
    },
    {
      "speaker": "A",
      "text": "逆も多分あってエンジニアってやっぱ就職まあ他の業種に比べてしやすいのはなんか英語喋れないけどまぁjavascript話せるじゃないけどプログラミング言語とかでまあプログラミング言語基本はほぼほぼ英語じゃないですか日本語でもある言語もあるらしいけど基本的には英語でそれについて喋っている時は全部の単語が理解できなかったりセンテンスとして理解できなくてもこの人何言ってるかわかるみたいな瞬間ってやっぱりエンジニアだと結構あってそういうのはやっぱりコンテキストを理解しているから全部理解できてなくても理解できる伝わるみたいなのがあるんで功績を理解するのはすごい大切なことですよね。",
      "start": 1293325,
      "end": 1333423,
      "timestamp": "21:33"
    },
    {
      "speaker": "B",
      "text": "しかもそれを理解できると、自分の能力がないから悪いんじゃなくて、単純に慣れてないからなんだっていうふうに、別に自分は悪くないって冷静に分析できるようにもなるので、それもあってどんどん失敗した方がいいのは、いろんなところで言われてるけど実際そうなんだな、。",
      "start": 1333423,
      "end": 1349968,
      "timestamp": "22:13"
    },
    {
      "speaker": "A",
      "text": "みたいな。",
      "start": 1349968,
      "end": 1350428,
      "timestamp": "22:29"
    },
    {
      "speaker": "B",
      "text": "それで経験を積めば積むほど、もう一回同じような状況に出会った時に、よりスムーズにやり取りができるんだなっていうふうに思い始めたのが、マレーシアにいた頃だから、カナダ来る、やっぱりそれも半年ちょっと前ぐらいって感じですかね。プラスチックって言われたらね、。",
      "start": 1350428,
      "end": 1365753,
      "timestamp": "22:30"
    },
    {
      "speaker": "C",
      "text": "紙かな?プラスチックかな?って選ばせるかなっていう。",
      "start": 1365753,
      "end": 1368493,
      "timestamp": "22:45"
    },
    {
      "speaker": "A",
      "text": "最初俺そう思ったよ。こっちだとバックみたいな、プラスチックバックとか言われるから。",
      "start": 1368493,
      "end": 1372814,
      "timestamp": "22:48"
    },
    {
      "speaker": "B",
      "text": "バックなら一瞬で分かってた。",
      "start": 1372814,
      "end": 1374775,
      "timestamp": "22:52"
    },
    {
      "speaker": "C",
      "text": "バックだろうって思ったわ。",
      "start": 1374775,
      "end": 1375975,
      "timestamp": "22:54"
    },
    {
      "speaker": "B",
      "text": "プラスチックって聞かれるの何?みたいな。",
      "start": 1375975,
      "end": 1378085,
      "timestamp": "22:55"
    },
    {
      "speaker": "A",
      "text": "なんだろうねって。そういう日本語って結構あるから日本でも起こるんだろうなみたいな。バックは出てこないけど、。",
      "start": 1378085,
      "end": 1384387,
      "timestamp": "22:58"
    },
    {
      "speaker": "B",
      "text": "なんだろうね。",
      "start": 1384387,
      "end": 1386007,
      "timestamp": "23:04"
    },
    {
      "speaker": "A",
      "text": "いろいろあるじゃないですか、その同じ英語、英語をインポートされて日本語として英語を使ってるんだけど海外の人からしたら分かんないみたいなのって結構ないですか?だからなんかそんなもんな。",
      "start": 1386017,
      "end": 1396584,
      "timestamp": "23:06"
    },
    {
      "speaker": "C",
      "text": "のかなみたいなまあそうね、日本は略が多すぎるか。",
      "start": 1396584,
      "end": 1399667,
      "timestamp": "23:16"
    },
    {
      "speaker": "B",
      "text": "なそんなもんなのかなって思える立場に一早く行けたのは良かったですね、神奈川大島行くの素晴らしい。",
      "start": 1399667,
      "end": 1408853,
      "timestamp": "23:19"
    },
    {
      "speaker": "A",
      "text": "そしたら、渡航前のもう一つ聞きたいのは、日本にいる間にやっておいてよかったこと、来た後に役立ったな、これ先にやっておいてよかったな、みたいなことってありますか?",
      "start": 1411081,
      "end": 1424138,
      "timestamp": "23:31"
    },
    {
      "speaker": "B",
      "text": "難しいですね。情報収集。まあ僕がこっち来る時は別に日本から応募しても通んないだろうなっていうことは色々ちょっと調べたらわかったんで別に応募とかはしなかったんですけど調べようと思ったらなんか全体として何が必要になりそうかわかると思っていて、それこそそのフロックのインタビュー記事とか、あのポッドキャスト聞くとかもそうですし、なんかいろんな個人の人が書いているものをいろいろたくさん読んでみるとわかることもあるんですけど、ジェネラルにやっぱり英語は伸ばしておいたほうがいいなとか、なんかレジュメいるらしいから職歴の整理は多少ないともしておいたほうがいいなみたいなことがあって、そこらへんはちょろちょろ準備はしていたっていう感じですねたださっき言った通り僕割と日常的に何か技術を学ぶとか英語をちょろちょろ勉強するとかっていうのはまあずっとやってたのでカナダに来るために特別集中して何かやったかって言われるとそんなにないかも日頃の勉強の延長みたいな感じで聞い。",
      "start": 1424138,
      "end": 1487129,
      "timestamp": "23:44"
    },
    {
      "speaker": "A",
      "text": "た感じで言うとそのマレーシアとか行ってた期間はすごい良かったのかなって感じですけどね僕も来る前に来る前とか結構その結構2年ぐらい空いてましたけどフィリピン一回行ってそれはそれこそ留学券なんだろうホリデーみたいな感じで行ったんですけどなんかそのなんだろうね喋る気持ち悪さがなくなるだったりとかアジア圏の英語とこっちの英語、こっちの英語すごい早いから、アジア圏に比べて全然違うんだけど、まあなんかやっぱ近いって英語ちょっと喋れるようになるとか、まあなんか身振り手振りプラスちょっとした単語で言えるようになるとかはあると思うんです。それはなんかすごい聞いてて良かったのかなみたいな。",
      "start": 1487129,
      "end": 1524040,
      "timestamp": "24:47"
    },
    {
      "speaker": "B",
      "text": "それはめちゃくちゃ良かったですね。思い出したんですけど、そこでマレーシアでノマドした経験とかを、日本の英語を使うデザイナーとかが集まるイベントで登壇して話したりもしてて、それも結構良かったかもしれないですね。事前にそういうのをやっておくと、そういうのをやってない人がカナダに来て初めて経験することをすでに知っておけるんで、それで結構マインドセットが出来上がるというか。そこら辺知れたの良かったかも。それ言うと確かにマレーシアで行ったのも、マレーシアの人も英語ネイティブの人じゃない人が多いから、なんか一口に英語って言ってもいろんな英語があるんだなっていうのをあらかじめこう肌の身で実感できたのは大きかったかもだから別にネイティブじゃないことをなんかこうコンプレックスに思わなくていいというかそれぞれが別になんかそれぞれの鉛を持って別に発音はそんなに気にせず意図が通ればokぐらいの感じでコミュニケーションしてるんだなってことが分かった。",
      "start": 1524040,
      "end": 1579305,
      "timestamp": "25:24"
    },
    {
      "speaker": "A",
      "text": "のでそれをどれだけ英語学習の中でどれだけ早く気づけるかってすごい大切ですよねなんかこっち来て僕自分もそうだったんだけどすぐの人って割とすぐネイティブに聞くとかネイティブにレジュメ直してもらうとか自分もそうだったから本当に一言は言えないんだけどネイティブの人、うちのチーム例えばいないけどなとか全然あるじゃないですかそこをネイティブだからといって、技術に明るい人とか、いろんな要素があるうちのネイティブ一つでしかないし、読む人もネイティブじゃないから、そもそも文法、別に全部ちゃんと分かってない人だって読むかもしれないし、特にカナダはあんまりそこはすごい寛容じゃないですか、ファクトリーは特にいろんな国の人がいて。",
      "start": 1579305,
      "end": 1623592,
      "timestamp": "26:19"
    },
    {
      "speaker": "B",
      "text": "人口の半分が外国人だからね。",
      "start": 1623592,
      "end": 1627173,
      "timestamp": "27:03"
    },
    {
      "speaker": "A",
      "text": "早い段階でそれを築けたのはすごい良かった。そうですね、。",
      "start": 1627173,
      "end": 1631094,
      "timestamp": "27:07"
    },
    {
      "speaker": "B",
      "text": "それは結構運が良かった気がしますね。",
      "start": 1631094,
      "end": 1633945,
      "timestamp": "27:11"
    },
    {
      "speaker": "A",
      "text": "そしたら今度は就職活動についてした後に聞いていきたいんですけど具体的にこんなことしたよとか結構ブログとかね多分自身のポッドキャストでも言われてると思うんですけどちょっと説明してもらっ。",
      "start": 1633955,
      "end": 1648729,
      "timestamp": "27:13"
    },
    {
      "speaker": "B",
      "text": "てもいいですか?最初の1社目終わった時にノートにも書いたんですけど、僕は最初の1社目は結構レジュメを対象に最適化した上で、最適化した上でなるべくたくさん送るっていう方針でやりましたね。始めたのが、レジュメをそもそも準備してたのはカナダ来てからすぐにやってたりもしてたかもしれないですけど、応募し始めたのは2024年の6月?5月末?6月ぐらい。",
      "start": 1648729,
      "end": 1678155,
      "timestamp": "27:28"
    },
    {
      "speaker": "A",
      "text": "来たのがいつでしたっけ?",
      "start": 1678155,
      "end": 1679106,
      "timestamp": "27:58"
    },
    {
      "speaker": "B",
      "text": "来たのが2023年末。ほぼ2024年の1月。でまあ学校通いながらレジュメの対策というかレジュメを整えたりとかイベントをたくさん行ってたりしましたけど、実際に本当に応募し始めたのは学校の授業が終わるっていうのが近づいてきた6月ぐらいですね。",
      "start": 1679106,
      "end": 1699573,
      "timestamp": "27:59"
    },
    {
      "speaker": "A",
      "text": "ちなみにそのレジュメを準備するっていうのはどういう流れでしたんですか?モデル自分でですか?それともなんか僕の頃だとそれこそ学校に何かそれ用の人がいてその人にそれこそネイティブの人に見てもらってっていうのがあった。",
      "start": 1699583,
      "end": 1716491,
      "timestamp": "28:19"
    },
    {
      "speaker": "B",
      "text": "んですけどほぼ自分でやりました。そもそもなんか学校という存在はあんまり信用してない先生とかもまあ親切だけど言うて社会人経験学校だけでしょみたいにちょっと思ってしまうし。",
      "start": 1716491,
      "end": 1730112,
      "timestamp": "28:36"
    },
    {
      "speaker": "A",
      "text": "がそこまでは言わなくてもあのエンジニアのエンジニアっていうかあのこのit業界は特に結構あのレジュメのそのプロセスとか違ったりだとかその例えばカフェと比べて、カフェはもうそのまま人間が見てもらえるけど、僕たちの業界だと例えば機械に通して情報抜かれてみたいな、なんかそれの対策が必要だったりするから、確かにそのただただ英語がわかる人が読んだらいいっていう話ではないですよね。",
      "start": 1730112,
      "end": 1764224,
      "timestamp": "28:50"
    },
    {
      "speaker": "B",
      "text": "学校でもそういうのはあったけど一見お願いしたことはなくて、自分でなんかコミュニティのイベントとか行ったりしてなんかそうしてみるとやっぱレジュメについて話してる人とかもいるしいろいろアドバイス聞いたら答えてくれる人も結構いるんですよね覚えてるのはなんかGogleディベロッパーミートアップだったっけななんかGogleのコミュニティのイベントにそれはでも結構早い段階から2024年の3月ぐらいに行ったらちょうどその最近の採用プロセスとかレジュメの大切さとかについて話している現地のエンジニアの人がいてそこで結構全体感が分かったりもしたしあとは今日本で働いてますけどフロックのコミュニティの中では有名なKさんとかが動画出したりとかちょっと仲良かったりしたので色々聞いてみたりして自分で経歴を整理していろいろネットで調べた上でこれがいいかなと思って作ってみてちょっと人にレビューをしてもらってだいたい良さそうっていうのをもらったんであとはもう応募しながら改善していくみたいなことをやってて一応そのレジュメのアプリケーショントラッキングシステム対策サービスジョブスキャンというサービス結構高かったんですけど使っていて応募するときは必ず自分のレジュメをスキャンして読み込ませた読み込ませてジョブディスクレーションも貼って一応その中でちゃんとATSのスタイリティックができているかどうか点数がちゃんと上がっているかどうかっていうのを見ながらちまちまやりながらなんかコマコマと毎度毎度修正をしてやってたって感じ。",
      "start": 1764224,
      "end": 1849844,
      "timestamp": "29:24"
    },
    {
      "speaker": "A",
      "text": "ですねどのぐらい送ったん。",
      "start": 1849844,
      "end": 1851164,
      "timestamp": "30:49"
    },
    {
      "speaker": "B",
      "text": "ですかなんか一社年に書いたノートを見てみると90通くらいうんで。",
      "start": 1851164,
      "end": 1858113,
      "timestamp": "30:51"
    },
    {
      "speaker": "A",
      "text": "どのぐらいが反応あったりとかなんか進んだりとか。",
      "start": 1858113,
      "end": 1861215,
      "timestamp": "30:58"
    },
    {
      "speaker": "B",
      "text": "しましたちょっと待ってください。",
      "start": 1861215,
      "end": 1863837,
      "timestamp": "31:01"
    },
    {
      "speaker": "C",
      "text": "はいいい変化だよね昔はコープインストラクターしか一人なかったじゃんコープインストラクターとかのそれこそ東さんが2学校行っ。",
      "start": 1863837,
      "end": 1871743,
      "timestamp": "31:03"
    },
    {
      "speaker": "A",
      "text": "た時にコープインストラクターみたいな。",
      "start": 1871743,
      "end": 1874585,
      "timestamp": "31:11"
    },
    {
      "speaker": "C",
      "text": "今いろんな人が情報発信し。",
      "start": 1874585,
      "end": 1875565,
      "timestamp": "31:14"
    },
    {
      "speaker": "A",
      "text": "てくれてるからね確かにまあそれこそK君とかねみんなやってくれてそれはすごいありがたいですよねもうそれこそまあ古い僕の時代は手探りというかみんなが手探りでまだみんななんか情報発信するにはまだ早いみたい。",
      "start": 1875565,
      "end": 1893209,
      "timestamp": "31:15"
    },
    {
      "speaker": "C",
      "text": "な感じ時代の変化が本当にあるなぁ富樫さんのこっち来た時ってみんなまだAgencyに働き入れてたしねサース系いなかったもんな。",
      "start": 1893209,
      "end": 1901033,
      "timestamp": "31:33"
    },
    {
      "speaker": "A",
      "text": "そうですねそれこそK君とか僕、学校でもコーナーストーンという、当時の学校でも同期なんであれですけど、やっぱ自分がやって人に話してみて、他の人違うやり方してるみたいな、そんな感じだったからそれこそATSなんて言葉も全然知らなかったし。",
      "start": 1901033,
      "end": 1920887,
      "timestamp": "31:41"
    },
    {
      "speaker": "B",
      "text": "今見てみるとだいたい6月後半から9月ぐらいまで最初に1社目入るまでだとだいたい100通弱ぐらい送ってたそれで実際に面接書類が通ったのは9つ?9か10くらいって書いて。",
      "start": 1920887,
      "end": 1938591,
      "timestamp": "32:00"
    },
    {
      "speaker": "A",
      "text": "ありますそれはランダムに出すっていうのはなしにちゃんと興味ある会社に1個1個見てって感じなんですか?",
      "start": 1938591,
      "end": 1945246,
      "timestamp": "32:18"
    },
    {
      "speaker": "B",
      "text": "そうですね、そもそも応募する時点で自分の経験的にはウェブのフロントエンドかフルスタック、JavaScript系のフルスタックかReactNativeが自分の経験あったのでそこしか見てなかったですねそれのインターメディレートからシニアのポジションだけそもそも自分の技術がかすってないところは送ってないし見てもない。",
      "start": 1945246,
      "end": 1968770,
      "timestamp": "32:25"
    },
    {
      "speaker": "A",
      "text": "っていう感じですね送り方はインディードとかレファラル頑張っ。",
      "start": 1968770,
      "end": 1973952,
      "timestamp": "32:48"
    },
    {
      "speaker": "B",
      "text": "たとかあります?最初レファラル頑張った時期があったんですけどオープンしているポジションを見つけたらリンクドインでそこで働いている人を見つけて申請してメッセージを送るとかちょっとやってた時期はあるんですけど全然返信来ないなって思ったのでそこは諦めて単純にリンクドインからやりましたリンクドインのボタンで会社の採用サイトにつながっている場合はそこからやるしリンクドインのEasyApplyがある場合はそこからやるしみたいな人によってはなんかリンクドインのEasyApply使わずに会社のホームページからやるって言ってる人もいたんですけど僕はもうあんまりやってなかったですね。",
      "start": 1973952,
      "end": 2009554,
      "timestamp": "32:53"
    },
    {
      "speaker": "A",
      "text": "そこは僕が割とlinkedとかindeとか見て個人のページに行ってっていうタイプだったんですよなんかlinkedinどうなんでしょうね僕もそのシステムを見たことないから実際どうなってるのかわかんないけどなんとなくそっちから行った方が見やすいんじゃないかなみたいなイメージがあったんですけど。",
      "start": 2012245,
      "end": 2032349,
      "timestamp": "33:32"
    },
    {
      "speaker": "B",
      "text": "どうなんですかね僕はまあなんかどうせ統合されてるんだろうな裏のシステムだとか思ってそれは知ってるとはあとはまあバランスどこに動力兼ねるかの兼ね合いだと思うんですけど僕は結構リンクドインでオープンジョブポジションがオープンしたらすぐに応募するっていうことをやってたりしてのでそれ以外にあんまり頑張ってる時間と労力がないみたいな。なので割とLinkedI集中でやってたという感じですね。",
      "start": 2032349,
      "end": 2059585,
      "timestamp": "33:52"
    },
    {
      "speaker": "A",
      "text": "就職活動でやったのはレジュメ?ポートフォリオとか作ったりしました?",
      "start": 2059585,
      "end": 2064288,
      "timestamp": "34:19"
    },
    {
      "speaker": "B",
      "text": "そうですね。やったことを全体感で言うと、レジュメはもちろん前で対策してましたし、LinkedIのアカウントも結構充実させましたね。プロフィールを積もえるとか、レジュメをちゃんと載せるとか。あとはそのLinkedIのポストも定期的にできるように頑張ってもしてたしコミュニティのイベントもBurn。\njsっていうのに登壇して自撮りをしてなんかLinkedIにポストしていい感じっぽい人を演出したりとかあとはGitHubのReadMeあんまり自分のプロフィールページ整理しなかったんでそれをちょっときれいにしてみたりとかさっき言ってたポートフォリオのサイトも作って僕は割と個人開発結構やる人だったので綺麗に見せようと思えば結構それを使ってなんか結構プロフェッショナルな感じに見せれたのでちゃんとその個人開発しているプロダクトを5個とか6個ぐらいあったのでそれぞれのページを作って単純に書いているだけだとあまりつまらないかなと思ったんでなんで作ったかみたいなストーリーをうまく整理して書いたりとかしていってあとたまに後半はカバーレターとか送ってたりします。最初は送ってなかったんですけど。カバーレターで結構僕は個人かハヤツのことを絡めてやってみると結構受けが良かったりとかして。",
      "start": 2064288,
      "end": 2133571,
      "timestamp": "34:24"
    },
    {
      "speaker": "A",
      "text": "じゃあ結構そのポートフォリオだったりカバーレターとかそこら辺で手応えはあった感じですか?",
      "start": 2133571,
      "end": 2139955,
      "timestamp": "35:33"
    },
    {
      "speaker": "B",
      "text": "いやポートフォリオどうだったのかなでもそのできることは全部やる方針だったのでどれが明確に刺さって一番誘ったかっていうよりかはなんか全体的にやってたのでGitHubのリードミー見てすごいねって言ってくれることもあったしとりあえずサイトを見てたくさんやってて面白いねって言われることもあったしカバーレターで僕はそのコラ画像を作る個人会社のサイトがあるのでそれを絡めて会社のビジネスの内容を調べてそれに絡めたコラ画像を作るってみるとそれが後から聞いてみるとそれが刺さったようだっていうのがあったりしてどれかが一番刺さったっていうよりかはまんべんなくできることを全部やってたのでちょろちょろいろんな手法が刺さったかなって全体的に良くなったか。",
      "start": 2139955,
      "end": 2181340,
      "timestamp": "35:39"
    },
    {
      "speaker": "A",
      "text": "なみたいな結構話聞いた感じだとそのポートフォルトだったりGitHubをちゃんと見られてるということですねその採用側も見るときもあるし。",
      "start": 2181340,
      "end": 2190444,
      "timestamp": "36:21"
    },
    {
      "speaker": "B",
      "text": "見ないときもあるまあそう。",
      "start": 2190444,
      "end": 2191545,
      "timestamp": "36:30"
    },
    {
      "speaker": "A",
      "text": "だけど早いうちだと逆に見られてるかもしれないですよその投稿をリンクリンとかでまだアリアプライの時期だと100人とか来てないからまあなんかゆっくり見てるうちに一人一人時間かけても見れるけど100人とか200人300人になってくると見れなくなったりとか見なくなったりするとかもあるのかもしれないですね。",
      "start": 2191545,
      "end": 2209339,
      "timestamp": "36:31"
    },
    {
      "speaker": "C",
      "text": "インティードからも送るし、リンクドインからも送るし、会社のEメールアドレスからも送るし、いろんな窓口から送ってらっしゃる方も多いと思う。3個か4個くらい来。",
      "start": 2211360,
      "end": 2225026,
      "timestamp": "36:51"
    },
    {
      "speaker": "A",
      "text": "たら1個くらい引き上げてくれるんじゃない?",
      "start": 2225026,
      "end": 2226337,
      "timestamp": "37:05"
    },
    {
      "speaker": "C",
      "text": "みたいな。ありえるかな?",
      "start": 2226337,
      "end": 2228867,
      "timestamp": "37:06"
    },
    {
      "speaker": "B",
      "text": "人によっては多分僕はなんか感覚としてやっぱこれをやれば絶対一番うまくいくみたいなものがあるっていうかはなんかまんべんなくなんか確率が数パーセント上がるみたいなイメージでそれを考えるとなんか1回の応募でだけを見て絶対にうまくいくっていうのはないので、なんか統計的に見てそれぞれ数パーセントやってれば数パーセント上がるんだったら10回とか100回やれば差は歴然だろうなぐらいな風に考えて、あんまりこう一個一個の応募でどれが一番というよりかは10個とか100個の中で全体的に見て最適になればいいなぁという感じで分析。",
      "start": 2228877,
      "end": 2267595,
      "timestamp": "37:08"
    },
    {
      "speaker": "C",
      "text": "に分析よってそうですねアナライズですねなんか1回。",
      "start": 2267595,
      "end": 2271959,
      "timestamp": "37:47"
    },
    {
      "speaker": "B",
      "text": "の応募で絶対に通ろうと思うともう博打でしかないと思うんですけど100回の応募で3、4回通ろうだったら絶対に博打ではないじゃないですか。確率だけ、一度の打席を見て確実にうまくいくんではなくて、統計的に見てうまくいきそうみたいなのに、バランスよく頑張ってみた。素晴らしい。",
      "start": 2271959,
      "end": 2294034,
      "timestamp": "37:51"
    },
    {
      "speaker": "A",
      "text": "じゃあ調べて見つけたテクニックみたいなのは全部やって、満遍なく確率を上げていったみたいな感じが。",
      "start": 2294034,
      "end": 2301913,
      "timestamp": "38:14"
    },
    {
      "speaker": "B",
      "text": "そうですね。だから僕は割と就職とかの面接も学校の授業がある間にもちょろちょろ呼ばれ始めたりしてたので、その時通ってたカレッジの人たちにもなんかどうやったらいいみたいなことを聞かれたりしたので、僕はこうやっていうことを全部教えたりしてたんですよ。イベントに行って話聞くのもいいし、そこで人事の人がたまにいるから話してるといろいろアドバイスもらえるからいいと思うし、ネジメもこういうサービスがあるから手続けしたらいいと思うし、なんならポートフィルム作った方がいいしっていう風にいろんなことやってること伝えたんですけどあんまり何か伝えたからといってやってる人がいたかというとあんまりいない気がし。",
      "start": 2301913,
      "end": 2337570,
      "timestamp": "38:21"
    },
    {
      "speaker": "C",
      "text": "ていて何だろうね本当。",
      "start": 2337570,
      "end": 2338891,
      "timestamp": "38:57"
    },
    {
      "speaker": "A",
      "text": "に結局やるだけなんですよでもやるのが一番。",
      "start": 2338891,
      "end": 2342894,
      "timestamp": "38:58"
    },
    {
      "speaker": "B",
      "text": "大事なんですよっていうのは実感しましただから別にそれが簡単だとは言わないですし大変じゃ大変だと思いますけど何だろう一個一個のやるべきことは別に難しくなくて全体としてちゃんとやるみたいなことがなんか難しいというか、持続して頑張ることが難しいのかなと思ったり、思わなかったり。",
      "start": 2342894,
      "end": 2365831,
      "timestamp": "39:02"
    },
    {
      "speaker": "A",
      "text": "いやモチベーションの継続みたいなのは難しいですよね。あとその優吾くんの場合はその一つ一つ見つけてやる、見つけてやるだけだからなんかロードマップ的に道みたいな感じだけど聞いた人からしたら一気に全部情報を聞いて、なんかちょっとオーバーベルミッションみたいなのはありますよね。だからなんかやっぱ自分で見つけてってそのプロセスが結構大切なのかなって今聞いてて。",
      "start": 2365831,
      "end": 2389657,
      "timestamp": "39:25"
    },
    {
      "speaker": "C",
      "text": "間違いない、。",
      "start": 2389667,
      "end": 2390208,
      "timestamp": "39:49"
    },
    {
      "speaker": "B",
      "text": "そっちの方が実感として納得して取り組むことができるし今言ったこと全部1ヶ月なのでやろうとすると僕無理だと思うので確かに振り返ってみると僕もイベントに行き始めたのがカナダに来てからすぐだったしその後まずレジュメを対策したのが多分1ヶ月とかかかってたしその後レジュメが一旦落ち着いたらGitHubの整理をし始めたしその整理が終わってしばらくしてオートフリオも作り始めたしで最後の就職成功した時点で見ると大体結果的に全部やったなって感じだけど最初からすべてが揃っていたわけではもちろんないその。",
      "start": 2390208,
      "end": 2425053,
      "timestamp": "39:50"
    },
    {
      "speaker": "A",
      "text": "やっぱ一つずつやっていくことによりやっぱちょっと伸びたらちょっと伸びたなっていうのが自分の中で分かってこれは大切なんだってのは分かるけどやっぱ一つ一気にその情報をもらって全部やってもその何が良かったかとかそうどこでその増えたのかとかがわかんないからやっぱそのなんか耳しみないではないけど情報としてこれやったらいいよってのはわかっててもその自分のなんだろう体は血肉にはなってないみたいな感じはなるほどねちょっと面白いなここ。",
      "start": 2425053,
      "end": 2454200,
      "timestamp": "40:25"
    },
    {
      "speaker": "C",
      "text": "で広げていい話しかわかんないけどねユウゴさんはご自身のね就職活動の体験を自分のノートでしたっけ。",
      "start": 2454200,
      "end": 2459603,
      "timestamp": "40:54"
    },
    {
      "speaker": "B",
      "text": "あれそうですね放送の概要欄に貼っておいてください。",
      "start": 2459603,
      "end": 2461944,
      "timestamp": "40:59"
    },
    {
      "speaker": "C",
      "text": "はい貼っておきますので確かに。あれにしかも見ても見て、トワシさんもね、あの記事見て、この人すごいなのか。",
      "start": 2461944,
      "end": 2468707,
      "timestamp": "41:01"
    },
    {
      "speaker": "B",
      "text": "そう、。",
      "start": 2468707,
      "end": 2469297,
      "timestamp": "41:08"
    },
    {
      "speaker": "C",
      "text": "ちゃんと体系でやりなかったかな。あれが出合いをね、体系的にやってるな言うて、それでフロックのね、ちょっとレジュメなイベントも2人にちょっと実際やっていただいたのがあって、あの説はありがとうございました。",
      "start": 2469297,
      "end": 2478601,
      "timestamp": "41:09"
    },
    {
      "speaker": "A",
      "text": "いや、。",
      "start": 2478601,
      "end": 2478641,
      "timestamp": "41:18"
    },
    {
      "speaker": "B",
      "text": "ありがとうございます。僕も楽しかったです。こっちにフロックで新しく来た人からと話しとノート読みました参考になりますって言われることがちらほらあったりそうだねそれとかなめて自分のITトリオっていうポッドキャストでも体験などを話したりしてたんでそれは結構なんか聞きましたとか読みましたって言ってくれる人はちょくちょくいるかなっていう感じがあり。",
      "start": 2478641,
      "end": 2501296,
      "timestamp": "41:18"
    },
    {
      "speaker": "C",
      "text": "ますそしたら90社ぐらい。",
      "start": 2501296,
      "end": 2504197,
      "timestamp": "41:41"
    },
    {
      "speaker": "A",
      "text": "応募してどのぐらい通ってどのぐらいなんか実際面接みたいな。",
      "start": 2504197,
      "end": 2507178,
      "timestamp": "41:44"
    },
    {
      "speaker": "B",
      "text": "のがあった面接行ったのがその10社ぐらいだったと思います。ノートにも書いてあった。9社か10社ぐらい。ただ覚えてるのは1社目が一番ボロボロでしたね。1社目はいきなりリファローだったんですよね。それこそCS道場っていう有名なユーチュームがバンクーバで定期的にイベント開催してて、そこで新しく来た人のメンターを見つけるだったかなとりあえずそんなイベントに行ったらジンジンの人がいて、レジュメその時すでに持ってたので繋げてくれて面接1回やったことがあったんですけどそこで面接最初にしたリクルーターの人がそもそもアメリカの方でそれが5月くらいだったかな6月くらい去年のだから就職活動し始めたら結構すぐだと結構なんかやっぱアメリカの英語むずいなぁ激チンみたいなそれが始まり。",
      "start": 2507178,
      "end": 2564059,
      "timestamp": "41:47"
    },
    {
      "speaker": "A",
      "text": "それはリクルーター面接みたいなの。",
      "start": 2564059,
      "end": 2567280,
      "timestamp": "42:44"
    },
    {
      "speaker": "B",
      "text": "はスキップしてリクルーター面接?",
      "start": 2567280,
      "end": 2569411,
      "timestamp": "42:47"
    },
    {
      "speaker": "A",
      "text": "リクルーター面接で。",
      "start": 2569411,
      "end": 2570002,
      "timestamp": "42:49"
    },
    {
      "speaker": "B",
      "text": "でまぁそれが始まりですけどその後は大体そうですねカナダの会社だった気がしますねまあ一時面接やって最初の方やっぱ落ちる確率が僕は高かったのでだんだんだんだんでもやっていくうちに対策の仕方とかもわかってきたのでやっぱり事前に会社のことを調べておいた方がいいなとかもうちょっと慣れてくると面接する人のことも調べておいたほうがいいなとかいろいろあってそんなになんか特別なことを面接があったわけではない気がしますねリートコードのダイス君も一応やってましたけど1社目に入るまではリートコード的な問題はあんまり出会わなかったかも一社だけやって落ちましたね。Amazonもなんか書類だけ最初に通ったんですけど、あれ解けたんだけどな。解けたけど落ちたのがあって、よくわかんないけど、その一つぐらいしかリートコード的な問題は出会わずに、それ以外はWebのフロントエンドのJavaScriptとかHTMLの生のものを使ったものとか、Reactを使ったものとかっていうコーディング面接があったりとか。",
      "start": 2572156,
      "end": 2642011,
      "timestamp": "42:52"
    },
    {
      "speaker": "A",
      "text": "そっちはじゃあ割となんだろうその1回目の撃沈から学んでというかスムーズにいけるようになってきたんですかねそうですね。",
      "start": 2642021,
      "end": 2649708,
      "timestamp": "44:02"
    },
    {
      "speaker": "B",
      "text": "やっぱりやればやるほどめっちゃ慣れてくる感じがあって僕も今3周目ですけど合計したらその後もつろつろがエースしてたんで14とか15車ぐらいやってて平均すると2時3時とかはあると思うんで結構な数面接はなぜかやってしまったんですが。",
      "start": 2649708,
      "end": 2666324,
      "timestamp": "44:09"
    },
    {
      "speaker": "C",
      "text": "すごいよね。だって就活始めてからで考えたら1年くらいってことでしょ?",
      "start": 2666324,
      "end": 2670637,
      "timestamp": "44:26"
    },
    {
      "speaker": "B",
      "text": "そうっすね。1年経ってない。10年した面接は珍しいよね。僕より知ってるかもしれないね。",
      "start": 2670637,
      "end": 2676532,
      "timestamp": "44:30"
    },
    {
      "speaker": "A",
      "text": "上書いた?",
      "start": 2676532,
      "end": 2677062,
      "timestamp": "44:36"
    },
    {
      "speaker": "B",
      "text": "もしかして。だからもう結構その直近の転職した会社とかその他同時にやってた面接はもう結構僕の中ではもうすごい慣れてて、もうね余裕って言ったら叩かれるかもしれない余裕ではないです余裕ではないですけど方向性はだいたいわかるし受けがいい話の繋い方もわかるし結構余裕が出てきて単純な面接対策だけではなくてプラスアルファでもうちょっと自分の個性を出して引っかかることなんだろうとかを考えて結構そのビヘビアルクエスチョンでも最後の質問タイムでちょっと実は会社のウェブサイト壊れているところを見つけたんだけどとか言ってその場でなんかデバッグをウェブページしたりとか素晴らしい面接官の人がなんかプライベートで個人開発してるんだったらうまく自分も個人開発してることをアピールして実際にその場でアプリ触ってもらったりしておーって話が盛り上がったりとかあとは趣味が一致してたらその趣味の話をするようにしてカルチャーヒルってアピールしたりとかなんかそう僕はマーベル映画見るのが好きなんですけど美術館でマーベル映画見るのが好きな方がいて話題に出してみて最近のマーベル映画どう思う?みたいなドラマどう思う?みたいないうのを言うと大体ドラマね良くないよねって話になって盛り上がるみたい。",
      "start": 2677062,
      "end": 2745690,
      "timestamp": "44:37"
    },
    {
      "speaker": "A",
      "text": "ないやでも相手も人間なんでそうしたらすごい大切ですよね相手のことも調べたりできるなら調べて会社の中でも仕事の話ずっとコーディングについてずっとやってるわけじゃないんでやっぱりこの人を自分の隣の席に座ったらどうかなっていう視点で考えたりするんでそういうなんだろう趣味とか共通の話題とかを探して喋ってくれる人だと、一緒に働き始めてからイメージしやすいんで、すごい好印象になりますよね。",
      "start": 2745690,
      "end": 2775677,
      "timestamp": "45:45"
    },
    {
      "speaker": "B",
      "text": "一緒に働いてもらいたいと思えるように頑張って個性を出し方を探したのが。",
      "start": 2775677,
      "end": 2781293,
      "timestamp": "46:15"
    },
    {
      "speaker": "C",
      "text": "あるフロックやっててさ、俺割と感動した事例。",
      "start": 2781293,
      "end": 2784756,
      "timestamp": "46:21"
    },
    {
      "speaker": "B",
      "text": "が2つあって一つ。",
      "start": 2784756,
      "end": 2786117,
      "timestamp": "46:24"
    },
    {
      "speaker": "C",
      "text": "がさっきのヨグさんと全く一緒で面接ところですごい印象を残っている会社さんとかはもう絶対にクローンサイト作ってで、あなたたちの問題これやと思うからってプレゼンテーションするんだってすごいなって思ってもう一人は必ずインタビューの日程を選べるんだったら金曜日の夜にするんだっつって夕方かにするんだっつっ。",
      "start": 2786117,
      "end": 2805489,
      "timestamp": "46:26"
    },
    {
      "speaker": "B",
      "text": "て絶対にビール持って行く。",
      "start": 2805489,
      "end": 2806890,
      "timestamp": "46:45"
    },
    {
      "speaker": "A",
      "text": "んだって。",
      "start": 2806890,
      "end": 2807471,
      "timestamp": "46:46"
    },
    {
      "speaker": "C",
      "text": "今から飲もうぜっていう風に言って終わりにするっていうのをやってるとすごい仲良くなれるよって。",
      "start": 2810801,
      "end": 2815847,
      "timestamp": "46:50"
    },
    {
      "speaker": "B",
      "text": "いうのを実践してた奴がいたね確実に目立ちます僕は最近そういうのを振り返って思ったのは多分僕はやったことないですけどこれってできる営業の人の思考に近いのかなという気がして営業する人って単純に自分の伝えたいことをアピールするだけじゃなくて結構相手のことを調べた上で相手に一番支える方法で話しに行くような気がするんで別に営業したことないからYouTbeの切り取りとかが流れてくる程度の知識なんですけどなんか考え方としてはそれに似てるなって気はしていて、ちゃんと自分のアピールしたいことはするんだけどどういうふうに話し始めたら相手に一番刺さるなとかどういうふうに個性を出したら相手が一番自分のことを魅力的に思ってくれるかっていうことを事前にちゃんとした調べをする。そのために会社のこととか会社のビジョンとかミッションとか事業内容も調べるし、面接官個人の個性も調べるしっていうのは必要だなって思ってたんで結構なんか営業に近いのかなとか思ったり大事。",
      "start": 2815847,
      "end": 2872565,
      "timestamp": "46:55"
    },
    {
      "speaker": "C",
      "text": "かもね今日俺フロックでインタビューした人も三菱の営業からエンジニアになった人。",
      "start": 2872565,
      "end": 2877490,
      "timestamp": "47:52"
    },
    {
      "speaker": "B",
      "text": "なんだけどすごい喋りやすく。",
      "start": 2877490,
      "end": 2878871,
      "timestamp": "47:57"
    },
    {
      "speaker": "C",
      "text": "てさ下調べすごいしさやっぱこういうのって能力のひとつだよねちょっと思った。",
      "start": 2878871,
      "end": 2886199,
      "timestamp": "47:58"
    },
    {
      "speaker": "B",
      "text": "よねいや思いましたねなんかエンジニアだけ僕はエンジニアとしてしか経験がないので割とこっちに来て面接対策とか考えれば結構軽視してた感じなんですよね技術力あればええやろみたいな技術力高ければ伝わるやろ思ってたんですけどまぁそれ伝わる場合もあれば伝わらない場合もあってそうねどんなケースにおいても相手の伝え方を実際にちゃんと考えたりするとどんなケースにおいても刺さりやすくなるっていうのがあるなと思ううん素晴らしいそれはなん。",
      "start": 2886199,
      "end": 2917371,
      "timestamp": "48:06"
    },
    {
      "speaker": "A",
      "text": "か就職じゃない人生の話みたいな人生の深い話をそしたら前半結構長くなってきたので最後質問なんですけど、オファーを受けた時の流れだったり、どんな風に感じたかみたいなのを聞ければなと思います。",
      "start": 2917371,
      "end": 2932450,
      "timestamp": "48:37"
    },
    {
      "speaker": "B",
      "text": "1社目ですかね。",
      "start": 2932450,
      "end": 2933150,
      "timestamp": "48:52"
    },
    {
      "speaker": "A",
      "text": "どうしましょう。3社もあるからね。まあでも直近の3社目でいきますか。",
      "start": 2933150,
      "end": 2940735,
      "timestamp": "48:53"
    },
    {
      "speaker": "B",
      "text": "直近の3社目。オファーを受けた時。その時は、会社の面接フローがすごい早く進めてくれてて、それは実は今働いてる会社の給料が遅延してたっていうことを最初から話してたんで結構スムーズに進めてくれたっていうのもあってでまぁスミ面接は3時か4時くらいまでやって最後にまたリクルーターの人との最終確認みたいなので給料を提示されたっていう感じだったんですけどただステアはジョブポジションなんかそのジョブのなんて言うんですかそれジョブディスクリプションのページに給与のレンジがそもそも示されているので、あんまり僕は交渉はしなかったかなっていう。まあそうだよね、。",
      "start": 2940735,
      "end": 2987096,
      "timestamp": "49:00"
    },
    {
      "speaker": "C",
      "text": "東海オンエアさんのところもマトリックス決まってるもんね、。",
      "start": 2987096,
      "end": 2989108,
      "timestamp": "49:47"
    },
    {
      "speaker": "A",
      "text": "たぶん。そうですね、基本的にはマトリックス決まってて、あとは前の会社からのどのぐらいかみたいな、前の会社が例えばですけどすっごい低くて、次の会社がすっごい高ければやっぱまあもう多分マトリックスの一番下みたいな感じになるし、例えばお前の会社がアマゾンみたいなとか大きい会社来たらすると、もうそのその時点でちょっとマトリックスと合わなくなっちゃったりもするんで、そこの兼ね合いとかもあるけど基本的にはマトリックスにフォローしてって感じなんじゃないですかね。",
      "start": 2989108,
      "end": 3017933,
      "timestamp": "49:49"
    },
    {
      "speaker": "B",
      "text": "なるほどね。",
      "start": 3017933,
      "end": 3019834,
      "timestamp": "50:17"
    },
    {
      "speaker": "C",
      "text": "せやほど大きかったらね、。",
      "start": 3019834,
      "end": 3021856,
      "timestamp": "50:19"
    },
    {
      "speaker": "B",
      "text": "これ。",
      "start": 3021856,
      "end": 3023197,
      "timestamp": "50:21"
    },
    {
      "speaker": "A",
      "text": "そうですね。お金のことは後半という。",
      "start": 3023197,
      "end": 3027385,
      "timestamp": "50:23"
    },
    {
      "speaker": "B",
      "text": "ことで一番大事なところです。",
      "start": 3027385,
      "end": 3029208,
      "timestamp": "50:27"
    },
    {
      "speaker": "A",
      "text": "からね前半は就職するまでの流れ聞いたんでここまでにしようかなと思いますありがとうございました。",
      "start": 3029208,
      "end": 3039324,
      "timestamp": "50:29"
    }
  ],
  "highlight1": "衝撃の事実！カナダのエンジニア就職を目指す人の99%が失敗する理由とは？",
  "highlight2": "実は、カナダへの移住を決意した優吾くんの就職活動は、4-5ヶ月かかったという驚愕の事実！",
  "highlight3": "知らないと損！優吾くんのカナダ就職に成功した秘訣は、300-500人と競争する中で見つけた「コミット履歴」の重要性だった！"
}