{
  "episodeGuid": "1cde61ee-9900-4255-9ba9-b09e147a240d",
  "episodeTitle": "物流業界からカナダでビックテックへ！北米で女性エンジニアとして転職した話（前半）#5",
  "transcribedAt": "2025-10-17T04:33:47.171Z",
  "duration": 3700,
  "fullText": "はい今回はAyakaんに来ていただきましたAyakaんはカナダのまたこれまた同じバンクーバーでワークデーというところに就職されたんですよねまず初めに簡単に経歴を教えてもらってもいい。ですかはいAyakaです経歴は最初新卒で日本のSGホールディングスという物流の会社に入社しましたこれがフロックの今スタッフされている桂太さんと同じ会社で全然知らずにカナダで再開してびっくりしたんですけどそれは余談でSGホールディングスという会社に入社して物流のコンサルの会社で倉庫のオペレーション設計を主にしていて4年勤務した後そこを退社しましてカナダに移住してきたという流れですその後1年間CICCCというコミュニティカレッジでウェブディベロップメントを勉強して就活してでワークデーに就職しましただからワークデーが1社目ですで今現在3社3年目です。ね3年目3年目っていうのはカナダ歴って。いうことですかねカナダ歴もエンジニア歴もカナダ歴は。4年カナダ歴4年目なんじゃないそしたら。プラス1年なんでワーク。デー入られてからもう何年?3年?2年?2年半なんです2。年半かなるほど素晴らしいちなみにワークデーって言ったらねもはや一等値にある非常にカナダでも有名な会社さんですけどわりかしやっぱり日本からすると日本にいらっしゃる方からすると何の会社やろっていうのがあると思うんですがワークデー具体的に何をされている会社なん。でしょうかワークデーは簡単に言うとお金と人を管理するのを手助けするソフトウェアを会社向け企業向けにB2Bに提供しているSaaSの会社ですねこっちって。結構使われてるイメージで何なら僕の会社でも使ってるんですけど日本って使われてないんですか日本確かオフィスありますよねエンジニアじゃないのかもしれない。けどありますありますセールスが主にセルスが主な部署がありますね。日本語の対応も知ってますよね、きっと。知ってます、知ってると思います。日本でも結構導入している会社が増えてきていると思います。そこらへんってあれなのかな、一応会社のなんだろう社員との契約みたいなのってちょっと国によってもいろいろ変わってくるじゃないですかとかコンペンセーションというかそのなんかお金の払い方みたいなのとかあのそこらへんてどうやってやってるんですかねなんかローカライズそれこそローカライゼーションチームがいても良さそうなもんだけど。クラウドサポートチームみたいなのがあるのでそのチームがその国ごとにとか会社ごとのコンフィギュレーションをサポートして使えるようにしてると思います。あと確かにごめんなさい確かにWorkdayっていっぱいめちゃくちゃアプリがたくさんあって合わないアプリをその国でアクティベートしなければいいだけですもんねそれでいう。とピックアップしてこれを使いたいこれを使いたいって使わないものはアダプトしなければいいってあと自分たちのコンフィグレーションに合わせて楽天も設定を変えられるようになっている。んですね今ちょっと拝見していると楽天さんとかソニーさんとかわりかし大きいところも導入されているっぽいのとワークデイ本当に日本にいらっしゃる方だともしかしたら大手いらっしゃる方はね知ってるかもしれないけどやっぱりアメリカのねカルフォルニアがやっぱり本社の会社さんっていうこともあるのでまあ人材はねさっき東橋さんのちょっとどういう人がっていうところはちょっと気になるところではあるんですがやっぱりカナダのワークデイさんはエンジニアさんだったりとかデベロップメント部門が主にあの人員がいらっしゃるってイメージ。ですかそうですね開発が多いと思いますセールスもほらいると思うんですけどやっぱり。そこはそういう構造になりますよねアメリカ本社カナダデベロップメントもちろんアメリカも全部のチームがあって日本はやっぱりアカウンティング広げたりとかセールスに入ったりとかっていう部分でローカライズしてっていう結構よくある型の展開を世界中にされているということ。ですねちなみにワークデーのバンクーバーオフィスは最初の回の優吾君と僕と同じビルに入ってるっていう本当。だよあそこのビルすごい僕らの知ってる方がたくさん入ってておまけに僕らのオフィスもあそこから1ブロック半くらいの方にあるの。で確かにめちゃくちゃ近いですね。そうなんですよあそこに全員集結すればいいじゃんっていうね本当にそしたら、。カナダに来る前は一社だったと思うんですけど、それは全然なんか日本の会社ですよね。そうですそうです。日経の佐川キュービンの母体となっているSGホールディングスっていうグループ会社を集めた会社なんですけど、。うちのねスタッフもやっぱり同じ会社にいらっしゃったっていうのを僕聞いてだからそう意外とですねそのAyakaんのお話もたくさんの人から実は耳にしていて僕ケルタさんもそうだし色んな噂が飛び交ってますか?そうそうだしあれあとユキさんとかもねあれかごめん個人名を出すあれやけれどもあのフロックのインタビューとかに載ってくれてる方ともちょっと仲良ししていただいてるっていうこともあってたくさんちょっとお伺いしていた。んですがそれで言うと僕はその人からAyakaんを紹介してもらって同じビルに日本人で知ってる人なんか友達が働いてるらしいよみたいなこと言ってたんで紹介してくれって。言っていや良かった良かった良い繋がりだと思いますで。そこは全然ただじゃあ全くの日本の会社だったと思うんですけどなんか海外で就職しようみたいな目指すきっかけみたいなのってあったんです。か海外に就職するっていう海外っていうテーマではずっと働きたかったんですね大学の時に留学とかも考えたんですけどやっぱり自分のお金で自分のキャリアもある上で行きたいなと思っててその方が1年しか留学できない学生時代よりもやっぱり自由が利くかなと思ってたので1回就職してちょっと考えようっていうことで大学では留学せずにいてで就職してから3年か4年くらい3年目かの時に会社全体がデジタル化を進めようみたいなムーブがあっていろんなSaaSの会社と契約を進めていてKintoeとか使い始めたんですねで私が営業開発部に所属してたんですけど全然自分のやってる本流の仕事とは別に営業成績を管理するツールを作ってくれって頼まれてでそれをSaaSのシステムエンジニアの人と一緒に要件定義というか私自身が作るんじゃないんですけど会議に参加していろいろ要件を固めていくっていうのをし始めてそこでどんなデータを渡せばいいかとかどういうAPIがいるかとかのミーティングをしてたんですねそこからちょっとずつ興味が出始めてその人たちがどういう仕事をしてるのかなっていうのとあと全然予算が下りなかった部分をBIツールっていうのを使って自分たちでぱっと見でデータを見れるようにしろっていう風に言われてで、BIツールってそんなにガチガチにプログラミングするわけじゃないんですけどなんか簡単なSQL文とか書けるものなのでそこで本とか買ってどうやってデータ取得するのかなとかフィルターかけるのかなとか自分で勉強しているうちにウェブ開発に興味が出てきたのでじゃあもっと勉強してみようってなってじゃあせっかく勉強するんだったら海外も行きたかったし全部一緒に2つセットにしちゃって海外留学勉強してちょっと転職目指してみようかなみたいな風になったっていう流れです。ねそっちの方にそれは内部のチームと一緒に作ったんですかそれともなんか受注みたいな感じで外部の人と一緒に作っ。たんですか外部ですね。受注施策してもらってたっていう。それこそ、なんか日本のよくあるSIAの人たちと外部の会社のSIAの人と一緒に働いたみたいな感じ?そうですね。上室みたいな部門はいなかったんですか?上室?なんか情報システム部みたいなのがいて、そういう人たちが結構外部の人と話すのかなと思ってたんですけど、。あったんですけどその人たちはあの倉庫のあのウェアハウスマネジメントシステムの開発に忙しいので内情をよく知ってる人が参加しないといけないじゃないですか要件定義って実際にシステム使うのが営業開発部門の人だからそれが私なので参加しないといけなかったっていう。なるほどねじゃあ計らずもがなSIRのやる上流工程を物流の会社にいながら経験することができたってことですよね?そうですね実際に手は動かさなかったんですけどどういうふうに要件を作って。いくのかとかいやすごいでもそれであったとしてもねうちのケイタさんなんかももちろん同じ会社で働かれていてITっていいなっていうふうに言いながらカナダに来てITも勉強しようと思ったんだけどでも自分に向いてないと絶対思ったのでやめましたって言ってたんですけど同じような方は多いと思うんですよねやっぱりITの分野にちょっと触れてもしかしたらこれって次の世代っていうか次の世界を作ってくるかもしれないとか割と楽しいかもしれないとかでも実際やっぱりやるっていう風になるとまたお話別じゃないのっていうことで結構大きい決断されたなと思いますがなんかあったんですか?ITいっぱい給料もらえそうとか。なんか希望というかずっと技術職なので身につけてしまえばいろんな技術のトレンドもあるから勉強し続けないといけないのももちろんなんですけどあんまり人と関わらずに僕も仕事するの好きだったんでそういう作業というか開発は向いてるかなって思いました。なるほど素晴らしいご自身の性格と対応してっていうことですね相談をしてそう。ですねもともと営業開発にいたから次のキャリアの営業って言われてたんですけど絶対やりたくないと思ったしやってる人を見てあんまり楽しそうではあるけどしんとそうっていうのもあったんで今度うちの。嫁様とぜひ会話していただきたいですねすごい営業の話ちょっと盛り上がりそうすみませんちょっとそれは別にあるんですがなるほどそれもあってITプログラミングエンジニアリングっていう部分に興味が出たということ。ですねちなみに僕もそれこそSIR出身で結構SIR僕が知ってるのと聞いた話でしかないんで全てではないと思うんだけど結構やっぱりSIRの仕事って辛そう辛いみたいなのがあるじゃないですかその内部システムというかそのSaaSとか作ってる会社に比べてその一緒に働いてみてなんかうわぁこの人たちめっちゃ働いてて嫌そうだなぁみたいななんかネガティブなイメージはなかったんですか結構本当にポジティブなイメージだけでもう私もこれやりたいみたいな感じになれたんですか。確かにねその人たちその一緒に仕事してた人たちは確かになんかこう要求をいろいろ投げられてそれをどう予算繰りするかするのかなみたいな結構しんどい立場にいるんだろうなーって思ったんでその作業するエンジニアの人たちとカスタマートのブリッジになってしんどそうだなーっていうイメージはあったんですけど実際に作業するエンジニアたちの良さ見れなかったんで、そこでのジャッジはあまりなかったんですけど、自分は作る側に興味がありましたね。SIAさんになりたいっていう。よりかは作る側あれでしょ東ヶ谷さんの言ってるところがITどかた的な感じの空気感を見てしまうとむしろ離れてっちゃうん。じゃないかみたいなねなんかSIAのそういう受託開発してる人たちの働き方ってミーティングをする人も作る人も一緒だったり結構多分僕は炎上してる案件とかに入るとそれこそこの人辛そうだなっていうのが多分要件定義を一緒にする会社の人とかにも多分見られちゃうというか見えてくるんでそういうのはあんまりなく本当にミーティングとかだけの時時に会うだけでそんなじゃあ気持ち悪いって言ったら悪いところを見。たかなあんまり覚えてないけどまあしんどそうではありましたすいませんこんなにいろいろお願いしてってこっちは申し訳なかったですね無理を言ってる感じがして。その温度感はやっぱりありはするってことですね。でもそれは良かったですねそしたらじゃあそこでなんかネガティブなイメージをつけずに。こっちに来て無知なだけ来たかもしれないいやいや。そんなこともないじゃないですかでもそれで言うとねやっぱり今お話しにあったところだといろんな多分海外っていう選択肢ってあったと思うんですよさっきね海外でやっぱり頑張ってみたいとか勉強してみたいっていう部分とリンクしたって話はあったと思うんですがそれでなんでカナダだったんですかアメリカとかやっぱ有名なんちゃうんっていうところはあると思う。んですけどビザですねやっぱり。ビザがみんないますねビザですね他に候補はどこ。があったんですかオーストラリアとかイギリスも考えたんですけど当時コロナで私が来たの2021年の夏なんですけど考え始めたのが2020年で、コロナまっただなかで、じゃあそのコロナ禍の中で渡航できるのどこってなったら、カナダが一番最初に国境が。開いたんですね。だから早いほうがいいやと思って、一個個も早く会社を辞めよう。と思ってたので。営業やだみたいなところも。ありつつですか、じゃあ。そうですね。なるほど。までもねカナダが本当に国境一番最初に開けたっていうのは本当その通りであのわりかし早かったよねカナダはなんかその辺復活するのランちゃんでもあれですか?じゃあオーストラリアの方がもしも先に国境ちょっと開けてたらオーストラリアに行ってた可能性も全然あるみたいな感じですか?あると思いますね。大丈夫でした?カナダみたいな寒いところで、みたいなね。オーストラリア行きたい人って、聞こうかって言うじゃないですか。全然聞こうとか考えてなかったです。あ、本当に?むしろカナダも来たことないのに、なんか、まあ行けるでしょとか思って。なるほど。実際来てから、下見してから考える人とか多いじゃないですか。全然そんなこともせず、その時は無鉄砲だったので、まだ、なんだろう、若かったからなのか。いや、でもね、あれですよ。樋口あのフロック使ってくる人たちだいたい500人くらい今いますけどあのトガシさんなんかもまさにど真ん中ですがあなたも1回もこっち来なかったっしょ?深井1回も来てないし僕は何なら別に調べてもないです樋口調べ。てもないこの人なんて俺。らがいいの深井近いか。も樋口でもねそういう人ばっかりっちゃばっかりですけどねやっぱりあの下見くる人が客人に1人くらいいるかな2人くらいいるかなみたいなのがうちの場合多い。ですけどね下見するにはちょっと高すぎますよね高い。んですよねそう往復に30万かけてくるかみたいなねところもあるのでそういうことですねじゃあカナダとオーストラリアいろいろ迷って国境先に開けたというところからカナダが選択肢に先に入ってきたってことです。ねちなみにカナダってやっぱりIT業界としては強いとかあるじゃないですか本当はそういうことは考えずに本当にもうビザというか、国境が開いた順だけだったんですか?それは情報として、やっぱりアメリカ西海岸にテク企業って集まってるので、就職先の幅は広いかなと思ってたのはありますね。それはやっぱり思いますよねアメリカ近いしっていうところと会社いっぱいありそうだしみたいなオーストリアやっぱ迷われる方ってうちにもやっぱり多いですけどやっぱりそこがキーになりますもんねあのなんとなく知ってるテック企業があのカナダの方が多そうみたいなそこでも情報としてやっぱり知り渡ってたってことです。ねそしたらあの全然僕と一緒じゃなかったです僕はなんかそんなことも考え。ていない本当に本当に何も迷ってる覚えないんだけどね本当に僕は。エンジニア海外就職でそのフロックが出てきたんで対応してるかもよくわかんないけどとりあえず連絡したらカナダって言われてバンクーバーって言われてあーなんか決まっちゃった。みたいな良かったのかなこんな人でっていう忙しかった。んですよね多分その時仕事がでなんかまあいいやみたいななんかそんな長くいるつもりもなかったからまあ別にワンチャン1年だったら何でもいいでしょみたいな感じで僕はそんなちゃんと考えて頭いい感じできてないんで申し訳ないです一緒に。いやいやいやもうだから何度もこのポッドキャスト言うとこやけどあなたはそういう長期的なプランはもう皆無かもしれないけど短期的なプランはもう綿密に組む必要があるそういう性格ということ。ですねちなみに英語はさっきの話だと大学の時から海外には興味あったけど留学をするってことは選ばなかったと思うんですけど英語はなんかどのくらいから勉強し始めたというかどのぐらい英語に対してなんか準備してから来。たんですか特別こうカナダに来るからしっかり勉強したっていうよりかはあの結構ずっと英語はあの好きな教科だったので高校の時に一番好きな教科だったので大学に入ってからもいつか使うだろうなと思ってあんまりこう距離を置かずにいたんですねなんか英語であのヨガを見るとか音楽聞くとかポッドキャスト聞くとかあの喋る機会こそそんなになかったんですけどずっと触れてはいてなので特別に何かカナダに来る時に対策したっていうことはなかったですねで来てからあとは大学の時に結構英語を使う機会がボランティアに行ったりとかあとはヨーロッパ一周をオーストラリアの人としたりとかあったのでずっと何かしらちょくちょく英語を使う機会はありました働いてからも留学生とか帰国資料の人が多かったりしたので周りになんかそういう英語を使おうぜみたいなイベントとか集まりとかもちょこちょこあったんでまあで。もそういうのってね自分から作ろうと思わないと周り勝手には作られないですからねちなみに何ヨーロッパ一周?ヨーロッパ一周を一ヶ月で大学生の最後にしたんですね。それがバスツアーだったので、日本人一人だけで、周りは基本的にオーストラリアとかニュージーランドの人が多かったかな。すごいアクティブですね。素晴らしい。ちなみにボランティアっていうのはどういうボランティアだったんですか?ボランティアはニュージーランドに行って、チャイルドケアのボランティアを一ヶ月したことだって。それも留学したかったけど、そんなに長く行けないから、何か代わりにできることないかなっていうので行ったっていうのがありますね。じゃあ、もともとすごいちゃんと興味があって、自分からそういう状況を作りに行ったみたいな感じなんですね。そうですね。いつかは海外に行きたいと思ってたので、準備というか、あんまり距離を置かずに行こうっていうのはありますね。ちなみにさっきからお伺いしてるやっぱり触手の選択でちらほら興味があるなっていう部分が例えばカナダでねA受験取ったりとか長期滞在するって言ったら今だともうテック科多分保育科だと思うんですよ有名なところでそれで言うとねそのチャイルドケアは例えばボランティアでされていたとか今回例えばITっていう分野をちょっとチョイスしたっていう部分も例えばその長期で海外に行けそうなっていう職種をずっと探されてたイメージですか?そうですね、日本で就職活動してた時の大きな基準も将来的には海外で仕事できるような職種、業種にしたくて物流も結構海外勤務とかあったりするのでそういう基準で選んだ会社ではあるん。ですけどなるほどねだからこのポッドキャストねそうよあなた、あなたは違うかもしれないけどね何を考えてなさ。そうに見えるかもしれない。けどそんなことはないと思うけどだからこのポッドキャスト聞いてる方々もやっぱり海外で今後っていうふうに考えられること多いと思うけどこのポッドキャストはITがもちろん多いかもしれないけど意外とやっぱり保育だったりさっき言ったチャイルドケアだったりあと本当物流系もそうだしあとどこだろうな金融もそうかこの辺はやっぱり移民とか永住権取るっていう人たちだと結構王道になってくると思うのでちょっと覚えておくといいかもしれないし綾香さんみたいにそういう調べ方をするのはすごく素晴らしいこと。だなとそれで言うとでも大学4年生の時にはもうなんだろうそういうことを考えてこれからどういうことをしたいかとかどういうところで働きたいかみたいなのを考えてちゃんと準備してで就職につなげてそこからまた自分の力で学校に行ってってできてきちゃうわけですよね高校生の頃とか大学生の頃の自分がいたら教えてあげたいですよそういうのです。よってでもそういうのってさ教えられたとしても多分興味とやっぱりなんか思考が向かないとうんそうだねって感じじゃなくない?そうなんですよね。タイミングもありますしね。決断できるタイミングと。その情報だから、大学生の時の戸橋龍一に対して伝えたところで、たぶん、へーって言ってそうな気もするんではないけど。確かに。ということで、素晴らしいデモ。本当に素晴らしいなってCICCCちなみに選んだのもじゃあコープっていう部分があるからって。いうことですかね一番安かっ。たんで分かりやすいところありがとう。ございます私それこそ特に調べもせずに学校は決めたんでレコードクオリティが低いことだけは知ってました。良かった良かった一番お金。をかけないで良くてディスカウントとかもあったんで。その時ちょっと安くなるなるほどじゃあやっぱり値段とコープとっていう分が割かしちょうどいいバランスだったってことですねそう。ですねそれこそAyakaんは全くその会社では一応要件定義みたいなところには関わったと思うんですけど技術力とかプログラミングっていうところにおいては全くゼロからこっち来てるわけじゃないですかカナダに来る前に何か準備みたいなのはしたんですかそれとももうコーナーストーンに入ってから。って感じですかいや本当にしとけばよかった話なんですけど3ヶ月ぐらい会社辞めてから時間あったのに遊びほうけて何もせずにCICCに入ってから準備コースみたいなのが1ヶ月あったんですけどその時に初めてHTMLとCSから勉強し始めましたいやーおかしいって。言ってみんな思ってると思うんですよ多分ぶっちゃけワークデーって本当にクッシュのいい会社にCICCの初心者コースに通っているような方が1年で入れるわけがないって多分思ってる人が多くてどういう勉強の仕方し。たのかなっていう勉強は他の人と同じことしかしてないと思いますしそれよりも足りてないところはいっぱいあったと思いますそんなに色々やってた。わけではないですけどこの話はたぶんポッドキャスト聞いてる方々が鵜呑みにするとCICC行ったら1年間でワークデーに行けるだけのクオリティーが見つくんだってなるんです。けどそんなことはない。ビザを。くれる移民局みたいな学校な。んだよそんなこと言うか分かんないけどでもそれは事実ではやっぱりあってカレッジも別に大学もそうなんだけどやっぱ教えてくれる先生にそれよるところがあるからそんな運ゲーでしかなくてましてや普通の私立のカレッジでしょってなるとそんななんかクオリティをやっぱり求めていく人っていないと思っててなんかね、どうしてもおそらくこのポッドキャストを聞いている方々は秘密を紐解こうと必死やきもきやきもきする気はしますがなんか特別メンターがすごかったとか?メンターいないですねそれこそフロッグとかにフロッグとかに入ってればよかったなって今後悔してるんです。けど全然全然でも誰も知らなかった本当に多分ここが一番のねおそらく今日聞いてくれてる方々のクエッションでそう何なんだろうね普通に学校に通って先生がむっちゃよかったなこともない。先生はみんな他のえっとりょうさんとガルと同じ代の人が先生でした。ベイクって一緒でしたっけ?フランスはです。アジアだ。ベイクならまだわかる。でも、そもそもさっき、ちょっとなんかその学校のことをディスってしまったけど、そもそも学校っていう、なんか就職するための勉強をするかそれとも本当にナレッジとしてちゃんとCSみたいなものを身につけるかみたいなのでも選ぶしかないじゃないですかで就職みたいなのの方に学校がよるとなんだろうなんかベースの技術みたいなのはまあ多分全く身につかないまま終わっちゃうしでベースの技術みたいなのを会社多分基本的にはそっちの方をやるのかななんかブートキャンプとかだったらまた別かもしれないですけどそういうのをやると今度就職活動の準備っていうのは自分でやらないといけないと思うからもうなんか学校っていうその体質上しょうがないとは思うんですよねその人に足りなくなったり。するのはそうだね間違い。ないなんでなんか聞きたいなと思ったのはその学校の授業以外ではなんかどんなことをやってたのかなってちょっと聞きたい。学校の授業そうですね以外でやったことの方がやっぱりあの効果はあったと思います学校のカリキュラムそんなにあの豊富じゃなかったし遅かったのです自分で先にどんどんどんどん勉強進めていくのが多分大切だったと思っていてでやっぱりあの知識がゼロの状態から始めるので半蔵形式のあのレクチャーがないと何もできないんですねだからUDEMYはたくさん。やりましたUDEMYの民だ。いっぱい買って安い時に買ってできるだけ早く進めていきましたねで多分半年ぐらいでそのいろんなインプットをやりきってそんなにいろんなことをやらずに本当にリアクトとちょっとデータベースとAPI書くぐらいのバックエンドぐらいのあの本当に絞って何でもかんでもやらずに絞ってでそれ一旦それができたら何かしらフルスタックのアプリって作れるじゃないですか簡単なものならそれを自分の力とあとグループ開発とかで3つぐらいかなポートフォリオに乗っけられるようなアプリを自力で作ってそうですねその時にインプットしてたものはアウトプットするのでエラーも出るしディバッギングしないといけないしっていうのでその都度勉強してっていう感じです。ね今度そうするとあのそれだけのボリュームのものをあのなんていうの授業外でやると今度授業のことが結構ついていけなくなったりとかあのもしくはおろそかにはなると思うんですけどそこらへんってなんかどうしてましたおろそかになってましたそれとももう本当に時間かけまくってどっちも頑張ったみたいな感じですか授業。はそんなに頑張ってないです、正直。朝だったら、モーニングクラスだったから、もう半分寝ながら受けてましたし、課題も、課題はちゃんと出してましたよ、けど、そんなに時間のかかるものでもなかったから。もう、そうですね。なるほどね。確かにそれで言うと、フランソワっていう先生は、それこそコーナーストーンに僕の次の台に学生として行ってたんですよね。だからもしかしたら、その人もその後の就活の大変さとかそれだけじゃ足りないみたいなのを分かってたからあんまり多く課題みたいなのを多くしなくしてくれたのはあるのかもしれないですね。もしかしたらかもしれないよね割と僕は逆にあのね経験でやっぱ来られてCICC行くっていう人たちもそれに多かったけどやっぱりついていけないっていう人の方が圧倒的に多かったもんなおだしょーそうなんですか三宅だから台が違うからなのか今言ったところがおだしょ。ーディセンにもよりますよね。三宅いや素晴らしいでもちなみに今の話は例えばReactだったりとかBackend何使ったかちょっとあれですけどAPI例えば構築したりとかっていう部分の技術的な選定ってやっぱりできるだけ就職活動するときに合わせたほうがいいじゃないですか求められてる技術にその辺の技術のチョイスとか選定とかは割と先生が言ってくれたことをそのまま宇野身にみたい。な感じですかねえっと同じ台でちょっと日本で経験のあるエンジニアとして経験のある人がクラスメイトにいるのでその人たちがやってることを丸パクリしました。いやー大事大事でもパクれる人がいたのはでも良かったですねそれはそうですね。その意味では、その人がロードマップを紹介してくれたりとか、このエルデミー良かったよとか、毎回毎回その人が先にやって、それを後で教えてくれたんで、自分で調べて何がいいかなとかっていう時間は特になかったですね。いやーでもそれそれ割かしメンターに近いんじゃねってちょっと。思いましたけど確かにメンターと思ってなかっただけで。メンターしてくれてた感触が楽しいですよねいやいや全然全然でもそういう環境をちゃんと自分で作れるっていうのは素晴らしいことですねあとすごい。なって思ったのがその学校のことをおろそかにしてもいいなって思って自分でやらないといけないことにちゃんと絞れたのはすごいですよねその技術の選定をしてそれ以外やらないってちゃんと決めてそれだけに絞ってポートフォリオを3つ作るってインプットした後にそれ作るって1年間のうちににそれ作るっていうのも3つ作るっていうだけでもすごいし日本人って結構やっぱ完璧主義で学校のこともあるから学校のこともやらないといけないみたいな結構この頃はあんまりないけど初心者で来た人が結構前いたじゃないですかその頃にアドバイスしてくださいみたいなので学校忙しすぎてそれ以外のことなんかできないですよっていうと言われてそれに学校のことはもう全部ほぼ無視しちゃって首にならないくらいでやって、あとはもう自習、学習したらいいんじゃない?みたいな言うと、いや、そんなことできないですよってみんなに言われてたんで、それがやっぱりできてちゃんと集中一つのこととか、自分のこれって決めたことに集中して、それをなんか1年間やり遂げれたっていうのがすごいですよね。いや、。大事。すごい大事だと思う、。それ。おだしょーはいそんな感じですねだからでも実際今東橋さんが言うたことはフロックも相当今悩んでるけどねやっぱり学校の課題に追われ英語の勉強に追われ結局本質的な就職をこっちへするっていうふうな目標あったはずなのにそっちに対する努力をする時間っていうのが取れてないっていう人は正直多いです。からねおだしょーでもあとはこういう綾香さんみたいなケースがいてくれる。とは。いえお前多分その人たち聞いてきた人たちはとはいえお前ちょっと経験あったからそれができたんでしょうみたいなやっぱ多分それ僕が答えたとしても思われてて多分他の人も結構みんな同じ就職できた人たちと同じこと言うんですよ学校に行ったけど全然やってないよみたいなでもなんかやっぱそれは経験者だからでしょみたいなのが多分あってまあAyakaんみたいに全くの未経験でもう本当に1ヶ月目でhtmlからやりましたみたいな人でもできるんだよっていうのはすごい何だろうお手本になるいいケース。ですよねいや本当そうです。よねいや学校の質にも本当によると思うんですけどちゃんと学校ランガラーとかわかんないんでそのそういうのに行った人がどう感じているのかちょっと謎ではあるんですけど学校でしっかり学べる自分が欲しい情報が得られるって思ったらそこにフォーカスした方がいいのかもしれないですけど私はやっぱりなんか分からなかったら巻き戻して聞きたいし分からないところをもう1回見たいしっていうのがあったので授業はこう流れていっちゃうじゃないですか自分が何が聞きたいのかっていうのをちゃんと用意しないままに聞くのでなんかこう受動的になっちゃうけど自分で学習する分には欲しい情報を探してお金出して買って聞いてってやるので身が入りやすかったっていうのがあり。ますなるほどねそしたら就職活動にちょっと話を移していきたいんですけどポートフォリオは3つ作られたっていうことだったんですけどなんかレジュメ書くのも結構その一苦労じゃないですかなんかそこらへんってなんか就職活動っていうとどのぐらいから始めました?就職活動学校が終わる学校のその勉強のアカデミックタームが終わる3ヶ月前ぐらいから始めて3ヶ月じゃないな2ヶ月ぐらいですね前から始めてでそうですねまずレジュメがそもそも未経験なのであのエクスペリエンスの部分書けないじゃないですかまずいと思ってその時あのボランティアをやってたのでボランティアの経験はかけたんですけどそれも大したあの威力なさそうだなと思ったので学校が終わった瞬間アカデミックタームが終わった瞬間から日本の業務委託の案件をやり始めましたでそれ就活は全部で6何ヶ月やったんだろう私どっかにメモった…3ヶ月か、3ヶ月やってたんですけど、就活を全部で。その期間、フリーランスで働きながら、経験も積みつつ就活しつつっていうのは、それはどっちもやってました。おだしょー理想の一つですね実際フロックも実際ねフロックも仮にだけど今日本から完全に未経験で来るんだったらやっぱり日本の自宅でも本当に正直何でもいいから未経験のレッテルをできれば就活の半年前に外しといてっていう風なのをお願いしてやっぱり進めてはいるんですよこれなんかあるよねそれなんかね嫌がるというかいやカナダに来たんだから海外の案件でやっぱりできれば就職をしておきたいとかそっちにちょっとフォーカスを置いている方多いなと思うんですけどとにかくねレジュメ上から未経験の一言を外さなくちゃいけないので。本当にそうだと思います本当に未経験だと一行あっても全然レジュメ通ら。ないので絶対無理でしょっていうこの間ねなんかスポットキャスト出てくれたね大学生とかの方やったら時間もあるビザもあるっていうところでプロジェクトとか研究とかっていうので行けるかもしれない行ける人もいるかもしれないけどよくわかんない彼氏出た人でっていう前提になってくるとね期間もそんなにやっぱり長いわけではないし働ける?未経験はとにかくないっていうのを前提にしなくちゃいけないのでこれは聞いている方にもぜひ覚えておいて欲しいところですね。僕たちの母校がよくわかんないって言われちゃったけど確かにそうですねなんか多分ちょっと気になるのは気になるというか聞いてる人が気になるなって思うのは僕たちの学校僕どっちも同じ学校に行ってたんですけど1年勉強の時間があって1年就職のワーキングビザっていうのをもらえる学校ってことですよねでそれ以外の学校だと大学とか出ればね3年もらえるしカナダのバンクーバーで言うとランガラとか行くと2年勉強して3年とかだから確かにその2年のうちその3年の中で、就職できるビザがある3年の中でレジュメ書いたりだとか、準備みたいなのをしてもまだまだ間に合うみたいなところがある中で、僕たちが行った学校は1年1年で本当その働けるタームが始まってから準備したら始まってから準備したのでは遅いみたいなのがあるから確かにその2、3ヶ月前には始めてでできるならまあそのぐらいとかその前ぐらいからちょっと日本での経験もつけつつちょっとプロジェクトにもかけるプロジェクトのエクスペリエンスの欄をかけるようになりつつみたいなのが結構大切になってきますよねそう。ですねそれをしないとむしろ未経験はちょっと厳しいんじゃないかなというのがありますね正直他に。はどんなことをやられましたかなんかよくあるのだったらlinkedだったりとかgithubになんか草林だったりとかプロファイルのところ書くだとかあると思うんです。けどそうですね私linkedには誰もがやると思うんですけどレジュメと自分のポートフォリオサイトのリンクとあとはそれだけかGitHubのリンクも貼ってGitHubは自然と芝が生えるじゃないですか毎日プロジェクトしてただからそこはアピールになったのか分からないんですけどそうですねアピールできるところは書いてあと何気に大事なのLinkedIのちゃんと写真を自分の顔でいい感じの人だって分かる写真にするのは大事だと思います私、inkedILで就職できたり、LinkedIのおかげで就職できたようなもんなので。っていうと?今のチームのマネージャーが、LinkedIで直接メッセージをくれて、私にこれ受けてみませんか?ワークデーのこういうポジションを受けてみませんか?っていうのをダイレクトメッセージくれたので、受けて通ったので、見てくれている人は見てくれているしリクルーターとつながるのも一番手取り早いと思うしいい人、楽しそうな人、一緒に働いてみたいなっていう印象を与えられるページにするっていうのは自分のブランディングの上で大事だ。と思いますいやむちゃくちゃ大事だと思うんですけど、これね誰にどう伝えたらいいんでしょうねフロックですらと言ったらいいかもしれないけど、全然うちに相談してくれる人ですらリンクドインのね写真はなんか変なよくわかんないアニメのアイコンやったりとかダメです言うたってみんなにもうほっぺってもねそんなん。すら連絡来ません来ませ。んよなんでみんなせえへんのかなと思っているとまあやっぱりねなんか嫌だっていう人多いんですよ。どうしたらいいなんか一応北米のIT業界だとレジュメに顔を載せないのがまああのそうですね数例というか決まりじゃないですかまあそれってなんかあの人種差別とかがないようにそういう見た目では判断しないようにしようみたいな多分心も行かしたなかななんだけど多分人によって多分違うと思うけど僕もあやかさんと同じ方であのやっぱり楽しいとか働く行く時にこの人と働いたら気持ちよさそうだなみたいな思わせるのってやっぱ大切だから僕はいろんなところに乗せられるところには顔乗せたらいいと思う派なんですけどそういうのではジャッジしないからいいだろうっていう人たちもいますよね乗せない人たちはそういう側なのか。なそうだねそんなところで判断してほしくないって思っ。てるんだろうな多分でも全然自分のなんですかモデルさんである必要はないじゃないですかただ笑ってこういいなんだろう楽しそうだなこの人コーディングしてる写真とか乗っけて楽しそうに仕事してるなとかでいいと思うそうなん。すよねなんかねなんかすごいイッチョーラとか黄色とか言ってるわけじゃなくてみたいなでもやっぱり乗せたくない人は多いからね特に日本の場合はっていう。のが。なんか自分の今見てみたんだけど僕は割と後ろ姿だった横の顔ちょっと見せてるぐらいだった全然気にしたこと。ないんだけどそうだよニッコーかなんかがちょっと眩しいなくらいのやつだろお前の。やつ覚えてるよちょっと爽やかな私覚えてますけど爽やかな。感じはしましたよ俺。の写真見習い俺の写真は割と結構ど真ん中やと思うよTwiterとかもそうやけど超爽やか高青年を気取っ。てるからいやでもちゃんとなんかやってなかった僕が言うのもあれだけどやっぱ顔見せてこんな人だよっていうのはどんどん見せていったほうがいいですよねお。だしょーはいまあそんな感じかまあちなみにねそのリンクドインの部分にも多分関係するのかなというふうに思うんですけど逆にレジュメとかそのポートフォリオとかの見せ方とかなんか伝えられる部分とかありますコツみたいな。私の場合、昨日したかどうかわからないんですけど、レジュメとカバーレターは毎回会社ごとに変えてました。例えば、私はフロントエンドでしか勉強をちゃんとしてなかったので、フロントエンド中心に応募してたんですけどフロントエンドっていうポジションに対してはフロントエンドデベロッパーですって書いたレジュメにしてソフトウェアエンジニアでポストが載ってる場合はソフトウェアエンジニアって書いてっていう細かい違いですけどあとはフロントエンドのカバーレターにはそういう自分の強みはフロントエンドちゃんとMockを再現できますよとかフロントエンドにしか刺さらないことソフトウェアエンジニアだともうちょっと包括的にAPIインテグレーションできますよとかそういう文庫を変えたりしてたと思い。ますなるほどね最近だと本当にマスアプライする人だいぶ減りましたねそうするともうとりあえず100通200通よくわからないとこにボンボンボン送るみたいなことはしなかったです。もんねしなかった全部で68社しか応募しなかった。ですでも業界未経験の人としてって考えたらアレやかもしれないけど相当ねフログの中でも少ない方かなと思うの。でめちゃくちゃ少ないと思いますこれ。ででも実際まあそれでちなみになんですけど何社くらい通ったとかもしくは連絡来たとかあります?最初本当に少ないですよ未経験なので5社しか通らなかったんですねレジュメ。いや十分十分びっくりするわ1割ぐらいは帰ってきてるから未経験で5社って。っていうじゃあやっぱりカバーレターとレジュメをちょっと変えたのはこうそうしたかもしれ。ないですねあとそれはなんかその変えた方がいいっていうのはどこで知っ。たんですかそれも個人的にあの日本で就活してた時もやっぱり見てる人はちゃんと読むじゃないですかカバーレターとかレジュメとかハイアリングマネージャー目線になった時に私日本でハイアリングもちょっとしてたことがあるんですけどちゃんと書いてる人この会社の特徴を理解して強みとか書いてくれてる人の方がやっぱり刺さるだろうなっていう向こう目線に立って考えたらこうかなっていうのを自分で試してみたっていう感じです。いやもうたっか聞いてて頭がいいんだなって。正直思うとこあるわなんか僕お願いしたときに私もう本当運でしか入ってないんで喋ることないですって言ってたんだけどめちゃくちゃちゃんとしてたその名前を変えたりするのって多分ATS対策ってATSアプリケーショントラッキングシステムATS対策って言うんですけどそれをって言う言葉は多分それを考えずにちゃんとアイテム店に立つことでそれがきっとできてたってことですね。いやすごいよねそのままで。は知らなかったですけど確か。に。何が起きてるか分かんないですけど確かに放送し。たのかもしれないちょっと補足するとATS対策っていうのは特に日本でもあんのか分からないですけどこっちってやっぱり1件のポストに対して200件とか300件とかのアプリケーションが来るんで人間が全部見てなくてそれがシステムでこの人たちがマッチしてるよみたいなのをポってハイアリングする側のハイアリングマネジャーとかに行くんですねそれにその200人とか300人の中でその10人とか選ばれると思うんですけどその選ばれるためのなんか対策みたいなのがあってそれがさっき言ってくれた名前を同じにしてるだとかジョブディスクリプションに書いてあるリアクトって書いてあったら自分もリアクトって書いてあるとかそのマッチング度合いみたいなのを多分パーセンテージみたいなので出してそのマッチング。の。さっくり言うとそんな感じなんですけどそういうのをほとんどの会社が使ってるの。かなこっちで終わりじゃない。とさばけないからねじゃあちゃんと意味かなってますね意味かなってるってことは皆さんやったほうがいいってことです。ねやったほうがいいということも素晴らしいちなみにどうしてもちょっと気になる部分がもう一つ就職活動してた時期って何月から何月くらい何年の何月から何月くらい2022。年の6月7月から。10月ですね4月から。10月かてすると割りかし景気も確かにいい。時期ですねあ、そうですねその時ちょっとその後からすごい悪くなったんですけどそう、。その後からむちゃくちゃリセッションまだ良い良かったですねえ、来たからだからいろんなものが噛み合ったんですね動き方もそうだしこれまでの作られてきたポートフリーもそうだしで、やっぱり景気もすごいマーケットもかなり活発な時期っていうとこもあったのでで、ビザもちゃんと残っててっていうねもう理想ぶ理想みたいなところがあるのでぜひ皆さん参考にしていただき。たいなとでもその5社の中でコーディングテストとかちゃんとテックインタビューをしたのがワークデーだけで一発本番で撮ったんです。ねすごすぎてよくわかんないもはやあれなんだけどワークデーのコーディングテストを覚えてる範囲でいいんですけどどんな。内容だったとかって2。回あって最初の1回目がフロントエンドのリアクトでペアプログラミングをするものペアプロなんだ本当にすごく簡単でしたステートの管理が。ちゃんとできるかとかはいはい。はいで2つ目はオブジェクト思考設計ですねなんて言うんでしたっけあれU…なん。でしたっけあれオブジェクトオリエンテッドUMD。ダイアグラムのを使ってカーシェアリングのアプリを作るならどんなオブジェクトモデルを設計しましょうかみたいなのをいろいろペラペラ喋りながら設定していってこのリレーションシップがこうなってとかっていうのをずっと喋り続けないといけない。なかなか大変でもその2回のコーディングインタビューで通るっていうのもすごいけれどもワークデーだけだったんですね他のちなみに4社はもう電話インタビューだけし。て終わりとかですか電話とあとファービヘビラルとあとオンラインで受けるコーディングアルゴリズムテストみたいな。のがあってOAみたいなやつですねオンラインアセスメントか。なそうですそうですそれで落とされるみたいなアルゴリズムちゃんと勉強する暇がなかったの。でいやそりゃそうっすよね。ちょっとしかやってなかったら見事に激痛いみたいな感じでし。たしゃーないっすよねまあジュニアに対してアルゴリズムまあそりゃ出すかいやでも大変だったんだっていうまあリートコードかじゃあんまりしなかったんですよねそういうとこじゃないですも。んねだってやり始めていやちゃんとやらないとなぁと思ってその1ヶ月ぐらいやってたんですけどその間にワークデーの選考が進んだのでちゃんとやりきるまでに通ったっていう感じですちなみ。にそのワークデーのあのコーディングインタビューはなんだろう自分まああの答え聞いてないと思うんで答えてからなんかどうだったかは相手から多分入社しても聞けないと思うんですけど自分的にはどうでしたなんかできましたそれとも全然できなかったけどコミュニケーションの仕方ができたとかなんかそんな感じ。でしたリアクトはそんなに難しくなかったのでその課題が出たのはちゃんと間違えずにできたと思いますでコミュニケーションも30分くらいの短いやつだったので45分かなでも最初の15分とかは本当に雑談感じだったんで、ジュニアに問われてるのって、私、ジュニアのポジションで撮ってもらってるんで、そこしか見られてなかったと思うんですけど、ちゃんと質問ができるのか?と言われたことを、ちゃんと理解してそれをやろうとしているか?とかの、そういう基本的なことだと思うので、それに関しては、。できてたかなと思います。それが1回目ですか?そのリアクトの問題が1。回目だった2回目。はもうちょっと長かったですね1時間くらいのオブジェクト試行設計で私オブジェクト志向もそこまであのジャバーやってたわけじゃなかったので準備してたわけじゃなかったんで不安だったんですけどそれに関してはあまりちゃんとあのきっちりしたものができてなかったかもしれないんですけどさっきも言ったように質問をちゃんとしたのとか答えてもらったものから何か学ぼうとしているかみたいなアトチュードとか。は。そうですねポジティブに見てもらえるようにしたかなっていう意識的にそこはしたかな意外と。そういう意味だと過去のご経験としてはその営業の例えばねあのお仕事だったりとか人とのやっぱり接し方みたいなところも結構役立ったイメージですかその面接とかでもそうです。ねなんか何を見られているのかなから考えて対策したのはもともと自分が働いてた時の経験が生きたのかなと。思いますね意外とジュニアから来る人は営業経験がある人っていうのでちょっとフィルター。上げようかな確かにオンラインアセスメントみたいにもう問題あるからやっといてっていう会社だとそういうところ見てくれないけど実際働くってなるとできないよりできないてコミュニケーション取れない方がすごい悪いじゃないですかとかあのできるけど全然コミュニケーション取れないからなんかコミュニケーションロスから来るなんか全然違う方向進んでたとかってあるんで特にやっぱりジュニアにはそういうところそのコミュニケーションできるとかちゃんと聞いて質問してくれて理解しようとしてくれるとかわかんない時にわかんないって言ってくれるみたいなのってすごい大切なのかなって思いますよね僕も前回の会社のシステムデザインインタビューが前の会社2社目かな僕は今3社目なんですけど一番最初に言った言葉が全然わかんないだったんですよそれこそ本当にシステムデザインインタビューの勉強し始めたばっかりでURLショートなってurlを短くするシステムっていうやつだったんですけどそれを僕見たことがなくてなんか全然わかんないところが出てきちゃってうんわからないって笑いながら言ってちょっとヒントみたいな感じでところから始めてでなんか結局その人がその2社目の僕のマネージャーになったんですけどそこからでもすごいコミュニケーションわかんないって言ってるんでなんか2人で作るみたいな感じで進めてくれて結構結局そこは受かったんですけど受かってそのままその僕もすごいそのマネージャーの働き方がすごいいいなと思った面接の時の対応だったりとかがすごいいいなと思って僕もそこで働いたんですけどやっぱりなんだろうそのできるかできないかだけじゃなくてそのできなくてもいいからなんかどういうふうにコミュニケーション取るかとかあの一緒に仕事してその時に楽しいかみたいなのってやっぱりすごいあると思うんで本当にその。通りだと思いますあの日本人の傾向がわからないんですけどやっぱり言葉数が少なくて黙っちゃうと何考えているのかわからないと思われちゃうのが一番問題だと思うんですねわからなくて悩んでいるのかあのヒントが欲しいのかちょっと考える時間が欲しいのかっていうのだけを最初にちゃんと相手にわかるように伝えると向こうもあのこの人何してるんだろう今っていうのがその不安というか疑心感がなくなるからだいぶその後のコミュニケーションが取りやすくなるんじゃないかなと思いますいや間違い。ない自分がわからないって思われるのが嫌なんでしょうねって思うことあるよねなんか恥ずかしいとかさ恥ずかしいです。けどねそうそうそういうふう。に思われるのが嫌だとかもちろんそれあるんだろうけどさとはいえ本質的な問題ってそこじゃないよねっていうところでねさっきからわからないところはじゃあどこがわからなくて誰に助けを求めるべきなのかとかそれも含めてやっぱりコミュニケーションな仕事やしそういうところに着目できるかどうかって今のお話聞いてると大事だなと思いました。ねあとは前の会社のそのレベルに合ったそのなんだろうなこのレベルの人はこれができるべきみたいのでなんか一つそれの一つの項目でわかんないときに正しい人にあのコミュニケーション取れることみたいなのがあってなんかやっぱりどれだけ強いエンジニアでもその技術的に分かんないことももちろんあればそうじゃなくてナレッジ的に会社の中で一部のチームにしか共有されてないみたいなことがあったりするんでそういうのを自分から情報を取りにいけるみたいなのはすごいプラスですよね別に分かんないことがあんのって人間なんて当たり前なんで基本的には違います。ワークでのレベルごとのクリテリアみたいなプロモーションのクリテリーにも、もうP1はコラボレイティブ、becolaborativeっていうのが大前提としてあるので、やっぱりそういう人を探している会社だったので、そこにマッチしたのかなっていうのはあるんですけど、まあ会社によって本当に黙々とひたすら機械のように正しく解いてくれる人が欲しかったらまた別かもしれない。けどそういうナードな会社もねいろいろいっぱいあるけど間違いない。そうねまあここから先は多分次回なんだろうけれども実際ジュニアで入ってねあの一番辛いレイオフの時期も生き残ってるわけですからねまあそう。いうコミュニケーションの部分もあった。ですよね絶対ないわけが。ないですよ2回もあり。ましたもう生き残ったちょっと待ってこれは次回だと思う。じゃあちょっと一旦戻ってそれが2回目のインタビューでその後はもう確認のインタビューみたいな感じですか?それとも何かビヘビラルみたいなのもあったんですか?ビヘビラルが最初。フォンコールがあって、今のマネージャー、ハイアリングマネージャーとのチャットがあって、で、その後2回のテクニカルインタビュー。だから計3つあって、最終確認の電話ですね。でじゃあ最初確認してサインしてそこから入社みたいな感じですかはいそしたらじゃあ最後にえっと給料のレンジとか言える範囲で教えて。いただいてもいいですかはい言える範囲ではそうですねセックスデジェットだけ減っておきますあと日本で働いてた時の3倍ぐらいには。なりましたすごいマジか素晴らしいセックスデジェットっていうのは日本で言う1000万超えたらすごいよねみたいなののその1000万デジェットって数字0が何個あるかみたいな桁が何桁かみたいな話ですよだからこれ。ちゃんとねいつも俺6個って計算するんですよだって1,2,3,4,5,6みたいないや素晴らしいジュニアで。ちなみにだいたいそのくらいジュニア1。年目でも6ステージとあって、全部込みですよ、RACU、ボーナスも込みで。去年にプロモーションもしてもらって毎年毎年レースもあるの。で夢しかないね本当に夢しかない前回出てくれた大学卒業しての方もそうでしたがやっぱりそうねジュニアでカナダにあるアメリカ資本の会社みたいなところになるとやっぱ60歳くらいからスタートされるところが多そうな感じですね日本に行った時の3倍って逆にね日本に行った時。に日本が少ないのかって。いう3倍って言われるとちょっとはーって思っちゃうよね。そうかわかるんですよ6デジェットは超えるだからそう。ねもしかしたらそれは多すぎる気がする6デ。ジェットって2000万とかの可能性もあるのかある。ね9000万99909万まで6。デジェットなんで笑い幅。が濁しすぎですかいやいや全然。大丈夫ですということで最後まで聞いてくださりありがとうございました海外キャリアログは毎月月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグキャリア海外キャリアログでお待ちしてますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "はい今回はAyakaんに来ていただきましたAyakaんはカナダのまたこれまた同じバンクーバーでワークデーというところに就職されたんですよねまず初めに簡単に経歴を教えてもらってもいい。",
      "start": 561,
      "end": 14670,
      "timestamp": "00:00"
    },
    {
      "speaker": "Ayaka",
      "text": "ですかはいAyakaです経歴は最初新卒で日本のSGホールディングスという物流の会社に入社しましたこれがフロックの今スタッフされている桂太さんと同じ会社で全然知らずにカナダで再開してびっくりしたんですけどそれは余談でSGホールディングスという会社に入社して物流のコンサルの会社で倉庫のオペレーション設計を主にしていて4年勤務した後そこを退社しましてカナダに移住してきたという流れですその後1年間CICCCというコミュニティカレッジでウェブディベロップメントを勉強して就活してでワークデーに就職しましただからワークデーが1社目ですで今現在3社3年目です。",
      "start": 14670,
      "end": 73925,
      "timestamp": "00:14"
    },
    {
      "speaker": "Senna",
      "text": "ね3年目3年目っていうのはカナダ歴って。",
      "start": 73925,
      "end": 77706,
      "timestamp": "01:13"
    },
    {
      "speaker": "Ayaka",
      "text": "いうことですかねカナダ歴もエンジニア歴もカナダ歴は。",
      "start": 77706,
      "end": 83347,
      "timestamp": "01:17"
    },
    {
      "speaker": "Ryo",
      "text": "4年カナダ歴4年目なんじゃないそしたら。",
      "start": 83347,
      "end": 85488,
      "timestamp": "01:23"
    },
    {
      "speaker": "Ayaka",
      "text": "プラス1年なんでワーク。",
      "start": 85488,
      "end": 88263,
      "timestamp": "01:25"
    },
    {
      "speaker": "Senna",
      "text": "デー入られてからもう何年?3年?",
      "start": 88263,
      "end": 91454,
      "timestamp": "01:28"
    },
    {
      "speaker": "Ayaka",
      "text": "2年?2年半なんです2。",
      "start": 91454,
      "end": 93584,
      "timestamp": "01:31"
    },
    {
      "speaker": "Senna",
      "text": "年半かなるほど素晴らしいちなみにワークデーって言ったらねもはや一等値にある非常にカナダでも有名な会社さんですけどわりかしやっぱり日本からすると日本にいらっしゃる方からすると何の会社やろっていうのがあると思うんですがワークデー具体的に何をされている会社なん。",
      "start": 93584,
      "end": 111167,
      "timestamp": "01:33"
    },
    {
      "speaker": "Ayaka",
      "text": "でしょうかワークデーは簡単に言うとお金と人を管理するのを手助けするソフトウェアを会社向け企業向けにB2Bに提供しているSaaSの会社ですねこっちって。",
      "start": 111167,
      "end": 132781,
      "timestamp": "01:51"
    },
    {
      "speaker": "Ryo",
      "text": "結構使われてるイメージで何なら僕の会社でも使ってるんですけど日本って使われてないんですか日本確かオフィスありますよねエンジニアじゃないのかもしれない。",
      "start": 132781,
      "end": 140982,
      "timestamp": "02:12"
    },
    {
      "speaker": "Ayaka",
      "text": "けどありますありますセールスが主にセルスが主な部署がありますね。",
      "start": 140982,
      "end": 152857,
      "timestamp": "02:20"
    },
    {
      "speaker": "Ryo",
      "text": "日本語の対応も知ってますよね、きっと。",
      "start": 152857,
      "end": 155729,
      "timestamp": "02:32"
    },
    {
      "speaker": "Ayaka",
      "text": "知ってます、知ってると思います。日本でも結構導入している会社が増えてきていると思います。",
      "start": 155729,
      "end": 162317,
      "timestamp": "02:35"
    },
    {
      "speaker": "Ryo",
      "text": "そこらへんってあれなのかな、一応会社のなんだろう社員との契約みたいなのってちょっと国によってもいろいろ変わってくるじゃないですかとかコンペンセーションというかそのなんかお金の払い方みたいなのとかあのそこらへんてどうやってやってるんですかねなんかローカライズそれこそローカライゼーションチームがいても良さそうなもんだけど。",
      "start": 162317,
      "end": 185962,
      "timestamp": "02:42"
    },
    {
      "speaker": "Ayaka",
      "text": "クラウドサポートチームみたいなのがあるのでそのチームがその国ごとにとか会社ごとのコンフィギュレーションをサポートして使えるようにしてると思います。",
      "start": 185962,
      "end": 198287,
      "timestamp": "03:05"
    },
    {
      "speaker": "Ryo",
      "text": "あと確かにごめんなさい確かにWorkdayっていっぱいめちゃくちゃアプリがたくさんあって合わないアプリをその国でアクティベートしなければいいだけですもんねそれでいう。",
      "start": 198287,
      "end": 208653,
      "timestamp": "03:18"
    },
    {
      "speaker": "Ayaka",
      "text": "とピックアップしてこれを使いたいこれを使いたいって使わないものはアダプトしなければいいってあと自分たちのコンフィグレーションに合わせて楽天も設定を変えられるようになっている。",
      "start": 208653,
      "end": 224167,
      "timestamp": "03:28"
    },
    {
      "speaker": "Senna",
      "text": "んですね今ちょっと拝見していると楽天さんとかソニーさんとかわりかし大きいところも導入されているっぽいのとワークデイ本当に日本にいらっしゃる方だともしかしたら大手いらっしゃる方はね知ってるかもしれないけどやっぱりアメリカのねカルフォルニアがやっぱり本社の会社さんっていうこともあるのでまあ人材はねさっき東橋さんのちょっとどういう人がっていうところはちょっと気になるところではあるんですがやっぱりカナダのワークデイさんはエンジニアさんだったりとかデベロップメント部門が主にあの人員がいらっしゃるってイメージ。",
      "start": 224167,
      "end": 255752,
      "timestamp": "03:44"
    },
    {
      "speaker": "Ayaka",
      "text": "ですかそうですね開発が多いと思いますセールスもほらいると思うんですけどやっぱり。",
      "start": 255752,
      "end": 263133,
      "timestamp": "04:15"
    },
    {
      "speaker": "Senna",
      "text": "そこはそういう構造になりますよねアメリカ本社カナダデベロップメントもちろんアメリカも全部のチームがあって日本はやっぱりアカウンティング広げたりとかセールスに入ったりとかっていう部分でローカライズしてっていう結構よくある型の展開を世界中にされているということ。",
      "start": 263133,
      "end": 281689,
      "timestamp": "04:23"
    },
    {
      "speaker": "Ryo",
      "text": "ですねちなみにワークデーのバンクーバーオフィスは最初の回の優吾君と僕と同じビルに入ってるっていう本当。",
      "start": 281689,
      "end": 292634,
      "timestamp": "04:41"
    },
    {
      "speaker": "Senna",
      "text": "だよあそこのビルすごい僕らの知ってる方がたくさん入ってておまけに僕らのオフィスもあそこから1ブロック半くらいの方にあるの。",
      "start": 292634,
      "end": 301558,
      "timestamp": "04:52"
    },
    {
      "speaker": "Ayaka",
      "text": "で確かにめちゃくちゃ近いですね。",
      "start": 301558,
      "end": 303880,
      "timestamp": "05:01"
    },
    {
      "speaker": "Senna",
      "text": "そうなんですよあそこに全員集結すればいいじゃんっていうね本当にそしたら、。",
      "start": 303880,
      "end": 310243,
      "timestamp": "05:03"
    },
    {
      "speaker": "Ryo",
      "text": "カナダに来る前は一社だったと思うんですけど、それは全然なんか日本の会社ですよね。",
      "start": 310243,
      "end": 319433,
      "timestamp": "05:10"
    },
    {
      "speaker": "Ayaka",
      "text": "そうですそうです。日経の佐川キュービンの母体となっているSGホールディングスっていうグループ会社を集めた会社なんですけど、。",
      "start": 319433,
      "end": 331235,
      "timestamp": "05:19"
    },
    {
      "speaker": "Senna",
      "text": "うちのねスタッフもやっぱり同じ会社にいらっしゃったっていうのを僕聞いてだからそう意外とですねそのAyakaんのお話もたくさんの人から実は耳にしていて僕ケルタさんもそうだし色んな噂が飛び交ってますか?そうそうだしあれあとユキさんとかもねあれかごめん個人名を出すあれやけれどもあのフロックのインタビューとかに載ってくれてる方ともちょっと仲良ししていただいてるっていうこともあってたくさんちょっとお伺いしていた。",
      "start": 331245,
      "end": 358057,
      "timestamp": "05:31"
    },
    {
      "speaker": "Ryo",
      "text": "んですがそれで言うと僕はその人からAyakaんを紹介してもらって同じビルに日本人で知ってる人なんか友達が働いてるらしいよみたいなこと言ってたんで紹介してくれって。",
      "start": 358057,
      "end": 367759,
      "timestamp": "05:58"
    },
    {
      "speaker": "Senna",
      "text": "言っていや良かった良かった良い繋がりだと思いますで。",
      "start": 367759,
      "end": 373060,
      "timestamp": "06:07"
    },
    {
      "speaker": "Ryo",
      "text": "そこは全然ただじゃあ全くの日本の会社だったと思うんですけどなんか海外で就職しようみたいな目指すきっかけみたいなのってあったんです。",
      "start": 373060,
      "end": 382923,
      "timestamp": "06:13"
    },
    {
      "speaker": "Ayaka",
      "text": "か海外に就職するっていう海外っていうテーマではずっと働きたかったんですね大学の時に留学とかも考えたんですけどやっぱり自分のお金で自分のキャリアもある上で行きたいなと思っててその方が1年しか留学できない学生時代よりもやっぱり自由が利くかなと思ってたので1回就職してちょっと考えようっていうことで大学では留学せずにいてで就職してから3年か4年くらい3年目かの時に会社全体がデジタル化を進めようみたいなムーブがあっていろんなSaaSの会社と契約を進めていてKintoeとか使い始めたんですねで私が営業開発部に所属してたんですけど全然自分のやってる本流の仕事とは別に営業成績を管理するツールを作ってくれって頼まれてでそれをSaaSのシステムエンジニアの人と一緒に要件定義というか私自身が作るんじゃないんですけど会議に参加していろいろ要件を固めていくっていうのをし始めてそこでどんなデータを渡せばいいかとかどういうAPIがいるかとかのミーティングをしてたんですねそこからちょっとずつ興味が出始めてその人たちがどういう仕事をしてるのかなっていうのとあと全然予算が下りなかった部分をBIツールっていうのを使って自分たちでぱっと見でデータを見れるようにしろっていう風に言われてで、BIツールってそんなにガチガチにプログラミングするわけじゃないんですけどなんか簡単なSQL文とか書けるものなのでそこで本とか買ってどうやってデータ取得するのかなとかフィルターかけるのかなとか自分で勉強しているうちにウェブ開発に興味が出てきたのでじゃあもっと勉強してみようってなってじゃあせっかく勉強するんだったら海外も行きたかったし全部一緒に2つセットにしちゃって海外留学勉強してちょっと転職目指してみようかなみたいな風になったっていう流れです。",
      "start": 382923,
      "end": 541815,
      "timestamp": "06:22"
    },
    {
      "speaker": "Ryo",
      "text": "ねそっちの方にそれは内部のチームと一緒に作ったんですかそれともなんか受注みたいな感じで外部の人と一緒に作っ。",
      "start": 541815,
      "end": 550582,
      "timestamp": "09:01"
    },
    {
      "speaker": "Ayaka",
      "text": "たんですか外部ですね。受注施策してもらってたっていう。",
      "start": 550582,
      "end": 556178,
      "timestamp": "09:10"
    },
    {
      "speaker": "Ryo",
      "text": "それこそ、なんか日本のよくあるSIAの人たちと外部の会社のSIAの人と一緒に働いたみたいな感じ?",
      "start": 556178,
      "end": 566103,
      "timestamp": "09:16"
    },
    {
      "speaker": "Ayaka",
      "text": "そうですね。",
      "start": 566103,
      "end": 567484,
      "timestamp": "09:26"
    },
    {
      "speaker": "Ryo",
      "text": "上室みたいな部門はいなかったんですか?上室?なんか情報システム部みたいなのがいて、そういう人たちが結構外部の人と話すのかなと思ってたんですけど、。",
      "start": 567484,
      "end": 578879,
      "timestamp": "09:27"
    },
    {
      "speaker": "Ayaka",
      "text": "あったんですけどその人たちはあの倉庫のあのウェアハウスマネジメントシステムの開発に忙しいので内情をよく知ってる人が参加しないといけないじゃないですか要件定義って実際にシステム使うのが営業開発部門の人だからそれが私なので参加しないといけなかったっていう。",
      "start": 578889,
      "end": 604040,
      "timestamp": "09:38"
    },
    {
      "speaker": "Senna",
      "text": "なるほどねじゃあ計らずもがなSIRのやる上流工程を物流の会社にいながら経験することができたってことですよね?",
      "start": 604993,
      "end": 616058,
      "timestamp": "10:04"
    },
    {
      "speaker": "Ayaka",
      "text": "そうですね実際に手は動かさなかったんですけどどういうふうに要件を作って。",
      "start": 616058,
      "end": 623401,
      "timestamp": "10:16"
    },
    {
      "speaker": "Senna",
      "text": "いくのかとかいやすごいでもそれであったとしてもねうちのケイタさんなんかももちろん同じ会社で働かれていてITっていいなっていうふうに言いながらカナダに来てITも勉強しようと思ったんだけどでも自分に向いてないと絶対思ったのでやめましたって言ってたんですけど同じような方は多いと思うんですよねやっぱりITの分野にちょっと触れてもしかしたらこれって次の世代っていうか次の世界を作ってくるかもしれないとか割と楽しいかもしれないとかでも実際やっぱりやるっていう風になるとまたお話別じゃないのっていうことで結構大きい決断されたなと思いますがなんかあったんですか?ITいっぱい給料もらえそうとか。",
      "start": 623401,
      "end": 664752,
      "timestamp": "10:23"
    },
    {
      "speaker": "Ayaka",
      "text": "なんか希望というかずっと技術職なので身につけてしまえばいろんな技術のトレンドもあるから勉強し続けないといけないのももちろんなんですけどあんまり人と関わらずに僕も仕事するの好きだったんでそういう作業というか開発は向いてるかなって思いました。",
      "start": 664752,
      "end": 690600,
      "timestamp": "11:04"
    },
    {
      "speaker": "Senna",
      "text": "なるほど素晴らしいご自身の性格と対応してっていうことですね相談をしてそう。",
      "start": 690600,
      "end": 695763,
      "timestamp": "11:30"
    },
    {
      "speaker": "Ayaka",
      "text": "ですねもともと営業開発にいたから次のキャリアの営業って言われてたんですけど絶対やりたくないと思ったしやってる人を見てあんまり楽しそうではあるけどしんとそうっていうのもあったんで今度うちの。",
      "start": 695763,
      "end": 712019,
      "timestamp": "11:35"
    },
    {
      "speaker": "Senna",
      "text": "嫁様とぜひ会話していただきたいですねすごい営業の話ちょっと盛り上がりそうすみませんちょっとそれは別にあるんですがなるほどそれもあってITプログラミングエンジニアリングっていう部分に興味が出たということ。",
      "start": 712019,
      "end": 724825,
      "timestamp": "11:52"
    },
    {
      "speaker": "Ryo",
      "text": "ですねちなみに僕もそれこそSIR出身で結構SIR僕が知ってるのと聞いた話でしかないんで全てではないと思うんだけど結構やっぱりSIRの仕事って辛そう辛いみたいなのがあるじゃないですかその内部システムというかそのSaaSとか作ってる会社に比べてその一緒に働いてみてなんかうわぁこの人たちめっちゃ働いてて嫌そうだなぁみたいななんかネガティブなイメージはなかったんですか結構本当にポジティブなイメージだけでもう私もこれやりたいみたいな感じになれたんですか。",
      "start": 724825,
      "end": 761252,
      "timestamp": "12:04"
    },
    {
      "speaker": "Ayaka",
      "text": "確かにねその人たちその一緒に仕事してた人たちは確かになんかこう要求をいろいろ投げられてそれをどう予算繰りするかするのかなみたいな結構しんどい立場にいるんだろうなーって思ったんでその作業するエンジニアの人たちとカスタマートのブリッジになってしんどそうだなーっていうイメージはあったんですけど実際に作業するエンジニアたちの良さ見れなかったんで、そこでのジャッジはあまりなかったんですけど、自分は作る側に興味がありましたね。SIAさんになりたいっていう。",
      "start": 761252,
      "end": 802109,
      "timestamp": "12:41"
    },
    {
      "speaker": "Senna",
      "text": "よりかは作る側あれでしょ東ヶ谷さんの言ってるところがITどかた的な感じの空気感を見てしまうとむしろ離れてっちゃうん。",
      "start": 802109,
      "end": 810253,
      "timestamp": "13:22"
    },
    {
      "speaker": "Ryo",
      "text": "じゃないかみたいなねなんかSIAのそういう受託開発してる人たちの働き方ってミーティングをする人も作る人も一緒だったり結構多分僕は炎上してる案件とかに入るとそれこそこの人辛そうだなっていうのが多分要件定義を一緒にする会社の人とかにも多分見られちゃうというか見えてくるんでそういうのはあんまりなく本当にミーティングとかだけの時時に会うだけでそんなじゃあ気持ち悪いって言ったら悪いところを見。",
      "start": 810253,
      "end": 852942,
      "timestamp": "13:30"
    },
    {
      "speaker": "Ayaka",
      "text": "たかなあんまり覚えてないけどまあしんどそうではありましたすいませんこんなにいろいろお願いしてってこっちは申し訳なかったですね無理を言ってる感じがして。",
      "start": 852942,
      "end": 866187,
      "timestamp": "14:12"
    },
    {
      "speaker": "Senna",
      "text": "その温度感はやっぱりありはするってことですね。",
      "start": 866187,
      "end": 867808,
      "timestamp": "14:26"
    },
    {
      "speaker": "Ryo",
      "text": "でもそれは良かったですねそしたらじゃあそこでなんかネガティブなイメージをつけずに。",
      "start": 870096,
      "end": 875901,
      "timestamp": "14:30"
    },
    {
      "speaker": "Ayaka",
      "text": "こっちに来て無知なだけ来たかもしれないいやいや。",
      "start": 875901,
      "end": 878924,
      "timestamp": "14:35"
    },
    {
      "speaker": "Senna",
      "text": "そんなこともないじゃないですかでもそれで言うとねやっぱり今お話しにあったところだといろんな多分海外っていう選択肢ってあったと思うんですよさっきね海外でやっぱり頑張ってみたいとか勉強してみたいっていう部分とリンクしたって話はあったと思うんですがそれでなんでカナダだったんですかアメリカとかやっぱ有名なんちゃうんっていうところはあると思う。",
      "start": 878924,
      "end": 897300,
      "timestamp": "14:38"
    },
    {
      "speaker": "Ayaka",
      "text": "んですけどビザですねやっぱり。",
      "start": 897300,
      "end": 899796,
      "timestamp": "14:57"
    },
    {
      "speaker": "Senna",
      "text": "ビザがみんないますねビザですね他に候補はどこ。",
      "start": 899796,
      "end": 905841,
      "timestamp": "14:59"
    },
    {
      "speaker": "Ayaka",
      "text": "があったんですかオーストラリアとかイギリスも考えたんですけど当時コロナで私が来たの2021年の夏なんですけど考え始めたのが2020年で、コロナまっただなかで、じゃあそのコロナ禍の中で渡航できるのどこってなったら、カナダが一番最初に国境が。",
      "start": 905841,
      "end": 928502,
      "timestamp": "15:05"
    },
    {
      "speaker": "Senna",
      "text": "開いたんですね。",
      "start": 928502,
      "end": 930063,
      "timestamp": "15:28"
    },
    {
      "speaker": "Ayaka",
      "text": "だから早いほうがいいやと思って、一個個も早く会社を辞めよう。",
      "start": 930063,
      "end": 933405,
      "timestamp": "15:30"
    },
    {
      "speaker": "Senna",
      "text": "と思ってたので。営業やだみたいなところも。",
      "start": 933405,
      "end": 936766,
      "timestamp": "15:33"
    },
    {
      "speaker": "Ryo",
      "text": "ありつつですか、じゃあ。",
      "start": 936766,
      "end": 938137,
      "timestamp": "15:36"
    },
    {
      "speaker": "Ayaka",
      "text": "そうですね。",
      "start": 938137,
      "end": 939238,
      "timestamp": "15:38"
    },
    {
      "speaker": "Senna",
      "text": "なるほど。までもねカナダが本当に国境一番最初に開けたっていうのは本当その通りであのわりかし早かったよねカナダはなんかその辺復活するのランちゃんでもあれですか?じゃあオーストラリアの方がもしも先に国境ちょっと開けてたらオーストラリアに行ってた可能性も全然あるみたいな感じですか?",
      "start": 939238,
      "end": 956601,
      "timestamp": "15:39"
    },
    {
      "speaker": "Ryo",
      "text": "あると思いますね。",
      "start": 956611,
      "end": 958942,
      "timestamp": "15:56"
    },
    {
      "speaker": "Senna",
      "text": "大丈夫でした?カナダみたいな寒いところで、みたいなね。オーストラリア行きたい人って、聞こうかって言うじゃないですか。",
      "start": 958942,
      "end": 964123,
      "timestamp": "15:58"
    },
    {
      "speaker": "Ayaka",
      "text": "全然聞こうとか考えてなかったです。あ、本当に?むしろカナダも来たことないのに、なんか、まあ行けるでしょとか思って。",
      "start": 964123,
      "end": 971866,
      "timestamp": "16:04"
    },
    {
      "speaker": "Senna",
      "text": "なるほど。",
      "start": 971866,
      "end": 972756,
      "timestamp": "16:11"
    },
    {
      "speaker": "Ayaka",
      "text": "実際来てから、下見してから考える人とか多いじゃないですか。全然そんなこともせず、その時は無鉄砲だったので、まだ、なんだろう、若かったからなのか。",
      "start": 972756,
      "end": 984299,
      "timestamp": "16:12"
    },
    {
      "speaker": "Senna",
      "text": "いや、でもね、あれですよ。樋口あのフロック使ってくる人たちだいたい500人くらい今いますけどあのトガシさんなんかもまさにど真ん中ですがあなたも1回もこっち来なかったっしょ?",
      "start": 984299,
      "end": 995946,
      "timestamp": "16:24"
    },
    {
      "speaker": "Ryo",
      "text": "深井1回も来てないし僕は何なら別に調べてもないです樋口調べ。",
      "start": 995946,
      "end": 999980,
      "timestamp": "16:35"
    },
    {
      "speaker": "Senna",
      "text": "てもないこの人なんて俺。",
      "start": 999980,
      "end": 1001741,
      "timestamp": "16:39"
    },
    {
      "speaker": "Ayaka",
      "text": "らがいいの深井近いか。",
      "start": 1001741,
      "end": 1002983,
      "timestamp": "16:41"
    },
    {
      "speaker": "Senna",
      "text": "も樋口でもねそういう人ばっかりっちゃばっかりですけどねやっぱりあの下見くる人が客人に1人くらいいるかな2人くらいいるかなみたいなのがうちの場合多い。",
      "start": 1002983,
      "end": 1013651,
      "timestamp": "16:42"
    },
    {
      "speaker": "Ayaka",
      "text": "ですけどね下見するにはちょっと高すぎますよね高い。",
      "start": 1013651,
      "end": 1016833,
      "timestamp": "16:53"
    },
    {
      "speaker": "Senna",
      "text": "んですよねそう往復に30万かけてくるかみたいなねところもあるのでそういうことですねじゃあカナダとオーストラリアいろいろ迷って国境先に開けたというところからカナダが選択肢に先に入ってきたってことです。",
      "start": 1016833,
      "end": 1030000,
      "timestamp": "16:56"
    },
    {
      "speaker": "Ryo",
      "text": "ねちなみにカナダってやっぱりIT業界としては強いとかあるじゃないですか本当はそういうことは考えずに本当にもうビザというか、国境が開いた順だけだったんですか?",
      "start": 1030000,
      "end": 1044021,
      "timestamp": "17:10"
    },
    {
      "speaker": "Ayaka",
      "text": "それは情報として、やっぱりアメリカ西海岸にテク企業って集まってるので、就職先の幅は広いかなと思ってたのはありますね。",
      "start": 1044021,
      "end": 1056013,
      "timestamp": "17:24"
    },
    {
      "speaker": "Senna",
      "text": "それはやっぱり思いますよねアメリカ近いしっていうところと会社いっぱいありそうだしみたいなオーストリアやっぱ迷われる方ってうちにもやっぱり多いですけどやっぱりそこがキーになりますもんねあのなんとなく知ってるテック企業があのカナダの方が多そうみたいなそこでも情報としてやっぱり知り渡ってたってことです。",
      "start": 1056023,
      "end": 1073440,
      "timestamp": "17:36"
    },
    {
      "speaker": "Ryo",
      "text": "ねそしたらあの全然僕と一緒じゃなかったです僕はなんかそんなことも考え。",
      "start": 1073440,
      "end": 1079084,
      "timestamp": "17:53"
    },
    {
      "speaker": "Senna",
      "text": "ていない本当に本当に何も迷ってる覚えないんだけどね本当に僕は。",
      "start": 1079084,
      "end": 1086531,
      "timestamp": "17:59"
    },
    {
      "speaker": "Ryo",
      "text": "エンジニア海外就職でそのフロックが出てきたんで対応してるかもよくわかんないけどとりあえず連絡したらカナダって言われてバンクーバーって言われてあーなんか決まっちゃった。",
      "start": 1086531,
      "end": 1097734,
      "timestamp": "18:06"
    },
    {
      "speaker": "Senna",
      "text": "みたいな良かったのかなこんな人でっていう忙しかった。",
      "start": 1097734,
      "end": 1102076,
      "timestamp": "18:17"
    },
    {
      "speaker": "Ryo",
      "text": "んですよね多分その時仕事がでなんかまあいいやみたいななんかそんな長くいるつもりもなかったからまあ別にワンチャン1年だったら何でもいいでしょみたいな感じで僕はそんなちゃんと考えて頭いい感じできてないんで申し訳ないです一緒に。",
      "start": 1102076,
      "end": 1117820,
      "timestamp": "18:22"
    },
    {
      "speaker": "Senna",
      "text": "いやいやいやもうだから何度もこのポッドキャスト言うとこやけどあなたはそういう長期的なプランはもう皆無かもしれないけど短期的なプランはもう綿密に組む必要があるそういう性格ということ。",
      "start": 1117820,
      "end": 1127842,
      "timestamp": "18:37"
    },
    {
      "speaker": "Ryo",
      "text": "ですねちなみに英語はさっきの話だと大学の時から海外には興味あったけど留学をするってことは選ばなかったと思うんですけど英語はなんかどのくらいから勉強し始めたというかどのぐらい英語に対してなんか準備してから来。",
      "start": 1127842,
      "end": 1144513,
      "timestamp": "18:47"
    },
    {
      "speaker": "Ayaka",
      "text": "たんですか特別こうカナダに来るからしっかり勉強したっていうよりかはあの結構ずっと英語はあの好きな教科だったので高校の時に一番好きな教科だったので大学に入ってからもいつか使うだろうなと思ってあんまりこう距離を置かずにいたんですねなんか英語であのヨガを見るとか音楽聞くとかポッドキャスト聞くとかあの喋る機会こそそんなになかったんですけどずっと触れてはいてなので特別に何かカナダに来る時に対策したっていうことはなかったですねで来てからあとは大学の時に結構英語を使う機会がボランティアに行ったりとかあとはヨーロッパ一周をオーストラリアの人としたりとかあったのでずっと何かしらちょくちょく英語を使う機会はありました働いてからも留学生とか帰国資料の人が多かったりしたので周りになんかそういう英語を使おうぜみたいなイベントとか集まりとかもちょこちょこあったんでまあで。",
      "start": 1144513,
      "end": 1231028,
      "timestamp": "19:04"
    },
    {
      "speaker": "Senna",
      "text": "もそういうのってね自分から作ろうと思わないと周り勝手には作られないですからねちなみに何ヨーロッパ一周?",
      "start": 1231028,
      "end": 1238062,
      "timestamp": "20:31"
    },
    {
      "speaker": "Ayaka",
      "text": "ヨーロッパ一周を一ヶ月で大学生の最後にしたんですね。それがバスツアーだったので、日本人一人だけで、周りは基本的にオーストラリアとかニュージーランドの人が多かったかな。",
      "start": 1238072,
      "end": 1250915,
      "timestamp": "20:38"
    },
    {
      "speaker": "Senna",
      "text": "すごいアクティブですね。素晴らしい。",
      "start": 1250915,
      "end": 1254826,
      "timestamp": "20:50"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみにボランティアっていうのはどういうボランティアだったんですか?",
      "start": 1254826,
      "end": 1257347,
      "timestamp": "20:54"
    },
    {
      "speaker": "Ayaka",
      "text": "ボランティアはニュージーランドに行って、チャイルドケアのボランティアを一ヶ月したことだって。それも留学したかったけど、そんなに長く行けないから、何か代わりにできることないかなっていうので行ったっていうのがありますね。",
      "start": 1257347,
      "end": 1273878,
      "timestamp": "20:57"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあ、もともとすごいちゃんと興味があって、自分からそういう状況を作りに行ったみたいな感じなんですね。",
      "start": 1273878,
      "end": 1283446,
      "timestamp": "21:13"
    },
    {
      "speaker": "Ayaka",
      "text": "そうですね。いつかは海外に行きたいと思ってたので、準備というか、あんまり距離を置かずに行こうっていうのはありますね。",
      "start": 1283446,
      "end": 1291203,
      "timestamp": "21:23"
    },
    {
      "speaker": "Senna",
      "text": "ちなみにさっきからお伺いしてるやっぱり触手の選択でちらほら興味があるなっていう部分が例えばカナダでねA受験取ったりとか長期滞在するって言ったら今だともうテック科多分保育科だと思うんですよ有名なところでそれで言うとねそのチャイルドケアは例えばボランティアでされていたとか今回例えばITっていう分野をちょっとチョイスしたっていう部分も例えばその長期で海外に行けそうなっていう職種をずっと探されてたイメージですか?",
      "start": 1291203,
      "end": 1317725,
      "timestamp": "21:31"
    },
    {
      "speaker": "Ayaka",
      "text": "そうですね、日本で就職活動してた時の大きな基準も将来的には海外で仕事できるような職種、業種にしたくて物流も結構海外勤務とかあったりするのでそういう基準で選んだ会社ではあるん。",
      "start": 1317735,
      "end": 1340428,
      "timestamp": "21:57"
    },
    {
      "speaker": "Senna",
      "text": "ですけどなるほどねだからこのポッドキャストねそうよあなた、あなたは違うかもしれないけどね何を考えてなさ。",
      "start": 1340428,
      "end": 1348710,
      "timestamp": "22:20"
    },
    {
      "speaker": "Ayaka",
      "text": "そうに見えるかもしれない。",
      "start": 1348710,
      "end": 1349833,
      "timestamp": "22:28"
    },
    {
      "speaker": "Senna",
      "text": "けどそんなことはないと思うけどだからこのポッドキャスト聞いてる方々もやっぱり海外で今後っていうふうに考えられること多いと思うけどこのポッドキャストはITがもちろん多いかもしれないけど意外とやっぱり保育だったりさっき言ったチャイルドケアだったりあと本当物流系もそうだしあとどこだろうな金融もそうかこの辺はやっぱり移民とか永住権取るっていう人たちだと結構王道になってくると思うのでちょっと覚えておくといいかもしれないし綾香さんみたいにそういう調べ方をするのはすごく素晴らしいこと。",
      "start": 1349833,
      "end": 1379622,
      "timestamp": "22:29"
    },
    {
      "speaker": "Ryo",
      "text": "だなとそれで言うとでも大学4年生の時にはもうなんだろうそういうことを考えてこれからどういうことをしたいかとかどういうところで働きたいかみたいなのを考えてちゃんと準備してで就職につなげてそこからまた自分の力で学校に行ってってできてきちゃうわけですよね高校生の頃とか大学生の頃の自分がいたら教えてあげたいですよそういうのです。",
      "start": 1379622,
      "end": 1399686,
      "timestamp": "22:59"
    },
    {
      "speaker": "Senna",
      "text": "よってでもそういうのってさ教えられたとしても多分興味とやっぱりなんか思考が向かないとうんそうだねって感じじゃなくない?そうなんですよね。",
      "start": 1399686,
      "end": 1411619,
      "timestamp": "23:19"
    },
    {
      "speaker": "Ayaka",
      "text": "タイミングもありますしね。決断できるタイミングと。",
      "start": 1411619,
      "end": 1417112,
      "timestamp": "23:31"
    },
    {
      "speaker": "Senna",
      "text": "その情報だから、大学生の時の戸橋龍一に対して伝えたところで、たぶん、へーって言ってそうな気もするんではないけど。",
      "start": 1417112,
      "end": 1423445,
      "timestamp": "23:37"
    },
    {
      "speaker": "Ryo",
      "text": "確かに。",
      "start": 1423445,
      "end": 1424545,
      "timestamp": "23:43"
    },
    {
      "speaker": "Senna",
      "text": "ということで、素晴らしいデモ。本当に素晴らしいなってCICCCちなみに選んだのもじゃあコープっていう部分があるからって。",
      "start": 1424545,
      "end": 1433314,
      "timestamp": "23:44"
    },
    {
      "speaker": "Ayaka",
      "text": "いうことですかね一番安かっ。",
      "start": 1433314,
      "end": 1435134,
      "timestamp": "23:53"
    },
    {
      "speaker": "Senna",
      "text": "たんで分かりやすいところありがとう。",
      "start": 1435134,
      "end": 1437655,
      "timestamp": "23:55"
    },
    {
      "speaker": "Ayaka",
      "text": "ございます私それこそ特に調べもせずに学校は決めたんでレコードクオリティが低いことだけは知ってました。",
      "start": 1437655,
      "end": 1446298,
      "timestamp": "23:57"
    },
    {
      "speaker": "Senna",
      "text": "良かった良かった一番お金。",
      "start": 1446298,
      "end": 1447938,
      "timestamp": "24:06"
    },
    {
      "speaker": "Ayaka",
      "text": "をかけないで良くてディスカウントとかもあったんで。",
      "start": 1447938,
      "end": 1450679,
      "timestamp": "24:07"
    },
    {
      "speaker": "Senna",
      "text": "その時ちょっと安くなるなるほどじゃあやっぱり値段とコープとっていう分が割かしちょうどいいバランスだったってことですねそう。",
      "start": 1450679,
      "end": 1460688,
      "timestamp": "24:10"
    },
    {
      "speaker": "Ryo",
      "text": "ですねそれこそAyakaんは全くその会社では一応要件定義みたいなところには関わったと思うんですけど技術力とかプログラミングっていうところにおいては全くゼロからこっち来てるわけじゃないですかカナダに来る前に何か準備みたいなのはしたんですかそれとももうコーナーストーンに入ってから。",
      "start": 1460688,
      "end": 1483052,
      "timestamp": "24:20"
    },
    {
      "speaker": "Ayaka",
      "text": "って感じですかいや本当にしとけばよかった話なんですけど3ヶ月ぐらい会社辞めてから時間あったのに遊びほうけて何もせずにCICCに入ってから準備コースみたいなのが1ヶ月あったんですけどその時に初めてHTMLとCSから勉強し始めましたいやーおかしいって。",
      "start": 1483052,
      "end": 1504597,
      "timestamp": "24:43"
    },
    {
      "speaker": "Senna",
      "text": "言ってみんな思ってると思うんですよ多分ぶっちゃけワークデーって本当にクッシュのいい会社にCICCの初心者コースに通っているような方が1年で入れるわけがないって多分思ってる人が多くてどういう勉強の仕方し。",
      "start": 1504597,
      "end": 1521749,
      "timestamp": "25:04"
    },
    {
      "speaker": "Ayaka",
      "text": "たのかなっていう勉強は他の人と同じことしかしてないと思いますしそれよりも足りてないところはいっぱいあったと思いますそんなに色々やってた。",
      "start": 1521749,
      "end": 1537788,
      "timestamp": "25:21"
    },
    {
      "speaker": "Senna",
      "text": "わけではないですけどこの話はたぶんポッドキャスト聞いてる方々が鵜呑みにするとCICC行ったら1年間でワークデーに行けるだけのクオリティーが見つくんだってなるんです。",
      "start": 1537788,
      "end": 1547952,
      "timestamp": "25:37"
    },
    {
      "speaker": "Ryo",
      "text": "けどそんなことはない。",
      "start": 1547952,
      "end": 1549572,
      "timestamp": "25:47"
    },
    {
      "speaker": "Senna",
      "text": "ビザを。",
      "start": 1551616,
      "end": 1551976,
      "timestamp": "25:51"
    },
    {
      "speaker": "Ryo",
      "text": "くれる移民局みたいな学校な。",
      "start": 1551976,
      "end": 1553778,
      "timestamp": "25:51"
    },
    {
      "speaker": "Senna",
      "text": "んだよそんなこと言うか分かんないけどでもそれは事実ではやっぱりあってカレッジも別に大学もそうなんだけどやっぱ教えてくれる先生にそれよるところがあるからそんな運ゲーでしかなくてましてや普通の私立のカレッジでしょってなるとそんななんかクオリティをやっぱり求めていく人っていないと思っててなんかね、どうしてもおそらくこのポッドキャストを聞いている方々は秘密を紐解こうと必死やきもきやきもきする気はしますがなんか特別メンターがすごかったとか?",
      "start": 1553778,
      "end": 1587243,
      "timestamp": "25:53"
    },
    {
      "speaker": "Ayaka",
      "text": "メンターいないですねそれこそフロッグとかにフロッグとかに入ってればよかったなって今後悔してるんです。",
      "start": 1587253,
      "end": 1594515,
      "timestamp": "26:27"
    },
    {
      "speaker": "Senna",
      "text": "けど全然全然でも誰も知らなかった本当に多分ここが一番のねおそらく今日聞いてくれてる方々のクエッションでそう何なんだろうね普通に学校に通って先生がむっちゃよかったなこともない。",
      "start": 1594515,
      "end": 1611979,
      "timestamp": "26:34"
    },
    {
      "speaker": "Ayaka",
      "text": "先生はみんな他のえっとりょうさんとガルと同じ代の人が先生でした。ベイクって一緒でしたっけ?フランスはです。",
      "start": 1611979,
      "end": 1623686,
      "timestamp": "26:51"
    },
    {
      "speaker": "Ryo",
      "text": "アジアだ。",
      "start": 1623686,
      "end": 1625386,
      "timestamp": "27:03"
    },
    {
      "speaker": "Senna",
      "text": "ベイクならまだわかる。",
      "start": 1625386,
      "end": 1627357,
      "timestamp": "27:05"
    },
    {
      "speaker": "Ryo",
      "text": "でも、そもそもさっき、ちょっとなんかその学校のことをディスってしまったけど、そもそも学校っていう、なんか就職するための勉強をするかそれとも本当にナレッジとしてちゃんとCSみたいなものを身につけるかみたいなのでも選ぶしかないじゃないですかで就職みたいなのの方に学校がよるとなんだろうなんかベースの技術みたいなのはまあ多分全く身につかないまま終わっちゃうしでベースの技術みたいなのを会社多分基本的にはそっちの方をやるのかななんかブートキャンプとかだったらまた別かもしれないですけどそういうのをやると今度就職活動の準備っていうのは自分でやらないといけないと思うからもうなんか学校っていうその体質上しょうがないとは思うんですよねその人に足りなくなったり。",
      "start": 1627357,
      "end": 1677361,
      "timestamp": "27:07"
    },
    {
      "speaker": "Senna",
      "text": "するのはそうだね間違い。",
      "start": 1677361,
      "end": 1679202,
      "timestamp": "27:57"
    },
    {
      "speaker": "Ryo",
      "text": "ないなんでなんか聞きたいなと思ったのはその学校の授業以外ではなんかどんなことをやってたのかなってちょっと聞きたい。",
      "start": 1679202,
      "end": 1688747,
      "timestamp": "27:59"
    },
    {
      "speaker": "Ayaka",
      "text": "学校の授業そうですね以外でやったことの方がやっぱりあの効果はあったと思います学校のカリキュラムそんなにあの豊富じゃなかったし遅かったのです自分で先にどんどんどんどん勉強進めていくのが多分大切だったと思っていてでやっぱりあの知識がゼロの状態から始めるので半蔵形式のあのレクチャーがないと何もできないんですねだからUDEMYはたくさん。",
      "start": 1688747,
      "end": 1722545,
      "timestamp": "28:08"
    },
    {
      "speaker": "Senna",
      "text": "やりましたUDEMYの民だ。",
      "start": 1722545,
      "end": 1724745,
      "timestamp": "28:42"
    },
    {
      "speaker": "Ayaka",
      "text": "いっぱい買って安い時に買ってできるだけ早く進めていきましたねで多分半年ぐらいでそのいろんなインプットをやりきってそんなにいろんなことをやらずに本当にリアクトとちょっとデータベースとAPI書くぐらいのバックエンドぐらいのあの本当に絞って何でもかんでもやらずに絞ってでそれ一旦それができたら何かしらフルスタックのアプリって作れるじゃないですか簡単なものならそれを自分の力とあとグループ開発とかで3つぐらいかなポートフォリオに乗っけられるようなアプリを自力で作ってそうですねその時にインプットしてたものはアウトプットするのでエラーも出るしディバッギングしないといけないしっていうのでその都度勉強してっていう感じです。",
      "start": 1724745,
      "end": 1786323,
      "timestamp": "28:44"
    },
    {
      "speaker": "Ryo",
      "text": "ね今度そうするとあのそれだけのボリュームのものをあのなんていうの授業外でやると今度授業のことが結構ついていけなくなったりとかあのもしくはおろそかにはなると思うんですけどそこらへんってなんかどうしてましたおろそかになってましたそれとももう本当に時間かけまくってどっちも頑張ったみたいな感じですか授業。",
      "start": 1786323,
      "end": 1807152,
      "timestamp": "29:46"
    },
    {
      "speaker": "Ayaka",
      "text": "はそんなに頑張ってないです、正直。朝だったら、モーニングクラスだったから、もう半分寝ながら受けてましたし、課題も、課題はちゃんと出してましたよ、けど、そんなに時間のかかるものでもなかったから。もう、そうですね。",
      "start": 1807152,
      "end": 1826676,
      "timestamp": "30:07"
    },
    {
      "speaker": "Senna",
      "text": "なるほどね。",
      "start": 1826686,
      "end": 1827777,
      "timestamp": "30:26"
    },
    {
      "speaker": "Ryo",
      "text": "確かにそれで言うと、フランソワっていう先生は、それこそコーナーストーンに僕の次の台に学生として行ってたんですよね。だからもしかしたら、その人もその後の就活の大変さとかそれだけじゃ足りないみたいなのを分かってたからあんまり多く課題みたいなのを多くしなくしてくれたのはあるのかもしれないですね。",
      "start": 1827777,
      "end": 1849588,
      "timestamp": "30:27"
    },
    {
      "speaker": "Senna",
      "text": "もしかしたらかもしれないよね割と僕は逆にあのね経験でやっぱ来られてCICC行くっていう人たちもそれに多かったけどやっぱりついていけないっていう人の方が圧倒的に多かったもんなおだしょーそうなんですか三宅だから台が違うからなのか今言ったところがおだしょ。",
      "start": 1849588,
      "end": 1866564,
      "timestamp": "30:49"
    },
    {
      "speaker": "Ryo",
      "text": "ーディセンにもよりますよね。",
      "start": 1866564,
      "end": 1868485,
      "timestamp": "31:06"
    },
    {
      "speaker": "Senna",
      "text": "三宅いや素晴らしいでもちなみに今の話は例えばReactだったりとかBackend何使ったかちょっとあれですけどAPI例えば構築したりとかっていう部分の技術的な選定ってやっぱりできるだけ就職活動するときに合わせたほうがいいじゃないですか求められてる技術にその辺の技術のチョイスとか選定とかは割と先生が言ってくれたことをそのまま宇野身にみたい。",
      "start": 1868485,
      "end": 1890999,
      "timestamp": "31:08"
    },
    {
      "speaker": "Ayaka",
      "text": "な感じですかねえっと同じ台でちょっと日本で経験のあるエンジニアとして経験のある人がクラスメイトにいるのでその人たちがやってることを丸パクリしました。",
      "start": 1890999,
      "end": 1904372,
      "timestamp": "31:30"
    },
    {
      "speaker": "Senna",
      "text": "いやー大事大事でもパクれる人がいたのはでも良かったですねそれはそうですね。",
      "start": 1904372,
      "end": 1909073,
      "timestamp": "31:44"
    },
    {
      "speaker": "Ayaka",
      "text": "その意味では、その人がロードマップを紹介してくれたりとか、このエルデミー良かったよとか、毎回毎回その人が先にやって、それを後で教えてくれたんで、自分で調べて何がいいかなとかっていう時間は特になかったですね。",
      "start": 1909073,
      "end": 1925142,
      "timestamp": "31:49"
    },
    {
      "speaker": "Senna",
      "text": "いやーでもそれそれ割かしメンターに近いんじゃねってちょっと。",
      "start": 1925152,
      "end": 1928074,
      "timestamp": "32:05"
    },
    {
      "speaker": "Ayaka",
      "text": "思いましたけど確かにメンターと思ってなかっただけで。",
      "start": 1928074,
      "end": 1932358,
      "timestamp": "32:08"
    },
    {
      "speaker": "Senna",
      "text": "メンターしてくれてた感触が楽しいですよねいやいや全然全然でもそういう環境をちゃんと自分で作れるっていうのは素晴らしいことですねあとすごい。",
      "start": 1932358,
      "end": 1942167,
      "timestamp": "32:12"
    },
    {
      "speaker": "Ryo",
      "text": "なって思ったのがその学校のことをおろそかにしてもいいなって思って自分でやらないといけないことにちゃんと絞れたのはすごいですよねその技術の選定をしてそれ以外やらないってちゃんと決めてそれだけに絞ってポートフォリオを3つ作るってインプットした後にそれ作るって1年間のうちににそれ作るっていうのも3つ作るっていうだけでもすごいし日本人って結構やっぱ完璧主義で学校のこともあるから学校のこともやらないといけないみたいな結構この頃はあんまりないけど初心者で来た人が結構前いたじゃないですかその頃にアドバイスしてくださいみたいなので学校忙しすぎてそれ以外のことなんかできないですよっていうと言われてそれに学校のことはもう全部ほぼ無視しちゃって首にならないくらいでやって、あとはもう自習、学習したらいいんじゃない?みたいな言うと、いや、そんなことできないですよってみんなに言われてたんで、それがやっぱりできてちゃんと集中一つのこととか、自分のこれって決めたことに集中して、それをなんか1年間やり遂げれたっていうのがすごいですよね。",
      "start": 1942167,
      "end": 2007457,
      "timestamp": "32:22"
    },
    {
      "speaker": "Senna",
      "text": "いや、。",
      "start": 2007457,
      "end": 2007858,
      "timestamp": "33:27"
    },
    {
      "speaker": "Ryo",
      "text": "大事。",
      "start": 2007858,
      "end": 2008328,
      "timestamp": "33:27"
    },
    {
      "speaker": "Senna",
      "text": "すごい大事だと思う、。",
      "start": 2008328,
      "end": 2009169,
      "timestamp": "33:28"
    },
    {
      "speaker": "Ryo",
      "text": "それ。",
      "start": 2009169,
      "end": 2009710,
      "timestamp": "33:29"
    },
    {
      "speaker": "Senna",
      "text": "おだしょーはいそんな感じですねだからでも実際今東橋さんが言うたことはフロックも相当今悩んでるけどねやっぱり学校の課題に追われ英語の勉強に追われ結局本質的な就職をこっちへするっていうふうな目標あったはずなのにそっちに対する努力をする時間っていうのが取れてないっていう人は正直多いです。",
      "start": 2009720,
      "end": 2032184,
      "timestamp": "33:29"
    },
    {
      "speaker": "Ryo",
      "text": "からねおだしょーでもあとはこういう綾香さんみたいなケースがいてくれる。",
      "start": 2032184,
      "end": 2036525,
      "timestamp": "33:52"
    },
    {
      "speaker": "Senna",
      "text": "とは。",
      "start": 2040533,
      "end": 2040673,
      "timestamp": "34:00"
    },
    {
      "speaker": "Ryo",
      "text": "いえお前多分その人たち聞いてきた人たちはとはいえお前ちょっと経験あったからそれができたんでしょうみたいなやっぱ多分それ僕が答えたとしても思われてて多分他の人も結構みんな同じ就職できた人たちと同じこと言うんですよ学校に行ったけど全然やってないよみたいなでもなんかやっぱそれは経験者だからでしょみたいなのが多分あってまあAyakaんみたいに全くの未経験でもう本当に1ヶ月目でhtmlからやりましたみたいな人でもできるんだよっていうのはすごい何だろうお手本になるいいケース。",
      "start": 2040673,
      "end": 2072724,
      "timestamp": "34:00"
    },
    {
      "speaker": "Senna",
      "text": "ですよねいや本当そうです。",
      "start": 2072724,
      "end": 2074324,
      "timestamp": "34:32"
    },
    {
      "speaker": "Ayaka",
      "text": "よねいや学校の質にも本当によると思うんですけどちゃんと学校ランガラーとかわかんないんでそのそういうのに行った人がどう感じているのかちょっと謎ではあるんですけど学校でしっかり学べる自分が欲しい情報が得られるって思ったらそこにフォーカスした方がいいのかもしれないですけど私はやっぱりなんか分からなかったら巻き戻して聞きたいし分からないところをもう1回見たいしっていうのがあったので授業はこう流れていっちゃうじゃないですか自分が何が聞きたいのかっていうのをちゃんと用意しないままに聞くのでなんかこう受動的になっちゃうけど自分で学習する分には欲しい情報を探してお金出して買って聞いてってやるので身が入りやすかったっていうのがあり。",
      "start": 2074324,
      "end": 2122804,
      "timestamp": "34:34"
    },
    {
      "speaker": "Ryo",
      "text": "ますなるほどねそしたら就職活動にちょっと話を移していきたいんですけどポートフォリオは3つ作られたっていうことだったんですけどなんかレジュメ書くのも結構その一苦労じゃないですかなんかそこらへんってなんか就職活動っていうとどのぐらいから始めました?",
      "start": 2122804,
      "end": 2145995,
      "timestamp": "35:22"
    },
    {
      "speaker": "Ayaka",
      "text": "就職活動学校が終わる学校のその勉強のアカデミックタームが終わる3ヶ月前ぐらいから始めて3ヶ月じゃないな2ヶ月ぐらいですね前から始めてでそうですねまずレジュメがそもそも未経験なのであのエクスペリエンスの部分書けないじゃないですかまずいと思ってその時あのボランティアをやってたのでボランティアの経験はかけたんですけどそれも大したあの威力なさそうだなと思ったので学校が終わった瞬間アカデミックタームが終わった瞬間から日本の業務委託の案件をやり始めましたでそれ就活は全部で6何ヶ月やったんだろう私どっかにメモった…3ヶ月か、3ヶ月やってたんですけど、就活を全部で。その期間、フリーランスで働きながら、経験も積みつつ就活しつつっていうのは、それはどっちもやってました。",
      "start": 2145995,
      "end": 2217458,
      "timestamp": "35:45"
    },
    {
      "speaker": "Senna",
      "text": "おだしょー理想の一つですね実際フロックも実際ねフロックも仮にだけど今日本から完全に未経験で来るんだったらやっぱり日本の自宅でも本当に正直何でもいいから未経験のレッテルをできれば就活の半年前に外しといてっていう風なのをお願いしてやっぱり進めてはいるんですよこれなんかあるよねそれなんかね嫌がるというかいやカナダに来たんだから海外の案件でやっぱりできれば就職をしておきたいとかそっちにちょっとフォーカスを置いている方多いなと思うんですけどとにかくねレジュメ上から未経験の一言を外さなくちゃいけないので。",
      "start": 2217468,
      "end": 2257093,
      "timestamp": "36:57"
    },
    {
      "speaker": "Ayaka",
      "text": "本当にそうだと思います本当に未経験だと一行あっても全然レジュメ通ら。",
      "start": 2257093,
      "end": 2264029,
      "timestamp": "37:37"
    },
    {
      "speaker": "Senna",
      "text": "ないので絶対無理でしょっていうこの間ねなんかスポットキャスト出てくれたね大学生とかの方やったら時間もあるビザもあるっていうところでプロジェクトとか研究とかっていうので行けるかもしれない行ける人もいるかもしれないけどよくわかんない彼氏出た人でっていう前提になってくるとね期間もそんなにやっぱり長いわけではないし働ける?未経験はとにかくないっていうのを前提にしなくちゃいけないのでこれは聞いている方にもぜひ覚えておいて欲しいところですね。",
      "start": 2264029,
      "end": 2293782,
      "timestamp": "37:44"
    },
    {
      "speaker": "Ryo",
      "text": "僕たちの母校がよくわかんないって言われちゃったけど確かにそうですねなんか多分ちょっと気になるのは気になるというか聞いてる人が気になるなって思うのは僕たちの学校僕どっちも同じ学校に行ってたんですけど1年勉強の時間があって1年就職のワーキングビザっていうのをもらえる学校ってことですよねでそれ以外の学校だと大学とか出ればね3年もらえるしカナダのバンクーバーで言うとランガラとか行くと2年勉強して3年とかだから確かにその2年のうちその3年の中で、就職できるビザがある3年の中でレジュメ書いたりだとか、準備みたいなのをしてもまだまだ間に合うみたいなところがある中で、僕たちが行った学校は1年1年で本当その働けるタームが始まってから準備したら始まってから準備したのでは遅いみたいなのがあるから確かにその2、3ヶ月前には始めてでできるならまあそのぐらいとかその前ぐらいからちょっと日本での経験もつけつつちょっとプロジェクトにもかけるプロジェクトのエクスペリエンスの欄をかけるようになりつつみたいなのが結構大切になってきますよねそう。",
      "start": 2293782,
      "end": 2370983,
      "timestamp": "38:13"
    },
    {
      "speaker": "Senna",
      "text": "ですねそれをしないとむしろ未経験はちょっと厳しいんじゃないかなというのがありますね正直他に。",
      "start": 2370983,
      "end": 2378167,
      "timestamp": "39:30"
    },
    {
      "speaker": "Ryo",
      "text": "はどんなことをやられましたかなんかよくあるのだったらlinkedだったりとかgithubになんか草林だったりとかプロファイルのところ書くだとかあると思うんです。",
      "start": 2378167,
      "end": 2387538,
      "timestamp": "39:38"
    },
    {
      "speaker": "Ayaka",
      "text": "けどそうですね私linkedには誰もがやると思うんですけどレジュメと自分のポートフォリオサイトのリンクとあとはそれだけかGitHubのリンクも貼ってGitHubは自然と芝が生えるじゃないですか毎日プロジェクトしてただからそこはアピールになったのか分からないんですけどそうですねアピールできるところは書いてあと何気に大事なのLinkedIのちゃんと写真を自分の顔でいい感じの人だって分かる写真にするのは大事だと思います私、inkedILで就職できたり、LinkedIのおかげで就職できたようなもんなので。っていうと?今のチームのマネージャーが、LinkedIで直接メッセージをくれて、私にこれ受けてみませんか?ワークデーのこういうポジションを受けてみませんか?っていうのをダイレクトメッセージくれたので、受けて通ったので、見てくれている人は見てくれているしリクルーターとつながるのも一番手取り早いと思うしいい人、楽しそうな人、一緒に働いてみたいなっていう印象を与えられるページにするっていうのは自分のブランディングの上で大事だ。",
      "start": 2387538,
      "end": 2476842,
      "timestamp": "39:47"
    },
    {
      "speaker": "Senna",
      "text": "と思いますいやむちゃくちゃ大事だと思うんですけど、これね誰にどう伝えたらいいんでしょうねフロックですらと言ったらいいかもしれないけど、全然うちに相談してくれる人ですらリンクドインのね写真はなんか変なよくわかんないアニメのアイコンやったりとかダメです言うたってみんなにもうほっぺってもねそんなん。",
      "start": 2476842,
      "end": 2495369,
      "timestamp": "41:16"
    },
    {
      "speaker": "Ayaka",
      "text": "すら連絡来ません来ませ。",
      "start": 2495369,
      "end": 2497290,
      "timestamp": "41:35"
    },
    {
      "speaker": "Senna",
      "text": "んよなんでみんなせえへんのかなと思っているとまあやっぱりねなんか嫌だっていう人多いんですよ。",
      "start": 2497290,
      "end": 2506715,
      "timestamp": "41:37"
    },
    {
      "speaker": "Ryo",
      "text": "どうしたらいいなんか一応北米のIT業界だとレジュメに顔を載せないのがまああのそうですね数例というか決まりじゃないですかまあそれってなんかあの人種差別とかがないようにそういう見た目では判断しないようにしようみたいな多分心も行かしたなかななんだけど多分人によって多分違うと思うけど僕もあやかさんと同じ方であのやっぱり楽しいとか働く行く時にこの人と働いたら気持ちよさそうだなみたいな思わせるのってやっぱ大切だから僕はいろんなところに乗せられるところには顔乗せたらいいと思う派なんですけどそういうのではジャッジしないからいいだろうっていう人たちもいますよね乗せない人たちはそういう側なのか。",
      "start": 2506715,
      "end": 2553432,
      "timestamp": "41:46"
    },
    {
      "speaker": "Senna",
      "text": "なそうだねそんなところで判断してほしくないって思っ。",
      "start": 2553432,
      "end": 2557295,
      "timestamp": "42:33"
    },
    {
      "speaker": "Ayaka",
      "text": "てるんだろうな多分でも全然自分のなんですかモデルさんである必要はないじゃないですかただ笑ってこういいなんだろう楽しそうだなこの人コーディングしてる写真とか乗っけて楽しそうに仕事してるなとかでいいと思うそうなん。",
      "start": 2557295,
      "end": 2576391,
      "timestamp": "42:37"
    },
    {
      "speaker": "Senna",
      "text": "すよねなんかねなんかすごいイッチョーラとか黄色とか言ってるわけじゃなくてみたいなでもやっぱり乗せたくない人は多いからね特に日本の場合はっていう。",
      "start": 2576391,
      "end": 2586500,
      "timestamp": "42:56"
    },
    {
      "speaker": "Ayaka",
      "text": "のが。",
      "start": 2586500,
      "end": 2586620,
      "timestamp": "43:06"
    },
    {
      "speaker": "Ryo",
      "text": "なんか自分の今見てみたんだけど僕は割と後ろ姿だった横の顔ちょっと見せてるぐらいだった全然気にしたこと。",
      "start": 2589476,
      "end": 2598979,
      "timestamp": "43:09"
    },
    {
      "speaker": "Senna",
      "text": "ないんだけどそうだよニッコーかなんかがちょっと眩しいなくらいのやつだろお前の。",
      "start": 2598979,
      "end": 2602000,
      "timestamp": "43:18"
    },
    {
      "speaker": "Ayaka",
      "text": "やつ覚えてるよちょっと爽やかな私覚えてますけど爽やかな。",
      "start": 2602000,
      "end": 2605821,
      "timestamp": "43:22"
    },
    {
      "speaker": "Ryo",
      "text": "感じはしましたよ俺。",
      "start": 2605821,
      "end": 2608702,
      "timestamp": "43:25"
    },
    {
      "speaker": "Senna",
      "text": "の写真見習い俺の写真は割と結構ど真ん中やと思うよTwiterとかもそうやけど超爽やか高青年を気取っ。",
      "start": 2608702,
      "end": 2617024,
      "timestamp": "43:28"
    },
    {
      "speaker": "Ryo",
      "text": "てるからいやでもちゃんとなんかやってなかった僕が言うのもあれだけどやっぱ顔見せてこんな人だよっていうのはどんどん見せていったほうがいいですよねお。",
      "start": 2617024,
      "end": 2625663,
      "timestamp": "43:37"
    },
    {
      "speaker": "Senna",
      "text": "だしょーはいまあそんな感じかまあちなみにねそのリンクドインの部分にも多分関係するのかなというふうに思うんですけど逆にレジュメとかそのポートフォリオとかの見せ方とかなんか伝えられる部分とかありますコツみたいな。",
      "start": 2625663,
      "end": 2639776,
      "timestamp": "43:45"
    },
    {
      "speaker": "Ayaka",
      "text": "私の場合、昨日したかどうかわからないんですけど、レジュメとカバーレターは毎回会社ごとに変えてました。例えば、私はフロントエンドでしか勉強をちゃんとしてなかったので、フロントエンド中心に応募してたんですけどフロントエンドっていうポジションに対してはフロントエンドデベロッパーですって書いたレジュメにしてソフトウェアエンジニアでポストが載ってる場合はソフトウェアエンジニアって書いてっていう細かい違いですけどあとはフロントエンドのカバーレターにはそういう自分の強みはフロントエンドちゃんとMockを再現できますよとかフロントエンドにしか刺さらないことソフトウェアエンジニアだともうちょっと包括的にAPIインテグレーションできますよとかそういう文庫を変えたりしてたと思い。",
      "start": 2642913,
      "end": 2709193,
      "timestamp": "44:02"
    },
    {
      "speaker": "Senna",
      "text": "ますなるほどね最近だと本当にマスアプライする人だいぶ減りましたねそうするともうとりあえず100通200通よくわからないとこにボンボンボン送るみたいなことはしなかったです。",
      "start": 2709193,
      "end": 2718958,
      "timestamp": "45:09"
    },
    {
      "speaker": "Ayaka",
      "text": "もんねしなかった全部で68社しか応募しなかった。",
      "start": 2718958,
      "end": 2723720,
      "timestamp": "45:18"
    },
    {
      "speaker": "Senna",
      "text": "ですでも業界未経験の人としてって考えたらアレやかもしれないけど相当ねフログの中でも少ない方かなと思うの。",
      "start": 2723720,
      "end": 2731446,
      "timestamp": "45:23"
    },
    {
      "speaker": "Ryo",
      "text": "でめちゃくちゃ少ないと思いますこれ。",
      "start": 2731446,
      "end": 2734007,
      "timestamp": "45:31"
    },
    {
      "speaker": "Senna",
      "text": "ででも実際まあそれでちなみになんですけど何社くらい通ったとかもしくは連絡来たとかあります?",
      "start": 2734007,
      "end": 2738831,
      "timestamp": "45:34"
    },
    {
      "speaker": "Ayaka",
      "text": "最初本当に少ないですよ未経験なので5社しか通らなかったんですねレジュメ。",
      "start": 2738831,
      "end": 2745436,
      "timestamp": "45:38"
    },
    {
      "speaker": "Ryo",
      "text": "いや十分十分びっくりするわ1割ぐらいは帰ってきてるから未経験で5社って。",
      "start": 2745436,
      "end": 2751861,
      "timestamp": "45:45"
    },
    {
      "speaker": "Ayaka",
      "text": "っていうじゃあやっぱりカバーレターとレジュメをちょっと変えたのはこうそうしたかもしれ。",
      "start": 2751861,
      "end": 2757290,
      "timestamp": "45:51"
    },
    {
      "speaker": "Ryo",
      "text": "ないですねあとそれはなんかその変えた方がいいっていうのはどこで知っ。",
      "start": 2757290,
      "end": 2762653,
      "timestamp": "45:57"
    },
    {
      "speaker": "Ayaka",
      "text": "たんですかそれも個人的にあの日本で就活してた時もやっぱり見てる人はちゃんと読むじゃないですかカバーレターとかレジュメとかハイアリングマネージャー目線になった時に私日本でハイアリングもちょっとしてたことがあるんですけどちゃんと書いてる人この会社の特徴を理解して強みとか書いてくれてる人の方がやっぱり刺さるだろうなっていう向こう目線に立って考えたらこうかなっていうのを自分で試してみたっていう感じです。",
      "start": 2762653,
      "end": 2797435,
      "timestamp": "46:02"
    },
    {
      "speaker": "Senna",
      "text": "いやもうたっか聞いてて頭がいいんだなって。",
      "start": 2797435,
      "end": 2800215,
      "timestamp": "46:37"
    },
    {
      "speaker": "Ryo",
      "text": "正直思うとこあるわなんか僕お願いしたときに私もう本当運でしか入ってないんで喋ることないですって言ってたんだけどめちゃくちゃちゃんとしてたその名前を変えたりするのって多分ATS対策ってATSアプリケーショントラッキングシステムATS対策って言うんですけどそれをって言う言葉は多分それを考えずにちゃんとアイテム店に立つことでそれがきっとできてたってことですね。",
      "start": 2800215,
      "end": 2828753,
      "timestamp": "46:40"
    },
    {
      "speaker": "Senna",
      "text": "いやすごいよねそのままで。",
      "start": 2828753,
      "end": 2830474,
      "timestamp": "47:08"
    },
    {
      "speaker": "Ayaka",
      "text": "は知らなかったですけど確か。",
      "start": 2830474,
      "end": 2832336,
      "timestamp": "47:10"
    },
    {
      "speaker": "Senna",
      "text": "に。",
      "start": 2832336,
      "end": 2832356,
      "timestamp": "47:12"
    },
    {
      "speaker": "Ayaka",
      "text": "何が起きてるか分かんないですけど確かに放送し。",
      "start": 2834717,
      "end": 2837538,
      "timestamp": "47:14"
    },
    {
      "speaker": "Ryo",
      "text": "たのかもしれないちょっと補足するとATS対策っていうのは特に日本でもあんのか分からないですけどこっちってやっぱり1件のポストに対して200件とか300件とかのアプリケーションが来るんで人間が全部見てなくてそれがシステムでこの人たちがマッチしてるよみたいなのをポってハイアリングする側のハイアリングマネジャーとかに行くんですねそれにその200人とか300人の中でその10人とか選ばれると思うんですけどその選ばれるためのなんか対策みたいなのがあってそれがさっき言ってくれた名前を同じにしてるだとかジョブディスクリプションに書いてあるリアクトって書いてあったら自分もリアクトって書いてあるとかそのマッチング度合いみたいなのを多分パーセンテージみたいなので出してそのマッチング。",
      "start": 2837538,
      "end": 2885651,
      "timestamp": "47:17"
    },
    {
      "speaker": "Senna",
      "text": "の。",
      "start": 2885651,
      "end": 2885671,
      "timestamp": "48:05"
    },
    {
      "speaker": "Ryo",
      "text": "さっくり言うとそんな感じなんですけどそういうのをほとんどの会社が使ってるの。",
      "start": 2891287,
      "end": 2895270,
      "timestamp": "48:11"
    },
    {
      "speaker": "Senna",
      "text": "かなこっちで終わりじゃない。",
      "start": 2895270,
      "end": 2898252,
      "timestamp": "48:15"
    },
    {
      "speaker": "Ayaka",
      "text": "とさばけないからねじゃあちゃんと意味かなってますね意味かなってるってことは皆さんやったほうがいいってことです。",
      "start": 2898252,
      "end": 2903316,
      "timestamp": "48:18"
    },
    {
      "speaker": "Senna",
      "text": "ねやったほうがいいということも素晴らしいちなみにどうしてもちょっと気になる部分がもう一つ就職活動してた時期って何月から何月くらい何年の何月から何月くらい2022。",
      "start": 2903316,
      "end": 2913744,
      "timestamp": "48:23"
    },
    {
      "speaker": "Ayaka",
      "text": "年の6月7月から。",
      "start": 2913744,
      "end": 2919455,
      "timestamp": "48:33"
    },
    {
      "speaker": "Ryo",
      "text": "10月ですね4月から。",
      "start": 2919455,
      "end": 2920915,
      "timestamp": "48:39"
    },
    {
      "speaker": "Senna",
      "text": "10月かてすると割りかし景気も確かにいい。",
      "start": 2920915,
      "end": 2923456,
      "timestamp": "48:40"
    },
    {
      "speaker": "Ayaka",
      "text": "時期ですねあ、そうですねその時ちょっとその後からすごい悪くなったんですけどそう、。",
      "start": 2923456,
      "end": 2930127,
      "timestamp": "48:43"
    },
    {
      "speaker": "Senna",
      "text": "その後からむちゃくちゃリセッションまだ良い良かったですねえ、来たからだからいろんなものが噛み合ったんですね動き方もそうだしこれまでの作られてきたポートフリーもそうだしで、やっぱり景気もすごいマーケットもかなり活発な時期っていうとこもあったのでで、ビザもちゃんと残っててっていうねもう理想ぶ理想みたいなところがあるのでぜひ皆さん参考にしていただき。",
      "start": 2930127,
      "end": 2951095,
      "timestamp": "48:50"
    },
    {
      "speaker": "Ayaka",
      "text": "たいなとでもその5社の中でコーディングテストとかちゃんとテックインタビューをしたのがワークデーだけで一発本番で撮ったんです。",
      "start": 2951095,
      "end": 2962801,
      "timestamp": "49:11"
    },
    {
      "speaker": "Senna",
      "text": "ねすごすぎてよくわかんないもはやあれなんだけどワークデーのコーディングテストを覚えてる範囲でいいんですけどどんな。",
      "start": 2962801,
      "end": 2971566,
      "timestamp": "49:22"
    },
    {
      "speaker": "Ryo",
      "text": "内容だったとかって2。",
      "start": 2971566,
      "end": 2973327,
      "timestamp": "49:31"
    },
    {
      "speaker": "Ayaka",
      "text": "回あって最初の1回目がフロントエンドのリアクトでペアプログラミングをするものペアプロなんだ本当にすごく簡単でしたステートの管理が。",
      "start": 2973327,
      "end": 2987200,
      "timestamp": "49:33"
    },
    {
      "speaker": "Ryo",
      "text": "ちゃんとできるかとかはいはい。",
      "start": 2987200,
      "end": 2988940,
      "timestamp": "49:47"
    },
    {
      "speaker": "Ayaka",
      "text": "はいで2つ目はオブジェクト思考設計ですねなんて言うんでしたっけあれU…なん。",
      "start": 2988940,
      "end": 3000984,
      "timestamp": "49:48"
    },
    {
      "speaker": "Ryo",
      "text": "でしたっけあれオブジェクトオリエンテッドUMD。",
      "start": 3000984,
      "end": 3006228,
      "timestamp": "50:00"
    },
    {
      "speaker": "Ayaka",
      "text": "ダイアグラムのを使ってカーシェアリングのアプリを作るならどんなオブジェクトモデルを設計しましょうかみたいなのをいろいろペラペラ喋りながら設定していってこのリレーションシップがこうなってとかっていうのをずっと喋り続けないといけない。",
      "start": 3006228,
      "end": 3028764,
      "timestamp": "50:06"
    },
    {
      "speaker": "Senna",
      "text": "なかなか大変でもその2回のコーディングインタビューで通るっていうのもすごいけれどもワークデーだけだったんですね他のちなみに4社はもう電話インタビューだけし。",
      "start": 3030877,
      "end": 3043000,
      "timestamp": "50:30"
    },
    {
      "speaker": "Ayaka",
      "text": "て終わりとかですか電話とあとファービヘビラルとあとオンラインで受けるコーディングアルゴリズムテストみたいな。",
      "start": 3043000,
      "end": 3052501,
      "timestamp": "50:43"
    },
    {
      "speaker": "Ryo",
      "text": "のがあってOAみたいなやつですねオンラインアセスメントか。",
      "start": 3052501,
      "end": 3055542,
      "timestamp": "50:52"
    },
    {
      "speaker": "Ayaka",
      "text": "なそうですそうですそれで落とされるみたいなアルゴリズムちゃんと勉強する暇がなかったの。",
      "start": 3055542,
      "end": 3061765,
      "timestamp": "50:55"
    },
    {
      "speaker": "Senna",
      "text": "でいやそりゃそうっすよね。",
      "start": 3061765,
      "end": 3064465,
      "timestamp": "51:01"
    },
    {
      "speaker": "Ayaka",
      "text": "ちょっとしかやってなかったら見事に激痛いみたいな感じでし。",
      "start": 3064465,
      "end": 3067686,
      "timestamp": "51:04"
    },
    {
      "speaker": "Senna",
      "text": "たしゃーないっすよねまあジュニアに対してアルゴリズムまあそりゃ出すかいやでも大変だったんだっていうまあリートコードかじゃあんまりしなかったんですよねそういうとこじゃないですも。",
      "start": 3067686,
      "end": 3077829,
      "timestamp": "51:07"
    },
    {
      "speaker": "Ayaka",
      "text": "んねだってやり始めていやちゃんとやらないとなぁと思ってその1ヶ月ぐらいやってたんですけどその間にワークデーの選考が進んだのでちゃんとやりきるまでに通ったっていう感じですちなみ。",
      "start": 3077829,
      "end": 3093758,
      "timestamp": "51:17"
    },
    {
      "speaker": "Ryo",
      "text": "にそのワークデーのあのコーディングインタビューはなんだろう自分まああの答え聞いてないと思うんで答えてからなんかどうだったかは相手から多分入社しても聞けないと思うんですけど自分的にはどうでしたなんかできましたそれとも全然できなかったけどコミュニケーションの仕方ができたとかなんかそんな感じ。",
      "start": 3093758,
      "end": 3115527,
      "timestamp": "51:33"
    },
    {
      "speaker": "Ayaka",
      "text": "でしたリアクトはそんなに難しくなかったのでその課題が出たのはちゃんと間違えずにできたと思いますでコミュニケーションも30分くらいの短いやつだったので45分かなでも最初の15分とかは本当に雑談感じだったんで、ジュニアに問われてるのって、私、ジュニアのポジションで撮ってもらってるんで、そこしか見られてなかったと思うんですけど、ちゃんと質問ができるのか?と言われたことを、ちゃんと理解してそれをやろうとしているか?とかの、そういう基本的なことだと思うので、それに関しては、。",
      "start": 3115527,
      "end": 3156794,
      "timestamp": "51:55"
    },
    {
      "speaker": "Ryo",
      "text": "できてたかなと思います。それが1回目ですか?そのリアクトの問題が1。",
      "start": 3156794,
      "end": 3165377,
      "timestamp": "52:36"
    },
    {
      "speaker": "Senna",
      "text": "回目だった2回目。",
      "start": 3165377,
      "end": 3171343,
      "timestamp": "52:45"
    },
    {
      "speaker": "Ayaka",
      "text": "はもうちょっと長かったですね1時間くらいのオブジェクト試行設計で私オブジェクト志向もそこまであのジャバーやってたわけじゃなかったので準備してたわけじゃなかったんで不安だったんですけどそれに関してはあまりちゃんとあのきっちりしたものができてなかったかもしれないんですけどさっきも言ったように質問をちゃんとしたのとか答えてもらったものから何か学ぼうとしているかみたいなアトチュードとか。",
      "start": 3171343,
      "end": 3201707,
      "timestamp": "52:51"
    },
    {
      "speaker": "Ryo",
      "text": "は。",
      "start": 3201707,
      "end": 3201727,
      "timestamp": "53:21"
    },
    {
      "speaker": "Ayaka",
      "text": "そうですねポジティブに見てもらえるようにしたかなっていう意識的にそこはしたかな意外と。",
      "start": 3205633,
      "end": 3212354,
      "timestamp": "53:25"
    },
    {
      "speaker": "Senna",
      "text": "そういう意味だと過去のご経験としてはその営業の例えばねあのお仕事だったりとか人とのやっぱり接し方みたいなところも結構役立ったイメージですかその面接とかでもそうです。",
      "start": 3212354,
      "end": 3222537,
      "timestamp": "53:32"
    },
    {
      "speaker": "Ayaka",
      "text": "ねなんか何を見られているのかなから考えて対策したのはもともと自分が働いてた時の経験が生きたのかなと。",
      "start": 3222537,
      "end": 3236826,
      "timestamp": "53:42"
    },
    {
      "speaker": "Senna",
      "text": "思いますね意外とジュニアから来る人は営業経験がある人っていうのでちょっとフィルター。",
      "start": 3236826,
      "end": 3243230,
      "timestamp": "53:56"
    },
    {
      "speaker": "Ryo",
      "text": "上げようかな確かにオンラインアセスメントみたいにもう問題あるからやっといてっていう会社だとそういうところ見てくれないけど実際働くってなるとできないよりできないてコミュニケーション取れない方がすごい悪いじゃないですかとかあのできるけど全然コミュニケーション取れないからなんかコミュニケーションロスから来るなんか全然違う方向進んでたとかってあるんで特にやっぱりジュニアにはそういうところそのコミュニケーションできるとかちゃんと聞いて質問してくれて理解しようとしてくれるとかわかんない時にわかんないって言ってくれるみたいなのってすごい大切なのかなって思いますよね僕も前回の会社のシステムデザインインタビューが前の会社2社目かな僕は今3社目なんですけど一番最初に言った言葉が全然わかんないだったんですよそれこそ本当にシステムデザインインタビューの勉強し始めたばっかりでURLショートなってurlを短くするシステムっていうやつだったんですけどそれを僕見たことがなくてなんか全然わかんないところが出てきちゃってうんわからないって笑いながら言ってちょっとヒントみたいな感じでところから始めてでなんか結局その人がその2社目の僕のマネージャーになったんですけどそこからでもすごいコミュニケーションわかんないって言ってるんでなんか2人で作るみたいな感じで進めてくれて結構結局そこは受かったんですけど受かってそのままその僕もすごいそのマネージャーの働き方がすごいいいなと思った面接の時の対応だったりとかがすごいいいなと思って僕もそこで働いたんですけどやっぱりなんだろうそのできるかできないかだけじゃなくてそのできなくてもいいからなんかどういうふうにコミュニケーション取るかとかあの一緒に仕事してその時に楽しいかみたいなのってやっぱりすごいあると思うんで本当にその。",
      "start": 3243230,
      "end": 3357075,
      "timestamp": "54:03"
    },
    {
      "speaker": "Ayaka",
      "text": "通りだと思いますあの日本人の傾向がわからないんですけどやっぱり言葉数が少なくて黙っちゃうと何考えているのかわからないと思われちゃうのが一番問題だと思うんですねわからなくて悩んでいるのかあのヒントが欲しいのかちょっと考える時間が欲しいのかっていうのだけを最初にちゃんと相手にわかるように伝えると向こうもあのこの人何してるんだろう今っていうのがその不安というか疑心感がなくなるからだいぶその後のコミュニケーションが取りやすくなるんじゃないかなと思いますいや間違い。",
      "start": 3357075,
      "end": 3396601,
      "timestamp": "55:57"
    },
    {
      "speaker": "Senna",
      "text": "ない自分がわからないって思われるのが嫌なんでしょうねって思うことあるよねなんか恥ずかしいとかさ恥ずかしいです。",
      "start": 3396601,
      "end": 3403145,
      "timestamp": "56:36"
    },
    {
      "speaker": "Ryo",
      "text": "けどねそうそうそういうふう。",
      "start": 3403145,
      "end": 3404346,
      "timestamp": "56:43"
    },
    {
      "speaker": "Senna",
      "text": "に思われるのが嫌だとかもちろんそれあるんだろうけどさとはいえ本質的な問題ってそこじゃないよねっていうところでねさっきからわからないところはじゃあどこがわからなくて誰に助けを求めるべきなのかとかそれも含めてやっぱりコミュニケーションな仕事やしそういうところに着目できるかどうかって今のお話聞いてると大事だなと思いました。",
      "start": 3404346,
      "end": 3425165,
      "timestamp": "56:44"
    },
    {
      "speaker": "Ryo",
      "text": "ねあとは前の会社のそのレベルに合ったそのなんだろうなこのレベルの人はこれができるべきみたいのでなんか一つそれの一つの項目でわかんないときに正しい人にあのコミュニケーション取れることみたいなのがあってなんかやっぱりどれだけ強いエンジニアでもその技術的に分かんないことももちろんあればそうじゃなくてナレッジ的に会社の中で一部のチームにしか共有されてないみたいなことがあったりするんでそういうのを自分から情報を取りにいけるみたいなのはすごいプラスですよね別に分かんないことがあんのって人間なんて当たり前なんで基本的には違います。",
      "start": 3425165,
      "end": 3466442,
      "timestamp": "57:05"
    },
    {
      "speaker": "Ayaka",
      "text": "ワークでのレベルごとのクリテリアみたいなプロモーションのクリテリーにも、もうP1はコラボレイティブ、becolaborativeっていうのが大前提としてあるので、やっぱりそういう人を探している会社だったので、そこにマッチしたのかなっていうのはあるんですけど、まあ会社によって本当に黙々とひたすら機械のように正しく解いてくれる人が欲しかったらまた別かもしれない。",
      "start": 3466442,
      "end": 3496738,
      "timestamp": "57:46"
    },
    {
      "speaker": "Ryo",
      "text": "けどそういうナードな会社もねいろいろいっぱいあるけど間違いない。",
      "start": 3496738,
      "end": 3501862,
      "timestamp": "58:16"
    },
    {
      "speaker": "Senna",
      "text": "そうねまあここから先は多分次回なんだろうけれども実際ジュニアで入ってねあの一番辛いレイオフの時期も生き残ってるわけですからねまあそう。",
      "start": 3501862,
      "end": 3509770,
      "timestamp": "58:21"
    },
    {
      "speaker": "Ayaka",
      "text": "いうコミュニケーションの部分もあった。",
      "start": 3509770,
      "end": 3512233,
      "timestamp": "58:29"
    },
    {
      "speaker": "Senna",
      "text": "ですよね絶対ないわけが。",
      "start": 3512233,
      "end": 3513674,
      "timestamp": "58:32"
    },
    {
      "speaker": "Ryo",
      "text": "ないですよ2回もあり。",
      "start": 3513674,
      "end": 3514235,
      "timestamp": "58:33"
    },
    {
      "speaker": "Senna",
      "text": "ましたもう生き残ったちょっと待ってこれは次回だと思う。",
      "start": 3514235,
      "end": 3517879,
      "timestamp": "58:34"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあちょっと一旦戻ってそれが2回目のインタビューでその後はもう確認のインタビューみたいな感じですか?それとも何かビヘビラルみたいなのもあったんですか?",
      "start": 3517879,
      "end": 3532684,
      "timestamp": "58:37"
    },
    {
      "speaker": "Ayaka",
      "text": "ビヘビラルが最初。フォンコールがあって、今のマネージャー、ハイアリングマネージャーとのチャットがあって、で、その後2回のテクニカルインタビュー。だから計3つあって、最終確認の電話ですね。",
      "start": 3532684,
      "end": 3555216,
      "timestamp": "58:52"
    },
    {
      "speaker": "Ryo",
      "text": "でじゃあ最初確認してサインしてそこから入社みたいな感じですかはいそしたらじゃあ最後にえっと給料のレンジとか言える範囲で教えて。",
      "start": 3555226,
      "end": 3568335,
      "timestamp": "59:15"
    },
    {
      "speaker": "Ayaka",
      "text": "いただいてもいいですかはい言える範囲ではそうですねセックスデジェットだけ減っておきますあと日本で働いてた時の3倍ぐらいには。",
      "start": 3568335,
      "end": 3580523,
      "timestamp": "59:28"
    },
    {
      "speaker": "Ryo",
      "text": "なりましたすごいマジか素晴らしいセックスデジェットっていうのは日本で言う1000万超えたらすごいよねみたいなののその1000万デジェットって数字0が何個あるかみたいな桁が何桁かみたいな話ですよだからこれ。",
      "start": 3580523,
      "end": 3599225,
      "timestamp": "59:40"
    },
    {
      "speaker": "Senna",
      "text": "ちゃんとねいつも俺6個って計算するんですよだって1,2,3,4,5,6みたいないや素晴らしいジュニアで。",
      "start": 3599225,
      "end": 3610174,
      "timestamp": "59:59"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみにだいたいそのくらいジュニア1。",
      "start": 3610174,
      "end": 3613722,
      "timestamp": "60:10"
    },
    {
      "speaker": "Ayaka",
      "text": "年目でも6ステージとあって、全部込みですよ、RACU、ボーナスも込みで。去年にプロモーションもしてもらって毎年毎年レースもあるの。",
      "start": 3613722,
      "end": 3634370,
      "timestamp": "60:13"
    },
    {
      "speaker": "Senna",
      "text": "で夢しかないね本当に夢しかない前回出てくれた大学卒業しての方もそうでしたがやっぱりそうねジュニアでカナダにあるアメリカ資本の会社みたいなところになるとやっぱ60歳くらいからスタートされるところが多そうな感じですね日本に行った時の3倍って逆にね日本に行った時。",
      "start": 3634370,
      "end": 3655858,
      "timestamp": "60:34"
    },
    {
      "speaker": "Ayaka",
      "text": "に日本が少ないのかって。",
      "start": 3655858,
      "end": 3656678,
      "timestamp": "60:55"
    },
    {
      "speaker": "Senna",
      "text": "いう3倍って言われるとちょっとはーって思っちゃうよね。",
      "start": 3656678,
      "end": 3661461,
      "timestamp": "60:56"
    },
    {
      "speaker": "Ryo",
      "text": "そうかわかるんですよ6デジェットは超えるだからそう。",
      "start": 3661461,
      "end": 3665063,
      "timestamp": "61:01"
    },
    {
      "speaker": "Senna",
      "text": "ねもしかしたらそれは多すぎる気がする6デ。",
      "start": 3665063,
      "end": 3668085,
      "timestamp": "61:05"
    },
    {
      "speaker": "Ayaka",
      "text": "ジェットって2000万とかの可能性もあるのかある。",
      "start": 3668085,
      "end": 3670566,
      "timestamp": "61:08"
    },
    {
      "speaker": "Senna",
      "text": "ね9000万99909万まで6。",
      "start": 3670566,
      "end": 3672307,
      "timestamp": "61:10"
    },
    {
      "speaker": "Ryo",
      "text": "デジェットなんで笑い幅。",
      "start": 3672307,
      "end": 3673348,
      "timestamp": "61:12"
    },
    {
      "speaker": "Ayaka",
      "text": "が濁しすぎですかいやいや全然。",
      "start": 3673348,
      "end": 3676790,
      "timestamp": "61:13"
    },
    {
      "speaker": "Ryo",
      "text": "大丈夫ですということで最後まで聞いてくださりありがとうございました海外キャリアログは毎月月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグキャリア海外キャリアログでお待ちしてますありがとうございました。",
      "start": 3676790,
      "end": 3699187,
      "timestamp": "61:16"
    }
  ]
}
