{
  "episodeGuid": "1fd7f7ee-5ceb-4775-bad3-6278e4a0fc2f",
  "episodeTitle": "日本のメガベン経験は通用する？ジュニアエンジニアのカナダ就職と給与【対談】",
  "transcribedAt": "2025-10-19T06:29:05.036Z",
  "duration": 1745,
  "fullText": "そしたら始めていきましょうか1週間前ぐらいかな元々なんか質問箱みたいなやろうみたいな思ってたんですけどまずとりあえず簡単にツイッターでマシュマロみたいなのやってみようみたいなので投げてみたんですねでなんか質問いただけたのでちょっと読み上げていくのでそれに対してえっと2人で話していければなと思いますはい。雑談会みたいなね今日は。まあそうですねはいはい、では読み上げていきます。私はカナダ永住県を持っていて、トロントに住所があります。カナダの大学を卒業しましたが、コンピューターサイエンスではありません。卒業が近く、専攻変更ができないので、独学でCSを勉強して、日本のメガ弁から内定が出ました。SRE、DevOps系のキャリアを歩むつもりです。数年ほど経験を積みジュニアレベルでトロントかバンクーバーで働きたいですこの計画に現実性はあるのでしょうかこの場合ジュニアでどのぐらいの給料が見込めるのでしょうかお読みいただきありがとうございますはいご質問ありがとう。ございますねマシュマロがあったんだねこれ質問サイトな。んだねじゃあそうなんかTwiterを通してなんかそのURLを踏んでもらうことでそこから質問なんでもできるよみたいな匿名でできるよみたいなみたいな素晴らしいじゃあここ。系で岡井さんに質問できるっていう素晴らしいプラットフォームですねそう。ですねまぁあのなんか今回の話で言うと結構いろいろ分解できるかなって思っててでまぁ僕よりも多分セナさんの方が詳しいことも多いのかなと思いつつちょっと話していきたいなってまずポイントとしてはカナダ永住権を持ってるってところですかねそうですね。まあここは多分大半の方は持っていらっしゃらないと思うけどまぁ結局さあの何塾カナダ永住権があると何回トライしてもね別に時間的制約がないっていうところは正直強いと思うのでまあね慣れる時まで頑張ったらいいんじゃないみたいな感じで話ができちゃうのが永住権持ってる人だと思うけどここはまず。強いですねそうですね。そもそもなんで永住権必要なの?みたいなのってあると思うんですけど、それって、僕たち結構こっちにいる人だとわかるんですけど、転職して給料を上げていくみたいな文化がある中で、ワークビザ、ワーホリとかだったら他の会社に移動することができるんですけどそれが終わって会社にビザを出してもらっている状態みたいな状態になるとクローズドワークファミリーってやつ。ですねその一社でしか。働けないそうなると他のところに転職とかが結構難しいとかってなってくるっていうのがあるから永住権あるといいよねみたいな間違いないですちなみにこれ。東海オンエアさん知ってたかなっていうレベルやけどさあれらしいよ、就労ビザでもしもクローズオブアクパメントで給料出したら基本的にそれ以上あげちゃいけないらしいよ。そうなんだあのね文脈。としてはカナダ政府に対してこの給料で人探したけど人見つからへんかったから日本人のこの人じゃないといけないのっていう話し方なのに給料あげちゃったらいやじゃあカナダ人で人見つかるじゃねーかよって話になっちゃうから厳密にあげちゃダメっていうわけじゃないけどプロセスがむっちゃめんどくさいらしいっていうのがね実はあってだからクローズワークパンミントで就労日のサポートしてもらったら給料実は上がりにくいっていうのってあのルールというわけじゃないけど実は裏側に理屈は通ってたっていうどうもがあって、なのでそういうのを踏まえた上でおっしゃる通り永住権っていうのがあるとそんな制約からね、。もう取っ払われるっていうで、もう一つのポイントとしては、CS出てないけど、カナダで、カナダでの経験があるってことなのかな、カナダでのエデュケーションがあるってことだと思うんで、英語に対しては多分きっと問題ないって言えるんじゃないかなと思いますね。彼の場合で、彼、彼女の場合で言うと。CS別に勉強してないけどっていう部分だとね、日本だったらやっぱり新卒採用の生徒もあるだろうし、メガメンからもそれは大体出るでしょうね。で、まあ、本題というか、特にまあ今回話していきたいなと思ったのが、えっと、僕もあんまり詳しくないんで、セナさんに聞いてみたいんですけど、なんか日本のベガ弁の経験って、バンクーバーで通用するの?まあ、北米で通用するの?ってところだと思うんですよね、結局は。ね、もう間違いない。でも結局トバスさんのさ前やってくれたレジュメ回でも同じ話題にはなったんじゃないかなと思うけどぶっちゃけレジュメにかける内容として見るんだったらねやっぱり日本のメガベンにいてアジャイルで回してスプリント回してでやることに対してのアチュメントがあってその実績っていうのがちゃんとかけるもんだったらやったら意味はあるだろうねっていう多分そういう話に落ち着くんじゃない。ですかね多分そうですね僕も答えとしては日本での経験はちゃんと使えますっていうのが一つとさっき、今、言ってくれたように、ただ、結構、こっちでの、日本で経験者がこっちでの就職が難しい理由って、履歴書とレジュメの書き方の違いがあって、自分の日本での経験を、こっちのレジュメ用の書き方になんか直すのがみんな苦労してるのかなっていうのが結構あるのかな。と思いますよね前ねトカシさんがフロックでイベント開いてくれた時に一人ちょっと題材を用意してその人の売れ締めをねちょっと見ていくっていうのやってくれたと思いますけどやっぱあの人もね半年くらい時間かけて多分ちゃんとブラッシュアップしていたと思うので何も考えないって言ったら言い方悪いけど日本だとどうしても買い手市場なので違う売り手市場か売り手市場なのでねなんかあんまりそのこっちの個人の努力とかしなくても正直仕事見つかるっていうのがあるかもしれないけどやっく米だとねその辺はどうアピールするかって話になるのでアピールしたことない人がねきなりじめ書くとそれは辛いよねって話。ですよそうですね、なんか僕が思う履歴書って、間違ってたらちょっと申し訳ないんですけど、事実を書くみたいなイメージで、だから誰が書いても同じキャリアというか、同じキャリアを歩んできた人だったら同じものが出来上がって、レジュメは本当その人の視点で何かをピックアップするだったりだとか、こういう職に就きたいからこういう風に書こうみたいなのって結構変わってくるというか、だから100人いたら100人書き方が違ってくるのかなみたいなのがレジュメなのかなって僕は思ってて、。間違いないですね俺最近それで言うんだったら日本は日本の履歴書は報告書あのカナダのレジュメはあの提案書っていうことが多いです。うん確かに面白いまあみたい。なそうまあ見方と言い方それぞれかもしれないけどね本当にか人によってはもうレジュメのやっぱり書き方とかそこに書いてる内容とかもやっぱり履歴書とレジュメとで全然違ったりします。それこそ、そのね、さっき出してくれたレジュメ回で、サンプルというか、その人の履歴をみんなで見てて、こういうふうに書いてきました、みたいな回をやったっていう話だったんですけど、なんか彼は、その半年後くらいにね、結局ちゃんと見つけて、しかも結構早い段階であれをやったんで、その半年かかったってわけではなくて、まあなんか学校行きつつ、ねそのレジュメをブラッシュアップしてって結構早い段階で見つけられたみたいだったんですごいあの回としては良かったのかなぁみたいな。でもあれで多分割とはっきりしたよね多分その日本からさそのメガベンチャーにいるようが何しようがやっぱりこのにこっちのカナダの方に来てまあゼロベースかやっぱりそのアピールポイントやっぱり探すとこから始めてるわけじゃないですかなのでそこで結局時間かかってるからねやっぱりその今のこのご質問者さんのそのメガ弁で内定がっていうので今からメガ弁で2年なのか3年なのか経験積んでのところでそれこそねカナダにいる東橋さんなんかも含めて転職だったりだからこっちのレジュメのつきやっぱり書き方っていう部分をやっぱりイメージできてる人が日本で経験積むとなんかやっぱりねレジュメには多分こういう風なアピールないようにこの行動ってなるんだろうなってそういう想像とリンクさせながら過ごせるだろうからそうですよねそうそう割と生かせるかどうなのかっていうのはそこのイメージができているかどうかっていうのにはワンチャンちょっとあの話持って帰れるかもしれないですよね。確かにまあとはいえあった事実としては残るじゃないですかなんでその後でそのちょっと経歴の見直しみたいなのをすればまあ自然のレジュメの書き方みたいなのを知らなくてもまあ経験したことはできるしまあねでメガ弁って言ったらきっとなんだパフォーマンスとかのこともあの触れるだろうしそういう意味で言うとあの経験としてはすごい生きるかなってまぁこっちにこっちのレジュメの様式に変えるみたいなところにちょっと時間はかかるかもしれないけど経験としてはいいんじゃないのって話だと。思いますね間違いないですねいやいやあのねまあこの結構レジュメ系の話なんかもそうなんだけどもあのさっきそれこそ相談実はあって海外就職したいんだよー言って今新卒2年目なんだよねって人あったんだよその人が今あの生命保険系の会社かなんかでデータサイエンティストやっててっていうのででもカナダに行って就職したいところはデータサイエンティストのSARSでって言っててだったら日本でやっぱりSaaS系のプロジェクトに順次ていた経験っていうのがやっぱりレジュメにかけるような状態にしておかないと結局カナダに来てカレッジ行こうがどこ行こうがそこの経験っていうのがレジュメにかけないからそれって経験値としてはちょっとまた頑張って作らなくちゃいけないよねって話をしたばっかりだったんですよ割とそこにも多分リンクするとこではあってやっぱり日本のメガ弁であったとしても間違いなく開発工程とか開発環境とかって割とこっちに通ってると思うのでそうですねうんなんかそこでのね経験が確かになんか生きないかって言われたらね100億%たぶん。生きるんだろうからうんあとはあのでも多分メガベンである必要はないのかなとは思いますよね勉強できるのであればあのなんだろう別にメガベンで大きい会社だといろんなパフォーマンスのこととかもできるしいいとは思うんだけど別に普通のなんだろう会社普通のSaaS他の小さい会社のSaaSの会社でも全然経験はできるのかなと思っててそうっすね残念なのはそのメガペンの名前ビッグネームみたいなのをこっちではほぼほぼ使えないまあメルカリであってもあんまりそんななんだろうって感じじゃないですか間違いないネームバリュー。でそもそも仕事が見つかるイメージを多分日本よりは捨ててきた方がいいよねおそらく。本当にいいとしたらまあアマゾンだとかガファムクラスの日本にある外資のそういうところだったら、たぶんネームバリューとしてすごい生きるのかもしれないけど、それ以外だと、まぁそこはちょっと期待できないかなとはありますね。そうですね。わざわざ調べないもんね、メルカリがとかDNAがとか。そうなんですよね。で、あともう1つこっからなんかちょっと深掘りしたいのが、そもそも日本で、日本で1回メガ弁を経由したほうがいいのか、それとも、永住権あるんだし、もう最初からこっちでジュニアレベルで来ちゃえばいいじゃんっていうのもあるのかなと思うんですけど、どう思います?いやこれ難しいですねまあ俺らはやっぱりそのフロッグとしてa受験持ってる人のがそれは当然レアだからあんまりなんかテンプレ的な回答って持ってないけどいやでもさすがにでもやっぱり新卒制度だったりとかへまあゼロベースからやっぱり経験を紡ぐに対しての度量みたいなところって正直日本の方がやっぱり充実していると僕は思っているのでそういう意味だったら、早いタイミングから面白い環境に、要するにレジュメに欠けそうな環境に通り込まれる可能性という意味だったら、俺は日本からっていうのはありなのかなと。は思いますけどね難しいですねどっちでもいいかなっていうのが僕の答え。かもしれないですどっちでもいいよね正直こっちでもちろんジュニアからっていうところでもう1回ねちょっと頑張って時間はかかるだろうし最初の職力積むのにやっぱり苦労はするんだろうけどそうです。ねあと待つ必要もないのかなっていうのはあるんですよねさっき今言ってくれたように永住権持っててビザもあるしでジュニアでいいんですよって言ってるんでそんなに待つ必要もないのかなっていうのは思いつつまあねsreデヴォープス系はバンクーバーにはあんまりポジションがないっていう事実もあるので確かにそれを考えるとまあ日本でちょっと経験あるよっていうところから攻めるのはありかなとも思いつつ。そうですねバンクーバーのsreにいるフロックのメンバーなんてほとんどリモートだもんねどっかの会社。のやっぱオフキーとか多分ここらへんはセナさんの方が多分詳しいと思うんですけどやっぱりなんかそのバンクーバーってそのサンフランシスコシアトルのあの拠点としてのイメージがあってでそこらへんをまあカナダとかバンクーバーに来る前に割とちゃんと揃えちゃってからあのバンクーバーのウェブの何だろう開発拠点として使ってる会社が多いのかなっていうイメージでで別にバンクーバーにもスタートアップとかが全くないわけではないけど、あんまりスタートアップにSRE、DevOpsにかけるお金がないとかっていうのがあると思うので、っていう風に僕は思ってるんですけど、。いやもう全く同じですね基本やっぱりそうねフロックのやっぱりメンバーにしてももうドスタートアップがもうビッグテクかみたいなやっぱり割と中間層がやっぱりバンクーバー少ないよねっていうの。はやっぱあってそうですねうんそれであれば多分トロントの方がきっといいのかなとは思うんですけど僕あんまりまあトロントのあの市場に詳しくはないんですけど。いやでもやっぱそうっすよあのフロックのやっぱりメンバーなんかでもやっぱり言語だったりフレームワークだったりでやっぱりトロント選ぶ人やっぱいますもんねうーんそうそれこそやっぱりネイティブアプリ作るぞーみたいなところなんかもねあのiosだったりとかまあそういう人だったりとかまあその辺でやっぱりまあエンジニアさんなんかでもやっぱり正直バンクーバーは仕事少ないそうあの辺ってやっぱりでも中堅以上のねやっぱり規模というかあのある程度やっぱり人数揃ってやっぱりパワーのある会社じゃないとやっぱりネイティブエンジニアって正直雇いにくいから各デバイスごとによってエンジニアとはなくそういった意味でね、やっぱりある程度企業数も多くて中間層も充実していてなおかつ人口も多くてっていう部分のトロントの方に集中するのは正直あり。ますよねそうですね僕も今の会社は大きい会社だけどSREDevOps系のポジションはバンクーバーオフィスにはなくて前の会社がそれこそトロントのあのちょっとまあそのそれこそ中堅企業ぐらいの大きさだったんですけどそこでは本当に3人いたかなデブオプス系の人がって感じだったんでそういうところにトロントでまあバンクーバーからであればまあ別にあのリモートでもね働けると思うんでそういうところに応募するかっていうする方が現実的ではあるのかなって感じですねそうです。ねバンクーバーでもいいけれども数は少ないだろうしDevOpsは確かにもうちょっとあるかなっていう気がするけどでもそれでもねDevOpsもSREもある程度企業と人数の規模がやっぱり必要な会社さんに必要な職種なのでやっぱりね人口多いトロントの方が多くはなるんだろう。なと思いますねそうですねで、ジュニアでどのぐらいの給料が見込めるかっていうところなんですけど、どうなんだろう?SREとかDevOpsのジュニアってあんまり聞かないからね。間違いない。てか、。SREにジュニアなんてわけあんの?って俺は思うんですけどね。あるんかな?一応、ありはするんだけど、サンプル数が結構少ないと思う。だから、あんまりSREってところに注目せずに、会社の企業イメージみたいなのを作るとやっぱりそのさっき言ったように中堅ではあるじゃないですかそうですね中堅でジュニアっていう風に考えるのがまあ多分ジュニアのソフトエンジニアって考えるのが多分あの一番近そうだなって思うとジュニアまあジュニアインターミネートかなっていうとまあ100Kいくかいかないかぐらいなのかなって僕のイメージ的には思うんですけど瀬名さんどうですかいや、。そんなもんじゃないですか。ついこの間だってね、本当にドジュニアというか、ド初心者でカナダに来て、こっちへカレッジ行って就職したよっていう方が何人か出て、その人たちの中にね、ジュニアなんだけども100系越えの人が出てきて、割とね、最近なんかジュニアのそこと言うか、あの給与値のやっぱり平均がなんか上がってる感じアフロック見てると思うんですよね。でちょっと前だったら正直60系とかやっぱり70系くらいからやっぱりジュニアスタートだよねっていうのが割とテンプレだったのか最近ね割と本当に80、90って上がってきてるの。で確かに上がってきてますね本当にそうそうマジ。かって俺はちょっとぶっちゃけびっくりしたけどなのでジュニアレベルでちゃんとしたといったら言い方悪いかもしれないけどちゃんとしたサース系の会社さんで人数もそれなりにいって規模もちゃんとあってっていうのだったら8090くらいからっていうふうに。見といてもいいんじゃ。ないかなと思いますね。なんか今ちょっと調べてみたら、ショッピファイ、カナダの大きい企業というか、IT系の大きい企業で有名なところで言うと、なんとなくですけど、100系から260系ぐらいまでSREもしくはDevOpsで撮ってるみたいなんで、まあそれで言うとショピファイは結構多分あの高めのレンジ設定をしていると思うのでまあそれ以外でもでもそれでも100Kぐらいいけるのかなみたいなのはありますよねそう。ですねまあ純というかもうカナダ初のね会社のショピファイでやっぱりそのレベルっていうのがあるのでまあやっぱりねバンクーバーとかにあるテック企業ってそういう会社さんたちでやっぱり戦わないと人は取れないのでそうですね。ねあとはねショッピファイ以外にもやっぱりそのあの少ないとはいえ多分大きい企業ビッグテックにアメリカとかのビッグテックとかからえっとポジション出しているところもあってまあそれ以上に出したりすると思うんでそれのサラリーにやっぱりちょっとあの持ち上げられるみたいなところある。じゃないですかありますねーこれちょっとカナダならではなとこ歩くないかなって思ってるのが日本でさ例えばビッグテック行ったらさそれ以外には行かないじゃんあの1回っていうかその例えば日本でグーグル入りましたって人がなんかタイバーエージェントに入りますってイメージ正直はないしでもなんか割とかーだってそういうのあるくないと思ってるのがあのアメリカの例えばビッグデッグ行きましたっていう人がなんかわけのわからんオファー額をもらってなんか30人くらいの規模なんかスタートアップに入ってたりするのがあるから割とその辺ってやっぱりちゃんとこっちの大きい会社に入った給与帯の待遇の人たちをちゃんと取ろうとする努力があるんだなっていうのは実はちょっと最近比べてて。思うこと確かにそうですね、アメリカでもやっぱその大きい会社行った後に小さい会社に行くみたいな、でもその小さい会社も給料自体は結構近い金額は出してくれてて、RSUみたいな持株制度みたいなのを利用してちょっと多めにパブリックカンパニーを払ってくれるんだけど、でもパブリックじゃないところはそれに負けないように現金比率めちゃくちゃ高くしてるみたいなところとかも結構効くんでそうですね、そういう意味で言うと日本であんまりそういうの効かない。まあ株式、エクイティ系のもしかしたらそういう制度が整ってないからっていうのはあるかもしれないですけどね、その会社が大きくなった時に見れる夢がやっぱりちょっと狭いというか、ないので。あとはなんかイメージなんですけど、間違ってたら申し訳ないんだけど、アメリカ系の大きい企業ってやっぱりそれでも忙しいじゃないですか、ちょっと。違いない。そう、なんで、スタートアップになるとそれが結構緩やかになるというかあの楽になるイメージがあるんで給料が少し落としつつもあのちょっと楽かなみたいな僕が知ってるやっぱりアメリカの企業でアメリカのスタートアップで給料が高くてでカナダにもリモートのポジションあるって人たちまああのセナさんも何人か知ってると思うんですけどなんかちょっと楽そうだなとは思うんだなってイメージですけどいや俺。この間ちょうどさスパベースとレールウェイの話を聞いたばっかりだったからあのスパベースは有名じゃないですかであそこの一応対抗馬と言わないけどまぁね勝つぞ超えるぞみたいなのがやっぱレールウェイで最近ちょっとレールウェイ使い出してるんですけどレールウェイはまだまだやっぱりその進行形のね会社というかまぁシリーズも多分多分多分はソベス並には行ってないだろうしってなるとまぁスターでもあれはスタータプって言わないのかなぁシリーズ乗ったからかな何がともあれともレールウェイはもうアホみたいに忙しい。らしいですよそうなんだまぁ会社にもやるのか。なぁはいでまぁわかんないけど少なくともスパベースとレールウェアを比べた人の話を聞くとスパベースの方が楽だって言ってたから。楽そうだって言ってた。からやっぱりこうスタートアップで今からシリーズ乗っていくぞみたいなとこってバチクソ忙しいのかな副業ダメって言ってた。しみたいなね確かにシリーズとかの場所にもよるのもあるかもしれないですね結構もうお金調達できてるところとかでエンジニアにも余裕あってなんかなんて言うんだろう、スタートアップだけどめちゃくちゃでかいみたいなところって結構あるじゃないですか。あるある。なんで未だにスタートアップやってんの?みたいなね、とこありますよね。そういうところは結構なんか、ふんわりしてるというか。まあでも、さっきの話に戻ると、まあそういうところ結構お金出してくれてるイメージはありますよね、こっちだと。で、。日本出ないのは何なんだろう。いやわかんねえ、何だろうね。規模があるからやっぱり、なんかその、例えばこっちのショッピファイ、カナダのローカル企業であるショッピファイは、やっぱり英語を使われてるから、市場っていう点においては、競合をちゃんと他の国でも取りに行けるわけじゃないですか。でも日本のスタートアップだと、やっぱり日本語を使ってのビジネスになると、市場的にはやっぱり日本に限定されちゃうからそういう意味で言うとやっぱりちょっと市場は小さくはなる日本の日本にいる外資ITに比べてGogleとかAmazonだとかMicrosftに行くっていうのを。考えるとだからなんかその辺のパスなんか作りたいなって思うときあるけどななんか日本でねGogleとか行った人ってやっぱ化け物級にやっぱりレベル高いっていうのはもう最近話しててもわかったのでああいう人たちがねなんか日本のそういうスタートアップに海賊みたいのがなんかレールが作れるのが楽しいなと思いすなんかそれ全然。起こんねーなーみたいなね難しいですね。なんか、一時期、帰った後のキャリアはどうしようかな、みたいなのを考えてた時期があって、それで、日本のスタートアップに行くのか、外資系のビッグテックみたいなところか、ファームみたいなところに行くのか、みたいなのを考えたときに、ちょっとやっぱり、最初、お金の考えると、Gogleだとかね、そういうところは結構、日本であっても、相当高い給料を出してくれているんで、そっちもありかなと思ったんですけど、でもやっぱなんか、Gogleはたぶんなんか別らしいですけど、結構やっぱローカライゼーションの仕事が多いと、面白い機能が作れないと、ちょっとなんかエンジニアとしての幸福度は下がるのではないかみたいなのを思って、だったら、僕としては、なんだろう、日本のスタートアップかなぁみたいなのを、考えてるんですけどでも確かにそれが例えばどうなんだろうgoleがじゃあ2000万もらえるんだとして日本のスタートアップが700万ですとかですかねだいたいいうと同じようなことをやってその差かみたいなのはあるからちょっとやっぱ確かに厳しいのは厳しいとは思います。だからそういうのに対してやっぱり夢見せるという意味でねなんかエクイティだったりとかその会社が大きくなっていくときにまあに応じてかなんか自分の報酬が大きくなっていくそういう夢の見せ方っていうのが多分スタートアップの常だとその辺のなんか法整備なのかエクイティ整備なのかわかんないけどあんまりなんか日本のスタートアップでそういう話あんま聞かない。ですようんなんだろうなんかやっぱりソフトウェアエンジニアから経営者になってないから、。みたいな感じなのかな。重要性みたいなのと、なんか重みか、みたいなのがもしかしたらちょっと相違があるのかなとは思う。なんかビジネスの方から来て、社長をやって、でエンジニアたちに、ソフトウェアを作らせるみたいなんで、日本の市場があると、その経営者の人たちはもうすでにお金は結構ちゃんともらえて幸せになるから、みたいな感じなのかな。なんか、北米だとやっぱり、Facebokもそうだし、僕が言ってるAsanaとかもそうですけど、ソフトウェアエンジニアがソフトウェアを作って、で、それが会社になって、で、お金とか集めて、その後ファブリックしてみたいな、そういうストーリーが結構多いじゃないですか。そうですね、間違いない。そういうのがまだ生まれてなくて、エンジニアファーストみたいな文化のある会社はやっぱちょっと少ないのかなっていう。まあ、そうですね。まあ、だから両方じゃないですか、エンジニアファーストな文化の会社は、まあ、少なからずはやっぱあると思うけど、とはいえ、その人たちが多分勝ち抜けてなくて、勝っていると思うよね、間違いなくね、その日本の市場という中だと。でも世界も含めてやっぱり視野取ってっていうので勝ち抜けてしまうの多分まあ自分たちの社員の幸福まで祈れるようなため帰るような多分そういう仕組み組織作りかできる気がするけど多分日本で勝つっていうところが多分上下になるとおそらく幸せになるのなれるのって多分経営。者だけでそうですねその。辺はちょっとある気がするかな俺はすいませんねちょっとなんか質問からずれてしまいましたがとは言えね戻るんだったらまあジュニアとしてのやっぱり給料っていうところだったらねやっぱりそのくらいやっぱりまあ上目指せるんじゃないかなとは思うのでそこはねでも俺この人でちょっと質問見てて思ったけどそもそもこの人ね日本でメガ弁入ってからまあ経験積んでからこっち来るって言ってるんでジュニアとしての就活は多分。ないと思うんだよね確かに、どのぐらいを想定してるのかわかんないけど、なんか英語もできるみたいだし、ビザのリストリクションみたいなのもないから、英受験持ってるし、で、日本で経験も積んできたっていうと別に全然ジュニアで行かずとも、5年も6年も働くわけじゃないだろうから、インターミディエイトぐらいにはなれそうな感じはありそうですけどね。これでもやっぱり質問ずっと俺も相談受け続けてて思うところで、だから日本で2、3年の経験積んでても、いや私はちょっとまだまだ自信がないのでジュニアからですみたいな人って結構多いんですが、ムードとしてはどうなんでしょう?知らないもの怖いっていうだけなんじゃないのかなってありますけどね。でも日本のエンジニアって結構レベル高いじゃないですか、技術レベルが。そうなのでね日本のメガ弁でちゃんと経験積みましたっていう人がねにまあわかんない本当にネスとかさがいたり何年経験積むのか次第だと思うけど確か1年とか1年未満とかで言うんだったらまあジュニアから探すのもありなんじゃないと思いつつまあ1年数に経験積むんだったら普通にインターミネートから探しても僕とかいいんじゃないか。なと思いますそうですねまあでもあのそこらへんのなんだろうフレキシブルさみたいなのは大切なのかなとは思いますけどね結構こっち来てそのインターミデートというか自分はもうシニアなんだから例えばねシニアでしかあの受けませんとかっていうよりはえっとインターミデートでもシニアでもえっとジュニアでもいいからとりあえず受けて仕事をもらってねそこからまあなんか給料交渉するだったりだとかあのねはたまた転職するみたいなやっぱ難しいのって一番最初の会社じゃないですか本当にそうですそのフレキシブルさを持ってジュニアでもいいしインターミュレートでもいいからとりあえず受けてみるみたいなのはありなのかもしれない。ですねそうですね間違いないフロップのインタビュー記事にいるこの間ファーウェイ受けてまあすんなり入った人もそうですけどあの最初はやっぱりその人も日本で経験むっちゃったけどインターワーから入ってるんですよねその人ってインターン科でも入ってるけど日本での経験値結構高かったんで当然インターン科の中だったらもう頭2,3個分やっぱり飛び抜けてたからもう割とトントン拍子で数ヶ月後にはもうフルタイムになってそのままシニアポジションでシニアポジションだったかなインターミニとかシニア科で入ってるので入り口の部分がね仮にちょっとジュニアだろうがインターミニだろうがインターンだろうが何かしらかも分かんないけどそこの会社に入り込みさえすればアピールする機会なんてもう5万とあるわけでおだしょーあり。ますねあとやっぱその昇進とかもあのちゃんとしてれば早いですしねあんまりなんかあのジュニアでこいつインターミーレートとかシニアのレベルあるけどあのジュニアのレベルで使ってやろうみたいな意地悪な人あんまいない。じゃないですかどんな会社おったら多分誰も寄りつかないから。ねでもなんかさっき言ったようにまあ頭で頭でっかちにならずにとりあえずジュニアから自分のレベルぐらいまではとりあえず受けてみてとりあえず就職するってところが大切なの。かなお願いしますまあ引き続きあれだよねこのマシュマロ投手でもいいしあのーTwiter。の方でもそうですねなんか質問してもらえたらちょっとどんどん答えていきたいなと。思います間違いないですまあこういった形でね取り上げることもあるかなと思います。ねはいありがとうございましたはい。ありがとうございましたということ。で最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "そしたら始めていきましょうか1週間前ぐらいかな元々なんか質問箱みたいなやろうみたいな思ってたんですけどまずとりあえず簡単にツイッターでマシュマロみたいなのやってみようみたいなので投げてみたんですねでなんか質問いただけたのでちょっと読み上げていくのでそれに対してえっと2人で話していければなと思いますはい。",
      "start": 48,
      "end": 20048,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "雑談会みたいなね今日は。",
      "start": 20048,
      "end": 21829,
      "timestamp": "00:20"
    },
    {
      "speaker": "Ryo",
      "text": "まあそうですねはいはい、では読み上げていきます。私はカナダ永住県を持っていて、トロントに住所があります。カナダの大学を卒業しましたが、コンピューターサイエンスではありません。卒業が近く、専攻変更ができないので、独学でCSを勉強して、日本のメガ弁から内定が出ました。SRE、DevOps系のキャリアを歩むつもりです。数年ほど経験を積みジュニアレベルでトロントかバンクーバーで働きたいですこの計画に現実性はあるのでしょうかこの場合ジュニアでどのぐらいの給料が見込めるのでしょうかお読みいただきありがとうございますはいご質問ありがとう。",
      "start": 21829,
      "end": 61816,
      "timestamp": "00:21"
    },
    {
      "speaker": "B",
      "text": "ございますねマシュマロがあったんだねこれ質問サイトな。",
      "start": 61816,
      "end": 66040,
      "timestamp": "01:01"
    },
    {
      "speaker": "Ryo",
      "text": "んだねじゃあそうなんかTwiterを通してなんかそのURLを踏んでもらうことでそこから質問なんでもできるよみたいな匿名でできるよみたいなみたいな素晴らしいじゃあここ。",
      "start": 66040,
      "end": 77887,
      "timestamp": "01:06"
    },
    {
      "speaker": "B",
      "text": "系で岡井さんに質問できるっていう素晴らしいプラットフォームですねそう。",
      "start": 77887,
      "end": 83331,
      "timestamp": "01:17"
    },
    {
      "speaker": "Ryo",
      "text": "ですねまぁあのなんか今回の話で言うと結構いろいろ分解できるかなって思っててでまぁ僕よりも多分セナさんの方が詳しいことも多いのかなと思いつつちょっと話していきたいなってまずポイントとしてはカナダ永住権を持ってるってところですかねそうですね。",
      "start": 83331,
      "end": 100780,
      "timestamp": "01:23"
    },
    {
      "speaker": "B",
      "text": "まあここは多分大半の方は持っていらっしゃらないと思うけどまぁ結局さあの何塾カナダ永住権があると何回トライしてもね別に時間的制約がないっていうところは正直強いと思うのでまあね慣れる時まで頑張ったらいいんじゃないみたいな感じで話ができちゃうのが永住権持ってる人だと思うけどここはまず。",
      "start": 100780,
      "end": 117808,
      "timestamp": "01:40"
    },
    {
      "speaker": "Ryo",
      "text": "強いですねそうですね。そもそもなんで永住権必要なの?みたいなのってあると思うんですけど、それって、僕たち結構こっちにいる人だとわかるんですけど、転職して給料を上げていくみたいな文化がある中で、ワークビザ、ワーホリとかだったら他の会社に移動することができるんですけどそれが終わって会社にビザを出してもらっている状態みたいな状態になるとクローズドワークファミリーってやつ。",
      "start": 117808,
      "end": 146710,
      "timestamp": "01:57"
    },
    {
      "speaker": "B",
      "text": "ですねその一社でしか。",
      "start": 146710,
      "end": 148791,
      "timestamp": "02:26"
    },
    {
      "speaker": "Ryo",
      "text": "働けないそうなると他のところに転職とかが結構難しいとかってなってくるっていうのがあるから永住権あるといいよねみたいな間違いないですちなみにこれ。",
      "start": 148791,
      "end": 159376,
      "timestamp": "02:28"
    },
    {
      "speaker": "B",
      "text": "東海オンエアさん知ってたかなっていうレベルやけどさあれらしいよ、就労ビザでもしもクローズオブアクパメントで給料出したら基本的にそれ以上あげちゃいけないらしいよ。",
      "start": 159376,
      "end": 167856,
      "timestamp": "02:39"
    },
    {
      "speaker": "Ryo",
      "text": "そうなんだあのね文脈。",
      "start": 169098,
      "end": 170659,
      "timestamp": "02:49"
    },
    {
      "speaker": "B",
      "text": "としてはカナダ政府に対してこの給料で人探したけど人見つからへんかったから日本人のこの人じゃないといけないのっていう話し方なのに給料あげちゃったらいやじゃあカナダ人で人見つかるじゃねーかよって話になっちゃうから厳密にあげちゃダメっていうわけじゃないけどプロセスがむっちゃめんどくさいらしいっていうのがね実はあってだからクローズワークパンミントで就労日のサポートしてもらったら給料実は上がりにくいっていうのってあのルールというわけじゃないけど実は裏側に理屈は通ってたっていうどうもがあって、なのでそういうのを踏まえた上でおっしゃる通り永住権っていうのがあるとそんな制約からね、。",
      "start": 170659,
      "end": 202863,
      "timestamp": "02:50"
    },
    {
      "speaker": "Ryo",
      "text": "もう取っ払われるっていうで、もう一つのポイントとしては、CS出てないけど、カナダで、カナダでの経験があるってことなのかな、カナダでのエデュケーションがあるってことだと思うんで、英語に対しては多分きっと問題ないって言えるんじゃないかなと思いますね。彼の場合で、彼、彼女の場合で言うと。",
      "start": 202863,
      "end": 222776,
      "timestamp": "03:22"
    },
    {
      "speaker": "B",
      "text": "CS別に勉強してないけどっていう部分だとね、日本だったらやっぱり新卒採用の生徒もあるだろうし、メガメンからもそれは大体出るでしょうね。",
      "start": 222776,
      "end": 230645,
      "timestamp": "03:42"
    },
    {
      "speaker": "Ryo",
      "text": "で、まあ、本題というか、特にまあ今回話していきたいなと思ったのが、えっと、僕もあんまり詳しくないんで、セナさんに聞いてみたいんですけど、なんか日本のベガ弁の経験って、バンクーバーで通用するの?まあ、北米で通用するの?ってところだと思うんですよね、結局は。",
      "start": 230655,
      "end": 247469,
      "timestamp": "03:50"
    },
    {
      "speaker": "B",
      "text": "ね、もう間違いない。でも結局トバスさんのさ前やってくれたレジュメ回でも同じ話題にはなったんじゃないかなと思うけどぶっちゃけレジュメにかける内容として見るんだったらねやっぱり日本のメガベンにいてアジャイルで回してスプリント回してでやることに対してのアチュメントがあってその実績っていうのがちゃんとかけるもんだったらやったら意味はあるだろうねっていう多分そういう話に落ち着くんじゃない。",
      "start": 247469,
      "end": 268374,
      "timestamp": "04:07"
    },
    {
      "speaker": "Ryo",
      "text": "ですかね多分そうですね僕も答えとしては日本での経験はちゃんと使えますっていうのが一つとさっき、今、言ってくれたように、ただ、結構、こっちでの、日本で経験者がこっちでの就職が難しい理由って、履歴書とレジュメの書き方の違いがあって、自分の日本での経験を、こっちのレジュメ用の書き方になんか直すのがみんな苦労してるのかなっていうのが結構あるのかな。",
      "start": 268374,
      "end": 301506,
      "timestamp": "04:28"
    },
    {
      "speaker": "B",
      "text": "と思いますよね前ねトカシさんがフロックでイベント開いてくれた時に一人ちょっと題材を用意してその人の売れ締めをねちょっと見ていくっていうのやってくれたと思いますけどやっぱあの人もね半年くらい時間かけて多分ちゃんとブラッシュアップしていたと思うので何も考えないって言ったら言い方悪いけど日本だとどうしても買い手市場なので違う売り手市場か売り手市場なのでねなんかあんまりそのこっちの個人の努力とかしなくても正直仕事見つかるっていうのがあるかもしれないけどやっく米だとねその辺はどうアピールするかって話になるのでアピールしたことない人がねきなりじめ書くとそれは辛いよねって話。",
      "start": 301506,
      "end": 334594,
      "timestamp": "05:01"
    },
    {
      "speaker": "Ryo",
      "text": "ですよそうですね、なんか僕が思う履歴書って、間違ってたらちょっと申し訳ないんですけど、事実を書くみたいなイメージで、だから誰が書いても同じキャリアというか、同じキャリアを歩んできた人だったら同じものが出来上がって、レジュメは本当その人の視点で何かをピックアップするだったりだとか、こういう職に就きたいからこういう風に書こうみたいなのって結構変わってくるというか、だから100人いたら100人書き方が違ってくるのかなみたいなのがレジュメなのかなって僕は思ってて、。",
      "start": 334594,
      "end": 364368,
      "timestamp": "05:34"
    },
    {
      "speaker": "B",
      "text": "間違いないですね俺最近それで言うんだったら日本は日本の履歴書は報告書あのカナダのレジュメはあの提案書っていうことが多いです。",
      "start": 364378,
      "end": 373900,
      "timestamp": "06:04"
    },
    {
      "speaker": "Ryo",
      "text": "うん確かに面白いまあみたい。",
      "start": 373900,
      "end": 376301,
      "timestamp": "06:13"
    },
    {
      "speaker": "B",
      "text": "なそうまあ見方と言い方それぞれかもしれないけどね本当にか人によってはもうレジュメのやっぱり書き方とかそこに書いてる内容とかもやっぱり履歴書とレジュメとで全然違ったりします。",
      "start": 376301,
      "end": 385883,
      "timestamp": "06:16"
    },
    {
      "speaker": "Ryo",
      "text": "それこそ、そのね、さっき出してくれたレジュメ回で、サンプルというか、その人の履歴をみんなで見てて、こういうふうに書いてきました、みたいな回をやったっていう話だったんですけど、なんか彼は、その半年後くらいにね、結局ちゃんと見つけて、しかも結構早い段階であれをやったんで、その半年かかったってわけではなくて、まあなんか学校行きつつ、ねそのレジュメをブラッシュアップしてって結構早い段階で見つけられたみたいだったんですごいあの回としては良かったのかなぁみたいな。",
      "start": 387677,
      "end": 418601,
      "timestamp": "06:27"
    },
    {
      "speaker": "B",
      "text": "でもあれで多分割とはっきりしたよね多分その日本からさそのメガベンチャーにいるようが何しようがやっぱりこのにこっちのカナダの方に来てまあゼロベースかやっぱりそのアピールポイントやっぱり探すとこから始めてるわけじゃないですかなのでそこで結局時間かかってるからねやっぱりその今のこのご質問者さんのそのメガ弁で内定がっていうので今からメガ弁で2年なのか3年なのか経験積んでのところでそれこそねカナダにいる東橋さんなんかも含めて転職だったりだからこっちのレジュメのつきやっぱり書き方っていう部分をやっぱりイメージできてる人が日本で経験積むとなんかやっぱりねレジュメには多分こういう風なアピールないようにこの行動ってなるんだろうなってそういう想像とリンクさせながら過ごせるだろうからそうですよねそうそう割と生かせるかどうなのかっていうのはそこのイメージができているかどうかっていうのにはワンチャンちょっとあの話持って帰れるかもしれないですよね。",
      "start": 418601,
      "end": 470412,
      "timestamp": "06:58"
    },
    {
      "speaker": "Ryo",
      "text": "確かにまあとはいえあった事実としては残るじゃないですかなんでその後でそのちょっと経歴の見直しみたいなのをすればまあ自然のレジュメの書き方みたいなのを知らなくてもまあ経験したことはできるしまあねでメガ弁って言ったらきっとなんだパフォーマンスとかのこともあの触れるだろうしそういう意味で言うとあの経験としてはすごい生きるかなってまぁこっちにこっちのレジュメの様式に変えるみたいなところにちょっと時間はかかるかもしれないけど経験としてはいいんじゃないのって話だと。",
      "start": 471016,
      "end": 501362,
      "timestamp": "07:51"
    },
    {
      "speaker": "B",
      "text": "思いますね間違いないですねいやいやあのねまあこの結構レジュメ系の話なんかもそうなんだけどもあのさっきそれこそ相談実はあって海外就職したいんだよー言って今新卒2年目なんだよねって人あったんだよその人が今あの生命保険系の会社かなんかでデータサイエンティストやっててっていうのででもカナダに行って就職したいところはデータサイエンティストのSARSでって言っててだったら日本でやっぱりSaaS系のプロジェクトに順次ていた経験っていうのがやっぱりレジュメにかけるような状態にしておかないと結局カナダに来てカレッジ行こうがどこ行こうがそこの経験っていうのがレジュメにかけないからそれって経験値としてはちょっとまた頑張って作らなくちゃいけないよねって話をしたばっかりだったんですよ割とそこにも多分リンクするとこではあってやっぱり日本のメガ弁であったとしても間違いなく開発工程とか開発環境とかって割とこっちに通ってると思うのでそうですねうんなんかそこでのね経験が確かになんか生きないかって言われたらね100億%たぶん。",
      "start": 501362,
      "end": 559039,
      "timestamp": "08:21"
    },
    {
      "speaker": "Ryo",
      "text": "生きるんだろうからうんあとはあのでも多分メガベンである必要はないのかなとは思いますよね勉強できるのであればあのなんだろう別にメガベンで大きい会社だといろんなパフォーマンスのこととかもできるしいいとは思うんだけど別に普通のなんだろう会社普通のSaaS他の小さい会社のSaaSの会社でも全然経験はできるのかなと思っててそうっすね残念なのはそのメガペンの名前ビッグネームみたいなのをこっちではほぼほぼ使えないまあメルカリであってもあんまりそんななんだろうって感じじゃないですか間違いないネームバリュー。",
      "start": 559039,
      "end": 593237,
      "timestamp": "09:19"
    },
    {
      "speaker": "B",
      "text": "でそもそも仕事が見つかるイメージを多分日本よりは捨ててきた方がいいよねおそらく。",
      "start": 593237,
      "end": 597700,
      "timestamp": "09:53"
    },
    {
      "speaker": "Ryo",
      "text": "本当にいいとしたらまあアマゾンだとかガファムクラスの日本にある外資のそういうところだったら、たぶんネームバリューとしてすごい生きるのかもしれないけど、それ以外だと、まぁそこはちょっと期待できないかなとはありますね。",
      "start": 597700,
      "end": 612331,
      "timestamp": "09:57"
    },
    {
      "speaker": "B",
      "text": "そうですね。わざわざ調べないもんね、メルカリがとかDNAがとか。",
      "start": 612331,
      "end": 615483,
      "timestamp": "10:12"
    },
    {
      "speaker": "Ryo",
      "text": "そうなんですよね。で、あともう1つこっからなんかちょっと深掘りしたいのが、そもそも日本で、日本で1回メガ弁を経由したほうがいいのか、それとも、永住権あるんだし、もう最初からこっちでジュニアレベルで来ちゃえばいいじゃんっていうのもあるのかなと思うんですけど、どう思います?",
      "start": 615483,
      "end": 634812,
      "timestamp": "10:15"
    },
    {
      "speaker": "B",
      "text": "いやこれ難しいですねまあ俺らはやっぱりそのフロッグとしてa受験持ってる人のがそれは当然レアだからあんまりなんかテンプレ的な回答って持ってないけどいやでもさすがにでもやっぱり新卒制度だったりとかへまあゼロベースからやっぱり経験を紡ぐに対しての度量みたいなところって正直日本の方がやっぱり充実していると僕は思っているのでそういう意味だったら、早いタイミングから面白い環境に、要するにレジュメに欠けそうな環境に通り込まれる可能性という意味だったら、俺は日本からっていうのはありなのかなと。",
      "start": 634822,
      "end": 665179,
      "timestamp": "10:34"
    },
    {
      "speaker": "Ryo",
      "text": "は思いますけどね難しいですねどっちでもいいかなっていうのが僕の答え。",
      "start": 665179,
      "end": 671368,
      "timestamp": "11:05"
    },
    {
      "speaker": "B",
      "text": "かもしれないですどっちでもいいよね正直こっちでもちろんジュニアからっていうところでもう1回ねちょっと頑張って時間はかかるだろうし最初の職力積むのにやっぱり苦労はするんだろうけどそうです。",
      "start": 671368,
      "end": 682951,
      "timestamp": "11:11"
    },
    {
      "speaker": "Ryo",
      "text": "ねあと待つ必要もないのかなっていうのはあるんですよねさっき今言ってくれたように永住権持っててビザもあるしでジュニアでいいんですよって言ってるんでそんなに待つ必要もないのかなっていうのは思いつつまあねsreデヴォープス系はバンクーバーにはあんまりポジションがないっていう事実もあるので確かにそれを考えるとまあ日本でちょっと経験あるよっていうところから攻めるのはありかなとも思いつつ。",
      "start": 682951,
      "end": 713825,
      "timestamp": "11:22"
    },
    {
      "speaker": "B",
      "text": "そうですねバンクーバーのsreにいるフロックのメンバーなんてほとんどリモートだもんねどっかの会社。",
      "start": 713825,
      "end": 719648,
      "timestamp": "11:53"
    },
    {
      "speaker": "Ryo",
      "text": "のやっぱオフキーとか多分ここらへんはセナさんの方が多分詳しいと思うんですけどやっぱりなんかそのバンクーバーってそのサンフランシスコシアトルのあの拠点としてのイメージがあってでそこらへんをまあカナダとかバンクーバーに来る前に割とちゃんと揃えちゃってからあのバンクーバーのウェブの何だろう開発拠点として使ってる会社が多いのかなっていうイメージでで別にバンクーバーにもスタートアップとかが全くないわけではないけど、あんまりスタートアップにSRE、DevOpsにかけるお金がないとかっていうのがあると思うので、っていう風に僕は思ってるんですけど、。",
      "start": 719648,
      "end": 760108,
      "timestamp": "11:59"
    },
    {
      "speaker": "B",
      "text": "いやもう全く同じですね基本やっぱりそうねフロックのやっぱりメンバーにしてももうドスタートアップがもうビッグテクかみたいなやっぱり割と中間層がやっぱりバンクーバー少ないよねっていうの。",
      "start": 760118,
      "end": 771027,
      "timestamp": "12:40"
    },
    {
      "speaker": "Ryo",
      "text": "はやっぱあってそうですねうんそれであれば多分トロントの方がきっといいのかなとは思うんですけど僕あんまりまあトロントのあの市場に詳しくはないんですけど。",
      "start": 771027,
      "end": 780154,
      "timestamp": "12:51"
    },
    {
      "speaker": "B",
      "text": "いやでもやっぱそうっすよあのフロックのやっぱりメンバーなんかでもやっぱり言語だったりフレームワークだったりでやっぱりトロント選ぶ人やっぱいますもんねうーんそうそれこそやっぱりネイティブアプリ作るぞーみたいなところなんかもねあのiosだったりとかまあそういう人だったりとかまあその辺でやっぱりまあエンジニアさんなんかでもやっぱり正直バンクーバーは仕事少ないそうあの辺ってやっぱりでも中堅以上のねやっぱり規模というかあのある程度やっぱり人数揃ってやっぱりパワーのある会社じゃないとやっぱりネイティブエンジニアって正直雇いにくいから各デバイスごとによってエンジニアとはなくそういった意味でね、やっぱりある程度企業数も多くて中間層も充実していてなおかつ人口も多くてっていう部分のトロントの方に集中するのは正直あり。",
      "start": 780154,
      "end": 820218,
      "timestamp": "13:00"
    },
    {
      "speaker": "Ryo",
      "text": "ますよねそうですね僕も今の会社は大きい会社だけどSREDevOps系のポジションはバンクーバーオフィスにはなくて前の会社がそれこそトロントのあのちょっとまあそのそれこそ中堅企業ぐらいの大きさだったんですけどそこでは本当に3人いたかなデブオプス系の人がって感じだったんでそういうところにトロントでまあバンクーバーからであればまあ別にあのリモートでもね働けると思うんでそういうところに応募するかっていうする方が現実的ではあるのかなって感じですねそうです。",
      "start": 820218,
      "end": 857031,
      "timestamp": "13:40"
    },
    {
      "speaker": "B",
      "text": "ねバンクーバーでもいいけれども数は少ないだろうしDevOpsは確かにもうちょっとあるかなっていう気がするけどでもそれでもねDevOpsもSREもある程度企業と人数の規模がやっぱり必要な会社さんに必要な職種なのでやっぱりね人口多いトロントの方が多くはなるんだろう。",
      "start": 857031,
      "end": 874881,
      "timestamp": "14:17"
    },
    {
      "speaker": "Ryo",
      "text": "なと思いますねそうですねで、ジュニアでどのぐらいの給料が見込めるかっていうところなんですけど、どうなんだろう?SREとかDevOpsのジュニアってあんまり聞かないからね。",
      "start": 874881,
      "end": 888115,
      "timestamp": "14:34"
    },
    {
      "speaker": "B",
      "text": "間違いない。",
      "start": 888115,
      "end": 888645,
      "timestamp": "14:48"
    },
    {
      "speaker": "Ryo",
      "text": "てか、。",
      "start": 888645,
      "end": 889090,
      "timestamp": "14:48"
    },
    {
      "speaker": "B",
      "text": "SREにジュニアなんてわけあんの?って俺は思うんですけどね。",
      "start": 889090,
      "end": 891445,
      "timestamp": "14:49"
    },
    {
      "speaker": "Ryo",
      "text": "あるんかな?一応、ありはするんだけど、サンプル数が結構少ないと思う。だから、あんまりSREってところに注目せずに、会社の企業イメージみたいなのを作るとやっぱりそのさっき言ったように中堅ではあるじゃないですかそうですね中堅でジュニアっていう風に考えるのがまあ多分ジュニアのソフトエンジニアって考えるのが多分あの一番近そうだなって思うとジュニアまあジュニアインターミネートかなっていうとまあ100Kいくかいかないかぐらいなのかなって僕のイメージ的には思うんですけど瀬名さんどうですかいや、。",
      "start": 891445,
      "end": 931065,
      "timestamp": "14:51"
    },
    {
      "speaker": "B",
      "text": "そんなもんじゃないですか。ついこの間だってね、本当にドジュニアというか、ド初心者でカナダに来て、こっちへカレッジ行って就職したよっていう方が何人か出て、その人たちの中にね、ジュニアなんだけども100系越えの人が出てきて、割とね、最近なんかジュニアのそこと言うか、あの給与値のやっぱり平均がなんか上がってる感じアフロック見てると思うんですよね。でちょっと前だったら正直60系とかやっぱり70系くらいからやっぱりジュニアスタートだよねっていうのが割とテンプレだったのか最近ね割と本当に80、90って上がってきてるの。",
      "start": 931065,
      "end": 965547,
      "timestamp": "15:31"
    },
    {
      "speaker": "Ryo",
      "text": "で確かに上がってきてますね本当にそうそうマジ。",
      "start": 965547,
      "end": 968748,
      "timestamp": "16:05"
    },
    {
      "speaker": "B",
      "text": "かって俺はちょっとぶっちゃけびっくりしたけどなのでジュニアレベルでちゃんとしたといったら言い方悪いかもしれないけどちゃんとしたサース系の会社さんで人数もそれなりにいって規模もちゃんとあってっていうのだったら8090くらいからっていうふうに。",
      "start": 968748,
      "end": 984712,
      "timestamp": "16:08"
    },
    {
      "speaker": "Ryo",
      "text": "見といてもいいんじゃ。",
      "start": 984712,
      "end": 985293,
      "timestamp": "16:24"
    },
    {
      "speaker": "B",
      "text": "ないかなと思いますね。",
      "start": 985293,
      "end": 985973,
      "timestamp": "16:25"
    },
    {
      "speaker": "Ryo",
      "text": "なんか今ちょっと調べてみたら、ショッピファイ、カナダの大きい企業というか、IT系の大きい企業で有名なところで言うと、なんとなくですけど、100系から260系ぐらいまでSREもしくはDevOpsで撮ってるみたいなんで、まあそれで言うとショピファイは結構多分あの高めのレンジ設定をしていると思うのでまあそれ以外でもでもそれでも100Kぐらいいけるのかなみたいなのはありますよねそう。",
      "start": 986840,
      "end": 1019501,
      "timestamp": "16:26"
    },
    {
      "speaker": "B",
      "text": "ですねまあ純というかもうカナダ初のね会社のショピファイでやっぱりそのレベルっていうのがあるのでまあやっぱりねバンクーバーとかにあるテック企業ってそういう会社さんたちでやっぱり戦わないと人は取れないのでそうですね。",
      "start": 1019501,
      "end": 1031483,
      "timestamp": "16:59"
    },
    {
      "speaker": "Ryo",
      "text": "ねあとはねショッピファイ以外にもやっぱりそのあの少ないとはいえ多分大きい企業ビッグテックにアメリカとかのビッグテックとかからえっとポジション出しているところもあってまあそれ以上に出したりすると思うんでそれのサラリーにやっぱりちょっとあの持ち上げられるみたいなところある。",
      "start": 1032003,
      "end": 1048490,
      "timestamp": "17:12"
    },
    {
      "speaker": "B",
      "text": "じゃないですかありますねーこれちょっとカナダならではなとこ歩くないかなって思ってるのが日本でさ例えばビッグテック行ったらさそれ以外には行かないじゃんあの1回っていうかその例えば日本でグーグル入りましたって人がなんかタイバーエージェントに入りますってイメージ正直はないしでもなんか割とかーだってそういうのあるくないと思ってるのがあのアメリカの例えばビッグデッグ行きましたっていう人がなんかわけのわからんオファー額をもらってなんか30人くらいの規模なんかスタートアップに入ってたりするのがあるから割とその辺ってやっぱりちゃんとこっちの大きい会社に入った給与帯の待遇の人たちをちゃんと取ろうとする努力があるんだなっていうのは実はちょっと最近比べてて。",
      "start": 1048490,
      "end": 1088037,
      "timestamp": "17:28"
    },
    {
      "speaker": "Ryo",
      "text": "思うこと確かにそうですね、アメリカでもやっぱその大きい会社行った後に小さい会社に行くみたいな、でもその小さい会社も給料自体は結構近い金額は出してくれてて、RSUみたいな持株制度みたいなのを利用してちょっと多めにパブリックカンパニーを払ってくれるんだけど、でもパブリックじゃないところはそれに負けないように現金比率めちゃくちゃ高くしてるみたいなところとかも結構効くんでそうですね、そういう意味で言うと日本であんまりそういうの効かない。",
      "start": 1088037,
      "end": 1119472,
      "timestamp": "18:08"
    },
    {
      "speaker": "B",
      "text": "まあ株式、エクイティ系のもしかしたらそういう制度が整ってないからっていうのはあるかもしれないですけどね、その会社が大きくなった時に見れる夢がやっぱりちょっと狭いというか、ないので。",
      "start": 1119472,
      "end": 1131389,
      "timestamp": "18:39"
    },
    {
      "speaker": "Ryo",
      "text": "あとはなんかイメージなんですけど、間違ってたら申し訳ないんだけど、アメリカ系の大きい企業ってやっぱりそれでも忙しいじゃないですか、ちょっと。",
      "start": 1131389,
      "end": 1139754,
      "timestamp": "18:51"
    },
    {
      "speaker": "B",
      "text": "違いない。",
      "start": 1139754,
      "end": 1140205,
      "timestamp": "18:59"
    },
    {
      "speaker": "Ryo",
      "text": "そう、なんで、スタートアップになるとそれが結構緩やかになるというかあの楽になるイメージがあるんで給料が少し落としつつもあのちょっと楽かなみたいな僕が知ってるやっぱりアメリカの企業でアメリカのスタートアップで給料が高くてでカナダにもリモートのポジションあるって人たちまああのセナさんも何人か知ってると思うんですけどなんかちょっと楽そうだなとは思うんだなってイメージですけどいや俺。",
      "start": 1140205,
      "end": 1171435,
      "timestamp": "19:00"
    },
    {
      "speaker": "B",
      "text": "この間ちょうどさスパベースとレールウェイの話を聞いたばっかりだったからあのスパベースは有名じゃないですかであそこの一応対抗馬と言わないけどまぁね勝つぞ超えるぞみたいなのがやっぱレールウェイで最近ちょっとレールウェイ使い出してるんですけどレールウェイはまだまだやっぱりその進行形のね会社というかまぁシリーズも多分多分多分はソベス並には行ってないだろうしってなるとまぁスターでもあれはスタータプって言わないのかなぁシリーズ乗ったからかな何がともあれともレールウェイはもうアホみたいに忙しい。",
      "start": 1171435,
      "end": 1201329,
      "timestamp": "19:31"
    },
    {
      "speaker": "Ryo",
      "text": "らしいですよそうなんだまぁ会社にもやるのか。",
      "start": 1201329,
      "end": 1204592,
      "timestamp": "20:01"
    },
    {
      "speaker": "B",
      "text": "なぁはいでまぁわかんないけど少なくともスパベースとレールウェアを比べた人の話を聞くとスパベースの方が楽だって言ってたから。",
      "start": 1204592,
      "end": 1212451,
      "timestamp": "20:04"
    },
    {
      "speaker": "Ryo",
      "text": "楽そうだって言ってた。",
      "start": 1212451,
      "end": 1214312,
      "timestamp": "20:12"
    },
    {
      "speaker": "B",
      "text": "からやっぱりこうスタートアップで今からシリーズ乗っていくぞみたいなとこってバチクソ忙しいのかな副業ダメって言ってた。",
      "start": 1214312,
      "end": 1220174,
      "timestamp": "20:14"
    },
    {
      "speaker": "Ryo",
      "text": "しみたいなね確かにシリーズとかの場所にもよるのもあるかもしれないですね結構もうお金調達できてるところとかでエンジニアにも余裕あってなんかなんて言うんだろう、スタートアップだけどめちゃくちゃでかいみたいなところって結構あるじゃないですか。",
      "start": 1220174,
      "end": 1237239,
      "timestamp": "20:20"
    },
    {
      "speaker": "B",
      "text": "あるある。なんで未だにスタートアップやってんの?みたいなね、とこありますよね。",
      "start": 1237239,
      "end": 1240572,
      "timestamp": "20:37"
    },
    {
      "speaker": "Ryo",
      "text": "そういうところは結構なんか、ふんわりしてるというか。まあでも、さっきの話に戻ると、まあそういうところ結構お金出してくれてるイメージはありますよね、こっちだと。",
      "start": 1240572,
      "end": 1251032,
      "timestamp": "20:40"
    },
    {
      "speaker": "B",
      "text": "で、。",
      "start": 1251032,
      "end": 1251553,
      "timestamp": "20:51"
    },
    {
      "speaker": "Ryo",
      "text": "日本出ないのは何なんだろう。",
      "start": 1251553,
      "end": 1254896,
      "timestamp": "20:51"
    },
    {
      "speaker": "B",
      "text": "いやわかんねえ、何だろうね。",
      "start": 1254896,
      "end": 1256907,
      "timestamp": "20:54"
    },
    {
      "speaker": "Ryo",
      "text": "規模があるからやっぱり、なんかその、例えばこっちのショッピファイ、カナダのローカル企業であるショッピファイは、やっぱり英語を使われてるから、市場っていう点においては、競合をちゃんと他の国でも取りに行けるわけじゃないですか。でも日本のスタートアップだと、やっぱり日本語を使ってのビジネスになると、市場的にはやっぱり日本に限定されちゃうからそういう意味で言うとやっぱりちょっと市場は小さくはなる日本の日本にいる外資ITに比べてGogleとかAmazonだとかMicrosftに行くっていうのを。",
      "start": 1256907,
      "end": 1295284,
      "timestamp": "20:56"
    },
    {
      "speaker": "B",
      "text": "考えるとだからなんかその辺のパスなんか作りたいなって思うときあるけどななんか日本でねGogleとか行った人ってやっぱ化け物級にやっぱりレベル高いっていうのはもう最近話しててもわかったのでああいう人たちがねなんか日本のそういうスタートアップに海賊みたいのがなんかレールが作れるのが楽しいなと思いすなんかそれ全然。",
      "start": 1295284,
      "end": 1312039,
      "timestamp": "21:35"
    },
    {
      "speaker": "Ryo",
      "text": "起こんねーなーみたいなね難しいですね。なんか、一時期、帰った後のキャリアはどうしようかな、みたいなのを考えてた時期があって、それで、日本のスタートアップに行くのか、外資系のビッグテックみたいなところか、ファームみたいなところに行くのか、みたいなのを考えたときに、ちょっとやっぱり、最初、お金の考えると、Gogleだとかね、そういうところは結構、日本であっても、相当高い給料を出してくれているんで、そっちもありかなと思ったんですけど、でもやっぱなんか、Gogleはたぶんなんか別らしいですけど、結構やっぱローカライゼーションの仕事が多いと、面白い機能が作れないと、ちょっとなんかエンジニアとしての幸福度は下がるのではないかみたいなのを思って、だったら、僕としては、なんだろう、日本のスタートアップかなぁみたいなのを、考えてるんですけどでも確かにそれが例えばどうなんだろうgoleがじゃあ2000万もらえるんだとして日本のスタートアップが700万ですとかですかねだいたいいうと同じようなことをやってその差かみたいなのはあるからちょっとやっぱ確かに厳しいのは厳しいとは思います。",
      "start": 1312039,
      "end": 1390143,
      "timestamp": "21:52"
    },
    {
      "speaker": "B",
      "text": "だからそういうのに対してやっぱり夢見せるという意味でねなんかエクイティだったりとかその会社が大きくなっていくときにまあに応じてかなんか自分の報酬が大きくなっていくそういう夢の見せ方っていうのが多分スタートアップの常だとその辺のなんか法整備なのかエクイティ整備なのかわかんないけどあんまりなんか日本のスタートアップでそういう話あんま聞かない。",
      "start": 1390143,
      "end": 1410787,
      "timestamp": "23:10"
    },
    {
      "speaker": "Ryo",
      "text": "ですようんなんだろうなんかやっぱりソフトウェアエンジニアから経営者になってないから、。",
      "start": 1410787,
      "end": 1419344,
      "timestamp": "23:30"
    },
    {
      "speaker": "B",
      "text": "みたいな感じなのかな。重要性みたいなのと、なんか重みか、みたいなのがもしかしたらちょっと相違があるのかなとは思う。",
      "start": 1419344,
      "end": 1428515,
      "timestamp": "23:39"
    },
    {
      "speaker": "Ryo",
      "text": "なんかビジネスの方から来て、社長をやって、でエンジニアたちに、ソフトウェアを作らせるみたいなんで、日本の市場があると、その経営者の人たちはもうすでにお金は結構ちゃんともらえて幸せになるから、みたいな感じなのかな。なんか、北米だとやっぱり、Facebokもそうだし、僕が言ってるAsanaとかもそうですけど、ソフトウェアエンジニアがソフトウェアを作って、で、それが会社になって、で、お金とか集めて、その後ファブリックしてみたいな、そういうストーリーが結構多いじゃないですか。",
      "start": 1428515,
      "end": 1464245,
      "timestamp": "23:48"
    },
    {
      "speaker": "B",
      "text": "そうですね、間違いない。",
      "start": 1464255,
      "end": 1466196,
      "timestamp": "24:24"
    },
    {
      "speaker": "Ryo",
      "text": "そういうのがまだ生まれてなくて、エンジニアファーストみたいな文化のある会社はやっぱちょっと少ないのかなっていう。",
      "start": 1466196,
      "end": 1475162,
      "timestamp": "24:26"
    },
    {
      "speaker": "B",
      "text": "まあ、そうですね。まあ、だから両方じゃないですか、エンジニアファーストな文化の会社は、まあ、少なからずはやっぱあると思うけど、とはいえ、その人たちが多分勝ち抜けてなくて、勝っていると思うよね、間違いなくね、その日本の市場という中だと。でも世界も含めてやっぱり視野取ってっていうので勝ち抜けてしまうの多分まあ自分たちの社員の幸福まで祈れるようなため帰るような多分そういう仕組み組織作りかできる気がするけど多分日本で勝つっていうところが多分上下になるとおそらく幸せになるのなれるのって多分経営。",
      "start": 1475162,
      "end": 1504803,
      "timestamp": "24:35"
    },
    {
      "speaker": "Ryo",
      "text": "者だけでそうですねその。",
      "start": 1504803,
      "end": 1507326,
      "timestamp": "25:04"
    },
    {
      "speaker": "B",
      "text": "辺はちょっとある気がするかな俺はすいませんねちょっとなんか質問からずれてしまいましたがとは言えね戻るんだったらまあジュニアとしてのやっぱり給料っていうところだったらねやっぱりそのくらいやっぱりまあ上目指せるんじゃないかなとは思うのでそこはねでも俺この人でちょっと質問見てて思ったけどそもそもこの人ね日本でメガ弁入ってからまあ経験積んでからこっち来るって言ってるんでジュニアとしての就活は多分。",
      "start": 1507326,
      "end": 1529077,
      "timestamp": "25:07"
    },
    {
      "speaker": "Ryo",
      "text": "ないと思うんだよね確かに、どのぐらいを想定してるのかわかんないけど、なんか英語もできるみたいだし、ビザのリストリクションみたいなのもないから、英受験持ってるし、で、日本で経験も積んできたっていうと別に全然ジュニアで行かずとも、5年も6年も働くわけじゃないだろうから、インターミディエイトぐらいにはなれそうな感じはありそうですけどね。",
      "start": 1529077,
      "end": 1555738,
      "timestamp": "25:29"
    },
    {
      "speaker": "B",
      "text": "これでもやっぱり質問ずっと俺も相談受け続けてて思うところで、だから日本で2、3年の経験積んでても、いや私はちょっとまだまだ自信がないのでジュニアからですみたいな人って結構多いんですが、ムードとしてはどうなんでしょう?",
      "start": 1555738,
      "end": 1569790,
      "timestamp": "25:55"
    },
    {
      "speaker": "Ryo",
      "text": "知らないもの怖いっていうだけなんじゃないのかなってありますけどね。でも日本のエンジニアって結構レベル高いじゃないですか、技術レベルが。",
      "start": 1569790,
      "end": 1580715,
      "timestamp": "26:09"
    },
    {
      "speaker": "B",
      "text": "そうなのでね日本のメガ弁でちゃんと経験積みましたっていう人がねにまあわかんない本当にネスとかさがいたり何年経験積むのか次第だと思うけど確か1年とか1年未満とかで言うんだったらまあジュニアから探すのもありなんじゃないと思いつつまあ1年数に経験積むんだったら普通にインターミネートから探しても僕とかいいんじゃないか。",
      "start": 1580725,
      "end": 1598006,
      "timestamp": "26:20"
    },
    {
      "speaker": "Ryo",
      "text": "なと思いますそうですねまあでもあのそこらへんのなんだろうフレキシブルさみたいなのは大切なのかなとは思いますけどね結構こっち来てそのインターミデートというか自分はもうシニアなんだから例えばねシニアでしかあの受けませんとかっていうよりはえっとインターミデートでもシニアでもえっとジュニアでもいいからとりあえず受けて仕事をもらってねそこからまあなんか給料交渉するだったりだとかあのねはたまた転職するみたいなやっぱ難しいのって一番最初の会社じゃないですか本当にそうですそのフレキシブルさを持ってジュニアでもいいしインターミュレートでもいいからとりあえず受けてみるみたいなのはありなのかもしれない。",
      "start": 1598006,
      "end": 1637465,
      "timestamp": "26:38"
    },
    {
      "speaker": "B",
      "text": "ですねそうですね間違いないフロップのインタビュー記事にいるこの間ファーウェイ受けてまあすんなり入った人もそうですけどあの最初はやっぱりその人も日本で経験むっちゃったけどインターワーから入ってるんですよねその人ってインターン科でも入ってるけど日本での経験値結構高かったんで当然インターン科の中だったらもう頭2,3個分やっぱり飛び抜けてたからもう割とトントン拍子で数ヶ月後にはもうフルタイムになってそのままシニアポジションでシニアポジションだったかなインターミニとかシニア科で入ってるので入り口の部分がね仮にちょっとジュニアだろうがインターミニだろうがインターンだろうが何かしらかも分かんないけどそこの会社に入り込みさえすればアピールする機会なんてもう5万とあるわけでおだしょーあり。",
      "start": 1637465,
      "end": 1678416,
      "timestamp": "27:17"
    },
    {
      "speaker": "Ryo",
      "text": "ますねあとやっぱその昇進とかもあのちゃんとしてれば早いですしねあんまりなんかあのジュニアでこいつインターミーレートとかシニアのレベルあるけどあのジュニアのレベルで使ってやろうみたいな意地悪な人あんまいない。",
      "start": 1678416,
      "end": 1692087,
      "timestamp": "27:58"
    },
    {
      "speaker": "B",
      "text": "じゃないですかどんな会社おったら多分誰も寄りつかないから。",
      "start": 1692087,
      "end": 1695869,
      "timestamp": "28:12"
    },
    {
      "speaker": "Ryo",
      "text": "ねでもなんかさっき言ったようにまあ頭で頭でっかちにならずにとりあえずジュニアから自分のレベルぐらいまではとりあえず受けてみてとりあえず就職するってところが大切なの。",
      "start": 1695869,
      "end": 1708154,
      "timestamp": "28:15"
    },
    {
      "speaker": "B",
      "text": "かなお願いしますまあ引き続きあれだよねこのマシュマロ投手でもいいしあのーTwiter。",
      "start": 1708154,
      "end": 1714614,
      "timestamp": "28:28"
    },
    {
      "speaker": "Ryo",
      "text": "の方でもそうですねなんか質問してもらえたらちょっとどんどん答えていきたいなと。",
      "start": 1714614,
      "end": 1718694,
      "timestamp": "28:34"
    },
    {
      "speaker": "B",
      "text": "思います間違いないですまあこういった形でね取り上げることもあるかなと思います。",
      "start": 1718694,
      "end": 1722519,
      "timestamp": "28:38"
    },
    {
      "speaker": "Ryo",
      "text": "ねはいありがとうございましたはい。",
      "start": 1722519,
      "end": 1724461,
      "timestamp": "28:42"
    },
    {
      "speaker": "B",
      "text": "ありがとうございましたということ。",
      "start": 1724461,
      "end": 1726232,
      "timestamp": "28:44"
    },
    {
      "speaker": "Ryo",
      "text": "で最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 1726232,
      "end": 1743980,
      "timestamp": "28:46"
    }
  ]
}