{
  "episodeGuid": "33115e65-8fd7-4b72-98bd-62adc4124b7a",
  "episodeTitle": "日本の大企業からカナダでスタートアップへ！カオスな環境でPM兼デザイナー兼エンジニアとして奮闘（後半）#24",
  "transcribedAt": "2025-11-24T05:58:02.400Z",
  "duration": 2321,
  "fullText": "はいそしたら今回も前回に引き続きKojikenさんに来ていただきましたホストは毎度のことながら僕と東ヶ志涼とセナさん来てもらってやってますそしたらまたKojikenさん簡単な自己紹介でいいんで自己紹介からお願いしますはい。Kojikenと申します日本で5年半エンジニアした後CICCCのUXデザインコースに半年間通って今の会社で5月から5ヶ月間働い。ているという前回は英語のこととか渡航前にどういう風に技術だったら英語を勉強してきたあとはまあなんかこっちの転職活動から練習について聞いてきたんですけど今回はえっと何だろう働いてからみたいなところを聞いていきたいなぁと思うんですけどざっくりどうですか働いてみ。てそうですね日本にいた頃は結構大きめの企業で働いてたんですけど結構今までの働き方とは変わってきたな上。上級からいきなり6人のスタートアップなわけでしょそれは落差がひどいでしょしかもあれですよねKojikenさんってその2社でしか働いたこと多分ないっていうことよねバイトとかでおくんだったら落差がすごいっていうのもある。よね海外だとなんかジョブディスクリプションがあってそれに従って役割決められてるみたいなのを勝手に想像してるけど結構カオスというか何でもやれっていう感じ9。人だったらねマトリックスの組みようもないですもんね確か。にそれはそうかもしれないですねどうですか働いてみて幸せですかそれともあれ実は前の会社の前の日本の方が良かったなぁみたいなのあります。か結構なんだろう良かったかなっていうのは振り返ってみないと分からないかなとでもなんか今すごい大変だしコンフォートゾーンではないんですけど逆にそれが結構日本にいた頃望んでいたことであるんですが新しい経験ができたりとか不慣れな英語でコミュニケーションしたりとかっていうのが今後振り返ってきた時によかったんじゃないかなって思えるような。気はしてるカオスっていうのは具体的にどういうところがカオスなんですか?働いていてカオスってほどではないですけどちょっとまだ売り上げが立ってないサービスでこれから本当にコアとなるユーザーを見つけてそれそんなユーザーに課金してもらうみたいな段階なんですけどあんまり誰も現状を把握できてないというかなんかサービスの方向性を示せてないというかまだなんだろうフィットネス動画の配信プラットフォームなんですけどなんかダンスだったり筋トレだったりその動画を配信するプラットフォームなんですけど全然動画ユーザー増えてるんですけど全然動画は見られてなかったりとか一回見ても何日も見続けてくれるユーザーが僕が見た中で一人しかいなかったりとか出る中でどういう方向性を持っていけばいいのかっていうのが誰も示せてない感じそこをなんか自分が今設計してる。ようなことになってますマネータイズとかについてもまだあんまりちゃんと決められてなくてみたいな感じなんですか?そうですじゃあ結構本当にエンジニアやりながらPMみたいな動き方もしてるみたいなそうです。本当にあとUIXデザイン学んでよかった本当に今昼間でデザインしたりとかもし。たりとデザイナーの方いるって言ってなかったでしょ?そうなんですけどその方が今動画の撮影スタジオみたいなのがオフィスにあってその撮影担当の人が辞めちゃって今そっちのコーチがなんかオフィスに来てその撮影スタジオでクラスを撮るんですけどその撮影を結構やるのに時間を取られていてあ、。それをデザイナーの人がやられてるって感じなんですか?めちゃくちゃカオスですねそれプロジェクトマネージャー。みたいな感じで何でもやる人がいてその人が今もう撮影係。6人だとそういうもんなのかなぁまあだからいい経験ちゃいい経験ですよねおそらくはその運輸の初期のタイミングでいうはユーエックスのショットやるし今をさあ主人気。にもするしっていうctoだねじゃあ。ちょっと不思議といったらね多分日本にいらっしゃる経営者とかの人は多分不思議なんだろうなというものがやっぱりこういう初期のスタートアップって正直80Kって言ってもねこっちへもまあ別にミニマンなんだろうこっちのやっぱり中央値がソフトエンジニアの中央値が1千万超えてるからあぐるけど800万でねまあそれなりにちゃんと生活のことは意識してのやっぱり金額だと思うのでやっぱりそういう6人とかのスタートアップで、しかも売り上げも経ってないっていう段階でやっぱり出せるんだってね。もちろん多分出資とか受けてるのは多分資金を食いついなんでいるんだろうなと思いつつ、なんか日本だとその辺ってちょっと安く買い叩けるし、あのもうなんだったら、やる気と今後の希望だけを抱かせて400万くらいでなんかポケ使うよくある話かなーって思うんですけど、なんかその辺のスタートアップ文化を日本のは知らないっていう前提だと思いますが、やっぱりそうなんか一丸となって、あの北米市場で戦っていこうみたいな、そういう気概があっての、今のご大愚なのかなっていうのは思うんですが、その辺のKojikenさん的には、周りの人たちもそんなイメージで一緒に仕事しているのか、まあシャアなしにスタートアップっていう関係もまんじているっていう感じなのかそんなこと言わないと思うけどそれでいう。とそんなにシャアなしって感じはないのとあと多分ファンダーが1回エグゼットしててそこで多分資金がある程度入ったのがエグゼット経験。者になるとまたちょっと雰囲気変わりますもんね。ただ元々さん2Bでエグゼットしてて今回2Cでアンダーシステムは全然難しいっておっしゃってるんで。2C向けのビジネスを2Bの人がやろうとすると大体カオスになる印象しか。ない確かにまぁでもまぁいいふうに見ると英語とかはめちゃくちゃなんだろう自分の範囲を超えてやらないといけないと思うんでなんていうの?英語力とかは尽きそう?結構オフラインも集合で出社なんで英語も多少聞き取れなくてもなんかスクリーンして見ながらアダコーダー言えたりとか視覚的にコミュニケーションできるのでそこら辺は結構やりやすいかなって感じ。ちなみにオフィスはどちらにあるんですか?ノースバン?ノースバンとかにあるそれ。はもうノースバンから離れられ。ないなまあまあまあそこは置いといてえっとそうかじゃあもう全部自分でほぼプラットフォームを作るサイドはほぼ全部自分でやっててそのデザイナーの人とかがコンテンツを作りつつ感じ。なのかもう一人エンジニアがいてもともと僕webアプリケーション経験しかなかったんですけどiOSアプリとかも配信しててそれも早速やらせてもらえたりしててそれは。なんだろうリアクトネイティブとかですかもうスイフトでスイフトで書いてる。んだ逆にねなんかもともとリアクトネイティブで作ってて何かしらの問題があって、で、もうそういう人と、まだAndroiは出してないんですけど、もうネイティブでやろうっていうすごいスタートアップだ、。なんかこの頃聞かない、なんて言うんだろう、あのインタビューですねいや間違いない、。なんかいいのか悪いのかさておき、最近安定した人が多かったですよねいや、。そう、。業務内容的にも、なんでホワイトなんだって人が多かったなって思う中でなんか明日会社がどうなってるかわかんねえみたいなね私何させられるかわかんねえみたいなねいや。でもいいと思いますなんかまあ別になんだなんだろうこっちってそのあんま一つの会社にすげー長くいたりそんなしないんで別になんか変わり種でいいのかなーってまあ1年か2年でもまあ働いて別に転職すれば別に安定したところもいけるしなんかそういう経験があるのはすごいいいのかなーって僕は。思いますそうだし、なんかまあ俺の勝手な判断というか見解でしかないけど、まあ上場企業のやっぱり数百人数千人のやっぱり規模の会社にもいて、で、その後でまあ6人のスタートアップって、なんかレジュメ的にはかける幅がすごく広がりそうだなって、ちょっと思ってね、そういったところもあって、なんかもしかしたら次のキャリアはすごい面白いことにもなるのかな、まあもしかしたらね、今の会社が上場する可能性もなくてにしてもあるかもしれないし、そういう楽しいフェーズをね、たくさん経験されていると、。羨ましいこと。じゃあもう一人のエンジニアとはどういう風なコラボレーションというか一緒に働かれてるん。ですか本当に機能ごとに担当をアサインしてるのであんまり一緒に同じ機能をコラボレーションして作るというよりは本当に機能ごとに調合を調査してこういうUI、Xにするべきだみたいなところから今エンジニア自身が考えて実装までしてるみたいな。レビューとかは?僕はしてなくて、僕が書くコードは一応フルレグ出すんですけどほとんど多分チェックはされてないそう。なりますよねなんかその辺もだからもう今からとかでしょCICDとかテストとかその辺に関してもスルーとまで言わないけれども。いやもうとりあえず動くものってじゃなくてしかも機能単位の切り分けなんすよねアプリ単位じゃなくてその感じだとSwiftとWebとモバイルで分けるのかなって思ったら横。なんで横やんじゃあ。何ガッツリネイティブ触ってるってことですかリアクトだったりリアクトじゃなかったらそういう人。だったりそうっす本当にまぁ簡単な機能からいやでも本当に元の日本の会社いた頃は本当にコードの品質とか本当にエッジケースとかの考慮とかすごいレビューもめちゃくちゃ叩かれまくってなんとかアップルもらうみたいな経験してたんでまあそこのギャップは感じますけどエンジニアとしていやーもうちょっと品質なんかお相手のエンジニアにもうちょっと品質気使ってほしいなとか思うことありつつでもやっぱりファンダーが評価するのは動くものというかアウトプットの気持ちを分かり。つつしかもそのフェーズやったら正直次のピッチを生き残るとかどうにかシリーズに乗るとかそういう話だと思うから一生懸命フロントだけ動いていてなんかプレゼンテーションでうまいこと話せるんだったらもうそれがゴールだと思うしね多分その先のことっていうのは今は考えられないフェーズなんだろうなっていうのは容易に想像ついちゃいます。セキュリティ周りはもうちょっと見。てほしいあーまあそうね個人情報の応援とかはもうそういう話はないからす。ねいやーでもすごいスタートアップっぽい。というかねでもなん。かその安定したそういうなんだろうそこら辺がしっかりした会社では学べないこととかって結構いっぱいあると思うので例えばなんだそのセキュリティーについて自分から提案してみたりだとかなんかねレビューの仕組み作ったりだとかなんかその安定した会社とか大きい会社だともうなんかすでに仕組みがいっぱいあって自分でそこら辺作ってチームビルディングするみたいなこととかもあんまりできないというかあんまり機会がない中でまあそういう会社でこそなんかやれることとかいっぱいあるしそれはなんかまあ今の会社ではすっごい幸せっていうわけではないかもしれないけどその次のインタビューとかに行かせるのかなと思うんでまあまあでもそれでもやっぱりまあセナさんがさっき言ったようにスタートアップで800万もらってって言ったらね結構いいのかなって思いますけどなんか働く時間とかはどんな感じなんですか。10時、19時。日本と。10時、19時。8時間?9時間?9時間で休憩が。それも結構珍しいですね。珍しいね。日本じゃん。なんか決められてなくて。一応、契約書には10時間。1日10時間ペースで、たぶん残業代を、なんだろう。出さないっていうことを多分10時間に設定してやってるんですけど結構みんな多分8時間7時間ぐらいしかあんまりじゃない、。その仕組み的にはなんかちょいみなし残業が含まれてますよ的なニュアンスででもやっぱりカナダ人だから実質はみんなそこまで働いてない。みたいな感じ間違いないこれが日本だったら多分とんでもないことになってんだろうなってねギリギリまで使ってんだろう。なってKojikenさん自体はどうなんですか?どんな感じで働かれてるんですか?僕がその、10時、19時の人で、まあ、19時、19時半ぐらいで、最後まで結構オフィスに残ることが多くて、みんな結構、5時とか6時とか。でも、そのファウンダーの人も会社に怒られてるんですよね?たまーに来ます。あ、。たまーに。じゃあそんなあんまりなんかマイクロマネジメントではないけどそんな管理されてる感じじゃなくて、藤堅さんが自主的に残ってちょっとなんとかしようみたいな感じで働かれてる。日本の働き方が染み付いてます。なんかあれですねあの聞いた感じだとなんだろう環境に対応してあのいっぱい働いたりだとかなんかもともとすげーいい企業に大企業にいたけど小さい企業でもそれに合わせてやっていけるバイタリティみたいなのがありつつもそこはちゃんとくじまで守って働くんですね僕はあのこっちに来てもうすぐすぐそれに染まってで金曜日誰も30以降働かないのよみたいなラッキーみたいな感じで結構すぐ染まって日本人。の遺伝子をどこに捨ててきたのかっていう。ね働かなくていいんだったらじゃあそれでいいかみたいなパフォーマンスすればいいんだみたいな僕は結構もうすぐ。染まっちゃったなちなみに俺小川さんに逆に聞きたいんだけどさそういうなんか超大企業にいたっていう人が次のフェーズでスタートアップに移ってっていうキャリアの人たちとかってアサナみたいな大きい会社にいるのかなって思っていっぱいい。ますよめちゃくちゃいっぱいいている。んだやっぱ全職スタートアップみたい。な全職スタートアップも多いしその後スタートアップ行くって人も結構多いんじゃないですか。やっぱりそうっすよねなんかそれをイメージついてアサナとか大きいところ行ってなんかもう大体キャリアの上働くという点だと見えてきたから次はスタートアップっていうのはあるんだろうけどなんかそういう大企業行ってスタートアップ行ってまあまあいろいろあってっていうのでまぁ次またアサナみたいな大きい会社の人たちって割と普通なのかな。ってごめんなさい質問は元スタートアップでそこから大企業ですか?そうそう元スタートアップであ、。そっちか僕みたいなタイプです。ねそうだねどちらかというとなんかKojikenさんみたいな人が次例えば朝なみたいなケースってなんか割と普通なのかどうだろうか。そういうことかえっとねスタートアップっていうので言うとなんかSFのスタートアップとかも入ってくると結構あるんですよSFとかってやっぱりそのスタートアップとかでもあの技術者それこそ6人とかでも結構そのなんかしっかり決まっててそのもう始める時には結構そのなんていうのファンディングされてるみたいなところも多分多くてそういうところだとあんまり何か技術者のそのレベルとかその大企業スタートアップっていうのの違いはなくてそういう人はまあそうですねでも確かに働き方が違うそういうなんだろう小さい会社であんまりそのインタビューとかもまあちゃんとなんていうのリードコードをやってみたいななんかその段そういうなんだ王道のインタビューをやらない会社からだとやっぱりちょっとその難しさっていうのはありますよね。まあそうだよね雰囲気でしか俺はわかんないけどそういうのはあるなーって思ってそれこそトガシさんみたいに最初1社2社3社みたいな感じでなんか順当ななんか転職重ねてなんか浅なレベルにはとどり着かないのかなーって勝手に。想像はしててまあ別に何だろうその順当にっていうよりかはやっぱりそのリートコードとかそのシステムデザインとかそのCSのそのベーシックをちゃんと持ってるかどうかみたいなのを見られて基本的には見られてるんでそれさえできれば別にその小さい会社だからとか中規模だからとかっていうのはないけどもやっぱりそのなんか小さい会社とかってそのリートコードだったりシステムデザインのインタビューがないじゃないですかだからその日本人とかもあんまりそのエリートコード系得意じゃないじゃないですかそういう人たちからするとやっぱりその中小企業の方が入りやすいからそこに留まるっていう人も多いですしまあでもそういうのを自分で勉強して、僕もCSとか出たわけではないし結構小さいところにいた時は確かにそのリードコードとかはなくてでもそこから自分で勉強してっていう感じだったんで少なくはなるけどなくはないって感じです。ねだからシンプルに慣れの問題ってことですよねそのリードコードのシステムデザインなのっていうところが引き落とされて入った人たちはその次も多分引き落とされるんだろうしまあ慣れてるしねっていう。そうですねだからなんか大きい大きさというよりはその大きい企業でもなんかそのリード行動とかやらないところとかもあるじゃないですか例えばサース系じゃない会社とかだったりするとそういうところもあるんでなんかだからその結構多分リード行動とか嫌いな人すごい嫌いなんですよねその王道のインタビューっていうのがそのない範囲で結構動いてる人たちとある範囲で動く人たちがいるっていう感じ。あーまあそうかハーツみたいに分かれてたりするんだな。じゃあそうするといい会社って感じですかねというわけ。でじゃあ朝菜に行きましょう何がどうなのかいや。僕もリードコード嫌いなん。ですよねじゃあ嫌い界隈に。行きましょうでも全然なんだろうリードコード嫌いなんかね今までポッドキャストで出てきてくれた人でも結構なんだろそのリードコードをやらずに結構いい会社とか言ってるあの有名というかあのよく出てくるK君このポッドキャストにも出てもらったんですけど彼も別にそんなリードコードをやってるっていうイメージ。はないですよねないね。できないとかではないと思うけど結構それ以外でなんだろう確かに彼はどっちかというと実装力がすごいあってあとはなんか自己アピール英語も上手だしそこら辺でうまくいってる感じするんで別にリードコードだけ全てって感じじゃないんでまあなんか自分の得意な分野で輝けばいいのかなと思いますよ。すみませんなんか今スタートアップを楽しんでるって事件さんに停職の話をしてしまったって今振り返って思いましたがそういう道もある。というそしたらなんか仕事内容的に何だろうこれから取り組んでみたいこととかなんか関わってみたいことなんか今見えてる範囲とかでそうじゃなくても全然いいんですけどなんかやってみたいこととかあり。ますかいやーまあ売上を伸ばしたいですね日本にいた頃も最初にいたチームはもともとあったサービスをリニューアルするって感じ技術とかをリニューアルしてデータを移行するみたいなサービスでもう一個のチームでも新しい新規プロジェクトをグロースするみたいな経験ができてなくてやっぱ今回今回というかこっち来て転職活動する中で何か英文レジュメ書く中でいかにその自分がビジネスに貢献してきたかっていうのを語れるかっていうのはすごい重要なのかなっていうのを肌になって今回それをまさにチャレンジングであるありますけどもそういうチャンスなのかなと思うなるほど。確かにあの結構やっぱ数字を出すってレジュメに数字を書いていくっていうのって結構大切でエンジニアでもそのなんだろうこういう風なアチーブメントをなんかその訂正的にではなく定量的に測れるのってすごい大切でそれでもやっぱりなんかそのお金額とかまで意識しながら働けてるエンジニアってやっぱ少なくてそれを考えるとその本当ゼロから稼ぎあの会社で稼ぎましたって言ったら結構レジュメ的にはなんか話やすいしそのなんていうのあのエンジニアとかその聞く側も質問なんかすごい聞いてて面白いいい話になるのだと思うんでそこができるならぜひちょっと頑張ってほしいなーって感じですよね確かに。なんかトガシさんの前のレジュメ会の話はないけれども実際面接するときの場のなんか雰囲気だったりとか話す内容とか割と想像しやすいもんね数字をちゃんと。これだけ作りましたっていえ。ばレジュメの一部に書いてあるとどうやってって話はなりやすいと思うその辺確かにね日本での大企業の経験の中だとなんか欠けているっていう部分だったら今すごい良い経験してるのかもしれないです。よねいやそうですねなんかさっきも言ったようにそのチームビルディングに対してもそうだしお金そのグロースみたいなお金のところについてもそうだしないもの本当001のお仕事が多いと思うんでここらへんなんかいろんなものに取り組んでそのあんまりなんかエンジニアっていうことにエンジニアの仕事っていうのに限らずなんかなんだろビヘイビラルインタビューで聞かれるようなこともいっぱい多分経験として得られるだろうしそのまあグロースとかそのなんだエンジニアに求められるものみたいなのでもなんか別にただの開発だけじゃなくてなんかさっきセナさんが言ってたようにCLCIとかなんかバックエンドとかそのDevOpsみたいな働き方も多分自分でやらないといけないみたいなそのセットアップとかもでなると思うんでなんかそこら辺もできてすごいあのレジュメ的にはめちゃくちゃいいのかなすごいなんかあの直接的に褒めるのではなくてあの。その。うち役立つよねみたいな話し方だからすごいなんかあの今ので満足してないみたいな話になっちゃったらあれだけどでもそんなことはなくてと思うんでいや。ごめんね俺がちょっと最近何そのなんか日本から働くこっちで働きたいですの人の中で割とねレジュメに何書けばいいですかっていう質問を受けることが多くてそれでねちょっとKojikenさんみたいなポジションの人が書くんだったらどういう風に書くかなっていうのを想像しながらちょっとそっちに寄っちゃったけど転職しろという。話じゃないからまあでもなんかうんなんかこっちのゲームやっぱ転職とかそのレジュメとかそのレジュメにどういうことを書きたいかみたいなありきで結構働くってのよくあることなんでなんかちょっとそこはなんかまあ切っても切り離せないみたいなところはありますけどね確かになんか他に働き…あごめん。なさいいやなんかもっとbiツールとかで何かユーザー数の繊維とかなんかビジネスに関わる筋を日本に行った時に見とけば。よかったなうーんとはめちゃ。わかりますめっちゃそうですよね。書くときに忘れちゃってるん。でちなみにちょっと話戻るんですけどそのレジュメとか書くときにそのやっぱ数字とか意識して書かないととかってあるじゃないですかでもなんかもうこっち来ちゃって会社辞めちゃってるわけだからそこらへんなんかあの書きづらいとかあったと思うんですけどどういうふうになんだそこらへん書いたりだとか経歴の洗い出しみたいなされたの。か一応辞める前にその英文レジュメ書くことは意識してたんでまあ、数字とかをメモってはいたんですけど、それでもやっぱ、いざ書くってなった時に数字をメモった程度なんで、なんか日本にいて働いてる時から数字を意識して働けてたら、もっとなんだろう、ビジネスに貢献できたりとか、働き方のモチベとかも変わってたんじゃないかって。ちなみになんかその書き方、その英文のレジュメの書き方みたいなのはどういうところでその情報を手に入れ。られたんですか?レジュメを書くにあたって何か記憶があることがどんなことなのかみたいなのを知ってる人がそういうのを見たりとかブログ記事を読んだりとか実際に何か自分のレジュメそれから添削してくれみたいなのをレディットでいる人がいてそういうので他の人をどういうところ指摘。するのかなじゃあ結構もう自分で英語で情報取りに行ったって感じなんですねまたちょっと戻るんですけど、他に時間とか結構カオスだよっていう風に聞いてたんですけど、他にカルチャーショックではないけど、こういうところ違うなみたいな発見とかはありましたか?でも結構みんなすぐ帰りますね。スタートアップでまだ売り上げも経ってないんで、なんか日本だったら本当にもっとハードワークするような環境であると思うんですけどちゃんとなんだろうみんな帰るしあと普通に家族を優先するというか家族の用事があるから休むって言っても、ファウンダーもそれ喜んで、おーメイトーいいねー感じで勇気。とかも取れる余裕が違うんだろうね、そういうのって。たまに余裕がなんだろうなって思う。何なんだろうね。本当にそれで、なんでなんだろうね。僕会社やるとしたら絶対カナダではやらないぞって思ってるんですけど、日本とかやっぱスタートアップとか、アメリカでも、アメリカのレベルとかも、ファウンドされてるとか、ファンドされてるとかもいろいろあると思うけど、カナダ人ってすごい無い余裕がありますよね。うんうんなんだないはずな。のにうーんなんか俺の想像でしかないけどさアメリカのスタートアップで頑張るぞそらそうだとめっちゃお金儲かるしむっちゃお金入ってくるしシリーズちょっと一個上がっただけで何十億とか入ってくるからそらまあみんな頑張る決まってるよねって話があってで日本のそれはあの申し訳ないけど別にエクイティもらえるわけでもなければあのスタートで働いたところでなんか見返りでそんななくて正直キャリア的な意味で考えたとまあキャリア的にあるかもしれないで、もうみんなハードワークを求めるから、なんかちょっと辛いなっていう人が俺は話聞くことが多いなって気がしてて。で、。カナダのそれは、なんか中間地点な気がしてて。日本ほどカツカツじゃないし、言うて80K個はやっぱり出せるようなね。売上立ってなくてもそんくらいは出してくれるし。のくせになんか家族優先でっていう形でなんか6時には絶対帰るしなんだけどなんかアメリカほとんどでもそんな旨味を持ってるわけでもないけどお金は一応USDKはなんとかなるしみたいななんかそういう変な中間地点ないかなって気がしてんだよ。ねなんか確かにすごいチルです。よねチルではあるけどスタートアップの環境としては確かにちょっとどうなんていうの。はありますよね絶対カナダでスタートアップするべきじゃないと思う。でもなんかでもたまにいるよねーでもみんな帰っちゃうっていうのもあるけどたまになんかそれこそチキアートさんって僕は尊敬する経営者でフリッカー作ってスラック作ってって人とかバンクーバーの人ってで作ったのはバンクーバーなんだけどもうその後すぐアメリカ行ってるからねやっぱりうん確かにだから作る瞬間バンクーバーはありだと思うんですよまあ割と安い金額で人に雇えるからでも、ちょっとでも霊に乗り出したりとか、ちょっとでも調達の空気が流れ出した瞬間にもアメリカ行くみたいな人が、俺多い気がするなっていうかね、。ちょっと。まあまあ、確かにそれを踏まえても、やっぱカナダは安いのか、アメリカに比べると。アメリカ比べれば、そりゃ安いでしょ。半分以下だろう、。たぶん。時信じて考えたらね。はいそしたらえっとなんだろう今後の展望というかまあ今の会社だけに留まらずこういうふうなキャリアを歩んでいきたいなぁとかでありますか正直自分。はそうなんだろうロングタームで考えてないというかその時々で好奇心があるところとかやりたいと思ったことをやって続けたのあんまりないっちゃないんですけどまずは目先の売り上げを立ってグロース経験を得たい。っていうところじゃああの会社に貢献するというあれはでもprとかは別に狙ってないぜでしたっけ。あのKojikenさんA受験。そう。ですなんかもともとは帰らざるを得ない状況にはなりたくないなと思っうんめちゃくちゃ撮りたいって言うわけでもんもともとその妻もは掘りとって自分のは掘りとワークビザをつなげてその間に条件を目指すっていうプランだったのも配偶者がワーホリ取っててもその配偶者はワークビザ取るのが難しいっていう条件があってそうです。配偶者ビザは配偶者の一方の人が働いていたら取れるけどねっていうのはワーホリあるだけだったらそれは取れないっていう部分に変わっちゃいましたもんね制度がね去年くらいから。じゃあもともとはまずは2、3年いてからその後は考えようかなみたいな感じで来られてたんですか?大半そうですよブロック使ってる人たちも大半は永住権ファーストって人ほぼいないです。よねそうですねまあでも別に永住権持ってる人たちもそういうわけでもなくなんか聞いたところに。よると。永住権取った方がキャリア的にいいらしいみたいなのを聞いてでまあねあの僕とかもそうなんですけどちょっといい時期に来てなんかたまたまアプライして取れたからみたいな人が多いのかなっていう印象ですよねそうだ。ねまあだからKojikenさんの場合もまあ例に漏れずっていう形は別に目標にしてるわけじゃないよっていうことでまあ基本はじゃあ泡彫りはまだあと1年残ってるんでしたっけ?そうですねあと10ヶ月くらい。10ヶ月くらいかじゃあ長期的に考えると、まあ日本には帰ろうかなとは思ってる感じですか?そうそしたらえっと最後に結構なんだろうな最後にというか結構あの行動力だったりだとかなんか日本にいる時から英語の勉強とかレジュメの英語のレジュメを書く準備みたいなの結構されてたと思うんですけどなんか自分のような経験すでにエンジニアとしての経験があってっていう人になんかアドバイスできるなってアドバイスするとしたらどんなアドバイスをしてあげられそう。ですか。お金さえあれば現地に来たらなんとか。なるかなって思いますとりあえず金を貯めてこいとなんか。結構日本と違ってバンクバー海底市場で何百件アプライしても受からないみたいないう話は聞いてたんでなんかその100件なのか200件なのかそこをアプライしきればまあ一社からは内定が出ると思ったんだよなんだろうそういう持ち上でなんだろう淡々となんかアプライしてで感触があったところに受けて一生懸命なんかクローンサイト作ったりできることしてやり続けたらなんとか内定をいただけた思い切って仲間を見つけてやることやれば仕事。はできるのかなと聞いた感じだとやることやればっていうやることっていうのの結構水準は高いのかなっていうさっきのクローンサイト作るだったりとかインタビューだからそのしてもらえるってなってからその会社について調べてやられてるわけじゃないですかレジュメについてもやっぱり日本にいる時からも意識してそこらへんなんか調べてるってのはなんだろう行動力だけではなくなんだろうすごいなんだろうな準備されてるなというかいうのを感じます。けどねなんかフロックの皆さんってすごいなんか準備してる印象があって自分に比べたら本当皆さん準備してる印象。があっていやそんなことはないでしょーって言っちゃったら怒ら。れるからただ一つ言えるのは準備した人は確かに準備ちゃんとしてきてしてあの情報発信してる人たちはそうかもしれないですね準備してうまくいってるんでそういう人たちはやっぱ準備してるなんかそれが見えやすいっていうのは多いかもしれないですよねただなんかそれ全員が全員ってわけではないのかなっていうふうなパンチはしますけどねそう。ですねまぁフログ運営してる人間が言うのもなんだけれどもあのそうできる限り伝えようとはしてるけどねそのさっきのまあなに日本にいううちからできればレジュメのこととか考えてねーだったりとか巻かれラスは答えるとなんですけどやっぱ自分から能動的にねなんか聞いてくれたりとか動いたり調べたりする人じゃないとその辺て何言っても響かないな正直なところなのやっぱりまあ確かに上積みだけ見るとねすごい調べてる気がしますが割と俺もKojikenさん並と言ったら言い方悪いけれどもちゃんとちゃんと調べてねしかも何でしょうねやってること自体がやっぱりすごく理にかなってるよね広報なあの路線をやっぱり歩まれてる部だと思う歩まれたりするかと思うこの辺はねなかなかちょっと僕らも実は課題として思っているからみんながみんなって確かにちょっと違うかもしれないのでぜひ聞いてる人はねKojikenさんみたいな路線が読めるように自然にちょっといろんな情報収集とねまあそれこそフログにも聞いてくれればなぁと思う確かに。そうですねはいそれでは締めようかなと思います今回はKojikenさんに来ていただきましたありがとうございましたありがとうございましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcasoubetなyどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "はいそしたら今回も前回に引き続きKojikenさんに来ていただきましたホストは毎度のことながら僕と東ヶ志涼とセナさん来てもらってやってますそしたらまたKojikenさん簡単な自己紹介でいいんで自己紹介からお願いしますはい。",
      "start": 8,
      "end": 17152,
      "timestamp": "00:00"
    },
    {
      "speaker": "Kojiken",
      "text": "Kojikenと申します日本で5年半エンジニアした後CICCCのUXデザインコースに半年間通って今の会社で5月から5ヶ月間働い。",
      "start": 17152,
      "end": 32778,
      "timestamp": "00:17"
    },
    {
      "speaker": "Ryo",
      "text": "ているという前回は英語のこととか渡航前にどういう風に技術だったら英語を勉強してきたあとはまあなんかこっちの転職活動から練習について聞いてきたんですけど今回はえっと何だろう働いてからみたいなところを聞いていきたいなぁと思うんですけどざっくりどうですか働いてみ。",
      "start": 32778,
      "end": 59081,
      "timestamp": "00:32"
    },
    {
      "speaker": "Kojiken",
      "text": "てそうですね日本にいた頃は結構大きめの企業で働いてたんですけど結構今までの働き方とは変わってきたな上。",
      "start": 59081,
      "end": 77726,
      "timestamp": "00:59"
    },
    {
      "speaker": "Senna",
      "text": "上級からいきなり6人のスタートアップなわけでしょそれは落差がひどいでしょしかもあれですよねKojikenさんってその2社でしか働いたこと多分ないっていうことよねバイトとかでおくんだったら落差がすごいっていうのもある。",
      "start": 77726,
      "end": 94639,
      "timestamp": "01:17"
    },
    {
      "speaker": "Kojiken",
      "text": "よね海外だとなんかジョブディスクリプションがあってそれに従って役割決められてるみたいなのを勝手に想像してるけど結構カオスというか何でもやれっていう感じ9。",
      "start": 94639,
      "end": 109860,
      "timestamp": "01:34"
    },
    {
      "speaker": "Senna",
      "text": "人だったらねマトリックスの組みようもないですもんね確か。",
      "start": 109860,
      "end": 113242,
      "timestamp": "01:49"
    },
    {
      "speaker": "Ryo",
      "text": "にそれはそうかもしれないですねどうですか働いてみて幸せですかそれともあれ実は前の会社の前の日本の方が良かったなぁみたいなのあります。",
      "start": 113242,
      "end": 123510,
      "timestamp": "01:53"
    },
    {
      "speaker": "Kojiken",
      "text": "か結構なんだろう良かったかなっていうのは振り返ってみないと分からないかなとでもなんか今すごい大変だしコンフォートゾーンではないんですけど逆にそれが結構日本にいた頃望んでいたことであるんですが新しい経験ができたりとか不慣れな英語でコミュニケーションしたりとかっていうのが今後振り返ってきた時によかったんじゃないかなって思えるような。",
      "start": 123510,
      "end": 155732,
      "timestamp": "02:03"
    },
    {
      "speaker": "Ryo",
      "text": "気はしてるカオスっていうのは具体的にどういうところがカオスなんですか?",
      "start": 155732,
      "end": 162728,
      "timestamp": "02:35"
    },
    {
      "speaker": "Kojiken",
      "text": "働いていてカオスってほどではないですけどちょっとまだ売り上げが立ってないサービスでこれから本当にコアとなるユーザーを見つけてそれそんなユーザーに課金してもらうみたいな段階なんですけどあんまり誰も現状を把握できてないというかなんかサービスの方向性を示せてないというかまだなんだろうフィットネス動画の配信プラットフォームなんですけどなんかダンスだったり筋トレだったりその動画を配信するプラットフォームなんですけど全然動画ユーザー増えてるんですけど全然動画は見られてなかったりとか一回見ても何日も見続けてくれるユーザーが僕が見た中で一人しかいなかったりとか出る中でどういう方向性を持っていけばいいのかっていうのが誰も示せてない感じそこをなんか自分が今設計してる。",
      "start": 162728,
      "end": 236830,
      "timestamp": "02:42"
    },
    {
      "speaker": "Ryo",
      "text": "ようなことになってますマネータイズとかについてもまだあんまりちゃんと決められてなくてみたいな感じなんですか?そうですじゃあ結構本当にエンジニアやりながらPMみたいな動き方もしてるみたいなそうです。",
      "start": 236830,
      "end": 259759,
      "timestamp": "03:56"
    },
    {
      "speaker": "Kojiken",
      "text": "本当にあとUIXデザイン学んでよかった本当に今昼間でデザインしたりとかもし。",
      "start": 261190,
      "end": 270594,
      "timestamp": "04:21"
    },
    {
      "speaker": "Ryo",
      "text": "たりとデザイナーの方いるって言ってなかったでしょ?",
      "start": 270594,
      "end": 275496,
      "timestamp": "04:30"
    },
    {
      "speaker": "Kojiken",
      "text": "そうなんですけどその方が今動画の撮影スタジオみたいなのがオフィスにあってその撮影担当の人が辞めちゃって今そっちのコーチがなんかオフィスに来てその撮影スタジオでクラスを撮るんですけどその撮影を結構やるのに時間を取られていてあ、。",
      "start": 275496,
      "end": 302552,
      "timestamp": "04:35"
    },
    {
      "speaker": "Ryo",
      "text": "それをデザイナーの人がやられてるって感じなんですか?めちゃくちゃカオスですねそれプロジェクトマネージャー。",
      "start": 302552,
      "end": 308946,
      "timestamp": "05:02"
    },
    {
      "speaker": "Kojiken",
      "text": "みたいな感じで何でもやる人がいてその人が今もう撮影係。",
      "start": 308946,
      "end": 314310,
      "timestamp": "05:08"
    },
    {
      "speaker": "Senna",
      "text": "6人だとそういうもんなのかなぁまあだからいい経験ちゃいい経験ですよねおそらくはその運輸の初期のタイミングでいうはユーエックスのショットやるし今をさあ主人気。",
      "start": 317227,
      "end": 328275,
      "timestamp": "05:17"
    },
    {
      "speaker": "Ryo",
      "text": "にもするしっていうctoだねじゃあ。",
      "start": 328275,
      "end": 331937,
      "timestamp": "05:28"
    },
    {
      "speaker": "Senna",
      "text": "ちょっと不思議といったらね多分日本にいらっしゃる経営者とかの人は多分不思議なんだろうなというものがやっぱりこういう初期のスタートアップって正直80Kって言ってもねこっちへもまあ別にミニマンなんだろうこっちのやっぱり中央値がソフトエンジニアの中央値が1千万超えてるからあぐるけど800万でねまあそれなりにちゃんと生活のことは意識してのやっぱり金額だと思うのでやっぱりそういう6人とかのスタートアップで、しかも売り上げも経ってないっていう段階でやっぱり出せるんだってね。もちろん多分出資とか受けてるのは多分資金を食いついなんでいるんだろうなと思いつつ、なんか日本だとその辺ってちょっと安く買い叩けるし、あのもうなんだったら、やる気と今後の希望だけを抱かせて400万くらいでなんかポケ使うよくある話かなーって思うんですけど、なんかその辺のスタートアップ文化を日本のは知らないっていう前提だと思いますが、やっぱりそうなんか一丸となって、あの北米市場で戦っていこうみたいな、そういう気概があっての、今のご大愚なのかなっていうのは思うんですが、その辺のKojikenさん的には、周りの人たちもそんなイメージで一緒に仕事しているのか、まあシャアなしにスタートアップっていう関係もまんじているっていう感じなのかそんなこと言わないと思うけどそれでいう。",
      "start": 335976,
      "end": 411896,
      "timestamp": "05:35"
    },
    {
      "speaker": "Kojiken",
      "text": "とそんなにシャアなしって感じはないのとあと多分ファンダーが1回エグゼットしててそこで多分資金がある程度入ったのがエグゼット経験。",
      "start": 411896,
      "end": 428027,
      "timestamp": "06:51"
    },
    {
      "speaker": "Senna",
      "text": "者になるとまたちょっと雰囲気変わりますもんね。",
      "start": 428027,
      "end": 429968,
      "timestamp": "07:08"
    },
    {
      "speaker": "Kojiken",
      "text": "ただ元々さん2Bでエグゼットしてて今回2Cでアンダーシステムは全然難しいっておっしゃってるんで。",
      "start": 432588,
      "end": 443413,
      "timestamp": "07:12"
    },
    {
      "speaker": "Senna",
      "text": "2C向けのビジネスを2Bの人がやろうとすると大体カオスになる印象しか。",
      "start": 443413,
      "end": 449936,
      "timestamp": "07:23"
    },
    {
      "speaker": "Ryo",
      "text": "ない確かにまぁでもまぁいいふうに見ると英語とかはめちゃくちゃなんだろう自分の範囲を超えてやらないといけないと思うんでなんていうの?英語力とかは尽きそう?",
      "start": 449936,
      "end": 468261,
      "timestamp": "07:29"
    },
    {
      "speaker": "Kojiken",
      "text": "結構オフラインも集合で出社なんで英語も多少聞き取れなくてもなんかスクリーンして見ながらアダコーダー言えたりとか視覚的にコミュニケーションできるのでそこら辺は結構やりやすいかなって感じ。",
      "start": 468261,
      "end": 485796,
      "timestamp": "07:48"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみにオフィスはどちらにあるんですか?ノースバン?ノースバンとかにあるそれ。",
      "start": 488606,
      "end": 494407,
      "timestamp": "08:08"
    },
    {
      "speaker": "Senna",
      "text": "はもうノースバンから離れられ。",
      "start": 494407,
      "end": 497368,
      "timestamp": "08:14"
    },
    {
      "speaker": "Ryo",
      "text": "ないなまあまあまあそこは置いといてえっとそうかじゃあもう全部自分でほぼプラットフォームを作るサイドはほぼ全部自分でやっててそのデザイナーの人とかがコンテンツを作りつつ感じ。",
      "start": 497368,
      "end": 514232,
      "timestamp": "08:17"
    },
    {
      "speaker": "Kojiken",
      "text": "なのかもう一人エンジニアがいてもともと僕webアプリケーション経験しかなかったんですけどiOSアプリとかも配信しててそれも早速やらせてもらえたりしててそれは。",
      "start": 514232,
      "end": 530225,
      "timestamp": "08:34"
    },
    {
      "speaker": "Ryo",
      "text": "なんだろうリアクトネイティブとかですかもうスイフトでスイフトで書いてる。",
      "start": 530225,
      "end": 536907,
      "timestamp": "08:50"
    },
    {
      "speaker": "Kojiken",
      "text": "んだ逆にねなんかもともとリアクトネイティブで作ってて何かしらの問題があって、で、もうそういう人と、まだAndroiは出してないんですけど、もうネイティブでやろうっていうすごいスタートアップだ、。",
      "start": 536907,
      "end": 555580,
      "timestamp": "08:56"
    },
    {
      "speaker": "Ryo",
      "text": "なんかこの頃聞かない、なんて言うんだろう、あのインタビューですねいや間違いない、。",
      "start": 555580,
      "end": 562585,
      "timestamp": "09:15"
    },
    {
      "speaker": "Senna",
      "text": "なんかいいのか悪いのかさておき、最近安定した人が多かったですよねいや、。",
      "start": 562585,
      "end": 567028,
      "timestamp": "09:22"
    },
    {
      "speaker": "Ryo",
      "text": "そう、。",
      "start": 567028,
      "end": 568009,
      "timestamp": "09:27"
    },
    {
      "speaker": "Senna",
      "text": "業務内容的にも、なんでホワイトなんだって人が多かったなって思う中でなんか明日会社がどうなってるかわかんねえみたいなね私何させられるかわかんねえみたいなねいや。",
      "start": 568009,
      "end": 579625,
      "timestamp": "09:28"
    },
    {
      "speaker": "Ryo",
      "text": "でもいいと思いますなんかまあ別になんだなんだろうこっちってそのあんま一つの会社にすげー長くいたりそんなしないんで別になんか変わり種でいいのかなーってまあ1年か2年でもまあ働いて別に転職すれば別に安定したところもいけるしなんかそういう経験があるのはすごいいいのかなーって僕は。",
      "start": 579625,
      "end": 602732,
      "timestamp": "09:39"
    },
    {
      "speaker": "Senna",
      "text": "思いますそうだし、なんかまあ俺の勝手な判断というか見解でしかないけど、まあ上場企業のやっぱり数百人数千人のやっぱり規模の会社にもいて、で、その後でまあ6人のスタートアップって、なんかレジュメ的にはかける幅がすごく広がりそうだなって、ちょっと思ってね、そういったところもあって、なんかもしかしたら次のキャリアはすごい面白いことにもなるのかな、まあもしかしたらね、今の会社が上場する可能性もなくてにしてもあるかもしれないし、そういう楽しいフェーズをね、たくさん経験されていると、。",
      "start": 602732,
      "end": 632388,
      "timestamp": "10:02"
    },
    {
      "speaker": "Ryo",
      "text": "羨ましいこと。じゃあもう一人のエンジニアとはどういう風なコラボレーションというか一緒に働かれてるん。",
      "start": 632388,
      "end": 644780,
      "timestamp": "10:32"
    },
    {
      "speaker": "Kojiken",
      "text": "ですか本当に機能ごとに担当をアサインしてるのであんまり一緒に同じ機能をコラボレーションして作るというよりは本当に機能ごとに調合を調査してこういうUI、Xにするべきだみたいなところから今エンジニア自身が考えて実装までしてるみたいな。",
      "start": 644780,
      "end": 673398,
      "timestamp": "10:44"
    },
    {
      "speaker": "Ryo",
      "text": "レビューとかは?",
      "start": 673398,
      "end": 677250,
      "timestamp": "11:13"
    },
    {
      "speaker": "Kojiken",
      "text": "僕はしてなくて、僕が書くコードは一応フルレグ出すんですけどほとんど多分チェックはされてないそう。",
      "start": 677250,
      "end": 686086,
      "timestamp": "11:17"
    },
    {
      "speaker": "Senna",
      "text": "なりますよねなんかその辺もだからもう今からとかでしょCICDとかテストとかその辺に関してもスルーとまで言わないけれども。",
      "start": 686086,
      "end": 697071,
      "timestamp": "11:26"
    },
    {
      "speaker": "Ryo",
      "text": "いやもうとりあえず動くものってじゃなくてしかも機能単位の切り分けなんすよねアプリ単位じゃなくてその感じだとSwiftとWebとモバイルで分けるのかなって思ったら横。",
      "start": 697071,
      "end": 715375,
      "timestamp": "11:37"
    },
    {
      "speaker": "Kojiken",
      "text": "なんで横やんじゃあ。",
      "start": 715375,
      "end": 717937,
      "timestamp": "11:55"
    },
    {
      "speaker": "Senna",
      "text": "何ガッツリネイティブ触ってるってことですかリアクトだったりリアクトじゃなかったらそういう人。",
      "start": 717937,
      "end": 723059,
      "timestamp": "11:57"
    },
    {
      "speaker": "Kojiken",
      "text": "だったりそうっす本当にまぁ簡単な機能からいやでも本当に元の日本の会社いた頃は本当にコードの品質とか本当にエッジケースとかの考慮とかすごいレビューもめちゃくちゃ叩かれまくってなんとかアップルもらうみたいな経験してたんでまあそこのギャップは感じますけどエンジニアとしていやーもうちょっと品質なんかお相手のエンジニアにもうちょっと品質気使ってほしいなとか思うことありつつでもやっぱりファンダーが評価するのは動くものというかアウトプットの気持ちを分かり。",
      "start": 723059,
      "end": 766206,
      "timestamp": "12:03"
    },
    {
      "speaker": "Senna",
      "text": "つつしかもそのフェーズやったら正直次のピッチを生き残るとかどうにかシリーズに乗るとかそういう話だと思うから一生懸命フロントだけ動いていてなんかプレゼンテーションでうまいこと話せるんだったらもうそれがゴールだと思うしね多分その先のことっていうのは今は考えられないフェーズなんだろうなっていうのは容易に想像ついちゃいます。",
      "start": 766206,
      "end": 786037,
      "timestamp": "12:46"
    },
    {
      "speaker": "Kojiken",
      "text": "セキュリティ周りはもうちょっと見。",
      "start": 788516,
      "end": 790078,
      "timestamp": "13:08"
    },
    {
      "speaker": "Senna",
      "text": "てほしいあーまあそうね個人情報の応援とかはもうそういう話はないからす。",
      "start": 790078,
      "end": 795085,
      "timestamp": "13:10"
    },
    {
      "speaker": "Ryo",
      "text": "ねいやーでもすごいスタートアップっぽい。",
      "start": 795085,
      "end": 799611,
      "timestamp": "13:15"
    },
    {
      "speaker": "Senna",
      "text": "というかねでもなん。",
      "start": 799611,
      "end": 802195,
      "timestamp": "13:19"
    },
    {
      "speaker": "Ryo",
      "text": "かその安定したそういうなんだろうそこら辺がしっかりした会社では学べないこととかって結構いっぱいあると思うので例えばなんだそのセキュリティーについて自分から提案してみたりだとかなんかねレビューの仕組み作ったりだとかなんかその安定した会社とか大きい会社だともうなんかすでに仕組みがいっぱいあって自分でそこら辺作ってチームビルディングするみたいなこととかもあんまりできないというかあんまり機会がない中でまあそういう会社でこそなんかやれることとかいっぱいあるしそれはなんかまあ今の会社ではすっごい幸せっていうわけではないかもしれないけどその次のインタビューとかに行かせるのかなと思うんでまあまあでもそれでもやっぱりまあセナさんがさっき言ったようにスタートアップで800万もらってって言ったらね結構いいのかなって思いますけどなんか働く時間とかはどんな感じなんですか。",
      "start": 802195,
      "end": 855899,
      "timestamp": "13:22"
    },
    {
      "speaker": "Kojiken",
      "text": "10時、19時。日本と。",
      "start": 858356,
      "end": 862147,
      "timestamp": "14:18"
    },
    {
      "speaker": "Ryo",
      "text": "10時、19時。8時間?9時間?",
      "start": 862147,
      "end": 867979,
      "timestamp": "14:22"
    },
    {
      "speaker": "Kojiken",
      "text": "9時間で休憩が。",
      "start": 867979,
      "end": 872161,
      "timestamp": "14:27"
    },
    {
      "speaker": "Ryo",
      "text": "それも結構珍しいですね。",
      "start": 872161,
      "end": 873551,
      "timestamp": "14:32"
    },
    {
      "speaker": "Senna",
      "text": "珍しいね。日本じゃん。",
      "start": 873551,
      "end": 876322,
      "timestamp": "14:33"
    },
    {
      "speaker": "Kojiken",
      "text": "なんか決められてなくて。一応、契約書には10時間。1日10時間ペースで、たぶん残業代を、なんだろう。出さないっていうことを多分10時間に設定してやってるんですけど結構みんな多分8時間7時間ぐらいしかあんまりじゃない、。",
      "start": 876322,
      "end": 900842,
      "timestamp": "14:36"
    },
    {
      "speaker": "Ryo",
      "text": "その仕組み的にはなんかちょいみなし残業が含まれてますよ的なニュアンスででもやっぱりカナダ人だから実質はみんなそこまで働いてない。",
      "start": 900842,
      "end": 911357,
      "timestamp": "15:00"
    },
    {
      "speaker": "Senna",
      "text": "みたいな感じ間違いないこれが日本だったら多分とんでもないことになってんだろうなってねギリギリまで使ってんだろう。",
      "start": 911357,
      "end": 917960,
      "timestamp": "15:11"
    },
    {
      "speaker": "Ryo",
      "text": "なってKojikenさん自体はどうなんですか?どんな感じで働かれてるんですか?",
      "start": 917960,
      "end": 922475,
      "timestamp": "15:17"
    },
    {
      "speaker": "Kojiken",
      "text": "僕がその、10時、19時の人で、まあ、19時、19時半ぐらいで、最後まで結構オフィスに残ることが多くて、みんな結構、5時とか6時とか。",
      "start": 922475,
      "end": 936409,
      "timestamp": "15:22"
    },
    {
      "speaker": "Ryo",
      "text": "でも、そのファウンダーの人も会社に怒られてるんですよね?",
      "start": 936409,
      "end": 940772,
      "timestamp": "15:36"
    },
    {
      "speaker": "Kojiken",
      "text": "たまーに来ます。",
      "start": 940782,
      "end": 942122,
      "timestamp": "15:40"
    },
    {
      "speaker": "Senna",
      "text": "あ、。",
      "start": 942122,
      "end": 942293,
      "timestamp": "15:42"
    },
    {
      "speaker": "Ryo",
      "text": "たまーに。じゃあそんなあんまりなんかマイクロマネジメントではないけどそんな管理されてる感じじゃなくて、藤堅さんが自主的に残ってちょっとなんとかしようみたいな感じで働かれてる。",
      "start": 942293,
      "end": 955857,
      "timestamp": "15:42"
    },
    {
      "speaker": "Kojiken",
      "text": "日本の働き方が染み付いてます。",
      "start": 955857,
      "end": 960918,
      "timestamp": "15:55"
    },
    {
      "speaker": "Ryo",
      "text": "なんかあれですねあの聞いた感じだとなんだろう環境に対応してあのいっぱい働いたりだとかなんかもともとすげーいい企業に大企業にいたけど小さい企業でもそれに合わせてやっていけるバイタリティみたいなのがありつつもそこはちゃんとくじまで守って働くんですね僕はあのこっちに来てもうすぐすぐそれに染まってで金曜日誰も30以降働かないのよみたいなラッキーみたいな感じで結構すぐ染まって日本人。",
      "start": 962457,
      "end": 996653,
      "timestamp": "16:02"
    },
    {
      "speaker": "Senna",
      "text": "の遺伝子をどこに捨ててきたのかっていう。",
      "start": 996653,
      "end": 998094,
      "timestamp": "16:36"
    },
    {
      "speaker": "Ryo",
      "text": "ね働かなくていいんだったらじゃあそれでいいかみたいなパフォーマンスすればいいんだみたいな僕は結構もうすぐ。",
      "start": 998094,
      "end": 1007921,
      "timestamp": "16:38"
    },
    {
      "speaker": "Senna",
      "text": "染まっちゃったなちなみに俺小川さんに逆に聞きたいんだけどさそういうなんか超大企業にいたっていう人が次のフェーズでスタートアップに移ってっていうキャリアの人たちとかってアサナみたいな大きい会社にいるのかなって思っていっぱいい。",
      "start": 1007921,
      "end": 1022589,
      "timestamp": "16:47"
    },
    {
      "speaker": "Ryo",
      "text": "ますよめちゃくちゃいっぱいいている。",
      "start": 1022589,
      "end": 1024250,
      "timestamp": "17:02"
    },
    {
      "speaker": "Senna",
      "text": "んだやっぱ全職スタートアップみたい。",
      "start": 1024250,
      "end": 1026392,
      "timestamp": "17:04"
    },
    {
      "speaker": "Ryo",
      "text": "な全職スタートアップも多いしその後スタートアップ行くって人も結構多いんじゃないですか。",
      "start": 1026392,
      "end": 1033490,
      "timestamp": "17:06"
    },
    {
      "speaker": "Senna",
      "text": "やっぱりそうっすよねなんかそれをイメージついてアサナとか大きいところ行ってなんかもう大体キャリアの上働くという点だと見えてきたから次はスタートアップっていうのはあるんだろうけどなんかそういう大企業行ってスタートアップ行ってまあまあいろいろあってっていうのでまぁ次またアサナみたいな大きい会社の人たちって割と普通なのかな。",
      "start": 1033490,
      "end": 1053042,
      "timestamp": "17:13"
    },
    {
      "speaker": "Ryo",
      "text": "ってごめんなさい質問は元スタートアップでそこから大企業ですか?",
      "start": 1053042,
      "end": 1059846,
      "timestamp": "17:33"
    },
    {
      "speaker": "Senna",
      "text": "そうそう元スタートアップであ、。",
      "start": 1059846,
      "end": 1061187,
      "timestamp": "17:39"
    },
    {
      "speaker": "Ryo",
      "text": "そっちか僕みたいなタイプです。",
      "start": 1061187,
      "end": 1062768,
      "timestamp": "17:41"
    },
    {
      "speaker": "Senna",
      "text": "ねそうだねどちらかというとなんかKojikenさんみたいな人が次例えば朝なみたいなケースってなんか割と普通なのかどうだろうか。",
      "start": 1062768,
      "end": 1073377,
      "timestamp": "17:42"
    },
    {
      "speaker": "Ryo",
      "text": "そういうことかえっとねスタートアップっていうので言うとなんかSFのスタートアップとかも入ってくると結構あるんですよSFとかってやっぱりそのスタートアップとかでもあの技術者それこそ6人とかでも結構そのなんかしっかり決まっててそのもう始める時には結構そのなんていうのファンディングされてるみたいなところも多分多くてそういうところだとあんまり何か技術者のそのレベルとかその大企業スタートアップっていうのの違いはなくてそういう人はまあそうですねでも確かに働き方が違うそういうなんだろう小さい会社であんまりそのインタビューとかもまあちゃんとなんていうのリードコードをやってみたいななんかその段そういうなんだ王道のインタビューをやらない会社からだとやっぱりちょっとその難しさっていうのはありますよね。",
      "start": 1073377,
      "end": 1131265,
      "timestamp": "17:53"
    },
    {
      "speaker": "Senna",
      "text": "まあそうだよね雰囲気でしか俺はわかんないけどそういうのはあるなーって思ってそれこそトガシさんみたいに最初1社2社3社みたいな感じでなんか順当ななんか転職重ねてなんか浅なレベルにはとどり着かないのかなーって勝手に。",
      "start": 1131265,
      "end": 1143516,
      "timestamp": "18:51"
    },
    {
      "speaker": "Ryo",
      "text": "想像はしててまあ別に何だろうその順当にっていうよりかはやっぱりそのリートコードとかそのシステムデザインとかそのCSのそのベーシックをちゃんと持ってるかどうかみたいなのを見られて基本的には見られてるんでそれさえできれば別にその小さい会社だからとか中規模だからとかっていうのはないけどもやっぱりそのなんか小さい会社とかってそのリートコードだったりシステムデザインのインタビューがないじゃないですかだからその日本人とかもあんまりそのエリートコード系得意じゃないじゃないですかそういう人たちからするとやっぱりその中小企業の方が入りやすいからそこに留まるっていう人も多いですしまあでもそういうのを自分で勉強して、僕もCSとか出たわけではないし結構小さいところにいた時は確かにそのリードコードとかはなくてでもそこから自分で勉強してっていう感じだったんで少なくはなるけどなくはないって感じです。",
      "start": 1143516,
      "end": 1205446,
      "timestamp": "19:03"
    },
    {
      "speaker": "Senna",
      "text": "ねだからシンプルに慣れの問題ってことですよねそのリードコードのシステムデザインなのっていうところが引き落とされて入った人たちはその次も多分引き落とされるんだろうしまあ慣れてるしねっていう。",
      "start": 1205446,
      "end": 1214951,
      "timestamp": "20:05"
    },
    {
      "speaker": "Ryo",
      "text": "そうですねだからなんか大きい大きさというよりはその大きい企業でもなんかそのリード行動とかやらないところとかもあるじゃないですか例えばサース系じゃない会社とかだったりするとそういうところもあるんでなんかだからその結構多分リード行動とか嫌いな人すごい嫌いなんですよねその王道のインタビューっていうのがそのない範囲で結構動いてる人たちとある範囲で動く人たちがいるっていう感じ。",
      "start": 1216178,
      "end": 1241353,
      "timestamp": "20:16"
    },
    {
      "speaker": "Senna",
      "text": "あーまあそうかハーツみたいに分かれてたりするんだな。",
      "start": 1241353,
      "end": 1244074,
      "timestamp": "20:41"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあそうするといい会社って感じですかねというわけ。",
      "start": 1244074,
      "end": 1249317,
      "timestamp": "20:44"
    },
    {
      "speaker": "Senna",
      "text": "でじゃあ朝菜に行きましょう何がどうなのかいや。",
      "start": 1249317,
      "end": 1253580,
      "timestamp": "20:49"
    },
    {
      "speaker": "Kojiken",
      "text": "僕もリードコード嫌いなん。",
      "start": 1253580,
      "end": 1255202,
      "timestamp": "20:53"
    },
    {
      "speaker": "Senna",
      "text": "ですよねじゃあ嫌い界隈に。",
      "start": 1255202,
      "end": 1257423,
      "timestamp": "20:55"
    },
    {
      "speaker": "Ryo",
      "text": "行きましょうでも全然なんだろうリードコード嫌いなんかね今までポッドキャストで出てきてくれた人でも結構なんだろそのリードコードをやらずに結構いい会社とか言ってるあの有名というかあのよく出てくるK君このポッドキャストにも出てもらったんですけど彼も別にそんなリードコードをやってるっていうイメージ。",
      "start": 1257423,
      "end": 1281123,
      "timestamp": "20:57"
    },
    {
      "speaker": "Senna",
      "text": "はないですよねないね。",
      "start": 1281123,
      "end": 1282805,
      "timestamp": "21:21"
    },
    {
      "speaker": "Ryo",
      "text": "できないとかではないと思うけど結構それ以外でなんだろう確かに彼はどっちかというと実装力がすごいあってあとはなんか自己アピール英語も上手だしそこら辺でうまくいってる感じするんで別にリードコードだけ全てって感じじゃないんでまあなんか自分の得意な分野で輝けばいいのかなと思いますよ。",
      "start": 1282805,
      "end": 1304018,
      "timestamp": "21:22"
    },
    {
      "speaker": "Senna",
      "text": "すみませんなんか今スタートアップを楽しんでるって事件さんに停職の話をしてしまったって今振り返って思いましたがそういう道もある。",
      "start": 1304310,
      "end": 1311175,
      "timestamp": "21:44"
    },
    {
      "speaker": "Ryo",
      "text": "というそしたらなんか仕事内容的に何だろうこれから取り組んでみたいこととかなんか関わってみたいことなんか今見えてる範囲とかでそうじゃなくても全然いいんですけどなんかやってみたいこととかあり。",
      "start": 1311175,
      "end": 1327326,
      "timestamp": "21:51"
    },
    {
      "speaker": "Kojiken",
      "text": "ますかいやーまあ売上を伸ばしたいですね日本にいた頃も最初にいたチームはもともとあったサービスをリニューアルするって感じ技術とかをリニューアルしてデータを移行するみたいなサービスでもう一個のチームでも新しい新規プロジェクトをグロースするみたいな経験ができてなくてやっぱ今回今回というかこっち来て転職活動する中で何か英文レジュメ書く中でいかにその自分がビジネスに貢献してきたかっていうのを語れるかっていうのはすごい重要なのかなっていうのを肌になって今回それをまさにチャレンジングであるありますけどもそういうチャンスなのかなと思うなるほど。",
      "start": 1327326,
      "end": 1387283,
      "timestamp": "22:07"
    },
    {
      "speaker": "Ryo",
      "text": "確かにあの結構やっぱ数字を出すってレジュメに数字を書いていくっていうのって結構大切でエンジニアでもそのなんだろうこういう風なアチーブメントをなんかその訂正的にではなく定量的に測れるのってすごい大切でそれでもやっぱりなんかそのお金額とかまで意識しながら働けてるエンジニアってやっぱ少なくてそれを考えるとその本当ゼロから稼ぎあの会社で稼ぎましたって言ったら結構レジュメ的にはなんか話やすいしそのなんていうのあのエンジニアとかその聞く側も質問なんかすごい聞いてて面白いいい話になるのだと思うんでそこができるならぜひちょっと頑張ってほしいなーって感じですよね確かに。",
      "start": 1389272,
      "end": 1434695,
      "timestamp": "23:09"
    },
    {
      "speaker": "Senna",
      "text": "なんかトガシさんの前のレジュメ会の話はないけれども実際面接するときの場のなんか雰囲気だったりとか話す内容とか割と想像しやすいもんね数字をちゃんと。",
      "start": 1434695,
      "end": 1443861,
      "timestamp": "23:54"
    },
    {
      "speaker": "Ryo",
      "text": "これだけ作りましたっていえ。",
      "start": 1443861,
      "end": 1444961,
      "timestamp": "24:03"
    },
    {
      "speaker": "Senna",
      "text": "ばレジュメの一部に書いてあるとどうやってって話はなりやすいと思うその辺確かにね日本での大企業の経験の中だとなんか欠けているっていう部分だったら今すごい良い経験してるのかもしれないです。",
      "start": 1444961,
      "end": 1455247,
      "timestamp": "24:04"
    },
    {
      "speaker": "Ryo",
      "text": "よねいやそうですねなんかさっきも言ったようにそのチームビルディングに対してもそうだしお金そのグロースみたいなお金のところについてもそうだしないもの本当001のお仕事が多いと思うんでここらへんなんかいろんなものに取り組んでそのあんまりなんかエンジニアっていうことにエンジニアの仕事っていうのに限らずなんかなんだろビヘイビラルインタビューで聞かれるようなこともいっぱい多分経験として得られるだろうしそのまあグロースとかそのなんだエンジニアに求められるものみたいなのでもなんか別にただの開発だけじゃなくてなんかさっきセナさんが言ってたようにCLCIとかなんかバックエンドとかそのDevOpsみたいな働き方も多分自分でやらないといけないみたいなそのセットアップとかもでなると思うんでなんかそこら辺もできてすごいあのレジュメ的にはめちゃくちゃいいのかなすごいなんかあの直接的に褒めるのではなくてあの。",
      "start": 1455247,
      "end": 1511414,
      "timestamp": "24:15"
    },
    {
      "speaker": "Senna",
      "text": "その。",
      "start": 1513138,
      "end": 1513358,
      "timestamp": "25:13"
    },
    {
      "speaker": "Ryo",
      "text": "うち役立つよねみたいな話し方だからすごいなんかあの今ので満足してないみたいな話になっちゃったらあれだけどでもそんなことはなくてと思うんでいや。",
      "start": 1513358,
      "end": 1525865,
      "timestamp": "25:13"
    },
    {
      "speaker": "Senna",
      "text": "ごめんね俺がちょっと最近何そのなんか日本から働くこっちで働きたいですの人の中で割とねレジュメに何書けばいいですかっていう質問を受けることが多くてそれでねちょっとKojikenさんみたいなポジションの人が書くんだったらどういう風に書くかなっていうのを想像しながらちょっとそっちに寄っちゃったけど転職しろという。",
      "start": 1525865,
      "end": 1542718,
      "timestamp": "25:25"
    },
    {
      "speaker": "Ryo",
      "text": "話じゃないからまあでもなんかうんなんかこっちのゲームやっぱ転職とかそのレジュメとかそのレジュメにどういうことを書きたいかみたいなありきで結構働くってのよくあることなんでなんかちょっとそこはなんかまあ切っても切り離せないみたいなところはありますけどね確かになんか他に働き…あごめん。",
      "start": 1542718,
      "end": 1564162,
      "timestamp": "25:42"
    },
    {
      "speaker": "Kojiken",
      "text": "なさいいやなんかもっとbiツールとかで何かユーザー数の繊維とかなんかビジネスに関わる筋を日本に行った時に見とけば。",
      "start": 1564162,
      "end": 1574854,
      "timestamp": "26:04"
    },
    {
      "speaker": "Ryo",
      "text": "よかったなうーんとはめちゃ。",
      "start": 1574854,
      "end": 1577136,
      "timestamp": "26:14"
    },
    {
      "speaker": "Senna",
      "text": "わかりますめっちゃそうですよね。",
      "start": 1577136,
      "end": 1579478,
      "timestamp": "26:17"
    },
    {
      "speaker": "Kojiken",
      "text": "書くときに忘れちゃってるん。",
      "start": 1579478,
      "end": 1581160,
      "timestamp": "26:19"
    },
    {
      "speaker": "Ryo",
      "text": "でちなみにちょっと話戻るんですけどそのレジュメとか書くときにそのやっぱ数字とか意識して書かないととかってあるじゃないですかでもなんかもうこっち来ちゃって会社辞めちゃってるわけだからそこらへんなんかあの書きづらいとかあったと思うんですけどどういうふうになんだそこらへん書いたりだとか経歴の洗い出しみたいなされたの。",
      "start": 1581160,
      "end": 1602547,
      "timestamp": "26:21"
    },
    {
      "speaker": "Kojiken",
      "text": "か一応辞める前にその英文レジュメ書くことは意識してたんでまあ、数字とかをメモってはいたんですけど、それでもやっぱ、いざ書くってなった時に数字をメモった程度なんで、なんか日本にいて働いてる時から数字を意識して働けてたら、もっとなんだろう、ビジネスに貢献できたりとか、働き方のモチベとかも変わってたんじゃないかって。",
      "start": 1602547,
      "end": 1636411,
      "timestamp": "26:42"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみになんかその書き方、その英文のレジュメの書き方みたいなのはどういうところでその情報を手に入れ。",
      "start": 1636421,
      "end": 1642687,
      "timestamp": "27:16"
    },
    {
      "speaker": "Kojiken",
      "text": "られたんですか?レジュメを書くにあたって何か記憶があることがどんなことなのかみたいなのを知ってる人がそういうのを見たりとかブログ記事を読んだりとか実際に何か自分のレジュメそれから添削してくれみたいなのをレディットでいる人がいてそういうので他の人をどういうところ指摘。",
      "start": 1642687,
      "end": 1667488,
      "timestamp": "27:22"
    },
    {
      "speaker": "Ryo",
      "text": "するのかなじゃあ結構もう自分で英語で情報取りに行ったって感じなんですねまたちょっと戻るんですけど、他に時間とか結構カオスだよっていう風に聞いてたんですけど、他にカルチャーショックではないけど、こういうところ違うなみたいな発見とかはありましたか?",
      "start": 1667488,
      "end": 1691499,
      "timestamp": "27:47"
    },
    {
      "speaker": "Kojiken",
      "text": "でも結構みんなすぐ帰りますね。スタートアップでまだ売り上げも経ってないんで、なんか日本だったら本当にもっとハードワークするような環境であると思うんですけどちゃんとなんだろうみんな帰るしあと普通に家族を優先するというか家族の用事があるから休むって言っても、ファウンダーもそれ喜んで、おーメイトーいいねー感じで勇気。",
      "start": 1691499,
      "end": 1723772,
      "timestamp": "28:11"
    },
    {
      "speaker": "Senna",
      "text": "とかも取れる余裕が違うんだろうね、そういうのって。たまに余裕がなんだろうなって思う。",
      "start": 1723772,
      "end": 1731731,
      "timestamp": "28:43"
    },
    {
      "speaker": "Ryo",
      "text": "何なんだろうね。",
      "start": 1731731,
      "end": 1732742,
      "timestamp": "28:51"
    },
    {
      "speaker": "Senna",
      "text": "本当にそれで、なんでなんだろうね。",
      "start": 1732742,
      "end": 1735433,
      "timestamp": "28:52"
    },
    {
      "speaker": "Ryo",
      "text": "僕会社やるとしたら絶対カナダではやらないぞって思ってるんですけど、日本とかやっぱスタートアップとか、アメリカでも、アメリカのレベルとかも、ファウンドされてるとか、ファンドされてるとかもいろいろあると思うけど、カナダ人ってすごい無い余裕がありますよね。うんうんなんだないはずな。",
      "start": 1735433,
      "end": 1755892,
      "timestamp": "28:55"
    },
    {
      "speaker": "Senna",
      "text": "のにうーんなんか俺の想像でしかないけどさアメリカのスタートアップで頑張るぞそらそうだとめっちゃお金儲かるしむっちゃお金入ってくるしシリーズちょっと一個上がっただけで何十億とか入ってくるからそらまあみんな頑張る決まってるよねって話があってで日本のそれはあの申し訳ないけど別にエクイティもらえるわけでもなければあのスタートで働いたところでなんか見返りでそんななくて正直キャリア的な意味で考えたとまあキャリア的にあるかもしれないで、もうみんなハードワークを求めるから、なんかちょっと辛いなっていう人が俺は話聞くことが多いなって気がしてて。",
      "start": 1755892,
      "end": 1791143,
      "timestamp": "29:15"
    },
    {
      "speaker": "Ryo",
      "text": "で、。",
      "start": 1791143,
      "end": 1791323,
      "timestamp": "29:51"
    },
    {
      "speaker": "Senna",
      "text": "カナダのそれは、なんか中間地点な気がしてて。日本ほどカツカツじゃないし、言うて80K個はやっぱり出せるようなね。売上立ってなくてもそんくらいは出してくれるし。のくせになんか家族優先でっていう形でなんか6時には絶対帰るしなんだけどなんかアメリカほとんどでもそんな旨味を持ってるわけでもないけどお金は一応USDKはなんとかなるしみたいななんかそういう変な中間地点ないかなって気がしてんだよ。",
      "start": 1791323,
      "end": 1818375,
      "timestamp": "29:51"
    },
    {
      "speaker": "Ryo",
      "text": "ねなんか確かにすごいチルです。",
      "start": 1818375,
      "end": 1822456,
      "timestamp": "30:18"
    },
    {
      "speaker": "Senna",
      "text": "よねチルではあるけどスタートアップの環境としては確かにちょっとどうなんていうの。",
      "start": 1822456,
      "end": 1826957,
      "timestamp": "30:22"
    },
    {
      "speaker": "Ryo",
      "text": "はありますよね絶対カナダでスタートアップするべきじゃないと思う。",
      "start": 1826957,
      "end": 1830258,
      "timestamp": "30:26"
    },
    {
      "speaker": "Senna",
      "text": "でもなんかでもたまにいるよねーでもみんな帰っちゃうっていうのもあるけどたまになんかそれこそチキアートさんって僕は尊敬する経営者でフリッカー作ってスラック作ってって人とかバンクーバーの人ってで作ったのはバンクーバーなんだけどもうその後すぐアメリカ行ってるからねやっぱりうん確かにだから作る瞬間バンクーバーはありだと思うんですよまあ割と安い金額で人に雇えるからでも、ちょっとでも霊に乗り出したりとか、ちょっとでも調達の空気が流れ出した瞬間にもアメリカ行くみたいな人が、俺多い気がするなっていうかね、。",
      "start": 1832439,
      "end": 1864635,
      "timestamp": "30:32"
    },
    {
      "speaker": "Ryo",
      "text": "ちょっと。まあまあ、確かにそれを踏まえても、やっぱカナダは安いのか、アメリカに比べると。",
      "start": 1864635,
      "end": 1869008,
      "timestamp": "31:04"
    },
    {
      "speaker": "Senna",
      "text": "アメリカ比べれば、そりゃ安いでしょ。半分以下だろう、。",
      "start": 1869008,
      "end": 1871540,
      "timestamp": "31:09"
    },
    {
      "speaker": "Ryo",
      "text": "たぶん。時信じて考えたらね。はいそしたらえっとなんだろう今後の展望というかまあ今の会社だけに留まらずこういうふうなキャリアを歩んでいきたいなぁとかでありますか正直自分。",
      "start": 1871540,
      "end": 1891941,
      "timestamp": "31:11"
    },
    {
      "speaker": "Kojiken",
      "text": "はそうなんだろうロングタームで考えてないというかその時々で好奇心があるところとかやりたいと思ったことをやって続けたのあんまりないっちゃないんですけどまずは目先の売り上げを立ってグロース経験を得たい。",
      "start": 1891941,
      "end": 1919700,
      "timestamp": "31:31"
    },
    {
      "speaker": "Senna",
      "text": "っていうところじゃああの会社に貢献するというあれはでもprとかは別に狙ってないぜでしたっけ。",
      "start": 1919700,
      "end": 1927827,
      "timestamp": "31:59"
    },
    {
      "speaker": "Kojiken",
      "text": "あのKojikenさんA受験。",
      "start": 1927827,
      "end": 1931791,
      "timestamp": "32:07"
    },
    {
      "speaker": "Ryo",
      "text": "そう。",
      "start": 1936123,
      "end": 1936243,
      "timestamp": "32:16"
    },
    {
      "speaker": "Kojiken",
      "text": "ですなんかもともとは帰らざるを得ない状況にはなりたくないなと思っうんめちゃくちゃ撮りたいって言うわけでもんもともとその妻もは掘りとって自分のは掘りとワークビザをつなげてその間に条件を目指すっていうプランだったのも配偶者がワーホリ取っててもその配偶者はワークビザ取るのが難しいっていう条件があってそうです。",
      "start": 1936243,
      "end": 1970507,
      "timestamp": "32:16"
    },
    {
      "speaker": "Senna",
      "text": "配偶者ビザは配偶者の一方の人が働いていたら取れるけどねっていうのはワーホリあるだけだったらそれは取れないっていう部分に変わっちゃいましたもんね制度がね去年くらいから。",
      "start": 1970507,
      "end": 1980290,
      "timestamp": "32:50"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあもともとはまずは2、3年いてからその後は考えようかなみたいな感じで来られてたんですか?",
      "start": 1983387,
      "end": 1990771,
      "timestamp": "33:03"
    },
    {
      "speaker": "Senna",
      "text": "大半そうですよブロック使ってる人たちも大半は永住権ファーストって人ほぼいないです。",
      "start": 1990771,
      "end": 1995553,
      "timestamp": "33:10"
    },
    {
      "speaker": "Ryo",
      "text": "よねそうですねまあでも別に永住権持ってる人たちもそういうわけでもなくなんか聞いたところに。",
      "start": 1995553,
      "end": 2005778,
      "timestamp": "33:15"
    },
    {
      "speaker": "Senna",
      "text": "よると。",
      "start": 2005778,
      "end": 2006038,
      "timestamp": "33:25"
    },
    {
      "speaker": "Ryo",
      "text": "永住権取った方がキャリア的にいいらしいみたいなのを聞いてでまあねあの僕とかもそうなんですけどちょっといい時期に来てなんかたまたまアプライして取れたからみたいな人が多いのかなっていう印象ですよねそうだ。",
      "start": 2007744,
      "end": 2022991,
      "timestamp": "33:27"
    },
    {
      "speaker": "Senna",
      "text": "ねまあだからKojikenさんの場合もまあ例に漏れずっていう形は別に目標にしてるわけじゃないよっていうことでまあ基本はじゃあ泡彫りはまだあと1年残ってるんでしたっけ?",
      "start": 2022991,
      "end": 2032945,
      "timestamp": "33:42"
    },
    {
      "speaker": "Kojiken",
      "text": "そうですねあと10ヶ月くらい。",
      "start": 2032945,
      "end": 2036117,
      "timestamp": "33:52"
    },
    {
      "speaker": "Ryo",
      "text": "10ヶ月くらいかじゃあ長期的に考えると、まあ日本には帰ろうかなとは思ってる感じですか?そうそしたらえっと最後に結構なんだろうな最後にというか結構あの行動力だったりだとかなんか日本にいる時から英語の勉強とかレジュメの英語のレジュメを書く準備みたいなの結構されてたと思うんですけどなんか自分のような経験すでにエンジニアとしての経験があってっていう人になんかアドバイスできるなってアドバイスするとしたらどんなアドバイスをしてあげられそう。",
      "start": 2036117,
      "end": 2074574,
      "timestamp": "33:56"
    },
    {
      "speaker": "Senna",
      "text": "ですか。",
      "start": 2074574,
      "end": 2074754,
      "timestamp": "34:34"
    },
    {
      "speaker": "Kojiken",
      "text": "お金さえあれば現地に来たらなんとか。",
      "start": 2082818,
      "end": 2086020,
      "timestamp": "34:42"
    },
    {
      "speaker": "Ryo",
      "text": "なるかなって思いますとりあえず金を貯めてこいとなんか。",
      "start": 2086020,
      "end": 2095663,
      "timestamp": "34:46"
    },
    {
      "speaker": "Kojiken",
      "text": "結構日本と違ってバンクバー海底市場で何百件アプライしても受からないみたいないう話は聞いてたんでなんかその100件なのか200件なのかそこをアプライしきればまあ一社からは内定が出ると思ったんだよなんだろうそういう持ち上でなんだろう淡々となんかアプライしてで感触があったところに受けて一生懸命なんかクローンサイト作ったりできることしてやり続けたらなんとか内定をいただけた思い切って仲間を見つけてやることやれば仕事。",
      "start": 2095663,
      "end": 2150033,
      "timestamp": "34:55"
    },
    {
      "speaker": "Ryo",
      "text": "はできるのかなと聞いた感じだとやることやればっていうやることっていうのの結構水準は高いのかなっていうさっきのクローンサイト作るだったりとかインタビューだからそのしてもらえるってなってからその会社について調べてやられてるわけじゃないですかレジュメについてもやっぱり日本にいる時からも意識してそこらへんなんか調べてるってのはなんだろう行動力だけではなくなんだろうすごいなんだろうな準備されてるなというかいうのを感じます。",
      "start": 2150033,
      "end": 2189398,
      "timestamp": "35:50"
    },
    {
      "speaker": "Kojiken",
      "text": "けどねなんかフロックの皆さんってすごいなんか準備してる印象があって自分に比べたら本当皆さん準備してる印象。",
      "start": 2189398,
      "end": 2202051,
      "timestamp": "36:29"
    },
    {
      "speaker": "Senna",
      "text": "があっていやそんなことはないでしょーって言っちゃったら怒ら。",
      "start": 2202051,
      "end": 2205053,
      "timestamp": "36:42"
    },
    {
      "speaker": "Ryo",
      "text": "れるからただ一つ言えるのは準備した人は確かに準備ちゃんとしてきてしてあの情報発信してる人たちはそうかもしれないですね準備してうまくいってるんでそういう人たちはやっぱ準備してるなんかそれが見えやすいっていうのは多いかもしれないですよねただなんかそれ全員が全員ってわけではないのかなっていうふうなパンチはしますけどねそう。",
      "start": 2205053,
      "end": 2226449,
      "timestamp": "36:45"
    },
    {
      "speaker": "Senna",
      "text": "ですねまぁフログ運営してる人間が言うのもなんだけれどもあのそうできる限り伝えようとはしてるけどねそのさっきのまあなに日本にいううちからできればレジュメのこととか考えてねーだったりとか巻かれラスは答えるとなんですけどやっぱ自分から能動的にねなんか聞いてくれたりとか動いたり調べたりする人じゃないとその辺て何言っても響かないな正直なところなのやっぱりまあ確かに上積みだけ見るとねすごい調べてる気がしますが割と俺もKojikenさん並と言ったら言い方悪いけれどもちゃんとちゃんと調べてねしかも何でしょうねやってること自体がやっぱりすごく理にかなってるよね広報なあの路線をやっぱり歩まれてる部だと思う歩まれたりするかと思うこの辺はねなかなかちょっと僕らも実は課題として思っているからみんながみんなって確かにちょっと違うかもしれないのでぜひ聞いてる人はねKojikenさんみたいな路線が読めるように自然にちょっといろんな情報収集とねまあそれこそフログにも聞いてくれればなぁと思う確かに。",
      "start": 2226449,
      "end": 2284127,
      "timestamp": "37:06"
    },
    {
      "speaker": "Ryo",
      "text": "そうですねはいそれでは締めようかなと思います今回はKojikenさんに来ていただきましたありがとうございましたありがとうございましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcasoubetなyどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2284127,
      "end": 2312745,
      "timestamp": "38:04"
    }
  ],
  "highlight1": "Kojikenさんが転職活動で感じたカオスとは、6人のスタートアップでジョブディスクリプションがなく、役割も明確でないため何でもやれという感じだったそうです。",
  "highlight2": "日本と違ってカナダのスタートアップでは売り上げが立っていなくても8万ドルが出せることがあり、家族を優先する文化もあるようです。",
  "highlight3": "Kojikenさんは日本にいる時から英語の勉強やレジュメの準備をしており、エンジニアとしての経験を持つ人ならアプライし続ければ内定が取れるとアドバイスしています。"
}