{
  "episodeGuid": "35eb5621-3f33-44aa-a9a2-4a138f67aafe",
  "episodeTitle": "【特別回】祝・Microsoft内定！GAFAMクラスの選考を突破したエンジニアの就活戦略",
  "transcribedAt": "2026-02-23T04:00:37.952Z",
  "duration": 3802,
  "fullText": "はい始めていきましょう今回のホストはカナダのアサナというところで現在ソフトエンジニアをやっているトガシとバンクーバー大中でWorkdayという会社でソフトウェアエンジニアをしている彩香です今回は前回にもちょっと前にも来てもらったんですけどヤンマーさんがマイクロソフトにバンクーバーのかなマイクロソフトにオファーをもらったということでおめでとうっていうのとなんだろうなアサナーも割と大きめの会社で2人目のホストをやってくれてる彩香さんもワークデーで割と大きめの会社なんで大きめの会社あるあるみたいなこととかあとはヤンマーさんが今後どういうふうにキャリアを考えていくのかとかをちょっと話していけたらいいかなと思ってます簡単にまずヤンマーさん前にもお願いしたんですけど簡単な経歴を教えていただいてもいいですか了解ですみなさんこんにちはヤンマーといいますカナダには全部で5年ぐらいかな5年以上いてカナダでのソフトウェアエンジニア歴は4年ぐらいやってます最初1年間学校にカナダに来た後に行ってそこから2年半ぐらいを最初のソフトウェアエンジニアとして結構モバイル中心だったんですけどもそこで働いてその後レイオフにあって半年後くらいにバックエンドを中心としたソフトウェアエンジニアにこれも1年間半くらいやって今回つい最近マイクロソフトからオファーをもらって来月から働くという感じになりますよろしくお願いしますこれからなんですねまずはおめでとうございますありがとうございますこれからですそうなんですよ楽しみですねとりあえずなんかあの鉄は熱いうちに打てみたいな感じであのとりあえず呼んでみてまあまたちょっとあの働いて慣れてきたらまあ3ヶ月とか半年とか経ったらまたちょっといろいろ聞いてみたいなと思うんですけどもちろんですなんかあのヤンマーさんってあの結構いろんな大きい会社を受けてたじゃないですかなんかそのことについてちょっと最初聞いていきたいなと思ったんですけど結構長い間多分割と転職活動されてたんですけどどういうところを受けたんですか?ああそうですねもうなんかそれはなんかここ1年とかでいいですかね結構僕もなんか転職のために毎回でっかいところを狙ってるんでなんか今までそうですね今回の収穫って意味では2025年をフルでほぼほぼ使ったっていう感じなんでその時はもうビッグテックというかユニコーンみたいなメガメジャーみたいなのだけを中心にやってアプライした数は何本だったかなだいたい20から40社ぐらいかなあのポチポチやるっていうのを含めればで、選考を受けたっていう意味では、実際インタビューにたどり着いてやったっていう意味では、多分6社、正確には6ポジションやったっていう感じですね。ちなみにそれはマスタープライみたいな感じなんですか?それとも1社1社割と丁寧に出した感じなんですか?ちょうど中間っていう感じですねそのハイブリッドみたいな感じでマスアプライほど適当にはしてないんですけどもやり方としてはある程度ベースノベル締めを作っておいてポジションによってちょっと20〜30分時間かけてテイラーして出していくっていうちょうど中間ぐらいの僕は先方を自分で考えてやってましたなんかATS対策とかもちゃんとやったりって感じですかなんか割と聞いた感じだとそのレジュメの通過率は結構いいじゃないですかそこら辺なんか気にしてやったこととかありますかそうですね、もちろんATSも結構考えましたし、あとは人が読んでいいようになるようにも考えたんで、もちろん両方、見た目も中身もしっかり考えて、ベースの万能さみたいな、万能レジュメをめっちゃしっかりと代用してしつくって部署によって細かいキーワードとかアバウトミーとかのところをちょっとジョブディスクリプション寄りに合わせたりとかテックスタックとかのキーワードの並び順を変えたりしてそこだけを考えて出していったっていうやり方をしてましたなんか会社そのアプライする会社選びの時にこだわりとかあったんですかなんかもともときっと働いている会社も結構いい会社だったから次選ぶのってちょっとピッキーになったりするのかなぁなんて思ってたんですけどそうですねバリバリピッキーになって僕今まで3回就活してたんですけどカナダにその一番初めのカナダのやつとリオフのあった後と今回のやつでだんだんビッグテックと中小ぐらいちっちゃめの規模の会社のアプライの割合を変えていって今回もフルで全部ビッグテックというかメガベンチャーみたいなその大きいやつを狙ったっていう感じですねなので規模は必ず1000人以上のやつで自分がなんか働いてモチベ上がりそうなところをひたすらアプライしたっていう感じですちょっと意地悪な質問になるんですけどなんで大きい会社に行こうかなと思ったんですかそうですねインタビューは見た?全然一応インタビューだった2つ理由が2つってことじゃないいろいろ理由があってやっぱり大きい会社だと結構大きい基本とかの開発とかやってる感じがあってもしかしたらそこできるかもしれないなっていう大規模開発ってやつですねであとはやっぱりその大きいところ行くとやっぱりいろんな人が集まるんでそこを期待してっていうのもあるしやっぱりもちろん給料もいいんでそこはそれを狙ってっていうのもあるしであとは大きいところを狙ったら結構もしそこでしっかりやれば得られるものってその経験もあるしそこで働いたっていうことが次のネクストステップに何でも役に立ちそうだかなと思ってそういうところですね本当に一般的な理由なんですけどもそこら辺をめちゃくちゃ狙ってめちゃくちゃっていうほどじゃないですけども考えてやりましたそうですねまずは給料いいですよねやっぱり笑笑切れ言は言えないですよもちろん僕も同じなんで基本的にやっぱ大きい会社は給料いっぱい出してくれるんでいいですねあとはなんか4番目に言ってたのは全部大きいかなと思うんですけど4番目に言ってたのは特に僕の中で結構大切かなと思っててそのレジュメとかアプライする転職活動ってやっぱ大変じゃないですかやっぱこれからの転職活動にすごい有利になるっていうのがあって結構その朝菜でもそうなんですけど働いてるだけでちょっと前にはウェルスシンプルの例えばですけどね日本じゃね間違ったカナダの銀行系の会社の割とスタートアップの中では大きい方のリクルーターから連絡が直接来たりだとかそういうのが来たりっていうのもだしすごい悪い言い方をするとレジュメが綺麗になるみたいなのとかもあったりするしやっぱりレジュメの通過率がめちゃくちゃ変わると思うんですごい楽かなってありますよねあとは2つ目に言われてたのもごめんなさい間違いないですって思って今後自分をアピールするときに色々こう僕はこれやったこれやったっていうのがすごいめんどくさいんでなんか一個分かりやすいのがあればすごい楽だなっていうのもあってそういうのもあってやったっていう感じですねまああと今後あの山田さんとか彩香さんはわかんないですけど僕はまあそのうちは日本に帰ろうかなと思って日本でももうちょっと仕事はしたいかなとは思ってるんですけどそういう時にもやっぱりいいのかなと思いますよねちょっとわかりやすい名前があるとそのなんだろう結構やっぱ海外に行ってた人ってなんか結局あの人たち何してたんだろうみたいなの見られやすいと思うんですけどマイクロソフトのエンジニアでやってましたみたいなのを言えるとすごい分かりやすくこの人ちゃんとやってたんだなみたいなのも聞いてもらえるのもいいのかなと思いますよね間違いないですあとこれ僕ちょっと前に渡辺さんという方にインタビューして渡辺さんとはちょっと違う意見だったんですけど今回ちょっと彩香さんもちょうどいるんで聞いてみたいなって感じなんですけど僕は結構今の会社にすごい良いエンジニアがめちゃくちゃいっぱいいてそのエンジニアたちから学べることがすごい多いなっていうふうに感じてて渡辺さんはユニティっていうところに行ったんだけどチームによるとは思うけど自分の周りではそんなでもなかったみたいなふうに言ってて確かに会社にもよるしチームとかその時期とか運とかにもあると思うんですけど綾香さんはどうでした私の周りも私の周りも優秀な人はいっぱいいますなんか本当にシニアとかの人の話聞いてると何言ってるかわかんないとかありますしけど仕事の仕方っていう意味ではそうですねみんななんかこういい意味でゆるくけどやることはちゃんとやってるしすごいコミュニケーションの仕方とかもなんかこういうふうに伝達すれば結構ステークホルダー多いんですよ大きい会社ってだからいろんな人に情報を回してコンセンスさせるみたいなそういうマネジメントも必要になってくると思うんですけどそういうのが上手い人もいるし本当にいろんな分野で得意分野が違う人たちがたくさんいるから学べることは多いなって思います確かにでもそういえば思ったけど彩香さん1社目だからそんなに比較はできないのかと思った確かにクラビオはないかもでも聞いてる感じだとね確かにうちの会社でも同じようなことが本当にあっていろんな優秀な人がいるなっていう感じで物事そういうステークホルダーと話したりだとか進めるのがめちゃくちゃ速い人もいれば技術的にすごいなっていう人もいれば頭の回転めっちゃ速いなみたいなこの人はみたいなのもいるんで確かにそうだなっていうふうに僕もペアプログラミングとかしたときにシニアの人とやるとアイデアがすっごい滝のように流れ出す人でそれを全部伝えてくれるけど結局どれがいいの?みたいな感じがなったりしてよく喋る人が多いからこっちではすごいオーバーロードみたいななる時もあるけどそれだけ知識量が多い人が多いんだなっていう感じはしましたなんかあの優秀な人っていう話の流れでなんかいい大学を出てる人もめちゃくちゃ多いですけどまああの浅野だとあのSFの近くにあるんでなんだっけUCバークレー優秀な人っていう意味では僕の今の会社でも全然いますねなんか多分僕の今の会社ちょうどすごいその規模が大きめになる企業との中間点みたいなトランジションみたいなフェーズのところで規模的には400人ぐらいなんですけどもでも結構もう本当になんでこの会社って言ったら必要なんですけどなんでこの規模の会社いるんだろうっていうレベルのめちゃくちゃ優秀な人がなんか結構ちょいちょいいてそこら辺はソフトスキルがすごい優秀っていう人もいれば10Xエンジニアみたいな感じで気づいたら全部自分で作っちゃってるとか気づいたら自分でバーンってこれ作ったから導入するぜみたいな人もいたりして本当に気分的にはこいつだけでいいんじゃないかなって思っちゃうぐらいの人もたまにいるっていう感じですねそういう意味で言うとあれですよねリートコードだとかデザインシステムとかそういうのを技術力も高い技術力もそうだけどを話しながらコミュニケーションとりながらやる技術だったりだとかあとはそもそもリードコードみたいなのできるかどうかみたいなのとかも問われてくるからそれはできないけど優秀な人たちっていっぱいいるじゃないですかそういう人たちも中くらいの会社には結構多いかなっていうイメージはありますよねそれは間違いないと思いますね結構なんかこの人らも後はインタビュー対策したらもうどこでも生きるんじゃないかなみたいな人ばっかじゃないですけど結構いるんでやっぱりそれはすごい感じますねインタビューだけが苦手って人も結構多いですからねまぁあれですけどちなみになんかごめんなさいちょっと話変わるんですけど他の6つぐらいっていう風に言われてたんですけど他のレジュメはパスしたけど行かないことを決めたのか落ちたのかわかんないですけどその6つの会社はどういう会社だったんですかそうですね結構バラバラなんですけども一つ目がストライプでそこは最終までいったかな二つ目がスノーフレークっていうところでこれも最後までいったっていう感じですね面白いのがマイクロソフト今回なんか3つぐらいポジション同時並行でやっててでなので三つポジションやってもう一つがAppleですねそれをやってAppleは一時で落ちちゃいました一番自信あったのにまあそういうこともありますねうんとか他の人とかもいろいろあるからそこら辺はなんかしょうがないってしょうがないけどその三つポジションっていうのは一気に三つポジション進んでたって感じなんですか一気にですね微妙になんか1ヶ月ぐらいずれたりしてたんですけど最初なんか進めてたらなんかその進めてる途中でなんかこのポジションをなんか別のリクルーターから行くぜみたいなってでそれがなんか2回ぐらい来たんでマジかよってびっくりしましたねさすがにそれはそれは技術面接も別々であるんですか?それとも一回やったから技術面接は一回目できたからパスみたいな感じなんですか?いや、それが全部別々なんですよ。だから靴足とか。チームによって使ってるスタッフが違うからとかですか?やっぱ結局メンタビュー通してやっぱりワンオンで会ってみたいっていうのがあるんで多分微妙に聞きたいこととか違ったりするんでそういった意味では確かに一時面接ぐらいパスしたら全部同じにしてほしいんですけどね、よく考えたら僕の時は、朝菜なんですけど、面接は全部一緒で、ビヘイビラルクエスチョンだけなんていうのリハイブラリクエスチョンって大体入るところのチームのマネージャーがやるみたいな感じとか関係のあるマネージャーがやるとかなんですけどそこに何人かいて今回何人かいるよって言われて何でって言ったらいくつかのポジション空いててみんなが一緒にやれるようにみたいな感じでだから技術面接は一緒でそこだけ別一緒にだけど聞きたいことをそれぞれ聞き合うみたいなでそのカルチャラルフィットをすればどっかのチームに入れるみたいな感じだったんですけどそういうやり方もあるけどじゃあ大山さんの場合は全部別々でなんですねいや別々でやりましたねだから全部合計で多分8回ぐらいインタビューやったと思いますマイクロソフトでありそれ3つのうちの1個に向かって2つ落ちたってことなんですかじゃあ1個受かって2つ落ちたって感じですねあ、そうなんだそれとも1個受かっても2つは終わりになったとかではなくいや本当にちょうど前半2つが落ちて最後のやつで受かったっていう感じですねまさかのへーそんなすごいなんか心折れそう最後らへんそうですね結構もう一生ってのは思ってましたちなみに並行してやってました?他の会社も並行してなんかありました?そのとき、マイクロソフト3本のときは前半はマイクロソフトの1ポジメ、2ポジメぐらいのときはSnowflakeと同時並行でやってて後半の2、3個目のときはAppleと同時でやってたんで10、11、12、1はほぼほぼ面接、面接って感じでしたね僕も本当同じ感じで一応友達がアンプリチュードで元々働いてた友達がいてその人に一応リファラルをもらってを受けててそっちも僕は1ヶ月あってそれでちょっとかぶって朝なもみたいな感じしかも僕めちゃくちゃそれ自信がアンプリチュート自信あって絶対受かったーって思ってたらなんか朝なのなんか第2次面接ぐらいの前の日ぐらいに落ちててすげーちょっとなんか結構へこんでなんかはーやってらんねみたいな感じで言ったけどみたいなめちゃくちゃ疲れますよねめっちゃ疲れますもう言ってもだからいつもだいたい2,3個ぐらい同時並行でやってた状態だったんでしかも働きながらやるのが今回一番きついなって思いましたねそのスケジューリング調整が働いてなんか1個だけとかだったらその日のためにUQ取るぜとかシックで取るぜみたいなバーンでできちゃうんですけどなんか2,3個やってるとプライオリティが難しいしこれも大切にしたいなみたいになってくると結構運が悪いともう1週間に2、3日ぐらい重なったりとかしてなんかすげー空き時間見つけてなんとか今の会社のミーティングとかの合間とか見つけたりとかやったりあとは結構なんかいつインタビューができるかっていうのが結構予測できないっていうのもあったりしてスケジューリングみたいなこっちが交付日を出すのにしても交付日ってある程度枠が必要じゃないですか何個か本当にこの日だけしか無理っていうのもまぁできるっちゃできるんですけど大体2,3日ぐらい交付を出してねっていう風に言われるんで一社で2,3日ぐらい交付を出してると他の会社でも同時閉庫を受けてたらその2,3日とかになってくるともうめちゃくちゃなんかその一つが決まるまで、その他のやつって被らないようにして2、3日こう出せってほぼほぼ無理じゃない?無理っていうかめっちゃ難しいじゃないですか。例えば1社目は月過水でほび出して次の会社が過水木とかで仮に両方とも火曜日に入っちゃったら終わっちゃうんでなので月過水と木金とかでほび分けるみたいな感じでそうすると1週間全部未面接入る可能性があるみたいな状態になっちゃうんで僕は結構そう言うよねそれはさ、月か末ってさ、どっちもに言ってさ、でももう1個受けてるから被っちゃったらごめんねって言えないなそうっすね、それも全然なんかありだった気がしますねなんか今思ってくれたら結構結構その段階による1次面接2次面接ぐらい通ってて途中とかだったら結構大切な候補者はあるじゃないですかそういう時だったら相手も落としたくないからとかあと大体の人たちが割と並行して受けてることが多いと思うんで途中で他に受けてる会社あるとかなんていうのカウンターオファーじゃないけどオファーちょっとその競争させてみたいなのとか結構あるあるじゃないですかだからなんかそこまで悩まずにそうしてそうって思ったけどわかんないどうなんだろう僕はあんまりかぶらせないようにしてましたねちょっとだけあの全なんか割と僕あのレジュメに自信があってレジュメであんまり落ちないと思ってたんであの少しずつかぶせるようにしてた最後の面接あたりに次の会社の一時面接を始めるぐらいをやるように回してたかもしれないまあでもそれでも疲れるんですけどねなんかちょっとずれて何もない時間とかが何も面接がない時間とかあると結構気持ちが切れちゃいそうになるじゃないですかそうですね何が正解かわかんないけどヤンマンさんは今回受かったのできっとそれが正解だったんでしょういや、何も特には、ただ今の話で言うと結構他の会社の名前じゃないですけど他にも選挙を受けてるんでって確かに全然出してもよかったかなっていう選考途中に結構多分やっぱビビってたんかなって思いますねそのスケジュール調整で調整したりするのがなんかいつ名前出したらいいのかなとか他のところとか名前出さなくてもいいかもしれないですけどもなんかもうひたすら飲まれてましたけど今の話聞いたら全然交渉できるなって思ったんでもしやる機会が今後あったらそうしたいと思いますなんか自信とかにもよるじゃないですか今回マイクロソフト受かってちょっとマイクロソフトで多分自信ついてマイクロソフトだぞみたいな感じでいけば次からは逆のできるじゃないですかわかんないけどできるとすごいですねある程度レジュメの最適化もされてたみたいなんですけどそれ以外にはどんなふうに技術面接の勉強だとかビヘイベラルインタビュー行動面接っていうんですかねの練習とかどういうことされましたかメインとしては3つ主軸を持っててDSAといういわゆるアルゴリズム系とシステムデザインとビヘイベラルクエスチョンの3つをメインの要素としてやってそれを毎日コンスタントにメニューとか組んだりして気分とかで入れ替えてやったりして対策してたっていう感じですねDSLって何ですか?DSAっていう日本だとデータストラクチャーアンドアルゴリズムっていう一応こっちだとそっちのほうの略し方のほうが大きいですかねそれからリードコード化っていう感じですごいこれ厳密なんですけどアルゴリズムってアルゴリズムだけじゃなくてアルゴリズムとデータストラクチャーなんで一応大体どこのコースとかも基本的にアルゴリズムだけじゃなくてデータストラクチャーも入れるんでみんなめんどくさいからその掲示板とかだったら結構DSADSAってみんな言ったりしてますねなんか結構いろんな会社で最終面接まで行ったりしてると思うんで結構な範囲をリートコードとかDSAっていうんですかでカバーしてると思うんですけどどういうふうに勉強されたんですかリートコードのデータストラクチャーとアルゴリズムっていう分野ではDSAに関しては、アルゴリズム系に関してはもうニートコード1本って感じでしたね。ニートコードって言う、なんかNの方ですね。結構有名、最近有名だと思うんですけど、あれがよく一番まとまってるんで、DSAに関しては僕結構もともと昔から対策してたんである程度の基礎知識があったんである程度のBDMぐらいまでは解けたり解けなかったりで結構であのサイトって結構なんか面接員出る150問ぐらいみたいなのまとめてくれてるんですよねなのでそれをひたすらこれ有料でしょ?えっと有料プランもありますね無料で結構半分ぐらい見れて有料で結構奥深くまで見れるっていう感じですねちなみに何か課金したんですかもちろんですもう2,3年前ぐらいに課金してますねでもあれ買い切りなんで多分1万か1万5千ぐらいなんで全然価値あると思うししかもサイドで結構アルゴリズム系だけじゃなくてシステムデザインとか他のOPとかもカバーしてるんでちょいちょい間違いなくビッグテックとかそういうテックインタビューがある企業だったら絶対にサブスクというか買い切りした方がコスパがいいサイトだと僕は思いますねぶっちゃけああいうのって全部課金しちゃえばいいんじゃないって思いますよね一瞬で元取れるじゃないですか実際なんでデータストラクチャー系とアルゴリズム系分かんないようだったらどんどんどんどん金かけて買ってもちろんちゃんと全部やるっていうのが前提ですけど全部お金かけても分かんない20万ぐらいにしか多分ならないと思うんで最悪全部課金しても23ヶ月すれば元取れるんじゃないかって勝手に僕は思ってるんですけど結構それ同意で結構課金しまくってましたね課金した後に見てないやつとかも見てないっていうかあんまり使ってないやつもありましたねとりあえず中身見るだけのために課金してそれでなんか良かったらまあ運が良かったし悪かったらもう嫌って言ってやったんですけどそれでもまあトータルおっしゃったようにそんななんかもうもっと言えばもう多分全部でねそんな10万もしない5万ぐらいのレベルでいけちゃうんですよねなんかもうあのとりあえず買ってみて本気できたかったらとりあえず買ってみてやるっていうのが一番いいんじゃないかなって思いますねあとはなんか課金することでちょっとそのやらなきゃなみたいな思う強制力みたいなのってあるじゃないですかやっぱりイートコードとか得意な人僕も割と得意ではあるんですけどとはいえなんか1日に2問も3問も解くのって結構そのそれこそそのミリアムとかあのハイレベルハードレベルとくのって結構時間かかるじゃないですかだからその1日それだけやろうと思うと結構その仕事以外でそのだけの時間を使わないといけないから結構やっぱ忍耐力って必要でそれのために僕はもう課金しちゃうっていうのも割とありましたねなんかお金を無駄にしないみたいなモチベーション間違いないですね。ライズアップみたいな感じですよね。なんか払っておくことでモチベを高めるみたいな感じですよ。そうそうそう、確かに。それは間違いなくあると思います。とりあえず払ったら、まあもうそれやったんだしってやる気になるし、あと結構なんだかんだやっぱり有料のサイトはいいですね、サービスは。やっぱり有料な部分にちゃんとリスポンスビリティが発生するんでちゃんとユーザーに対応しないといけないっていうことでコメントとかもちゃんと返信してたりとか定期的に更新したりするんで無料もいいんですけども始まりは無料で全然いいんですけども全然本気でやるんだったら有料で時間とか効率性を高めるっていうのがあとモチベを高めるっていうのが一番いいかなって思いますねもともとなんかあのミディアム溶けたり溶けなかったぐらいまだ溶けない溶けたり溶けないかったりぐらいのまでのレベルではあったっていう風に言ってたんですけどそのレベルに至るにはどういうことをされたんですか最初は結構なんかブーストっていうか面白いのが僕の行ってた学校私立の先生が前も名前出したかもしれないですけどデレックっていう先生なんですけどもその先生が結構アルゴリズムオタクだったんでなんか授業でなんか知らないですけどいきなり結構アルゴリズムの授業とかをわざわざ割いてやってなんか2、3ヶ月間ぐらいしかもそこで結構難しいなんかハードレベルまで全然やりだしてなんで多分生徒によっては全然結局フロントエンドとか使わないからしかも中二症ぐらいの規模だったらなんでやってるか意味わかんねえってやってたんですけど僕は結構もともとそんな嫌いじゃなかったんで面白いやんって感じになって結構そこで基礎知識つけて最初の基礎は学んだっていう感じですね早川さんだったけどデリックではなかった私フランス語でしたデリックってまだやってるのかな確かに僕の先生もデリックだったんですけどリードコードめっちゃ好きですよねめっちゃやらされた気がするしでも僕結構あの一番最初に紹介された時にそれからハマってちゃんとずっとやっててで僕あの学校行ってた時まだ当時あのなんて言うんだっけコロナになる前でただなんか僕自分で行けるっしょと思ってたんで学校あんまり行ってなかったんですよそしたらシアトルに遊びに1ヶ月間ぐらい遊びに行ったりとかブラジルに遊びに行ったりしてて1回単位を落としたんですねでその先生に何とかしてって言ったらリートコード50問やってきて見せてくれたらいいよって言われてでもデリックが最初になんか紹介してくれた時点50も通り越しててokですみたいな感じで言って次の日くらいにはいって言ってみせたらokになったっていうエピソードが確かにあの人はめっちゃ好きあの人強プロ勢なんで元々確かにそうなんだから知らなかったなんで好きでしかしそれでokって言うのどんだけ好きなんって感じですよねまあまあカナダなんで学校外まあ学校ってかまあコーナーストーンは特にねちょっと緩い学校なんでっていうのもあると思うんですけどじゃあ学校でやりつつまあその後も自分でちょこちょこやりながらみたいな感じですかそうですね学校で基礎やった後に台解けるようになってそのおかげで多分最初から結構大きな会社でもスクリーニングっていうか一時面接だけは取れるようになったっていう感じでただビザ的なもんとかその後が無理だったんで最初は普通にそういう企業に行ってたんですけどもやっぱりなんだかんだ後半になってきてそういうの対策しないといけないなってなった場合にもう一回やるかってなってそこでニートコード知ってあえやんってなってもう一回始めたっていう感じでしたね何回ぐらいやりました?分けて2回に分けてやったみたいな感じなんですか?リートコードは本当にオンオフオンオフしすぎてよくわからんですね結構伝説とかっていう対策わかんないですね毎日してたっていう時もあるし全然せずに週末のコンテストだけプレッシャーに対する中でどんだけできるかみたいなことを鍛えるためにやってたっていう時もあるしちょっとまばらすぎて何回って数えることはできないんですけどもでも結構定期的にやってたっていう感じですねめっちゃやってる方だったと思いますただめっちゃやってる後にそうですねめっちゃやった後に気づいたのがそんなにやらなくていいなっていうのは分かりましたその心はなんか結局めっちゃやってもなんか問題めっちゃあるんでなんかそんなにそれが解けるようになったからって言って適当に出した問題が特にいけるわけじゃないしあとは結局なんだかんだ面接で出る問題ってほぼほぼ決まってるっていうのがよくわかったんでなのでさっき言ったみたいにニットコードが出している150問のやつをしっかりとっておけばいいんだなっていう結構昔は質より量の方をメインでひたすら解いてたっていうのがあったんですけども意外と質のほうが重要だなっていうのでそこは気づいたっていう感じですねりょうがあったから質に移行できたっていうのもありそうな気もするしGogleとかって確か新しい問題どんどん作るみたいなのがあるからそういう会社に受けるのであれば量も大切なのかなあと僕DP系えっとなんだっけダイナミックプログラミングか僕めっちゃ苦手なんですよいやわかります今ではできる今では多分大体大丈夫なんですけどそういう苦手なやつは世にある問題全部見ればいいと思ってて僕はだいたい普通の会社のやつは取れると思ってて今それあってますねさっき言った世にあるのっていうのが結構150文に集約してる部分もあるんでとりあえず150文全部押さえておくかつあと一番究極なのが会社の過去を見るっていう感じですねリートコードNのほうじゃなくてLのほうオリジナルのリートコードのほうがタグとかがあったりして企業別に分けてるんで僕とかは最初の基礎力上げた後にそのタグで例えばMicrosft受けるってなった場合にはMicrosftのタグで調べて過去3ヶ月とか6ヶ月のフリクエンシー出現範囲度でイージーとかもあるんですけどでも自分が時に臭そうなやつをひたすら全部目通してひたすら抑えておくっていうのは物量で最後もう笑う気みたいなやつはやってましたね絶対やったほうがいいですよね僕は前回の会社も今回の会社もリートコード系の問題僕一瞬で終わらせてるんですけどそれ予想とそもそもやりすぎて暗記してたみたいなので一瞬でどっちも終わらせててやっぱある程度やればそういうラッキーも起こりうるかなと思っててできるからいっぱいやったほうがいいですよね僕はちなみにそろそろ転職かなって思うタイミングで3ヶ月ぐらい絶対勉強するようにしてて一番最初の就職こっちカナダのね就職の前に3ヶ月ぐらいやってその前はちょっとやってたけどそこで僕も割と維持は絶対解けるしミリアムも解けるし解けるか解けなかったかぐらいになってで2社目受ける前にもまたやってでミリアム大体いけるなってなってで3社目今の会社の前もちょっと復習だけやってみたいな感じでやりましたねなんかやっぱちょこちょこやるのがいいですよね、なんだろうあんまりなんかコンツメすぎてずっとやり続けてもなんかちょっとやる気がなくなっちゃうし僕は割とメリハリをつけてやってよかったなって感じですねそうですね僕も多分なんかある程度一回最初のその規則から全部知ってやるのだけは結構大変だと思うんですけどもそこはなんか大変かもしれないですけどそれ一回やって慣れた後は後はなんか半分思い出しゲーみたいな感じがあるんで確かに確かにそこを1ヶ月から3ヶ月間ぐらい当ててバッとやってこうちょっと覚えげにさせていくっていうのはもうあのプライドを捨ててやるっていうのがいいんじゃないかなって僕は思いますね確かにシステムデザインについてはどうですかどういうふうに勉強されましたシステムデザインは結構僕がめっちゃ苦労したところでリードコードはさっき言ったみたいに最初から基礎があって結構最初からいけたって感じなんですけどもいつもそのシステムデザインが特にこの1年で初めてやったやつでしかも僕最近にバックエンドになったんでもう全部がゼロからスタートだったんで最初は本とかこれもおすすめのHeloWrdっていうウェブサービスがあるんですけどもそれで基礎的な知識を抑えた後に有名なトピックとかコモンパターンよくあるあるパターンとかを調べてそれをベースにある程度のトピックは自分でMockでインタビューしたり誰かとモックインタビューしたりしてっていう感じでやってきましたね。モックインタビューはどういう人にお願いしたんですか?今回は全然なんだかんだしなかったんですけども1年前とかだったら確かプランプもう名前が変わっちゃったかななんか無料のインタビューサイトがあるんですよねそれはなんかよくあるのはインタビュー。\nioみたいな感じでお金をめっちゃ払ってその講師からインタビューをやるっていうそういう形式もあるんですけどもそのプランプ今の名前ちょっと忘れてたんですけどもそれはマッチングみたいな感じなんですよねこの例えば土曜日の夜8時にスタートするみたいな感じでブッキングしといたらその8時になってウェブサイト行ったらマッチングがスタートして同じように登録している人とマッチングして1時間使って最初の30分は自分がインタビューする側で向こうがなんか面接かみたいなその後半30分はロールが逆になって違う問題があるっていうなんか本当にランダムの人で世界中の人と会うってインタビューするっていうので結構緊張感いるしなかなか大変なんですけども結構それがメンタル的にも気合的にも練習になるっていう感じはそれは最初でボコボコになりながらされされながらやってましたね泣きながらそれは相手も転職活動している人なんですか?それとももうシニアとかの人?面白いのが本当にピンキリで僕みたいに最初から始めて何も知らないっていう人もたまにいたりするんですけども逆に今Amazonで働いてて実は自分もJobChangeしたいからインタビュー受けてるんだっていう人もいたりして結構いろんな上下がありますね確かにインタビューする側になるのも結構勉強になるからいいなって思うんですけど相手側にそのインタビューする技術がなかったらそんななんかインタビューされる方も微妙なんじゃないのとかってちょっと思うんですけどどうですかそれは間違いないですなのである程度やった後に極めようとするとなんかクオリティ上げようとするとそのサイトは良くないかなっていう感じですねただなんかもうなんかとりあえず初めてやって何やったらいいか分かんないっていう状態からある程度こうスパルタでちょっとなんか雰囲気だと使って慣れるっていう意味ではなんか結構いいんじゃないかなっていうのでなんかずっとはなんで僕も後半使わなかっていう感じでしたね最初のある程度そのあんまりちゃんとはしなかったんですけども後半はでもまあなんかきっかけにはなれたじゃないですかインタビューする確かに確かに聞いた感じだとそれこそ有料のやつ今大手にいる人でそういうのを受かってきた人たちがなんかインタビューやってあげますよみたいな多分時給みたいな感じで1時間300ドルとかって結構よく見ると思うんですけどそういうのをやる前にちょっととりあえず量こなしてそういうのに慣れるみたいな感触つかむみたいなのを前にやると確かに良さそうですねいやそうなんですよ間違いなくそれでなんかいきなりゼロから状態で一回も文句インタビューしたことない状態でそういう人たちとあたると結構300ドルって無駄になりやすいんですけどある程度何回かやった後にそうなると初めて何か意味が出てくるんじゃないかなっていう感じのノラインタビューみたいな感じですねめっちゃ怖いですけどねただの感想です。怖そうだなと思って。逆に言えばインタビューってそういう感じなんで、それ慣れてはね。インタビューも結構慣れてくるっていうかメンテナンスを鍛える面でもいいかなってどうせタダだし最悪怖かったらもうねあのプラザワータダなんですかサーベスくん今はもう課金制になってんのかな僕が始めた当時ってなんかちょっと始まったばっかりで結構なんか最初7回ぐらいまで無料とかだったんですけど僕リファラルで人にあげまくってたらなんかいつのまにか無限にできるみたいな特別になってそれずつ使いまくってたっていう感じなんですけどさっき言った怖いってなっても最悪ブッチしたり途中でああもういいってパズルボタン押せば終わるだけなんであとはどうしようもしかしてもうその人には一生会わない?基本は会わないじゃないですか僕同じ人と会ったことは二度とないですね多分さすがにユーザーIDとか管理してるんで絶対過去に会った人とは会わないようにっていうのはできるじゃないですかああそうか面白い初めて知った教材はじゃあそのハローワールドでモクインタビューはそのハローインタビューですねハローインタビューハローインタビューはなんて言うんだっけ忘れちゃったけどそのサービスを使ってその勉強みたいなところはそのハローインタビューがメインえごめんなさいハローインタビューがどっちだハローインタビューがめちゃくちゃいいですね中国語を学ぶっていう意味でもいいしYouTbeも出してるしなんなら最近だったら結構AI使って採点サイトも出てるし多分あれもなんか有料で払ったら講師が採点してくれるっていうのもやってくれるしとりあえずシステムデザインはもうあれ一択とはまだ言ってないんですけどでも始めるんだったらもうあれで80割ぐらいカバーしてくれるんじゃないかなっていう感じがしますねだからYouTbeにも結構いいの上がってますよねなんか僕はYouTbeを結構使っててなんかドロップボックスをデザインしてくださいだとかツイッターデザインとかYouTbeデザインとかって言ってなんか結構いろんなのが上がっててそれが良かった覚えがあるけど僕はそのそこらへんの今ヤンマーさんが言ってくれたサイトは使わないサイトとか教材は使わなかったかな多分そうですね、りょうさんがやってた時って、ちょっとまだそのハローインタビューがそこまで力入れてなかった時だったと思うんですよね。そんな勢いで。確かに。なので、ちょうど終わった後ぐらいに僕が始めようと思った時に、結構だんだん色々増えてきて、YouTbeとかも出したりってやったんで、僕はそっちの方やったっていう感じでしたね。えっと逆に何だろうまあこれからちょっと大きい会社に行くと思うんですけどあやかさんはもう大きい会社に3年4年ぐらいいるんで大先輩なんですけど逆に何か聞いてみたいこととかありますかあるやつありますあのやっぱり皆さんそのちょっといきなりもあるしちょっと小さいところ小さいっていうか中ぐらいの時から全然大きめの規模にバーンって入ったっていうことがあったと思うんですけどもそれでなんかその違いギャップとかでめっちゃこれが苦労したとかつまずいたっていうのがあれば1点と逆にこれやってたらやっててよかったとかあとはなんかもし同じことをやるんだったら多分こうするだろうなみたいなことがあったら知りたいって感じですね僕は今からちょうど入るんでなんか今のうちにできることとか入った後に意識してできることがあったらすごいやりたいなっていうのは考えてるんであんまないかもしれないですけどあやかさんでも確か入った当初最初めちゃくちゃ苦労したっていう風に言ってたと思うんですけどそうですねいやそれが大きい会社だからなのか分かんないですけど確かにいいしゃべりバンクーバー来て一社目なんでどうなんだろうでも体感ではやっぱり他のスタートアップとかで働いてる人とかの話と比べるとミーティングが多かったのでそうですねすごい人と話す機会行動を書くっていうよりかは人と話す機会が多くてその中でプレゼンテーションしたりとかエピックなんて言うんだろうエピックってエピックですねエピックを管理する役になったらエピックリードになったらPMとの調整QAとの調整いろんなステークホルダーとのさっきも話したみたいに調整する時間も多かったりとかがあったとりあえずミーティングの多さとその自分で発言しないといけない場の多さにすごい私は最初圧倒されて思ってたのと違うと思いました私はエンジニアになったのは黙々と静かに誰とも話さず仕事する目的でなったのにちょっと聞いてた話と違うぞと思ってもし今の会社とか前の会社が自由に行動する時間がたくさんあるんだったらちょっとその辺はギャップになるかもしれないですね確かに僕も一社目二社目は割と小さい会社途中くらいの会社だったけどめちゃくちゃ行動する時間があったけど今はその会話する時間だったりミーティングだったり自分が発言しないといけないとかプレゼンしないといけないとかっていうのは確かにめちゃくちゃ多くなったかななんていうのバーバル口頭でもそうだしドキュメンテーションだとかステータスのアップデートみたいなステークホルダーの人たちに説明するだとか今遅れてますよだとか今順調に行ってますよ大きいプロジェクトだと順調に行っててもやっぱり言ってあげないとこういうふうになってるよみたいに言ってあげないと心配っていうかわかんないじゃないですかエンジニア以外の人たちには特にだからそういうのはすごい確かに多いかなあとは付け足す感じで言うとやっぱりドキュメントが多い今は結構AIで会社の中のAIみたいなのがあってドキュメント調べたりするのは多分割と楽ですけど僕が入ったときはまだAIが会社に導入されてなかったりとかでドキュメントを読むんだけど僕が知りたいことはドキュメントの中の5パーセントとか10パーセントででもドキュメントは100パーセントの量で書いてあるから全部結局読まないといけないみたいなのでもう苦労はしたんだけど今はなさそうかなそこら辺は時代の変化もありなるほど確かにそう考えるとでっかいからこそその不透明性が出てきてそれを補うためによりソフトスキルが必要になってくるっていう感じですよねコミュニケーションのほうがあといろんなチームが存在してるから自分の扱ってるプロダクトよりもプロダクトの他に触っちゃったりとかすると他のところが壊れるとかもあったりとかインパクトの範囲がすごい広いなって思いますねパフォーマンスとか影響出たら全然違うチームの人からいきなりメッセージきてちょっとこれめっちゃ遅くなってるんだけどすいませんとかすごい影響する範囲が広くなってしまうからその辺ではそうですねちょっと気を使うだからこそミーティングが多いんだと思います。いろんな人の意見も聞いて、他の人の立場での意見も汲み入れないといけなかったりするからめちゃくちゃ似てるというか被せる感じになるけどAORみたいな概念があってAreaofResponsibltyっていうんですけど自分の持ち物みたいなのがあっていつプロダクトを開発するプログラムワークみたいなのとは別に自分のチームの持ち物とか自分個人の持ち物みたいなのがあってそれを管理するような仕事がなんていうんだろうなそのスプリントの中に組み込まれていくあの例えばこのページはこの人のものだからなんかこのページを触るときはその人に一応レビューしてもらってねみたいなのとかがあったりするんですよその会社とかにもよるんですけどあの朝なってあのアサナっていう会社がアサナっていうプロダクトを作ってる会社なんでマイクロソフトとかだとなんか違うチームがもうプロダクト1個持ってるとかってなったりするからちょっと構造は違うかもしれないんですけど自分の持ち物を管理していくみたいなとか行動が汚くならないとか自分が好きなふうにではないけどいいものを保つための仕事みたいなのがあってそれにちょっと最初苦労っていうわけじゃないけど時間配分だったりとかはちょっと難しいかな自分がプログラムワークに集中してどんどんどんどん新しい機能に時間費やしたいのにそういうのが入ってきてみたいな感じでちょっとそっち行ってまた戻ってきてっていうコンテキストチェンジみたいなのがあったりするのは割と大変っていう風に思ったかな当時はそれってなんかその自分が持ってるやつって変わっていくんですか?それともなんかどんどん増えていくっていう感じなんですか?変わってもいくし増えてもいくし僕の場合はチームを交換したんでそのチームのOKRみたいなのとか自分らが作ってきたものとかが割とそのOKRに沿ったものだったりとか自分らが作ってきたものとかそのチームにあるべきものがその人たちに割り当てられるんですよ基本的にはだからチームが変わるとそれが変わるってのもあるし長くいればもちろん多分増えていくことが多くなるんですけど例えば新しく入ってきた人たちに受け渡しがあったりだとかまた僕みたいな人がチームを変えたときにその人が抜けるからその人の持ち物をちょっと分配しましょうみたいなのがあったりするんでチームの中ではちょっと整理されなんか分配されたりはするから減ることもなくはないですけどなるほどって感じですかねじゃあ結構なんか自分というかシマっていうか管轄領域みたいなのがチームレベルじゃなくて個人レベルでも発生するっていうことですねそれをなんか僕が全部今まで質問してきた中で結構繋がってるのってやっぱりそのコミュニケーションっていうのがあってそうすると考えてるのがやっぱりすごい重要なのがなんかこれがあった時に誰になんか話したらいいかっていうか誰に連絡したらいいかみたいなのを知るってすごい重要だなって思ったんですけどもそれってなんかこう自分で徐々に徐々に見つけていきました?それともなんかすごい効率よくこうこれだったらこの人に聞くべきだったかこの人に聞いた方がいいみたいなのってどういうふうに探していきました?なんかスラックの中にたくさんチャンネルが存在しててこのチームのチャンネルASKなんとかチームウッデブみたいななんかチームごとにDev開発用の質問をする場所とあとは本当にカスタマーサポートチームとかが使ってるファンクショナリティよりの質問をする場所とかいろんなチャンネルが本当に存在しててワークフローとかもあって質問するならここのフォームに入力してねとかすごいたくさん存在してるから私も最初にどのチャンネルに何を聞けばいいのか分からなかったんですけどでも本当に自分の小さいチームの中からって質問を投げてこういう疑問があるんだけどどこの人に聞くのがいいかなって聞いてしたら知ってる人が教えてくれるからそれでどんどんどんどん私のブックマークしてるチャンネルが増えていってみたいな風にして広げていきましたね毎回毎回多分質問によって聞く先は違うからしばらくはきっと大変だと思うんですけど私はSlackを超活用しましたなるほどめっちゃサンゴになりますうちもそれと近くってスラックはそういうふうになっててチーム名inboxみたいなチーム名interalとかいろいろそういうのが分かれてたりするんでそこに引きに行ったりだとかあとアサナはやっぱりアサナ自体がそういうプロなんかプロダクトなんでなんか割とそこらへんはなんか気持ち良くなるようにルールとかで設定してたりなんかそのわかりやすいようになんか朝の中で設定してたしてるっていうのがあってそこらへんはなんか結構システムチェックにやってくれてるってのもあるかもしれないでもやっぱあやかさんの言うとおりそこはもう本当に時間かけてとかもう最初だからチームの人に聞いてその人が教えてくれてとかでその人に聞いてみてみたいないつかに一人仲良くなれる人が作るのが一番早いですよ何でも聞くいっぱいオフィス行ってオフィスバンクーバーですよねオフィスでできるだけ顔出してチームの同僚なりランチする人なり見つけてとりあえずわからないことは聞くおしゃべり好きな人はきっと多いしあんまり仕事もしてないだろうからお話をいっぱいしてわからないことは全部聞くのが早いですオンボディメーターみたいな人がいるからその人をまずその人に聞いてみるでその人がやってることをコピーするみたいな感じでやっていくと確かにいいかもしんないですねその人がわからないときにどういう動きしてるステイクホルダーの人が分かんないときにどういう動きしてるかみたいなのを見てみたらその会社での人たちがやってるようなことを学べそうだなっていうのはありますよねあと僕逆にやってよかったことは最初のほうに割となんか結構実力を出すじゃないけど頑張ってこの人できるなみたいなのを見せると後から楽だなっていうふうに思いますね僕は割となんだろうデザインとか実装とかも早い方なんですけどそれを最初の方で出すことで割となんだろうそういうふうに認知されてなんかプロジェクトとかもそういうなんだろうなちょっと時間とかが求められる時間スピーディーにやることが求められるようなプロジェクトとかがアサインされたりとかでなんか自分の色を出していくみたいなのはなんか割といいかもしれないですねまあ会社にもちろん会社によりけりだと思うんですけどやっぱり信用は最初についていた方がいいですよねイメージはあるしなんか僕結構やっぱその大きい会社だとそのクビになっちゃう人も結構多くてそういう人たちはやっぱりなんか最初にすごいオンボーディングとかに時間がかかっちゃってるみたいなのはありそうだなっていうのは思いましたねオンボーディング一生終わらない人いますよねそういう人ですかねなんかいなくなっちゃうなっていうのは結構感じるんでやっぱりそのなんかマイクロソフトpipめっちゃ厳しいって聞いたことあります怖いですよねあでもマイクロソフトがpipあれなのかpipってだいたい厳しいもんじゃないpipいったらもう終わりだと思ったほうがいいっていうふうにみんな思っているとマイクロソフトのピーパーなんか別格だ別格だみたいな聞いたことあります私具体的にどう思うと不安はあることありますよねもう無理でしょテイクバックしてくださいヤマさんの場合PIPより先にまずプロベーションをサバイブしないといけないんで大丈夫ですよそれが始まるのかなカナダの企業で言うとカナダもやっぱりアメリカほどはレイオフしやすくないんでPIPとかがちゃんとしてるみたいなのあると思うんでオフィスに行くようにする方がいいと思います最初オンラインでこいつ何やってるんだって思われるより毎日行ってとりあえずちゃんと勤勉さんバーティールして確かにそういう意味で言うとヤンマーさんはないかもしれないけど僕はオフィスに行ってもオンラインだったので僕一人だけのチーム会社のバックーバーには僕一人だけだったんでそこはめちゃくちゃ大変でしたねやっぱり無駄な料理を僕みんながオンラインだったらいいんすよまだみんながオンラインだからちょっとコミュニケーション作ろうねとかっていうのが結構あったりするんででも僕の場合はオンライン僕だけっていう僕だけバンクーバーで他の人みんなsfっていう感じだったんでそれで苦労も結構ありましたねコミュニケーションなんか取るのが難しいみたいななんか僕だけ伝わってないことがやっぱり出てくるとか僕が途中まで僕じゃない人がリードしててその途中から僕がリードしたプロジェクトがあってなぜかわかんないけどそのプロジェクトなんかにノミネートされてアワードもらってるんだけど僕もらったことも知らないし何も共有されてなくてなんかSFに出張があって行ってその僕に引き継ぐ前の人のところになんかアワードみたいのがあってなんだあれって思ってでフワッと聞いてみたら仲良い別の人に聞いてみたらあれあのプロジェクトのアワードお前もされてたよみたいなことを言われたみたいな何も聞いてないみたいなそんなのがあったりもするんでコミュニケーションは大切ですねもうチームメイトとは会ったんですか会ったというかインタビューのプロセスでチームメイトとはもう対面したんですかいやまだですねこれちょっと載せていいかよくわかんないんですけども今回もうマジで新規のチーム1から作るらしくてリード以外はなんかもう新しく入ったりとか別のところから来たりっていう感じなんですよねだからインタビュープロセスもリードっていうかそのメインのマネージャー以外は実際にチーム8とは関わせしてないんじゃないかっていう感じなんですよねおーそれは…今日マネージャーはもうあったんですねマネージャー会いましたね2回くらい話してインタビューとオファーをもらった後に1回僕結構ちょっともう1回やる内容を知りたいから話させてくれって言ってもう1回プラスでインタビューではないんですけど確認の1on1開いてやる内容とか目的じゃないですけど色んな細かい内容を話したんでその時によく話したって感じですねでも出来立てのチームは割とどうしたらいいか分かんないみんなが分かんないみたいな状況になったりするんで大変だなっていうのも思いつつそれみんなが分かってるからしょうがないよねみたいなのはあると思うんでちょっとぐらいランプアップに時間がかかっても大丈夫かなと思いつつあれもこんぐらいですかねとりあえずはお疲れさまでしたっていうのとおめでとうございますありがとうございますということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうござい",
  "utterances": [
    {
      "speaker": "A",
      "text": "はい始めていきましょう今回のホストはカナダのアサナというところで現在ソフトエンジニアを",
      "start": 409,
      "end": 7901,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "やっているトガシとバンクーバー大中でWorkdayという会社でソフトウェアエンジニアをしている",
      "start": 7901,
      "end": 13450,
      "timestamp": "00:07"
    },
    {
      "speaker": "A",
      "text": "彩香です今回は前回にもちょっと前にも来てもらったんですけどヤンマーさんがマイクロソフトにバンクーバーのかなマイクロソフトにオファーをもらったということでおめでとうっていうのとなんだろうなアサナーも割と大きめの会社で2人目のホストをやってくれてる彩香さんもワークデーで割と大きめの会社なんで大きめの会社あるあるみたいなこととかあとはヤンマーさんが今後どういうふうにキャリアを考えていくのかとかをちょっと話していけたらいいかなと思ってます簡単にまずヤンマーさん前にもお願いしたんですけど簡単な経歴を教えて",
      "start": 13450,
      "end": 55982,
      "timestamp": "00:13"
    },
    {
      "speaker": "C",
      "text": "いただいてもいいですか了解ですみなさんこんにちはヤンマーといいますカナダには全部で5年ぐらいかな5年以上いてカナダでのソフトウェアエンジニア歴は4年ぐらいやってます最初1年間学校にカナダに来た後に行ってそこから2年半ぐらいを最初のソフトウェアエンジニアとして結構モバイル中心だったんですけどもそこで働いてその後レイオフにあって半年後くらいにバックエンドを中心としたソフトウェアエンジニアにこれも1年間半くらいやって今回つい最近マイクロソフトからオファーをもらって来月から働くという感じになりますよろしくお願い",
      "start": 55982,
      "end": 105945,
      "timestamp": "00:55"
    },
    {
      "speaker": "B",
      "text": "しますこれからなんですねまずはおめでとうございます",
      "start": 105945,
      "end": 110408,
      "timestamp": "01:45"
    },
    {
      "speaker": "C",
      "text": "ありがとうございますこれからですそう",
      "start": 110408,
      "end": 113799,
      "timestamp": "01:50"
    },
    {
      "speaker": "B",
      "text": "なんですよ楽しみですね",
      "start": 113799,
      "end": 115640,
      "timestamp": "01:53"
    },
    {
      "speaker": "A",
      "text": "とりあえずなんかあの鉄は熱いうちに打てみたいな感じであのとりあえず呼んでみてまあまたちょっとあの働いて慣れてきたらまあ3ヶ月とか半年とか経ったらまたちょっといろいろ聞いてみたいなと思うんですけどもちろんですなんかあのヤンマーさんってあの結構いろんな大きい会社を受けてたじゃないですかなんかそのことについてちょっと最初聞いていきたいなと思ったんですけど結構長い間多分割と転職活動されてたんですけどどういうところを受けたんですか?",
      "start": 115640,
      "end": 150853,
      "timestamp": "01:55"
    },
    {
      "speaker": "C",
      "text": "ああそうですねもうなんかそれはなんかここ1年とかでいいですかね結構僕もなんか転職のために毎回でっかいところを狙ってるんでなんか今までそうですね今回の収穫って意味では2025年をフルでほぼほぼ使ったっていう感じなんでその時はもうビッグテックというかユニコーンみたいなメガメジャーみたいなのだけを中心にやってアプライした数は何本だったかなだいたい20から40社ぐらいかなあのポチポチやるっていうのを含めればで、選考を受けたっていう意味では、実際インタビューにたどり着いてやったっていう意味では、多分6社、正確には6ポジションやったっていう感じですね。",
      "start": 150853,
      "end": 203529,
      "timestamp": "02:30"
    },
    {
      "speaker": "A",
      "text": "ちなみにそれはマスタープライみたいな感じなんですか?それとも1社1社割と丁寧に出した感じ",
      "start": 203529,
      "end": 207973,
      "timestamp": "03:23"
    },
    {
      "speaker": "C",
      "text": "なんですか?ちょうど中間っていう感じですねそのハイブリッドみたいな感じでマスアプライほど適当にはしてないんですけどもやり方としてはある程度ベースノベル締めを作っておいてポジションによってちょっと20〜30分時間かけてテイラーして出していくっていうちょうど中間ぐらいの僕は先方を自分で考えてやってまし",
      "start": 207973,
      "end": 233417,
      "timestamp": "03:27"
    },
    {
      "speaker": "A",
      "text": "たなんかATS対策とかもちゃんとやったりって感じですかなんか割と聞いた感じだとそのレジュメの通過率は結構いいじゃないですかそこら辺なんか気にして",
      "start": 233417,
      "end": 245804,
      "timestamp": "03:53"
    },
    {
      "speaker": "C",
      "text": "やったこととかありますかそうですね、もちろんATSも結構考えましたし、あとは人が読んでいいようになるようにも考えたんで、もちろん両方、見た目も中身もしっかり考えて、ベースの万能さみたいな、万能レジュメをめっちゃしっかりと代用してしつくって部署によって細かいキーワードとかアバウトミーとかのところをちょっとジョブディスクリプション寄りに合わせたりとかテックスタックとかのキーワードの並び順を変えたりしてそこだけを考えて出していったっていうやり方をしてまし",
      "start": 245804,
      "end": 286022,
      "timestamp": "04:05"
    },
    {
      "speaker": "B",
      "text": "たなんか会社そのアプライする会社選びの時にこだわりとかあったんですかなんかもともときっと働いている会社も結構いい会社だったから次選ぶのってちょっとピッキーになったりするのかなぁなんて思ってた",
      "start": 286022,
      "end": 303042,
      "timestamp": "04:46"
    },
    {
      "speaker": "C",
      "text": "んですけどそうですねバリバリピッキーになって僕今まで3回就活してたんですけどカナダにその一番初めのカナダのやつとリオフのあった後と今回のやつでだんだんビッグテックと中小ぐらいちっちゃめの規模の会社のアプライの割合を変えていって今回もフルで全部ビッグテックというかメガベンチャーみたいなその大きいやつを狙ったっていう感じですねなので規模は必ず1000人以上のやつで自分がなんか働いてモチベ上がりそうなところをひたすらアプライしたっていう感じですちょっと意地悪",
      "start": 303042,
      "end": 347221,
      "timestamp": "05:03"
    },
    {
      "speaker": "A",
      "text": "な質問になるんですけどなんで大きい会社に行こうかなと思ったんですか",
      "start": 347221,
      "end": 351505,
      "timestamp": "05:47"
    },
    {
      "speaker": "C",
      "text": "そうですねインタビューは見",
      "start": 352908,
      "end": 356531,
      "timestamp": "05:52"
    },
    {
      "speaker": "A",
      "text": "た?全然一応インタビューだった2",
      "start": 356531,
      "end": 361695,
      "timestamp": "05:56"
    },
    {
      "speaker": "C",
      "text": "つ理由が2つってことじゃないいろいろ理由があってやっぱり大きい会社だと結構大きい基本とかの開発とかやってる感じがあってもしかしたらそこできるかもしれないなっていう大規模開発ってやつですねであとはやっぱりその大きいところ行くとやっぱりいろんな人が集まるんでそこを期待してっていうのもあるしやっぱりもちろん給料もいいんでそこはそれを狙ってっていうのもあるしであとは大きいところを狙ったら結構もしそこでしっかりやれば得られるものってその経験もあるしそこで働いたっていうことが次のネクストステップに何でも役に立ちそうだかなと思ってそういうところですね本当に一般的な理由なんですけどもそこら辺をめちゃくちゃ狙ってめちゃくちゃっていうほどじゃないですけども",
      "start": 361695,
      "end": 419995,
      "timestamp": "06:01"
    },
    {
      "speaker": "A",
      "text": "考えてやりましたそうですねまずは給料いいですよねやっぱり笑",
      "start": 419995,
      "end": 425901,
      "timestamp": "06:59"
    },
    {
      "speaker": "C",
      "text": "笑切れ言は",
      "start": 425901,
      "end": 435018,
      "timestamp": "07:05"
    },
    {
      "speaker": "A",
      "text": "言えないですよもちろん僕も同じなんで基本的にやっぱ大きい会社は給料いっぱい出してくれるんでいいですねあとはなんか4番目に言ってたのは全部大きいかなと思うんですけど4番目に言ってたのは特に僕の中で結構大切かなと思っ",
      "start": 435018,
      "end": 451642,
      "timestamp": "07:15"
    },
    {
      "speaker": "C",
      "text": "て",
      "start": 451642,
      "end": 451762,
      "timestamp": "07:31"
    },
    {
      "speaker": "A",
      "text": "てそのレジュメとかアプライする転職活動ってやっぱ大変じゃないですかやっぱこれからの転職活動にすごい有利になるっていうのがあって結構その朝菜でもそうなんですけど働いてるだけでちょっと前にはウェルスシンプルの例えばですけどね日本じゃね間違ったカナダの銀行系の会社の割とスタートアップの中では大きい方のリクルーターから連絡が直接来たりだとかそういうのが来たりっていうのもだしすごい悪い言い方をするとレジュメが綺麗になるみたいなのとかもあったりするしやっぱりレジュメの通過率がめちゃくちゃ変わると思うんですごい楽かなってありますよねあとは2つ目に言われて",
      "start": 451762,
      "end": 503457,
      "timestamp": "07:31"
    },
    {
      "speaker": "C",
      "text": "たのもごめんなさい間違いないですって思って今後自分をアピールするときに色々こう僕はこれやったこれやったっていうのがすごいめんどくさいんでなんか一個分かりやすいのがあればすごい楽だなっていうのもあっ",
      "start": 503457,
      "end": 518500,
      "timestamp": "08:23"
    },
    {
      "speaker": "A",
      "text": "てそういうのもあって",
      "start": 518500,
      "end": 519682,
      "timestamp": "08:38"
    },
    {
      "speaker": "C",
      "text": "やったっていう感じですね",
      "start": 519682,
      "end": 520503,
      "timestamp": "08:39"
    },
    {
      "speaker": "A",
      "text": "まああと今後あの山田さんとか彩香さんはわかんないですけど僕はまあそのうちは日本に帰ろうかなと思って日本でももうちょっと仕事はしたいかなとは思ってるんですけどそういう時にもやっぱりいいのかなと思いますよねちょっとわかりやすい名前があるとそのなんだろう結構やっぱ海外に行ってた人ってなんか結局あの人たち何してたんだろうみたいなの見られやすいと思うんですけどマイクロソフトのエンジニアでやってましたみたいなのを言えるとすごい分かりやすくこの人ちゃんとやってたんだなみたいなのも聞いてもらえるのもいいのかな",
      "start": 521779,
      "end": 553014,
      "timestamp": "08:41"
    },
    {
      "speaker": "C",
      "text": "と思いますよね間違いない",
      "start": 553014,
      "end": 555016,
      "timestamp": "09:13"
    },
    {
      "speaker": "A",
      "text": "ですあとこれ僕ちょっと前に渡辺さんという方にインタビューして渡辺さんとはちょっと違う意見だったんですけど今回ちょっと彩香さんもちょうどいるんで聞いてみたいなって感じなんですけど僕は結構今の会社にすごい良いエンジニアがめちゃくちゃいっぱいいてそのエンジニアたちから学べることがすごい多いなっていうふうに感じてて渡辺さんはユニティっていうところに行ったんだけどチームによるとは思うけど自分の周りではそんなでもなかったみたいなふうに言ってて確かに会社にもよるしチームとかその時期とか運とかにもあると思うんですけど綾香さんはどうでし",
      "start": 555016,
      "end": 598576,
      "timestamp": "09:15"
    },
    {
      "speaker": "B",
      "text": "た私の周りも私の周りも優秀な人はいっぱいいますなんか本当にシニアとかの人の話聞いてると何言ってるかわかんないとかありますしけど仕事の仕方っていう意味ではそうですねみんななんかこういい意味でゆるくけどやることはちゃんとやってるしすごいコミュニケーションの仕方とかもなんかこういうふうに伝達すれば結構ステークホルダー多いんですよ大きい会社ってだからいろんな人に情報を回してコンセンスさせるみたいなそういうマネジメントも必要になってくると思うんですけどそういうのが上手い人もいるし本当にいろんな分野で得意分野が違う人たちがたくさんいるから学べることは多いなって思います確か",
      "start": 598576,
      "end": 660768,
      "timestamp": "09:58"
    },
    {
      "speaker": "A",
      "text": "にでもそういえば思ったけど彩香さん1社目だからそんなに比較はできないのかと思った確かにクラビオはないかもでも聞いてる感じだとね確かにうちの会社でも同じようなことが本当にあっていろんな優秀な人がいるなっていう感じで物事そういうステークホルダーと話したりだとか進めるのがめちゃくちゃ速い人もいれば技術的にすごいなっていう人もいれば頭の回転めっちゃ速いなみたいなこの人はみたいなのもいるんで確かにそうだなっていうふう",
      "start": 660768,
      "end": 688501,
      "timestamp": "11:00"
    },
    {
      "speaker": "B",
      "text": "に僕もペアプログラミングとかしたときにシニアの人とやるとアイデアがすっごい滝のように流れ出す人でそれを全部伝えてくれるけど結局どれがいい",
      "start": 688501,
      "end": 700506,
      "timestamp": "11:28"
    },
    {
      "speaker": "C",
      "text": "の?みたいな感じがなったり",
      "start": 700506,
      "end": 703288,
      "timestamp": "11:40"
    },
    {
      "speaker": "B",
      "text": "してよく喋る人が多いからこっちではすごいオーバーロードみたいななる時もあるけどそれだけ知識量が多い人が多いんだなっていう感じ",
      "start": 703288,
      "end": 715857,
      "timestamp": "11:43"
    },
    {
      "speaker": "A",
      "text": "はしましたなんかあの優秀な人っていう話の流れでなんかいい大学を出てる人もめちゃくちゃ多いですけどまああの浅野だとあのSFの近くにあるんでなんだっけUCバークレー優秀な",
      "start": 715857,
      "end": 732853,
      "timestamp": "11:55"
    },
    {
      "speaker": "C",
      "text": "人っていう意味では僕の今の会社でも全然いますねなんか多分僕の今の会社ちょうどすごいその規模が大きめになる企業との中間点みたいなトランジションみたいなフェーズのところで規模的には400人ぐらいなんですけどもでも結構もう本当になんでこの会社って言ったら必要なんですけどなんでこの規模の会社いるんだろうっていうレベルのめちゃくちゃ優秀な人がなんか結構ちょいちょいいてそこら辺はソフトスキルがすごい優秀っていう人もいれば10Xエンジニアみたいな感じで気づいたら全部自分で作っちゃってるとか気づいたら自分でバーンってこれ作ったから導入するぜみたいな人もいたりして本当に気分的にはこいつだけでいいんじゃないかなって思っちゃうぐらいの人もたまにいるっていう感じですね",
      "start": 732853,
      "end": 785008,
      "timestamp": "12:12"
    },
    {
      "speaker": "A",
      "text": "そういう意味で言うとあれですよねリートコードだとかデザインシステムとかそういうのを技術力も高い技術力もそうだけどを話しながらコミュニケーションとりながらやる技術だったりだとかあとはそもそもリードコードみたいなのできるかどうかみたいなのとかも問われてくるからそれはできないけど優秀な人たちっていっぱいいるじゃないですかそういう人たちも中くらいの会社には結構多いかなっていうイメージはあり",
      "start": 785008,
      "end": 821241,
      "timestamp": "13:05"
    },
    {
      "speaker": "C",
      "text": "ますよねそれは間違いないと思いますね結構なんかこの人らも後はインタビュー対策したらもうどこでも生きるんじゃないかなみたいな人ばっかじゃないですけど結構いるんでやっぱりそれは",
      "start": 821241,
      "end": 833395,
      "timestamp": "13:41"
    },
    {
      "speaker": "A",
      "text": "すごい感じますねインタビューだけが苦手って人も結構多いですからねまぁあれですけどちなみ",
      "start": 833395,
      "end": 840140,
      "timestamp": "13:53"
    },
    {
      "speaker": "C",
      "text": "になん",
      "start": 840140,
      "end": 840340,
      "timestamp": "14:00"
    },
    {
      "speaker": "A",
      "text": "かごめんなさいちょっと話変わるんですけど他の6つぐらいっていう風に言われてたんですけど他のレジュメはパスしたけど行かないことを決めたのか落ちたのかわかんないですけどその6つの会社はどういう会社だったん",
      "start": 840340,
      "end": 861062,
      "timestamp": "14:00"
    },
    {
      "speaker": "C",
      "text": "ですかそうですね結構バラバラなんですけども一つ目がストライプでそこは最終までいったかな二つ目がスノーフレークっていうところでこれも最後までいったっていう感じですね面白いのがマイクロソフト今回なんか3つぐらいポジション同時並行でやっててでなので三つポジションやってもう一つがAppleですねそれをやってAppleは一時で落ちちゃいました一番自信あったのに",
      "start": 861062,
      "end": 894471,
      "timestamp": "14:21"
    },
    {
      "speaker": "A",
      "text": "まあそういうこともありますねうんとか他の人とかもいろいろあるからそこら辺はなんかしょうがないってしょうがないけどその三つポジションっていうのは一気に三つポジション進んでたって感じなんです",
      "start": 894471,
      "end": 905795,
      "timestamp": "14:54"
    },
    {
      "speaker": "C",
      "text": "か一気にですね微妙になんか1ヶ月ぐらいずれたりしてたんですけど最初なんか進めてたらなんかその進めてる途中でなんかこのポジションをなんか別のリクルーターから行くぜみたいなってでそれがなんか2回ぐらい来たんでマジかよってびっくりしましたねさすがにそれ",
      "start": 905795,
      "end": 926543,
      "timestamp": "15:05"
    },
    {
      "speaker": "A",
      "text": "はそれは技術面接も別々であるんですか?それとも一回やったから技術面接は一回目できたからパスみたいな感じなんです",
      "start": 926543,
      "end": 937899,
      "timestamp": "15:26"
    },
    {
      "speaker": "C",
      "text": "か?いや、それが全部別々なんですよ。だから靴足と",
      "start": 937899,
      "end": 941705,
      "timestamp": "15:37"
    },
    {
      "speaker": "B",
      "text": "か。チームによって使ってるスタッフが違うからとかです",
      "start": 941705,
      "end": 946740,
      "timestamp": "15:41"
    },
    {
      "speaker": "C",
      "text": "か?やっぱ結局メンタビュー通してやっぱりワンオンで会ってみたいっていうのがあるんで多分微妙に聞きたいこととか違ったりするんでそういった意味では確かに一時面接ぐらいパスしたら全部同じにしてほしいんですけど",
      "start": 946740,
      "end": 964000,
      "timestamp": "15:46"
    },
    {
      "speaker": "A",
      "text": "ね、よく考えたら僕の時は、朝菜なんですけど、面接は全部一緒で、ビヘイビラルクエスチョンだけなんていうのリハイブラリクエスチョンって大体入るところのチームのマネージャーがやるみたいな感じとか関係のあるマネージャーがやるとかなんですけどそこに何人かいて今回何人かいるよって言われて何でって言ったらいくつかのポジション空いててみんなが一緒にやれるようにみたいな感じでだから技術面接は一緒でそこだけ別一緒にだけど聞きたいことをそれぞれ聞き合うみたいなでそのカルチャラルフィットをすればどっかのチームに入れるみたいな感じだったんですけどそういうやり方もあるけどじゃあ大山さんの場合は全部別々でな",
      "start": 964000,
      "end": 1012414,
      "timestamp": "16:04"
    },
    {
      "speaker": "C",
      "text": "んですねいや別々でやりましたねだから全部合計で多分8回ぐらいインタビューやっ",
      "start": 1012414,
      "end": 1018339,
      "timestamp": "16:52"
    },
    {
      "speaker": "A",
      "text": "たと思いますマイクロソフトでありそれ3つのうちの1個に向かって2つ落ちたってことなんですか",
      "start": 1018339,
      "end": 1025104,
      "timestamp": "16:58"
    },
    {
      "speaker": "C",
      "text": "じゃあ1個受かって2つ落ちたって感じですね",
      "start": 1025104,
      "end": 1028915,
      "timestamp": "17:05"
    },
    {
      "speaker": "A",
      "text": "あ、そうなんだそれとも1個受かっても2つは終わりになったと",
      "start": 1028915,
      "end": 1034579,
      "timestamp": "17:08"
    },
    {
      "speaker": "C",
      "text": "かではなくいや本当にちょうど前半2つが落ちて最後のやつで受かったって",
      "start": 1034579,
      "end": 1043265,
      "timestamp": "17:14"
    },
    {
      "speaker": "A",
      "text": "いう感じですねまさかのへー",
      "start": 1043265,
      "end": 1046186,
      "timestamp": "17:23"
    },
    {
      "speaker": "B",
      "text": "そんなすごいなんか心折れそう最後",
      "start": 1046186,
      "end": 1048969,
      "timestamp": "17:26"
    },
    {
      "speaker": "C",
      "text": "らへんそうですね結構もう一生ってのは思って",
      "start": 1048969,
      "end": 1053652,
      "timestamp": "17:28"
    },
    {
      "speaker": "A",
      "text": "ましたちなみに並行してやってました?他の会社も並行してなんかありまし",
      "start": 1053652,
      "end": 1057796,
      "timestamp": "17:33"
    },
    {
      "speaker": "C",
      "text": "た?そのとき、マイクロソフト3本のときは前半はマイクロソフトの1ポジメ、2ポジメぐらいのときはSnowflakeと同時並行でやってて後半の2、3個目のときはAppleと同時でやってたんで",
      "start": 1057796,
      "end": 1075975,
      "timestamp": "17:37"
    },
    {
      "speaker": "A",
      "text": "10、",
      "start": 1075975,
      "end": 1076385,
      "timestamp": "17:55"
    },
    {
      "speaker": "C",
      "text": "11、12、1はほぼほぼ面接、面接って感じでした",
      "start": 1076385,
      "end": 1081480,
      "timestamp": "17:56"
    },
    {
      "speaker": "A",
      "text": "ね僕も本当同じ感じで一応友達がアンプリチュードで元々働いてた友達がいてその人に一応リファラルをもらってを受けててそっちも僕は1ヶ月あってそれでちょっとかぶって朝なもみたいな感じしかも僕めちゃくちゃそれ自信がアンプリチュート自信あって絶対受かったーって思ってたらなんか朝なのなんか第2次面接ぐらいの前の日ぐらいに落ちててすげーちょっとなんか結構へこんでなんかはーやってらんねみたいな感じで言ったけどみたいなめちゃくちゃ疲れますよ",
      "start": 1081480,
      "end": 1128453,
      "timestamp": "18:01"
    },
    {
      "speaker": "C",
      "text": "ねめっちゃ疲れますもう言ってもだからいつもだいたい2,3個ぐらい同時並行でやってた状態だったんでしかも働きながらやるのが今回一番きついなって思いましたねそのスケジューリング調整が働いてなんか1個だけとかだったらその日のためにUQ取るぜとかシックで取るぜみたいなバーンでできちゃうんですけどなんか2,3個やってるとプライオリティが難しいしこれも大切にしたいなみたいになってくると結構運が悪いともう1週間に2、3日ぐらい重なったりとかしてなんかすげー空き時間見つけてなんとか今の会社のミーティングとかの合間とか見つけたりとかやったりあとは結構なんかいつインタビューができるかっていうのが結構予測できないっていうのもあったりしてスケジューリングみたいなこっちが交付日を出すのにしても交付日ってある程度枠が必要じゃないですか何個か本当にこの日だけしか無理っていうのもまぁできるっちゃできるんですけど大体2,3日ぐらい交付を出してねっていう風に言われるんで一社で2,3日ぐらい交付を出してると他の会社でも同時閉庫を受けてたらその2,3日とかになってくるともうめちゃくちゃなんかその一つが決まるまで、その他のやつって被らないようにして2、3日こう出せってほぼほぼ無理じゃない?無理っていうかめっちゃ難しいじゃないですか。例えば1社目は月過水でほび出して次の会社が過水木とかで仮に両方とも火曜日に入っちゃったら終わっちゃうんでなので月過水と木金とかでほび分けるみたいな感じでそうすると1週間全部未面接入る可能性があるみたいな状態になっちゃうんで僕は結構そう言うよねそれは",
      "start": 1128453,
      "end": 1237061,
      "timestamp": "18:48"
    },
    {
      "speaker": "A",
      "text": "さ、月か末ってさ、どっちもに言ってさ、でももう1個受けてるから被っちゃったらごめんねって言えないなそうっす",
      "start": 1237061,
      "end": 1245588,
      "timestamp": "20:37"
    },
    {
      "speaker": "C",
      "text": "ね、それも全然なんかありだった気がしますねなんか今思ってくれたら",
      "start": 1245588,
      "end": 1249691,
      "timestamp": "20:45"
    },
    {
      "speaker": "A",
      "text": "結構結構その段階による1次面接2次面接ぐらい通ってて途中とかだったら結構大切な候補者はあるじゃないですかそういう時だったら相手も落としたくないからとかあと大体の人たちが割と並行して受けてることが多いと思うんで途中で他に受けてる会社あるとかなんていうのカウンターオファーじゃないけどオファーちょっとその競争させてみたいなのとか結構あるあるじゃないですかだからなんかそこまで悩まずにそうしてそうって思ったけどわかんないどうなんだろう僕はあんまりかぶらせないようにしてましたねちょっとだけあの全なんか割と僕あのレジュメに自信があってレジュメであんまり落ちないと思ってたんであの少しずつかぶせるようにしてた最後の面接あたりに次の会社の一時面接を始めるぐらいをやるように回してたかもしれないまあでもそれでも疲れるんですけどねなんかちょっとずれて何もない時間とかが何も面接がない時間とかあると結構気持ちが切れちゃいそうになるじゃないですかそうですね何が正解かわかんないけどヤンマンさんは今回受かったのできっとそれが正解だったん",
      "start": 1249691,
      "end": 1346893,
      "timestamp": "20:49"
    },
    {
      "speaker": "C",
      "text": "でしょういや、何も特には、ただ今の話で言うと結構他の会社の名前じゃないですけど他にも選挙を受けてるんでって確かに全然出してもよかったかなっていう選考途中に結構多分やっぱビビってたんかなって思いますねそのスケジュール調整で調整したりするのがなんかいつ名前出したらいいのかなとか他のところとか名前出さなくてもいいかもしれないですけどもなんかもうひたすら飲まれてまし",
      "start": 1346893,
      "end": 1377460,
      "timestamp": "22:26"
    },
    {
      "speaker": "A",
      "text": "たけど今の話聞いたら",
      "start": 1377460,
      "end": 1379421,
      "timestamp": "22:57"
    },
    {
      "speaker": "C",
      "text": "全然交渉できるなって思ったんでもしやる機会が今後あったらそうしたいと思い",
      "start": 1379421,
      "end": 1384745,
      "timestamp": "22:59"
    },
    {
      "speaker": "A",
      "text": "ますなんか自信とかにもよるじゃないですか今回マイクロソフト受かってちょっとマイクロソフトで多分自信ついてマイクロソフトだぞみたいな感じでいけば次からは逆のできるじゃないですかわかんないけどできる",
      "start": 1384745,
      "end": 1400514,
      "timestamp": "23:04"
    },
    {
      "speaker": "C",
      "text": "とすごいです",
      "start": 1400514,
      "end": 1401254,
      "timestamp": "23:20"
    },
    {
      "speaker": "A",
      "text": "ねある程度レジュメの最適化もされてたみたいなんですけどそれ以外にはどんなふうに技術面接の勉強だとかビヘイベラルインタビュー行動面接っていうんですかねの練習とかどういう",
      "start": 1401254,
      "end": 1415531,
      "timestamp": "23:21"
    },
    {
      "speaker": "C",
      "text": "ことされましたかメインとしては3つ主軸を持っててDSAといういわゆるアルゴリズム系とシステムデザインとビヘイベラルクエスチョンの3つをメインの要素としてやってそれを毎日コンスタントにメニューとか組んだりして気分とかで入れ替えてやったりして対策してたっていう感じ",
      "start": 1415531,
      "end": 1444628,
      "timestamp": "23:35"
    },
    {
      "speaker": "A",
      "text": "ですねDSLって何です",
      "start": 1444628,
      "end": 1445749,
      "timestamp": "24:04"
    },
    {
      "speaker": "C",
      "text": "か?DSAっていう日本だとデータストラクチャーアンドアルゴリズムっていう一応こっちだとそっちのほうの略し方のほうが大きいですかねそれからリードコード化っていう感じですごいこれ厳密なんですけどアルゴリズムってアルゴリズムだけじゃなくてアルゴリズムとデータストラクチャーなんで一応大体どこのコースとかも基本的にアルゴリズムだけじゃなくてデータストラクチャーも入れるんでみんなめんどくさいからその掲示板とかだったら結構DSADSAってみんな言ったりして",
      "start": 1445749,
      "end": 1484685,
      "timestamp": "24:05"
    },
    {
      "speaker": "A",
      "text": "ますねなんか結構いろんな会社で最終面接まで行ったりしてると思うんで結構な範囲をリートコードとかDSAっていうんですかでカバーしてると思うんですけどどういうふうに勉強されたんですかリートコードのデータストラクチャーとアルゴリズムっていう分野で",
      "start": 1484685,
      "end": 1506626,
      "timestamp": "24:44"
    },
    {
      "speaker": "C",
      "text": "はDSAに関しては、アルゴリズム系に関してはもうニートコード1本って感じでしたね。ニートコードって言う、なんかNの方ですね。結構有名、最近有名だと思うんですけど、あれがよく一番まとまってるんで、DSAに関しては僕結構もともと昔から対策してたんである程度の基礎知識があったんである程度のBDMぐらいまでは解けたり解けなかったりで結構であのサイトって結構なんか面接員出る150問ぐらいみたいなのまとめてくれてるんですよねなのでそれをひたすらこれ有料でしょ?えっと有料プランもありますね無料で結構半分ぐらい見れて有料で結構奥深くまで見れるっていう感じですねちなみに何か課金したんですかもちろんですもう2,3年前ぐらいに課金してますねでもあれ買い切りなんで多分1万か1万5千ぐらいなんで全然価値あると思うししかもサイドで結構アルゴリズム系だけじゃなくてシステムデザインとか他のOPとかもカバーしてるんでちょいちょい間違いなくビッグテックとかそういうテックインタビューがある企業だったら絶対にサブスクというか買い切りした方がコスパがいいサイトだと僕は思います",
      "start": 1506626,
      "end": 1591387,
      "timestamp": "25:06"
    },
    {
      "speaker": "A",
      "text": "ねぶっちゃけああいうのって全部課金しちゃえばいいんじゃないって思いますよね一瞬で元取れるじゃないですか実際なんでデータストラクチャー系とアルゴリズム系分かんないようだったらどんどんどんどん金かけて買ってもちろんちゃんと全部やるっていうのが前提ですけど全部お金かけても分かんない20万ぐらいにしか多分ならないと思うんで最悪全部課金しても23ヶ月すれば元取れるんじゃないかって勝手に僕は思ってるんです",
      "start": 1591387,
      "end": 1621145,
      "timestamp": "26:31"
    },
    {
      "speaker": "C",
      "text": "けど結構それ同意で結構課金しまくってましたね課金した後に見てないやつとかも見てないっていうかあんまり使ってないやつもありましたねとりあえず中身見るだけのために課金してそれでなんか良かったらまあ運が良かったし悪かったらもう嫌って言ってやったんですけどそれでもまあトータルおっしゃったようにそんななんかもうもっと言えばもう多分全部でねそんな10万もしない5万ぐらいのレベルでいけちゃうんですよねなんかもうあのとりあえず買ってみて本気できたかったらとりあえず買ってみてやるっていう",
      "start": 1621145,
      "end": 1654377,
      "timestamp": "27:01"
    },
    {
      "speaker": "A",
      "text": "のが一番いいんじゃない",
      "start": 1654377,
      "end": 1654978,
      "timestamp": "27:34"
    },
    {
      "speaker": "C",
      "text": "かなって思います",
      "start": 1654978,
      "end": 1655638,
      "timestamp": "27:34"
    },
    {
      "speaker": "A",
      "text": "ねあとはなんか課金することでちょっとそのやらなきゃなみたいな思う強制力みたいなのってあるじゃないですかやっぱりイートコードとか得意な人僕も割と得意ではあるんですけどとはいえなんか1日に2問も3問も解くのって結構そのそれこそそのミリアムとかあのハイレベルハードレベルとくのって結構時間かかるじゃないですかだからその1日それだけやろうと思うと結構その仕事以外でそのだけの時間を使わないといけないから結構やっぱ忍耐力って必要でそれのために僕はもう課金しちゃうっていうのも割とありましたねなんかお金を",
      "start": 1655638,
      "end": 1702600,
      "timestamp": "27:35"
    },
    {
      "speaker": "C",
      "text": "無駄にしないみたいなモチベーション間違いないですね。ライズアップみたいな感じですよね。なんか払っておくことでモチベを高めるみたいな感じです",
      "start": 1702600,
      "end": 1711629,
      "timestamp": "28:22"
    },
    {
      "speaker": "A",
      "text": "よ。そうそうそう、確か",
      "start": 1711629,
      "end": 1712930,
      "timestamp": "28:31"
    },
    {
      "speaker": "C",
      "text": "に。それは間違いなくあると思います。とりあえず払ったら、まあもうそれやったんだしってやる気になるし、あと結構なんだかんだやっぱり有料のサイトはいいですね、サービスは。やっぱり有料な部分にちゃんとリスポンスビリティが発生するんでちゃんとユーザーに対応しないといけないっていうことでコメントとかもちゃんと返信してたりとか定期的に更新したりするんで無料もいいんですけども始まりは無料で全然いいんですけども全然本気でやるんだったら有料で時間とか効率性を高めるっていうのがあとモチベを高めるっていうのが一番いいかなって思います",
      "start": 1712930,
      "end": 1746342,
      "timestamp": "28:32"
    },
    {
      "speaker": "A",
      "text": "ねもともとなんかあのミディアム溶けたり溶けなかったぐらいまだ溶けない溶けたり溶けないかったりぐらいのまでのレベルではあったっていう風に言ってたんですけどそのレベルに至るにはどういうことをされたんですか",
      "start": 1746342,
      "end": 1760619,
      "timestamp": "29:06"
    },
    {
      "speaker": "C",
      "text": "最初は結構なんかブーストっていうか面白いのが僕の行ってた学校私立の先生が前も名前出したかもしれないですけどデレックっていう先生なんですけどもその先生が結構アルゴリズムオタクだったんでなんか授業でなんか知らないですけどいきなり結構アルゴリズムの授業とかをわざわざ割いてやってなんか2、3ヶ月間ぐらいしかもそこで結構難しいなんかハードレベルまで全然やりだしてなんで多分生徒によっては全然結局フロントエンドとか使わないからしかも中二症ぐらいの規模だったらなんでやってるか意味わかんねえってやってたんですけど僕は結構もともとそんな嫌いじゃなかったんで面白いやんって感じになって結構そこで基礎知識つけて最初の基礎は学んだっていう",
      "start": 1761891,
      "end": 1810293,
      "timestamp": "29:21"
    },
    {
      "speaker": "A",
      "text": "感じですね早川さんだったけどデリックではなかっ",
      "start": 1810293,
      "end": 1815598,
      "timestamp": "30:10"
    },
    {
      "speaker": "B",
      "text": "た私フランス語でしたデリックってまだ",
      "start": 1815598,
      "end": 1819731,
      "timestamp": "30:15"
    },
    {
      "speaker": "A",
      "text": "やってるのかな確かに僕の先生もデリックだったんですけどリードコードめっちゃ好きですよねめっちゃやらされた気がするしでも僕結構あの一番最初に紹介された時にそれからハマってちゃんとずっとやっててで僕あの学校行ってた時まだ当時あのなんて言うんだっけコロナになる前でただなんか僕自分で行けるっしょと思ってたんで学校あんまり行ってなかったんですよそしたらシアトルに遊びに1ヶ月間ぐらい遊びに行ったりとかブラジルに遊びに行ったりしてて1回単位を落としたんですねでその先生に何とかしてって言ったらリートコード50問やってきて見せてくれたらいいよって言われてでもデリックが最初になんか紹介してくれた時点50も通り越しててokですみたいな感じで言って次の日くらいにはいって言ってみせたらokになったっていうエピソードが確かにあの人はめっちゃ好きあの人",
      "start": 1819731,
      "end": 1891650,
      "timestamp": "30:19"
    },
    {
      "speaker": "C",
      "text": "強プロ勢なんで元々",
      "start": 1891650,
      "end": 1893650,
      "timestamp": "31:31"
    },
    {
      "speaker": "A",
      "text": "確かにそうなんだから",
      "start": 1893650,
      "end": 1894971,
      "timestamp": "31:33"
    },
    {
      "speaker": "C",
      "text": "知らなかったなんで好きでしかしそれでokって言うのどんだけ好きなんって感じ",
      "start": 1894971,
      "end": 1900252,
      "timestamp": "31:34"
    },
    {
      "speaker": "A",
      "text": "ですよねまあまあカナダなんで学校外まあ学校ってかまあコーナーストーンは特にねちょっと緩い学校なんでっていうのもあると思うんですけどじゃあ学校でやりつつまあその後も自分でちょこちょこやりながらみたいな感じ",
      "start": 1900252,
      "end": 1916452,
      "timestamp": "31:40"
    },
    {
      "speaker": "C",
      "text": "ですかそうですね学校で基礎やった後に台解けるようになってそのおかげで多分最初から結構大きな会社でもスクリーニングっていうか一時面接だけは取れるようになったっていう感じでただビザ的なもんとかその後が無理だったんで最初は普通にそういう企業に行ってたんですけどもやっぱりなんだかんだ後半になってきてそういうの対策しないといけないなってなった場合にもう一回やるかってなってそこでニートコード知ってあえやんってなってもう一回",
      "start": 1916452,
      "end": 1950029,
      "timestamp": "31:56"
    },
    {
      "speaker": "A",
      "text": "始めたっていう感じでしたね何回ぐらいやりました?分けて2回に分けてやったみたいな感じなんです",
      "start": 1950029,
      "end": 1959998,
      "timestamp": "32:30"
    },
    {
      "speaker": "C",
      "text": "か?リートコードは本当にオンオフオンオフしすぎてよくわからんですね結構伝説とかっていう対策わかんないですね毎日してたっていう時もあるし全然せずに週末のコンテストだけプレッシャーに対する中でどんだけできるかみたいなことを鍛えるためにやってたっていう時もあるしちょっとまばらすぎて何回って数えることはできないんですけどもでも結構定期",
      "start": 1959998,
      "end": 1994252,
      "timestamp": "32:39"
    },
    {
      "speaker": "A",
      "text": "的にやってたっていう",
      "start": 1994252,
      "end": 1996494,
      "timestamp": "33:14"
    },
    {
      "speaker": "C",
      "text": "感じですねめっちゃやってる方だったと思いますただめっちゃやってる後にそうですねめっちゃやった後に気づいたのがそんなにやらなくていいなっていうのは分かりましたその心はなんか結局めっちゃやってもなんか問題めっちゃあるんでなんかそんなにそれが解けるようになったからって言って適当に出した問題が特にいけるわけじゃないしあとは結局なんだかんだ面接で出る問題ってほぼほぼ決まってるっていうのがよくわかったんでなのでさっき言ったみたいにニットコードが出している150問のやつをしっかりとっておけばいいんだなっていう結構昔は質より量の方をメインでひたすら解いてたっていうのがあったんですけども意外と質のほうが重要だなっていうのでそこは気づいたっていう感じですね",
      "start": 1996494,
      "end": 2047523,
      "timestamp": "33:16"
    },
    {
      "speaker": "A",
      "text": "りょうがあったから質に移行できたっていうのもありそうな気もするしGogleとかって確か新しい問題どんどん作るみたいなのがあるからそういう会社に受けるのであれば量も大切なのかなあと僕DP系えっとなんだっけダイナミックプログラミングか僕めっちゃ苦手なんですよいやわかります今ではできる今では多分大体大丈夫なんですけどそういう苦手なやつは世にある問題全部見ればいいと思ってて",
      "start": 2047523,
      "end": 2085393,
      "timestamp": "34:07"
    },
    {
      "speaker": "C",
      "text": "僕",
      "start": 2085393,
      "end": 2085693,
      "timestamp": "34:45"
    },
    {
      "speaker": "A",
      "text": "はだいたい普通の会社のやつは取れると思ってて",
      "start": 2085693,
      "end": 2098422,
      "timestamp": "34:45"
    },
    {
      "speaker": "C",
      "text": "今それあってますねさっき言った世にあるのっていうのが結構150文に集約してる部分もあるんでとりあえず150文全部押さえておくかつあと一番究極なのが会社の過去を見るっていう感じですねリートコードNのほうじゃなくてLのほうオリジナルのリートコードのほうがタグとかがあったりして企業別に分けてるんで僕とかは最初の基礎力上げた後にそのタグで例えばMicrosft受けるってなった場合にはMicrosftのタグで調べて過去3ヶ月とか6ヶ月のフリクエンシー出現範囲度でイージーとかもあるんですけどでも自分が時に臭そうなやつをひたすら全部目通してひたすら抑えておくっていうのは物量で最後もう笑う気みたいなやつはやってました",
      "start": 2098684,
      "end": 2152440,
      "timestamp": "34:58"
    },
    {
      "speaker": "A",
      "text": "ね絶対やったほうがいいですよね僕は前回の会社も今回の会社もリートコード系の問題僕一瞬で終わらせてるんですけどそれ予想とそもそもやりすぎて暗記してたみたいなので一瞬でどっちも終わらせててやっぱある程度やればそういうラッキーも起こりうるかなと思っててできるからいっぱいやったほうがいいですよね僕はちなみにそろそろ転職かなって思うタイミングで3ヶ月ぐらい絶対勉強するようにしてて一番最初の就職こっちカナダのね就職の前に3ヶ月ぐらいやってその前はちょっとやってたけどそこで僕も割と維持は絶対解けるしミリアムも解けるし解けるか解けなかったかぐらいになってで2社目受ける前にもまたやってでミリアム大体いけるなってなってで3社目今の会社の前もちょっと復習だけやってみたいな感じでやりましたねなんかやっぱちょこちょこやるのがいいですよね、なんだろうあんまりなんかコンツメすぎてずっとやり続けてもなんかちょっとやる気がなくなっちゃうし僕は割とメリハリをつけてやってよかったなって",
      "start": 2152440,
      "end": 2226549,
      "timestamp": "35:52"
    },
    {
      "speaker": "C",
      "text": "感じですねそうですね僕も多分なんかある程度一回最初のその規則から全部知ってやるのだけは結構大変だと思うんですけどもそこはなんか大変かもしれないですけどそれ一回やって慣れた後は後はなんか半分思い出しゲー",
      "start": 2226549,
      "end": 2241229,
      "timestamp": "37:06"
    },
    {
      "speaker": "A",
      "text": "みたいな感じがあるんで",
      "start": 2241229,
      "end": 2242230,
      "timestamp": "37:21"
    },
    {
      "speaker": "C",
      "text": "確かに確かにそこを1ヶ月から3ヶ月間ぐらい当ててバッとやってこうちょっと覚えげにさせていくっていうのはもうあのプライドを捨ててやるっていうのがいいんじゃないかなって僕は思いますね確か",
      "start": 2242230,
      "end": 2255807,
      "timestamp": "37:22"
    },
    {
      "speaker": "A",
      "text": "にシステムデザインについてはどうですかどういうふうに",
      "start": 2255807,
      "end": 2258490,
      "timestamp": "37:35"
    },
    {
      "speaker": "C",
      "text": "勉強されましたシステムデザインは結構僕がめっちゃ苦労したところでリードコードはさっき言ったみたいに最初から基礎があって結構最初からいけたって感じなんですけどもいつもそのシステムデザインが特にこの1年で初めてやったやつでしかも僕最近にバックエンドになったんでもう全部がゼロからスタートだったんで最初は本とかこれもおすすめのHeloWrdっていうウェブサービスがあるんですけどもそれで基礎的な知識を抑えた後に有名なトピックとかコモンパターンよくあるあるパターンとかを調べてそれをベースにある程度のトピックは自分でMockでインタビューしたり誰かとモックインタビューしたりしてっていう感じでやってきました",
      "start": 2258490,
      "end": 2311863,
      "timestamp": "37:38"
    },
    {
      "speaker": "A",
      "text": "ね。モックインタビューはどういう人にお願いしたんです",
      "start": 2311863,
      "end": 2315491,
      "timestamp": "38:31"
    },
    {
      "speaker": "C",
      "text": "か?今回は全然なんだかんだしなかったんですけども1年前とかだったら確かプランプもう名前が変わっちゃったかななんか無料のインタビューサイトがあるんですよねそれはなんかよくあるのはインタビュー。\nioみたいな感じでお金をめっちゃ払ってその講師からインタビューをやるっていうそういう形式もあるんですけどもそのプランプ今の名前ちょっと忘れてたんですけどもそれはマッチングみたいな感じなんですよねこの例えば土曜日の夜8時にスタートするみたいな感じでブッキングしといたらその8時になってウェブサイト行ったらマッチングがスタートして同じように登録している人とマッチングして1時間使って最初の30分は自分がインタビューする側で向こうがなんか面接かみたいなその後半30分はロールが逆になって違う問題があるっていうなんか本当にランダムの人で世界中の人と会うってインタビューするっていうので結構緊張感いるしなかなか大変なんですけども結構それがメンタル的にも気合的にも練習になるっていう感じはそれは最初でボコボコになりながらされされながらやってましたね泣き",
      "start": 2315491,
      "end": 2390635,
      "timestamp": "38:35"
    },
    {
      "speaker": "B",
      "text": "ながらそれは相手も転職活動している人なんですか?それとももうシニアとかの",
      "start": 2390635,
      "end": 2401675,
      "timestamp": "39:50"
    },
    {
      "speaker": "C",
      "text": "人?面白いのが本当にピンキリで僕みたいに最初から始めて何も知らないっていう人もたまにいたりするんですけども逆に今Amazonで働いてて実は自分もJobChangeしたいからインタビュー受けてるんだっていう人もいたりして結構いろんな上下があります",
      "start": 2401675,
      "end": 2418208,
      "timestamp": "40:01"
    },
    {
      "speaker": "A",
      "text": "ね確かにインタビューする側になるのも結構勉強になるからいいなって思うんですけど相手側にそのインタビューする技術がなかったらそんななんかインタビューされる方も微妙なんじゃないのとかってちょっと思うんですけどどうですかそれは間違い",
      "start": 2418208,
      "end": 2439918,
      "timestamp": "40:18"
    },
    {
      "speaker": "C",
      "text": "ないですなのである程度やった後に極めようとするとなんかクオリティ上げようとするとそのサイトは良くないかなっていう感じですねただなんかもうなんかとりあえず初めてやって何やったらいいか分かんないっていう状態からある程度こうスパルタでちょっとなんか雰囲気だと使って慣れるっていう意味ではなんか結構いいんじゃないかなっていうのでなんかずっとはなんで僕も後半使わなかっていう感じでしたね最初のある程度そのあんまりちゃんとはしなかったんですけども後半はでもまあなんかきっかけにはなれたじゃないですかインタビューする確かに確か",
      "start": 2439918,
      "end": 2478571,
      "timestamp": "40:39"
    },
    {
      "speaker": "A",
      "text": "に聞いた感じだとそれこそ有料のやつ今大手にいる人でそういうのを受かってきた人たちがなんかインタビューやってあげますよみたいな多分時給みたいな感じで1時間300ドルとかって結構よく見ると思うんですけどそういうのをやる前にちょっととりあえず量こなしてそういうのに慣れるみたいな感触つかむみたいなのを前にやると確かに良さ",
      "start": 2478571,
      "end": 2504041,
      "timestamp": "41:18"
    },
    {
      "speaker": "C",
      "text": "そうですねいやそうなんですよ間違いなくそれでなんかいきなりゼロから状態で一回も文句インタビューしたことない状態でそういう人たちとあたると結構300ドルって無駄になりやすいんですけどある程度何回かやった後にそうなると初めて何か意味が出てくるんじゃないかなっていう感じのノラインタビューみたいな感じですねめっちゃ怖いですけど",
      "start": 2504041,
      "end": 2527072,
      "timestamp": "41:44"
    },
    {
      "speaker": "B",
      "text": "ねただの感想です。怖そうだなと思っ",
      "start": 2527072,
      "end": 2538287,
      "timestamp": "42:07"
    },
    {
      "speaker": "C",
      "text": "て。逆に言えばインタビューってそういう感じなんで、それ慣れてはね。インタビューも結構慣れてくるっていうかメンテナンスを鍛える面でもいいかなってどうせタダだし最悪怖かったらもうねあのプラザワータダなんですかサーベスくん今はもう課金制になってんのかな僕が始めた当時ってなんかちょっと始まったばっかりで結構なんか最初7回ぐらいまで無料とかだったんですけど僕リファラルで人にあげまくってたらなんかいつのまにか無限にできるみたいな特別になってそれずつ使いまくってたっていう感じなんですけどさっき言った怖いってなっても最悪ブッチしたり途中でああもういいってパズルボタン押せば終わるだけなんであと",
      "start": 2538287,
      "end": 2584510,
      "timestamp": "42:18"
    },
    {
      "speaker": "B",
      "text": "はどうしようもしかしてもうその人には一生会わ",
      "start": 2584510,
      "end": 2587892,
      "timestamp": "43:04"
    },
    {
      "speaker": "C",
      "text": "ない?基本は会わないじゃないですか僕同じ人と会ったことは二度とないですね多分さすがにユーザーIDとか管理してるんで絶対過去に会った人とは会わないようにっていうのはできるじゃないです",
      "start": 2587892,
      "end": 2600100,
      "timestamp": "43:07"
    },
    {
      "speaker": "A",
      "text": "か",
      "start": 2600100,
      "end": 2600120,
      "timestamp": "43:20"
    },
    {
      "speaker": "B",
      "text": "ああそうか面白い初めて知っ",
      "start": 2602328,
      "end": 2605130,
      "timestamp": "43:22"
    },
    {
      "speaker": "A",
      "text": "た教材はじゃあそのハローワールドでモクインタビューはそのハローインタビュー",
      "start": 2605130,
      "end": 2609854,
      "timestamp": "43:25"
    },
    {
      "speaker": "C",
      "text": "ですねハローインタビューハローインタビュー",
      "start": 2609854,
      "end": 2613077,
      "timestamp": "43:29"
    },
    {
      "speaker": "A",
      "text": "はなんて言うんだっけ忘れちゃったけどそのサービスを使ってその勉強みたいなところはそのハローインタビューがメインえごめんなさいハローインタビューがどっち",
      "start": 2613077,
      "end": 2637876,
      "timestamp": "43:33"
    },
    {
      "speaker": "C",
      "text": "だハローインタビューがめちゃくちゃいいですね中国語を学ぶっていう意味でもいいしYouTbeも出してるしなんなら最近だったら結構AI使って採点サイトも出てるし多分あれもなんか有料で払ったら講師が採点してくれるっていうのもやってくれるしとりあえずシステムデザインはもうあれ一択とはまだ言ってないんですけどでも始めるんだったらもうあれで80割ぐらいカバーしてくれるんじゃないかなっていう感じがします",
      "start": 2637876,
      "end": 2668148,
      "timestamp": "43:57"
    },
    {
      "speaker": "A",
      "text": "ねだからYouTbeにも結構いいの上がってますよねなんか僕はYouTbeを結構使っててなんかドロップボックスをデザインしてくださいだとかツイッターデザインとかYouTbeデザインとかって言ってなんか結構いろんなのが上がっててそれが良かった覚えがあるけど僕はそのそこらへんの今ヤンマーさんが言ってくれたサイトは使わないサイトとか教材は使わなかったかな多分そうです",
      "start": 2668148,
      "end": 2696657,
      "timestamp": "44:28"
    },
    {
      "speaker": "C",
      "text": "ね、りょうさんがやってた時って、ちょっとまだそのハローインタビューがそこまで力入れてなかった時だったと思うんですよね。そんな勢いで。確かに。なので、ちょうど終わった後ぐらいに僕が始めようと思った時に、結構だんだん色々増えてきて、YouTbeとかも出したりってやったんで、僕はそっちの方やったっていう感じでした",
      "start": 2696657,
      "end": 2715619,
      "timestamp": "44:56"
    },
    {
      "speaker": "A",
      "text": "ね。えっと逆に何だろうまあこれからちょっと大きい会社に行くと思うんですけどあやかさんはもう大きい会社に3年4年ぐらいいるんで大先輩なんですけど逆に何か聞いてみたいこととかありますかあるやつ",
      "start": 2715619,
      "end": 2734758,
      "timestamp": "45:15"
    },
    {
      "speaker": "C",
      "text": "ありますあのやっぱり皆さんそのちょっといきなりもあるしちょっと小さいところ小さいっていうか中ぐらいの時から全然大きめの規模にバーンって入ったっていうことがあったと思うんですけどもそれでなんかその違いギャップとかでめっちゃこれが苦労したとかつまずいたっていうのがあれば1点と逆にこれやってたらやっててよかったとかあとはなんかもし同じことをやるんだったら多分こうするだろうなみたいなことがあったら知りたいって感じですね僕は今からちょうど入るんでなんか今のうちにできることとか入った後に意識してできることがあったらすごいやりたいなっていうのは考えてるんであんまないかもしれ",
      "start": 2734758,
      "end": 2782350,
      "timestamp": "45:34"
    },
    {
      "speaker": "A",
      "text": "ないですけどあやかさんでも確か入った当初最初めちゃくちゃ苦労したっていう風に言ってたと思うんですけど",
      "start": 2782350,
      "end": 2789876,
      "timestamp": "46:22"
    },
    {
      "speaker": "B",
      "text": "そうですねいやそれが大きい会社だからなのか分かんないですけど確かにいいしゃべりバンクーバー来て一社目なんでどうなんだろうでも体感ではやっぱり他のスタートアップとかで働いてる人とかの話と比べるとミーティングが多かったのでそうですねすごい人と話す機会行動を書くっていうよりかは人と話す機会が多くてその中でプレゼンテーションしたり",
      "start": 2789876,
      "end": 2825306,
      "timestamp": "46:29"
    },
    {
      "speaker": "A",
      "text": "と",
      "start": 2825306,
      "end": 2825466,
      "timestamp": "47:05"
    },
    {
      "speaker": "B",
      "text": "かエピックなんて言うんだろうエピックってエピックですねエピックを管理する役になったらエピックリードになったらPMとの調整QAとの調整いろんなステークホルダーとのさっきも話したみたいに調整する時間も多かったりとかがあったとりあえずミーティングの多さとその自分で発言しないといけない場の多さにすごい私は最初圧倒されて思ってたのと違うと思いました私はエンジニアになったのは黙々と静かに誰とも話さず仕事する目的でなったのにちょっと聞いてた話と違うぞと思ってもし今の会社とか前の会社が自由に行動する時間がたくさんあるんだったらちょっとその辺はギャップになるかもしれないです",
      "start": 2825466,
      "end": 2889286,
      "timestamp": "47:05"
    },
    {
      "speaker": "A",
      "text": "ね確かに僕も一社目二社目は割と小さい会社途中くらいの会社だったけどめちゃくちゃ行動する時間があったけど今はその会話する時間だったりミーティングだったり自分が発言しないといけないとかプレゼンしないといけないとかっていうのは確かにめちゃくちゃ多くなったかななんていうのバーバル口頭でもそうだしドキュメンテーションだとかステータスのアップデートみたいなステークホルダーの人たちに説明するだとか今遅れてますよだとか今順調に行ってますよ大きいプロジェクトだと順調に行っててもやっぱり言ってあげないとこういうふうになってるよみたいに言ってあげないと心配っていうかわかんないじゃないですかエンジニア以外の人たちには特にだからそういうのはすごい確かに多いかなあとは付け足す感じで言うとやっぱりドキュメントが多い今は結構AIで会社の中のAIみたいなのがあってドキュメント調べたりするのは多分割と楽ですけど僕が入ったときはまだAIが会社に導入されてなかったりとかでドキュメントを読むんだけど僕が知りたいことはドキュメントの中の5パーセントとか10パーセントででもドキュメントは100パーセントの量で書いてあるから全部結局読まないといけないみたいなのでもう苦労はしたんだけど今はなさそうかなそこら辺は時代の変化も",
      "start": 2889286,
      "end": 2987390,
      "timestamp": "48:09"
    },
    {
      "speaker": "C",
      "text": "ありなるほど確かにそう考えるとでっかいからこそその不透明性が出てきてそれを補うためによりソフトスキルが必要になってくるっていう感じですよねコミュニケーションの",
      "start": 2987390,
      "end": 3004169,
      "timestamp": "49:47"
    },
    {
      "speaker": "B",
      "text": "ほうがあといろんなチームが存在してるから自分の扱ってるプロダクトよりもプロダクトの他に触っちゃったりとかすると他のところが壊れるとかもあったりとかインパクトの範囲がすごい広いなって思いますねパフォーマンスとか影響出たら全然違うチームの人からいきなりメッセージきてちょっとこれめっちゃ遅くなってるんだけどすいませんとかすごい影響する範囲が広くなってしまうからその辺ではそうですね",
      "start": 3004169,
      "end": 3046964,
      "timestamp": "50:04"
    },
    {
      "speaker": "C",
      "text": "ちょっと気を",
      "start": 3046964,
      "end": 3047305,
      "timestamp": "50:46"
    },
    {
      "speaker": "A",
      "text": "使うだからこそ",
      "start": 3047305,
      "end": 3051196,
      "timestamp": "50:47"
    },
    {
      "speaker": "B",
      "text": "ミーティングが多いんだと思います。いろんな人の意見も聞いて、他の人の立場での意見も汲み入れないといけ",
      "start": 3051196,
      "end": 3059461,
      "timestamp": "50:51"
    },
    {
      "speaker": "A",
      "text": "なかったりするからめちゃくちゃ似てるというか被せる感じになるけどAORみたいな概念があってAreaofResponsibltyっていうんですけど自分の持ち物みたいなのがあっていつプロダクトを開発するプログラムワークみたいなのとは別に自分のチームの持ち物とか自分個人の持ち物みたいなのがあってそれを管理するような仕事がなんていうんだろうなそのスプリントの中に組み込まれていくあの例えばこのページはこの人のものだからなんかこのページを触るときはその人に一応レビューしてもらってねみたいなのとかがあったりするんですよその会社とかにもよるんですけどあの朝なってあのアサナっていう会社がアサナっていうプロダクトを作ってる会社なんでマイクロソフトとかだとなんか違うチームがもうプロダクト1個持ってるとかってなったりするからちょっと構造は違うかもしれないんですけど自分の持ち物を管理していくみたいなとか行動が汚くならないとか自分が好きなふうにではないけどいいものを保つための仕事みたいなのがあってそれにちょっと最初苦労っていうわけじゃないけど時間配分だったりとかはちょっと難しいかな自分がプログラムワークに集中してどんどんどんどん新しい機能に時間費やしたいのにそういうのが入ってきてみたいな感じでちょっとそっち行ってまた戻ってきてっていうコンテキストチェンジみたいなのがあったりするのは割と大変っていう風に思ったかな当時はそれって",
      "start": 3059461,
      "end": 3164587,
      "timestamp": "50:59"
    },
    {
      "speaker": "C",
      "text": "なんかその自分が持ってるやつって変わっていくんですか?それともなんかどんどん増えていくっていう感じなんです",
      "start": 3164587,
      "end": 3169850,
      "timestamp": "52:44"
    },
    {
      "speaker": "A",
      "text": "か?変わってもいくし増えてもいくし僕の場合はチームを交換したんでそのチームのOKRみたいなのとか自分らが作ってきたものとかが割とそのOKRに沿ったものだったりとか自分らが作ってきたものとかそのチームにあるべきものがその人たちに割り当てられるんですよ基本的にはだからチームが変わるとそれが変わるってのもあるし長くいればもちろん多分増えていくことが多くなるんですけど例えば新しく入ってきた人たちに受け渡しがあったりだとかまた僕みたいな人がチームを変えたときにその人が抜けるからその人の持ち物をちょっと分配しましょうみたいなのがあったりするんでチームの中ではちょっと整理されなんか分配されたりはするから減ることもなくはないですけどなるほど",
      "start": 3169850,
      "end": 3226534,
      "timestamp": "52:49"
    },
    {
      "speaker": "C",
      "text": "って感じですかねじゃあ結構なんか自分というかシマっていうか管轄領域みたいなのがチームレベルじゃなくて個人レベルでも発生するっていうことですねそれをなんか僕が全部今まで質問してきた中で結構繋がってるのってやっぱりそのコミュニケーションっていうのがあってそうすると考えてるのがやっぱりすごい重要なのがなんかこれがあった時に誰になんか話したらいいかっていうか誰に連絡したらいいかみたいなのを知るってすごい重要だなって思ったんですけどもそれってなんかこう自分で徐々に徐々に見つけていきました?それともなんかすごい効率よくこうこれだったらこの人に聞くべきだったかこの人に聞いた方がいいみたいなのってどういうふうに探していきまし",
      "start": 3226534,
      "end": 3272074,
      "timestamp": "53:46"
    },
    {
      "speaker": "B",
      "text": "た?なんかスラックの中にたくさんチャンネルが存在しててこのチームのチャンネルASKなんとかチームウッデブみたいななんかチームごとにDev開発用の質問をする場所とあとは本当にカスタマーサポートチームとかが使ってるファンクショナリティよりの質問をする場所とかいろんなチャンネルが本当に存在しててワークフローとかもあって質問するならここのフォームに入力してねとかすごいたくさん存在してるから私も最初にどのチャンネルに何を聞けばいいのか分からなかったんですけどでも本当に自分の小さいチームの中からって質問を投げてこういう疑問があるんだけどどこの人に聞くのがいいかなって聞いてしたら知ってる人が教えてくれるからそれでどんどんどんどん私のブックマークしてるチャンネルが増えていってみたいな風にして広げていきましたね毎回毎回多分質問によって聞く先は違うからしばらくはきっと大変だと思うんですけど私はSlackを超活用し",
      "start": 3272074,
      "end": 3342633,
      "timestamp": "54:32"
    },
    {
      "speaker": "C",
      "text": "ましたなるほどめっちゃサンゴになり",
      "start": 3342633,
      "end": 3347065,
      "timestamp": "55:42"
    },
    {
      "speaker": "A",
      "text": "ますうちもそれと近くってスラックはそういうふうになっててチーム名inboxみたいなチーム名interalとかいろいろそういうのが分かれてたりするんでそこに引きに行ったりだとかあとアサナはやっぱりアサナ自体がそういうプロなんかプロダクトなんでなんか割とそこらへんはなんか気持ち良くなるようにルールとかで設定してたりなんかそのわかりやすいようになんか朝の中で設定してたしてるっていうのがあってそこらへんはなんか結構システムチェックにやってくれてるってのもあるかもしれないでもやっぱあやかさんの言うとおりそこはもう本当に時間かけてとかもう最初だからチームの人に聞いてその人が教えてくれてとかでその人に聞いてみてみたいな",
      "start": 3347065,
      "end": 3399907,
      "timestamp": "55:47"
    },
    {
      "speaker": "B",
      "text": "いつかに一人仲良くなれる人が作るのが一番早いですよ何でも聞くいっぱいオフィス行ってオフィスバンクーバーですよねオフィスでできるだけ顔出してチームの同僚なりランチする人なり見つけてとりあえずわからないことは聞くおしゃべり好きな人はきっと多いしあんまり仕事もしてないだろうからお話をいっぱいしてわからないことは全部聞くのが早いですオン",
      "start": 3399907,
      "end": 3437727,
      "timestamp": "56:39"
    },
    {
      "speaker": "A",
      "text": "ボディメーターみたいな人がいるからその人をまずその人に聞いてみるでその人がやってることをコピーするみたいな感じでやっていくと確かにいいかもしんないですねその人がわからないときにどういう動きしてるステイクホルダーの人が分かんないときにどういう動きしてるかみたいなのを見てみたらその会社での人たちがやってるようなことを学べそうだなっていうのはありますよねあと僕逆にやってよかったことは最初のほうに割となんか結構実力を出すじゃないけど頑張ってこの人できるなみたいなのを見せると後から楽だなっていうふうに思いますね僕は割となんだろうデザインとか実装とかも早い方なんですけどそれを最初の方で出すことで割となんだろうそういうふうに認知されてなんかプロジェクトとかもそういうなんだろうなちょっと時間とかが求められる時間スピーディーにやることが求められるようなプロジェクトとかがアサインされたりとかでなんか自分の色を出していくみたいなのはなんか割といいかもしれないですねまあ会社にもちろん会社によりけりだと思うん",
      "start": 3437727,
      "end": 3507516,
      "timestamp": "57:17"
    },
    {
      "speaker": "C",
      "text": "ですけどやっぱり信用は最初に",
      "start": 3507516,
      "end": 3512217,
      "timestamp": "58:27"
    },
    {
      "speaker": "A",
      "text": "ついていた方がいい",
      "start": 3512217,
      "end": 3512617,
      "timestamp": "58:32"
    },
    {
      "speaker": "C",
      "text": "ですよねイメージはある",
      "start": 3512617,
      "end": 3513938,
      "timestamp": "58:32"
    },
    {
      "speaker": "A",
      "text": "しなんか僕結構やっぱその大きい会社だとそのクビになっちゃう人も結構多くてそういう人たちはやっぱりなんか最初にすごいオンボーディングとかに時間がかかっちゃってるみたいなのはありそうだなって",
      "start": 3513938,
      "end": 3531476,
      "timestamp": "58:33"
    },
    {
      "speaker": "C",
      "text": "いうのは思いましたね",
      "start": 3531476,
      "end": 3534378,
      "timestamp": "58:51"
    },
    {
      "speaker": "B",
      "text": "オンボーディング一生終わらない人い",
      "start": 3534378,
      "end": 3535959,
      "timestamp": "58:54"
    },
    {
      "speaker": "C",
      "text": "ますよねそういう人です",
      "start": 3535959,
      "end": 3537579,
      "timestamp": "58:55"
    },
    {
      "speaker": "A",
      "text": "かねなんかいなくなっちゃうなっていうのは結構感じる",
      "start": 3537579,
      "end": 3544207,
      "timestamp": "58:57"
    },
    {
      "speaker": "B",
      "text": "んでやっぱりそのなんかマイクロソフトpipめっちゃ厳しいって聞いた",
      "start": 3544207,
      "end": 3547692,
      "timestamp": "59:04"
    },
    {
      "speaker": "C",
      "text": "ことあります怖いですよね",
      "start": 3547692,
      "end": 3549494,
      "timestamp": "59:07"
    },
    {
      "speaker": "A",
      "text": "あでもマイクロソフトがpipあれなのかpipってだいたい厳しいもんじゃないpipいったらもう終わりだと思ったほうがいいっていうふうにみんな",
      "start": 3549494,
      "end": 3558525,
      "timestamp": "59:09"
    },
    {
      "speaker": "B",
      "text": "思っているとマイクロソフトのピーパーなんか別格だ別格だみたいな聞いたことあります私具体的にどう思うと不安はあることありますよ",
      "start": 3559437,
      "end": 3569688,
      "timestamp": "59:19"
    },
    {
      "speaker": "A",
      "text": "ねもう無理",
      "start": 3569688,
      "end": 3570269,
      "timestamp": "59:29"
    },
    {
      "speaker": "B",
      "text": "でしょテイクバックし",
      "start": 3570269,
      "end": 3575534,
      "timestamp": "59:30"
    },
    {
      "speaker": "A",
      "text": "てくださいヤマさんの場合PIPより先にまずプロベーションをサバイブしないといけないん",
      "start": 3575534,
      "end": 3579336,
      "timestamp": "59:35"
    },
    {
      "speaker": "B",
      "text": "で大丈夫ですよそれが始まる",
      "start": 3579336,
      "end": 3582018,
      "timestamp": "59:39"
    },
    {
      "speaker": "A",
      "text": "のかなカナダの企業で言うとカナダもやっぱりアメリカほどはレイオフしやすくないんでPIPとかがちゃんとしてるみたいなのあると思う",
      "start": 3582018,
      "end": 3589763,
      "timestamp": "59:42"
    },
    {
      "speaker": "B",
      "text": "んでオフィスに行くようにする方がいいと思います最初オンラインでこいつ何やってるんだって思われるより毎日行ってとりあえずちゃんと勤勉さん",
      "start": 3589763,
      "end": 3601905,
      "timestamp": "59:49"
    },
    {
      "speaker": "A",
      "text": "バーティールして確かにそういう意味で言うとヤンマーさんはないかもしれないけど僕はオフィスに行ってもオンラインだったので僕一人だけのチーム会社のバックーバーには僕一人だけだったんでそこはめちゃくちゃ大変でしたねやっぱり無駄な料理を僕みんながオンラインだったらいいんすよまだみんながオンラインだからちょっとコミュニケーション作ろうねとかっていうのが結構あったりするんででも僕の場合はオンライン僕だけっていう僕だけバンクーバーで他の人みんなsfっていう感じだったんでそれで苦労も結構ありましたねコミュニケーションなんか取るのが難しいみたいななんか僕だけ伝わってないことがやっぱり出てくる",
      "start": 3601905,
      "end": 3641586,
      "timestamp": "60:01"
    },
    {
      "speaker": "B",
      "text": "と",
      "start": 3641586,
      "end": 3641686,
      "timestamp": "60:41"
    },
    {
      "speaker": "A",
      "text": "か僕が途中まで僕じゃない人がリードしててその途中から僕がリードしたプロジェクトがあってなぜかわかんないけどそのプロジェクトなんかにノミネートされてアワードもらってるんだけど僕もらったことも知らないし何も共有されてなくてなんかSFに出張があって行ってその僕に引き継ぐ前の人のところになんかアワードみたいのがあってなんだあれって思ってでフワッと聞いてみたら仲良い別の人に聞いてみたらあれあのプロジェクトのアワードお前もされてたよみたいな",
      "start": 3641686,
      "end": 3679652,
      "timestamp": "60:41"
    },
    {
      "speaker": "C",
      "text": "ことを言われたみたいな",
      "start": 3679652,
      "end": 3681573,
      "timestamp": "61:19"
    },
    {
      "speaker": "A",
      "text": "何も聞いてないみたいなそんなのがあったりもするんでコミュニケーションは大切ですね",
      "start": 3681573,
      "end": 3688958,
      "timestamp": "61:21"
    },
    {
      "speaker": "B",
      "text": "もうチームメイトとは会ったんですか会ったというかインタビューのプロセスでチームメイトとはもう対面したんですか",
      "start": 3688958,
      "end": 3695543,
      "timestamp": "61:28"
    },
    {
      "speaker": "C",
      "text": "いやまだですねこれちょっと載せていいかよくわかんないんですけども今回もうマジで新規のチーム1から作るらしくてリード以外はなんかもう新しく入ったりとか別のところから来たりっていう感じなんですよねだからインタビュープロセスもリードっていうかそのメインのマネージャー以外は実際にチーム8とは関わせしてないんじゃないかっていう感じなんですよ",
      "start": 3695543,
      "end": 3719457,
      "timestamp": "61:35"
    },
    {
      "speaker": "B",
      "text": "ねおーそれは…今日マネージャー",
      "start": 3719457,
      "end": 3722401,
      "timestamp": "61:59"
    },
    {
      "speaker": "C",
      "text": "はもうあったんですねマネージャー会いましたね2回くらい話してインタビューとオファーをもらった後に1回僕結構ちょっともう1回やる内容を知りたいから話させてくれって言ってもう1回プラスでインタビューではないんですけど確認の1on1開いてやる内容とか目的じゃないですけど色んな細かい内容を話したんでその時によく話したって感じ",
      "start": 3722401,
      "end": 3748318,
      "timestamp": "62:02"
    },
    {
      "speaker": "A",
      "text": "ですねでも出来立てのチームは割とどうしたらいいか分かんないみんなが分かんないみたいな状況になったりするんで大変だなっていうのも思いつつそれみんなが分かってるからしょうがないよねみたいなのはあると思うんでちょっとぐらいランプアップに時間がかかっても大丈夫かなと思いつつあれもこんぐらいですかねとりあえずはお疲れさまでしたっていうのとお",
      "start": 3748318,
      "end": 3779340,
      "timestamp": "62:28"
    },
    {
      "speaker": "C",
      "text": "めでとうございますありがとうございますと",
      "start": 3779340,
      "end": 3782281,
      "timestamp": "62:59"
    },
    {
      "speaker": "A",
      "text": "いうことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうござい",
      "start": 3782281,
      "end": 3800108,
      "timestamp": "63:02"
    }
  ],
  "highlight1": "マイクロソフトへの転職を目指すヤンマーさんが、DSAやシステムデザインを勉強するために課金したサイトを紹介、有料のサービスは最初は躊躇するけど、時間とモチベーションを大幅に節約できるのでおすすめだと話しています、詳しくはPodcastで話しています。",
  "highlight2": "ヤンマーさんは転職活動で20から40社ぐらいにアプライして、6社で実際にインタビューを行ったと話しており、そのときのエピソードや、どのようにして会社を選んだのか、詳しくはPodcastで話しています。",
  "highlight3": "ヤンマーさんがマイクロソフトへの転職のために何ヶ月もDSAやシステムデザインを勉強し、ニートコードを毎日コンスタントにやっていたと話しています、詳しくはPodcastで話しています。"
}