{
  "episodeGuid": "38e9ffda-c375-481d-b7c3-cac177287431",
  "episodeTitle": "AI時代に未経験からエンジニア海外就職を勝ち取った3つのフェーズ、金融マンの家族移住（前半）#11",
  "transcribedAt": "2025-10-19T01:34:55.090Z",
  "duration": 3618,
  "fullText": "はいそれでは今回はIshiさんに来ていただきましたIshiさんはバンクーバーで働いていてまずは簡単に経歴。から教えてくださいはい、ありがとうございます。石と言います。僕はカナダに2年前に来て、こっちのカレッジを卒業して、今年の3月からこちらでエンジニアとしてキャリアをスタートさせてまして、いわゆる未経験就職したグミです。もうちょっと経歴を話すと、10年ぐらい日本の銀行なんですけど、そちらで働いていて、その後2年間日本のテックのスタートアップで働いてて職種としては金融というかファイナンス系の職種だったんですけど色々あってちょっとカナダでエンジニア就職したいと思いあってこっちに来てラッキーなことに就職して今働いて半年くらいっていうそういう感じですね医師さん。はあれですよね、家族と来られてるんですよね。どんな感じの家族構成なんでしたっけ?子供が2人いまして、今3歳と6歳で上の子は小学校に通ってるみたいな感じ。こうした時点では4歳と2歳っていう感じですね。妻と4人でこっちで暮らしてるっていう。家族が必ずしも足枷になるってわけではないですけど未経験で別に英語系外資とかで働いてたみたいな英語を使って働いてたってわけでもない。んですよねきっと銀行にいた時に海外駐在をしていて東南アジアなんで、お互い第2言語でやり取りするっていうレベル感ですけど、英語で仕事するっていう経験自体もしている状態そう。なんですね、でもそれでも未経験で家族と一緒に来るって結構なハードルの高さと。いうかあれですけど間違いない、俺もだってイッサンの話を一番最初フロック相談来た時、正直ちょっとびっくりしましたもんしかも一山の場合は金融業界のスペシャリストということで過去のご経歴も相当キラキラしていてなんで今さらと言ったらいいかというと言い方が悪いけどエンジニアでしかも国も変えて北米で家族いてこの人ちゃんとカウンシングしたって3回くらい。聞きましたもんそうですね、結構話すと長くなっちゃうんですけど自分のキャリアの話と子どもの教育環境の話といろんな理由があって一つこれですっていうのは僕の場合難しいんですけど結論だけ聞くとクレイジーな話。かなと間違いない、何考えてんだって。家族に関して言うと子供が小さいうちにこっちに来て教育環境的にも多様性がある中で子育てをしたいこれは親のエゴかもしれないんですがそういう思いがあってカナダの場合現実的に僕みたいなまだ永住権も取ってないような人をただで学校に通わせられるっていうのもあったりとかしてすごくあの子育て組にとっては魅力的な国だなぁって思って彼女を選んだっていうのがあのそうですねこれ何から話せばいい。ですかねエンジニアになんかその時にエンジニアになろうと思った経緯はどんな感じなんですかなんか前の職種でもなんかこっちに来たりとか他の国に行けたりっていうのはでき。たんですかねそうですねあの銀行にいる場合は海外に行ってたっていう自分がそういう人材だったっていうのもあってもう一回海外駐在することは可能だったと思うんですけどよくこれは銀行だけじゃなくて日本の海外駐在でよくあるのは結局行ったところで日本の会社の海外法人海外支店ブランチみたいなところで日本の働き方とか日本の仕事をする海外でするっていう僕の場合は海外就職をしたいっていう思いがすごく強くてその時点でまだエンジニアとかあんまり頭なかったんですけど海外駐在をした時にラッキーだったのが銀行が海外の会社を買収したんですねその買収したところに送り込まれるっていうそういうポジションだったんで自分の労働環境的に完全に外資っていうか日本の会社じゃない環境で働いて、それがすごく自分の中でいい体験だったっていうのがあってそれを自分の力で実現したいっていうふうに思ったっていうのが、これ10年ぐらい前の話なんですけど、自分が海外駐在をしたときに感じた現体験というかだったんですねであの当時はそのまあそういうことを自分の例えば金融機関に勤めてる人間がやろうと思った時に一番高取り売り選択して例えば海外mbaに行ってうんあるいはダイレクトに就職するあると思うんですけど何にしてもこうまあ文系職なんですよハードスキルがないですと実際に海外でMBAに行かれた日本人ってすごく優秀な方が多いんですけど皆結局海外で自分の思ったようなキャリアに引っかからなくて帰ってきたりとか日本ですごくいいパッケージが用意されてるんでそもそもそこが魅力的に移ったりいろんな事情があって就職を目的にした時にあんまり費用対効果というか自分の目的を達成するのに一番確実な方法だと思えなかったのでで走行しているうちにコロナになりあの海外から日本に戻されみたいなあって一旦こうスタートアップに転職したんですね時にあのテックの会社で自分が資金調達をしているあするポジションだったんですけどそのいろんな個ステークフォルダーと話しているときに会社になぜお金が詰まってくるかってあの自分が何かやったわけじゃなくて、そのプロダクトがあるからなんですよね。しっかりしたプロダクトがあって、それが僕がいたのは金融業界だったんですけど、金融業界にとってその革新的なプロダクトだったんで、いろんな投資家が興味を持ってお金を提供してくださるみたいな。結局それってエンジニアがすごいんだよね、僕の中では思って。で、それと、あとさっき言ったMBAのハードスキルがない分系職の人間が海外就職するっていうのを結構僕の中でリンクして自分がエンジニアになれば海外就職もできるし、その時に委員長だとしながら会社が自分ができないことをできるようになるかもしれないいろんな観点でエンジニアになるっていうことが自分の中ではすごい合理的な選択というかお金の話とかにすればキャリアのステップとしては思ったんででみたいなと思っていろいろ探してたらフロックさんに出る感じです。ねなるほどですね改めてちゃんと聞くとちゃんと合理的な背景があったんだなっていうのも改めてびっくりしたところがあるんですが逆にでも僕が聞いていいのであればハードスキルっていう側面で言うのだったら正直エンジニア以外にもいくつかあるよねっていう気ももちろんするんですよもちろんソフトウェアを作るっていう文脈以外でもプロダクトを作る上だとUI作ったりもそうだしマーケット広げたりするのもある意味ハードスキルかもしれないしなんかその中で。エンジニア王っていう部分におい。ては今の文脈だったら海外就職永住権とかっていう部分とやっぱりうまいことリンクしたっていう感じですか。ねそうですねそれもありますねあとはテックとかもう一つは前スタートアップに行ったときにソフトウェアによって法人カード扱う会社だったんですけど法人カードのプロダクトが実はもう何十年も前からあったのにテックのスタートアップが形でサービスを届けた結果プロダクトのコアは変わってないのにものすごく売れるみたいな印象が発生していてそれがやっぱすごいなっていうふうに思ってなんかまあアセナさんがおっしゃる通り何か他にも多分よく考えれば選択肢ってあると思うんですけど自分はなんかこうエンジニアになりたいなっていうふうに思うのも理由があるんであとあれですね、もう今となっては何のあれもないですけど、当時その永住権を取るという観点でエンジニアになる、エンジニアだとこうPCPがかかるとかですね、いろんなベネフィットもあったんで。ありましたね、。昔は。いい選択肢だなっていうふうに当時は映ってた。確かにです。海外に来る時にどういうふうな観点であのカナダを。選ばれたんですか?そうですね。いろいろあるんですけど、当時僕がそういうことを考えていたのが2022年とかだったんですけど、その当時、移民にオープンな国ってほとんどなかったっていうことがあって、カナダは今思えば結構ブーストしてた期間を僕はその時点だけ見てたっていうことなんですけど、すごい移民に積極的だなっていう印象があって、それはアイデンティティとして掲げているっていうふうに僕の目には映って、あとさっき言った教育の話もそうなんですけど、子どもを学校に通わせるとかって考えた時に、カナダほど恵まれた条件のところはなかった。それは金銭的な意味でだけですか?それとも他にも何。かあるんですか?カルチャー的な観点でも、例えばアメリカとかって、これも場所によると思うんですけど、いろんな人種がいるんですけど、やっぱり人種で分かれているという現実があったりとか、いろいろあると思うんですけど、カナダって相対的にはそういうのがあんまりないっていう。ふうに。現実的にはいろいろあるかもしれないんですけど、社会としてその多様性を重んじるということにトライしてるなっていう感じで、これは来てから実際にそうだなって思ったりもしたんですけど、その多様性を実現する前提として、自己肯定感が高くないと他者との違いを受け入れられないっていうのを僕自身が日本で働いたり海外で働いたりしながら学んだところもあって多分多様性とかその他人との違いを重んじられる社会ってそういうふうに自分自身を大事にするということをちゃんと教育してくれる環境なんじゃないかなっていうそれは親として僕は勝手に考えただけなんですけどそういう環境で育てたいな日本の教育ももちろん水準は高いと思うんですけど僕の記憶の限りだとやっぱり組織を重んじるとか学校の一員として社会に恥ずかしくないように振る舞いなさいみたいなのも結構あると思うんですねそれはそれで考え方として別にありだと思うんですけど子どもに学ばせたいのは何かって考えたときに、やっぱりそれよりも全然違う人たちと混じり合って成長していってほしいなっていうのがあって、カナダの教育環境をいいなと思った。また、実際にこっちに来ている人とかに話を聞いたりして、その人たちが結構カナダで教育を受けさせるとすごくいいよみたいなことを言ってたんでそういう期待があって来たって感じですね。なるほどですね実際フロックもこの仕事して長いんですけどやっぱりお子様連れてとか家族でいらっしゃるっていう方やっぱ一定数いらっしゃって僕もトカシさんもやっぱり子供がまだいないのでその辺に対してのすべてなんかそうなんだねっていう部分で聞くことしかできない部分はあるんですけどやっぱりでも多いですもんねこっちの教育環境がとかそういうダイバーシティーがとかでも実際のところどうなんですか日本ってそれこそインターナショナルスクールやっぱり通わせようという親御さんも多いわけじゃないですかその中でやっぱりリスクを取ってまでかなだっていう部分においてはやっぱり先ほどのダイバーシティーの部分だったり子供に与えられる何かっていうところがやっぱり重きを置いてかつ行動に移されたっていう。ことですよねそうですね、子どもの教育という観点ではそうですね。日本でインターナショナルスクールはやっぱり高いという現実的な話もありますし、やっぱり社会の一部に同士になっちゃうので、日本の中でいうと、学校の外を出たらもう全然違う環境、カルチャーだったりしますし、中にはそれこそ自分がもともと働いていた銀行で、インターナショナルスクールで英語力を買われて入ったとか言ったんですけど、日本の会社とのカルチャーアンフィットに苦しんでいる。ああ、やっぱりあるんですね。じゃあその人が急に海外就職して海外で働けるかって言ったら、まあそんなことはないと思って、なんでこう、エグジットとして結構難しさもあるなと思って。なるほどね、インター出た後どうするのっていう部分ってことですね。そうですね。今2年ぐらい、今もうこっちにいるってことですよね。そうですね、僕は2023年のクラス。実際行かせてみてというか、子供とかはどんな反応だったりとか、親から見た視点としてどんな感じですか。この反応は、下の子はまだなんか言葉も日本語も怪しいみたいな状態で来たんであれなんですけど、上の子は結構もう日本で幼稚園に通ってから来たんで、なんかやっぱ帰りたいっていうのはすごい言ってますね。それは友達的な面でですか?そうですね、友達的な面と、あと英語はやっぱり最初できないんで、なんかそこでなかなかこう難しかったりっていうのは1年ぐらいあったんですけど、なんか直近半年ぐらいで急になんかペラペラ喋り出すよう。になっておーやっぱあるん。だ僕の発音矯正とか。始めたりします言いますよねなんかこれはあるあるなんですけど子供になんか発音矯正されるってこっちに来る親子さんあるあるですよ。ねそうなんですよこれ来たかと思ってパパ。のこの発音おかしいって言われますかまあまあショックかもしれんなちなみにごめんなさいね一個だけ多分注釈入れなくちゃいけないのがこっちに来られたインターナショナルの方々のご子様の学費が無料っていうのは確かにあるんですけどもやっぱりステータスにもちろんよるのでペアリンスもステータスにもちろんよるっていう部分で医師さんの場合ポストグラデーションビデオの出る効率化レジ行けたからっていう部分がもちろんあるっていうのはこれちょっと一応前提にはさせてもらえれ。ばと思いますそうですねありがとうございますそしたらちょっと。技術のところどうやって学んだかみたいなところに戻りたいんですけど今あったように公立の学校に通われたってことなんですけどじゃあそれまでは全く未経験未経験だったのはそうだと思うんですけど勉強も日本ではせずに来られたんですかそれとも日本でも準備とかされたんです。か。あんまりできなかったっていうのが正直なところでUDEMYの講座を買って最低限のJavaScriptのシンタックスを勉強したっていう程度ですなので授業に出た時点でなんかこの単語って聞いたことないとかそういうのはないんですけど理解してるかって言われれば全然理解してないみたいなそんなレベル感で来たというか来ちゃったという学校は。どんなコースに通われたん。ですか学校はこちらの公立カレッジのランガラカレッジというところのウェブモバイルデザイン&デベロップメントWMDって呼んでるコースなんで1年4ヶ月ですね全部でそちらに通ってましたね内容としては全然コンピューターサイエンス的なことはやらなくてデザイナーとデベロッパーが半分半分ずつあの構成されているコースででwebアプリを作りましょうそれも完全に実装よりのあのこういうコース。はい行ってみてどうですかあの勉強できたなぁって感じですかそれとも自分でもやっぱり自己学習が必要だったなぁとかまぁ今働いてると思うんですけどそれとのなんか働いてみてのギャップみたいなのとかってありますか。えっと実はそんなギャップの話から言うとそんなにはなくてあの乱柄でやっていることって極めて実践的なんでなんかベースが若干不安なところはあの正直例えばコンピュータサイエンスの知識そういう意味であるんですけどその現場に入ってなんかいきなりこうgithubとかってもらってこれやってくださいって言われると結構それに近いことをランガラの中で実際に体験することができるので割と実践的なコースだったかなというふうに僕は思っています具体的に言うと全部で4タームに分かれているんですけど2ターム目3ターム目4ターム目でUIXデザイナーと組んでプロジェクトを1個回して完成されたウェブアプリを作って出していくんですねでよくある他のコースだと例えばそれを最後のタームだけでやったりとかすると思うんですけどランガラはなんかそれがメインぐらいの感じでどんどん3ヶ月4ヶ月ごとにぐるぐるぐるぐる回していくみたいな感じなんでそれを3週ぐらいすると結構自分の中ではギャップはそんなに感じなかったっていうのがただもう一個ご質問であった学校の授業だけで十分かどうかっていう話で言うと自分で結構カバーしながらやった方がいいかなと思ってて内容的にはそんなに悪い内容じゃないと思うんですけど先生によってすごいクオリティが変わるっていうのがあるのともう一個授業の進度的にそんなに早くないので何かどこにタイムラインを置くかによるんですけど例えば卒業した後にすぐ就職したいっていう風に考えるのであれば学校のペースでやってたら多分間に合わないのでどんどん先取りして勉強していくっていうアクションが必要という感じですね。教材というかプロジェクトを回す形学校の勉強でプロジェクトを回す形になるとそれこそシンタックスだったりとかプレームワークの勉強とかっていうのはもう自分自身でされたっていう感じ。ですかそうですねおっしゃる通りで若干乱柄のコースが矛盾してるんですけど例えば第三ターン目にやるこのプロジェクトがリアクトなんですねリアクトを使ったアプリを作ってくださいって話なんですがランガラはその時点そのプロジェクトが始まった時点でまだ授業でリアクトを教えてないんですねなので多分本当は良くないっていうかもちろん改善のうちがある気がしてるんですけどただ現実そうなっちゃってるんでプロジェクトを純回転させて参加しようと思ったら自分で次のタイムのプロジェクトで使う技術を前のタイムで学習しておく必要。があるっていうそのキャッチアップにはどの程度時間かかりましたか誰でもできそうかなって感じですかそれとも結構時間かけてやり。ましたそうですね僕は結構時間かけてやったというかむしろそこの時間をどれだけ取れるかを学習のベンチマークにしてたっていう感じですねなんでランガラの授業に出る時点で例えばさっきの例でリアクトを第3ターン目からやりますってなった第3ターン目でリアクトを学ぶってベンチマークを自分の中で置かないようにしててそれも第2ターンまでに自分の中でやっておくっていうのをしてましたねそうなってくると結局全部の授業力入れてたら自分の時間が取れなくなっていくので偶然的にその必要のない授業とか自分の興味があまりない授業は最低限単位だけ取れればいいやみたいな感じで割とバッサリあのメリハリをつけながらやっててただしプロジェクトだけはめちゃくちゃ真剣スタンスで基本的になんで自分の勉強を多分3、4時間ぐらいは取ってやってましたねそれもなんかその自分の中で計画を立てて今週はここまでやるとか今月はこういうふうにやるとかそういうのをこうつぶつぶで立てながらあの学習してた気がありますねこの辺はあれ。だよね割と未経験から。こっちへ就職しましたって。人割と今回いろいろポッドギャスを通して話してる気がするけどやっぱ共通してる部分かもしれないですね学校の授業だけフォローアップするっていう人は多分一人もいなくてむしろバッサリするっていうワードが結構よく聞かれるなって気がするのでなのでイスさんもそこにね上位に漏れずという形でその取捨選択はちゃんとできて。たってことですねそうですねそこがむちゃくちゃ重要だと思い。ますあのなんだろうわからないえっと新しい技術とか全く別のことを勉強するときにあの何がわかんないかわかんないみたいな状態になりがちだと思うんですけどなんかその勉強をする上でそのここまでとかってどういうふうに決めたんですかもしくはなんかメンターみたいな方がいたんですか。なんかコマゴマと質問するようなメンターはCっていうなら学校のインストラクターがそうだったかなっていう感じですけどあのえっとどこまでっていうのはあんまり負荷を失いようにはしてましたね逆に言うとあの例えばあのまあリアクトの例をもっかい出すとなんかリアクトってあの中級とか上級とかいろいろあるじゃないですかよ放送買うとあれでなんかも初級とか中級でいいとこで止めてあの複雑なリアクトフックは必要性が生じるまでちゃんと勉強しないみたいなことをやってどんどんどんどん新しい知識を吸収してアウトプットするようにしてましたねアウトプットしたときにつまずいて初めて何が必要かって見えてくると思ってインプットするとどれが本当言う通りでどれが重要か分かんないし自分の中に何が分かんないかも分かんない分かった気になるだけで終わるみたいな経験的なパターンだと思うんでとにかく早く実装することに重きを置いてやってましたねその一つの例としてタームとタームの間にランガラって3週間ぐらい休みがあるんですけどデザイナーを一人声かけて二人で個人プロジェクトを回してLinkedIにアップしたりとかしてそれは二つの狙いがあって一つはアウトプット学習のためにやったもう一個は乱柄のプロジェクトの終了を待ってレジュメに載せてると遅れるんで自分で一個技術をマンスタックでアプリを作りたかったんで乱柄のプロジェクトの終了を待ってると自分の収穫が遅れちゃうのでその前にレジュメに載せれるレベルのやつを削って先に載せるためにですねやるっていうのを自分の時間を使ってやったりしてます。なんかジュニアの鏡みたいな人ですね話を聞いているとやっぱなんかその初学者というか未経験で勉強するとやっぱりどこを勉強していいか分かんなくてやっぱりどんどんどんどん変なところ必要のないところに時間をかけたりとか深掘りをしちゃってさっき言われたように分かった気になっているんだけど実際現場でというか働いてみるとそんなに必要なかったりだとか結構初級それこそさっきのudemyとかで購入したときの初級中級みたいなところまででほとんどの仕事はできてそこからって結構なんだろうインターミデートだったりとかシニアの人たちのサポートももらえるから全然確かに最初の方は必要ないからそんな感じのやり方がすごいいいのかなって感じし。ますよねありがとうございますあとちょっと1個話してなかったのがあってやっぱり人に聞くっていうのは結構大事かなと思います今言ったリアクトのどの分野を勉強するんだみたいな細かい話だけじゃなくてなんて言うんですかねその全体の学習プランとかどこどこに努力したらいいのかとかなんかそういうのはやっぱそのあの人の話を聞いて取り入れていった面があってあの僕の場合のえっと広一さんうんうんうんランガラにいらっしゃったはいあのランガラに入りたてぐらいの時にちょっとワンオンの時間をもらって学習のベンチマークをどうやって置いたらいいかって相談をしたんですね結局僕の中では学校を卒業して割とすぐ就職したいっていうのがあってそうなってくるとランガラの授業でいうとどこまでやればそのジュニアとしてのスタートライン立てるんで3ターン目が終わるぐらいつまり卒業4ヶ月前までのカリキュラム終了でスタートライン立てるってあるってエンジニアとしてフルタイムで就職するためにこれもフロックのいろんな人に言われたのが半年ぐらいの実務経験はレジ名に載せといた方がいいそうなってくると残り4ヶ月でスタートラインに立ってそこから就活してたら卒業時点で半年の職歴って絶対に載せられないんで間に合わないなって思ったんでなんで自分の中で2ターン目が終わる時点で卒業の8ヶ月前9ヶ月前ぐらいに自分が就活にアプライできる状態を作っておこうと思って、そこに向かって学習していった。これは自分の中で迷いなく計画を立てるっていう意味ですアドバイスというか。いや素晴らしいこいつさんはねよくフロックのスラックなんかでもメンターしてあげるよっていう風に言うてくれてる人やからもうほんと頭上がらないから今度ちょっと飯でも連れてったからなてか俺の手料理をね御馳走しようって言ってた思っててそれはどうでもいいんだけどでもやっぱりそうねそういうなんか人にすぐ切る人ってやっぱ強いなって俺改めて最近思ってることがあってね、なんでだろうね、逆に言うとなんでみんな聞かないんだろうねっていう全部自分の中で解決しよう。するよねそれも何を聞いてわからないとかっていうのもあると思いますけどねなんかやっぱ話聞いててイシさんはすごい勉強の仕方とかも戦略的ですごい頭がいいなっていう感じなんでなんか聞くポイントもしっかりと心得ているんだろうなみたいなのを感じますよねいや本当にそれ。ちょっと共通点って言ったらもしかしたら失礼かもしれないけど前にやっぱ話した綾香さんもやっぱ未経験からこっちいらっしゃってワークデイ入ってっていう人だけどやっぱ同じちょっと空気を感じるもんね勉強するステップだったりとか分からないところを切り捨てるところだったりとか分からないじゃない必要ないところを切り捨てるところだったりとかすぐ人に聞くっていうところだったりとかやっぱりそういう共通項は実は見えてきそうだよねっていうところが俺実は結構ワクワクして話聞いてる。んですけどなかなか再現性っていう意味ではなんかそれを誰でもできるようになるかって言ったらどういうふうにやったらそうなれるかっていうのが分からないからあれですけど確かにそういう共通点はなんか初学者で未経験からこっちで就職してる人たちにはちょっとそういう共通点がありそう。ですねそうですね共通項はないし再現性は難しいかもしれないけどでもやらなあかんよっていうことをとりあえずリスタップしておくことはできる気がしてて人に聞くとかもそうだしでも聞くっていうことが必要なことだと思ってない人がやっぱり多くて自分の力で何とか解決するこれこそが力になるんだみたいなあるじゃないですか人の力を頼ったらそれは本当の自分の力じゃないみたいなああいうのもちょっと邪魔してるんじゃないかなってそれ人育ちの話になるから何とも言えないん。ですけどねまあでもそうですね、日本だとね、ググレカスでしたっけ?GKSみたいな人に聞くときに、「そんなことも知らないんですか?」ってやっぱり言われちゃう僕も経験があるんでそういうもんだと思ってるとなかなか人に聞きにくいというか、特に未経験ってエンジンだと何話したらいいかわかんないみたいなそうだったんですけどだったんでなんでここ1さんみたいにこう自分から歩み寄ってくれるというかなんか僕の時間を抑えてみたいに言える人めちゃくちゃ貴重でし。たねいやーそうですよね間違いない俺もちょっとたまにあのフロックの作で言うようにしようこいつさんみたいに俺暇よってそういうところからな気がしてきたなんか。まあでも瀬名さんあんまり暇そうではないですけどねそれが出現するかどうか。いやだからほら頑張る頑張るまあ。でもねこれを聞いてそういうふうに自分からそういうふうに質問してくれるような人が増えてくれるといいですねそしたら。僕にも聞いてくれればっていう確かに一緒にぜひ。質問してほしいですねちょっと頑張って聞かせてもらいましょ。うそしたら技術のことは大体なんだろう流れとしてはつかめたかなって思うんでそしたらちょっと英語について聞いていきたいんですけど英語はどのいつぐらいから勉強し始めたんですか?英語はあのカナダに来るたびに改めて勉強したっていうことはあんまりなくて時間がなくてやれなかったっていうのもさっき冒頭話したように海外駐在の経験があって、曲がりなりにも英語で意思疎通してビジネスをしてたけど最低限なんて言うんですかね、仕事はできるみたいな状況で来ました。それはその時の会社のその時の会社に働いてた時に勉強してって感じなんですか?それともなんか何だろう、その前から本当にやっぱ海外で働きたいみたいなのはずっとあって学生の頃から意識して英語を勉強してたとかそんな感じですか?そうですね、学生の大学4年生ぐらいで英語をやりたいなみたいな、海外、もともと海外志向はそんな強くなかったんですけど大学3年生の時に大学でロンドンに行くっていうイベントがあってそこで緩和されてしまってそれから英語も自分でやるようになりました。実はその大学4年生の時にビクトリアに1ヶ月だけ、よくある夏休みを使って遊びの語学旅行とかに行きました。自分の中で結構その体験もでかくて、間違えて喋っても気にしないです。会社入ってから、人口入ったのも海外駐在行けるから安いっていう。で入ったのからもあの自分で勉強はいずっとやってましたねすごいなんかこう込ん詰めて行ったって感じじゃないんですけどなんか継続的にあのまあ勉強してだっていうかただ本当に使えるようになったのはあのまあ海外実際に払えてからありますけど海外。駐在者は僕も知り合い何人かいますけどやっぱ駐在がきっかけで本気で勉強しだしたとかやっぱり喋れるようになったといえば何らかんだいいって思うので仕事で使うようになったっていうのがやっぱり大きい。んでしょうねそうですね僕の場合特に日本のブランチじゃなくて海外の法人に自分が日本人一人とかで乗り込んでいくみたいな感じで一つできないと情報開示。すらしてくれないそりゃそうか、ぶっちゃけでも今エンジニアとして働かれてる部分はあると思うんですけど正直金融の方がやっぱりその英語として詰めなくちゃいけない話っていうのはやっぱ多いんじゃないですかやっぱいや、。なんか似てるところが、むしろ似てるかなと思ってて基本的なワードを使いまして意思疎通を図るみたいな感じなんでなんか日常会話より最終的に楽。みたいなあーなるほどねまあゴールが見えているところがありますよねお互いやらなくちゃいけないこととかそう。ですねそうですねなんか色金融話ビジネスの話をするだけだったら周りと皆さん旅したと思うんですけどキャッチアップはむしろ早いん。じゃない素晴らしいそうするとやっぱり英語周りの分に関しては大学4年生の時の経験から既にもう意識して働きながらまた詰めていってっていう継続が物言っ。たってことですねそうですね。僕の場合はありがとうございますじゃあそのままちょっと次行かせていただくんだったらやっぱりそうですね就活前の話だとは思うんですよねやっぱり英語の部分見えたし学校で相当勉強したっていうのも分かったしフロックのメンバーにも聞いてメンターもいてっていうところもだいぶ見えてきたので具体的にやっぱり元金融マンがこっちでカレッジ行って就職活動する果たしてそんなうまくいくもんなのかっていう話をちょっと聞いてみたいなと思いますが実際どうでした。実際うまくいかなかったですね。そりゃそうっすよねなかなか厳しい。ですよねでもねそういう厳しい厳しいって話をめちゃくちゃ聞いてたんで良かったかなっていう言い口は。現実は分かってたけどっていうまぁでもとはいえやっぱり心の中ではみんな思うじゃないですかとはいえ1ヶ月くらい頑張りゃなんかワンチャンあるんじゃねーのみたい。なそうですねそれってで。もなんかエンジニアに多いんじゃないんですかわかんないけどなんか日本のエンジニアでその楽してきた人たちはそう思うのかもしれないけど石井さんはエンジニアだったわけではないんで日本ではなんかそれはないのかなってわかん。ないけどでもそうですねそれに近い感じですね簡単なわけがないっていう。近い。かったっていうそれはで。も良かったかもしれないですねでも具体的にはいつ頃から何をしだした。とかってそうですね多分あの3フェーズぐらいあるかなと思うまず最初のフェーズから話すと自分が始めたのは半年か経たないかぐらい。の時です何年か早い。早いですねその時点ではVanilaJSCSJavaScriptしか知らなくてそれらを使ったプロジェクトがほぼ完成してるタイミングで1回就活というものをやってみないと何が必要か分からないっていうふうに失敗する前提でやりますその時もでもやるならちゃんとやらないとフィードバックも正しくいられないと思ったんであのランガラの先輩です日本人の先輩何人もいるんでレジュメを見てもらってだいたい皆さんのプロジェクト1個しか書いてないレジュメは通らないよっていうフィードバックなんですけどそれはそうだけどでもこういうふうに書いたらいいよとかあとまあいろいろ教えてくれますしまあリンクトインとかのジョブポスティングを見てこういう感じなんだっていうのがわかっでも、70件ぐらいですかね、その時点で応募して本当ワンクリックでバーってトガシ。用方式じゃないですかトガシさんもこっち来てわけわかんないのにいきなり就活したやつやろ、。確かでも僕今から思うと結構それって良くてメンタル的に大変なことを細切りにすると2回目3回目今でいうとレジュメ作ってレジュメ出して全く帰ってこなくてっていう流れを最初の方に経験しておくと2回目そこからのアップデートになるし知識も溜まってるんでなんかメンタル的にはあんまり来ないのかもしれないですねちょっと今。聞いてて思ったんですけど悪くなることはないもんねだって最初の時より。それは今聞いててすごいそうだなって思いましたね。僕も今本当に聞いてて思ったんですけど僕も本当に2,3回に分けてやってたのもあるしあと僕リートコードを僕もCSとか出てたわけじゃないんでちょっと大手とかを受けるときにはリートコードとかシステムデザインとかって勉強したんですけどそれを結構3回4回ぐらいに分けてやったんですよねリートコードのイージーができるようになって一社目を買ってもうちょっとできるようになって二社目を買ってで他の残りを全部ミディアムは絶対いけるかなぐらいになって今の三社目になるんですけどそういうふうにレジュメもそうだしそういう大変なことをちょっと細切りにしてやると楽だったなっていうふうに思ったんでそれはなんか特にあのレジュメっていうそのレジュメというかその最初の送って返信が来るまでの流れってすごいメンタルにめちゃくちゃ来るじゃないですか最初返信帰ってこないとなんでそこをちょっとなんか細切りにできたのはすごい良かったのかな。みたいな思いましたね今思えばそれを自分もなんかやってた感じです最初は来ないんですよ。でも来ないけどあえて早めに始めてるっていう感覚で、そういう気持ちで自分も臨んでたんで別に帰ってこなくても想定の範囲内みたいな余裕がありますよねそう受け止められましたねこれがなんか完璧にしてから進んでたら来なかった時に完璧なのに来ないともうこれ以上やることないみたいなもうどうしようもない気持ちになってたかもしれないです。ね確かにいやーそうよね実際にやっぱり契機もあるしもちろんポジションが悪くタイミングもあるしっていうね自分以外の余裕も大きいんだけどやっぱり自分のせいにしたくなりますもんね完璧にここまでやったのにっていうそう。ですねなんであのまだ僕はソフトウェア開発がどうとかって言えるくらいの経験もないですけど、アジャイルの話じゃないですけど、早くトライして、早くフェイルして、次に繋げるっていう。それをいかに早くスモールにやれるかっていうのは結構、就活でも同じかなっていうふうにしましたね。なんか履歴書からレジュメに変えるので結構やっぱインプットが多いというかその履歴書ってなんか誰が書い誰がなんか経歴というか経歴が同じであれば誰が書いても同じものになると思うんですけど基本的にはレジュメってやっぱもう何通りでも書き方があってそのまず自分の経験を洗い出すみたいなところでも結構大変だったりするしそれを英語にしないといけなくてまた大変で今はAIとかがあるんでちょっと楽にはなった気もするんですけどそこからアプライしてみてなんだろううまくいかなくてATSみたいなの知ってみたいなやっぱインプットがすごい膨大でなんで全部最初から完璧っていうのは多分そもそも結構難しいんですよね。や素晴らしいではまあそれで実際目レジュメ最初送ってみて当然最初帰ってこないんでしょうけど具体的にどうですかその就職するまでの間ねやっぱり就職活動を振り返ってフェーズねまだ今1個目くらいかなと思います。2を離さないといけないですね。その後やっぱりダメで、少なくともマンスタックのプロジェクトはやらなきゃダメだろうと思って、それをさっき言った個人プロジェクトでささっと書けるものを作って、載せてもう一度やったっていうのが去年の6月ぐらいなので来てから10ヶ月目ぐらいの話ですねそこで確か4,50件ぐらい送ったんですけど帰ってこなくてさすがに今の自分にこの手法はダメだと思ってネットワーク、ネットワーキングですね、ネットワーキングに行くっていう手段を切り替えたっていうのがフェーズ2ネットワーキングっていろんな意見があって意味あるよっていう人もいれば意味ないよっていう人もある僕個人としてはどこに行くかによるかなって思ってて要は自分が提供できるもの、ギブできるものが何でもいいんであればそこに自分が行く価値があるんで何か引っかかるかもしれないただそれがないと自分がテイクするだけになるんで雑踏に紛れるみたいなそういう整理なのかなと思って結構意味ないって言ってる方によくあるのがなんかテック系のミートアップに未経験なのに当然こう雇ってください以外の発言がないみたいな自分から提供できるものも当然ないしそうなってくると同じような人もいっぱいいますとそこの中で自分に就職の話がまあこんだけ競争激しい中で来るわけないよねってあるかなと思って僕も最初それを知らずにあのテック系のイベントに参加してた意味ないなっていうふうに思って自分の場合スタートアップでの経験があったりとかドメインで言うと金融ですねのドメインがあるんでそういうワードに興味があるありそうな人が来るイベントに行こうと思ってスタートアップのピッチイベントとかそういう系のやつはあんまなかったんですけどそういうワードがイベントの名前についてるやつとかに自分の身の上を話して誰か紹介してほしいと言ってましたねそれがちょうど1年ぐらい6月7月8月ぐらいちょうど夏でイベントも多かったんで2,3回ぐらいそういうイベントに行ってすごいたくさんの人とリンクしてコーヒーチャットしてみたいなことをやってましたねその活動を通じていきなり就職できたってわけじゃないんですけどこれを続けてるといいことが起きそうだなっていう感覚は自分の中であっていろいろあるんですけど、一個具体例をあげると、フィンテックの会社のCTOがスタートアップのイベントにいて、その人に声かけたらデベロッパーじゃないんですけど、僕がクレジットカード業界にちょっと詳しかったんで、その話を教えてほしいみたいに言われて、インターナルミーティングに何回か参加するっていう謎のイベントが発生してで、そうこうしているうちにでも僕はビジネスじゃなくてディベロッパーになりたくてこっちに来てるんだけどみたいなからなんかあのちょっと今はまだプロダクトっていうかなんかそのポジションを上げられないけど君が学校を卒業したらもう一回相談してくれるって言われてで、今実際働いている会社は違う会社なんですけど学校卒業したタイミングで向こうから連絡が来て雇ってあげるよみたいなインターンでいいんだったら雇おうよみたいなたのがあっいましたねえっともう1個はこれ実際にあの自分があのレジュメに乗ったってすごい大きな話だったしフロックも関わってる話なんですけどあのボランティアですねボランティアにえっとなんかすることができるようになったっていうのがあってあの僕は勝手にこじつけてるだけかもしれないんですけどもとあるイベントでそのえっと終わるイベントでファウンダーの方を見てその人に僕個人的に興味持っててイベント中には話しかける時間がなかったんですけど一方的にリンクトインとかのメッセージとか送っててたまたまなんですけどその3週間後ぐらいにフロックでその人がやってる会社のボランティアの募集がフロックで出たんですねそれに応募してボランティアとして迎え入れてもらったっていうそれがまあその後僕のレジュメに乗って今の回それがフェーズ2の成果ですもう一個はあのランガラーからあのパートタイムの仕事をえっといただいたってのがまああの8月の末ぐらいにとってなんであの成果というか、フェーズ2の終わりに起こったことはボランティアと1個パートタイムと2つの仕事場をいただくことができたっていう感じですね素晴らしい、。それはだってね、卒業まで半年くらいのタイミングでそれを実際かけていたっていうことですもんね、。そうするとそうですね、半年ちょっと切ったくらいでそうですね、そういう状況を持っていけたんでちょっと遅れましたけどよかったなっていや素晴らしい。だって当初の予定通りっちゃ通りだったんじゃないですかだって半年分くらいの何かしらの職歴をレジュメに載せなくっちゃねってそのフロックの他のメンバーからとかも聞いててどうにかやっぱりそれを行動にうつかさえないとなっていってフェーズ1で失敗し2でじゃあ。っていうことで一心復帰まあ。でも2のタイミングは色々期待事ありますねやっぱりそのネットワーキングの部分においては正直賛否両論は間違いなくその通りでそう行っても意味ねーよなっていう人も相当フロックにもいるしいや絶対行くべきだっていう人もめちゃくちゃ多いからそうなんかこの辺は人に正直よるなーってずっと思っていたんだけどギブできるっていうワードは確かにあるかもしれないですねイベントに対し。てあとは多分あの行っても意味ないっていうのはその人は行っても意味ないっていうことなのかと思うんですよね僕も多分行っても意味ない組なんですよねっていうのはまああんまりなんかそのなんだろう自分から発言していく方ではないしライトニングトークみたいなのをするような性格ではないっていうのがあって言っても意味ないって言ってる人たちはシャイだったり僕みたいにそういうことあんまりやりたくないかなっていうのでで、自分からもあんまり喋りかけにはいかないタイプなのであれば、確かにその人は行っても意味ないっていう。で、。まあなんかそういうふうにギブが与えられるものを探すっていうのもまあ一つですし、えっと、まあ登壇するっていうのも一つだし、で、そんなことギブできるものはないけど、えっと誰にでも、誰でも彼でももう話しかけれるよみたいな性格の持ち主だったら多分それも、あの、なんだろうね、行っても意味あるそう言った方がいいっていう人になるんだろうなぁみたいなまあその人のコンテキストがあってのなんかまあ賛否両論なんだろうなみたいな。のがありいや間違いないちょっとたまにかわいそうだなって思うのが明らかにそうトガシさんタイプというかまあ本当は行きたくないし行く必要も多分ないんだろうなっていう人がでもメンターからやっぱり行った方がいいよって聞いたからもう自分のケツむちゃくちゃぶっ叩きまくってもう嫌だけど行くみたいなね人もいたりするかそうなるとメンタルやられたりするからすねなかなかちょっと嘘万人にって言っては自分との会話が大事だなってあると。思いますねそれはそうですねあと僕はその前の職歴にフックをかけていきましたけど趣味とかでも全然いいと思って趣味っていうとそのフレンドシップとかその趣味の知識とか興味関心がギブできるものとかみんなそれを期待しているのでそこで普通に友達作ったりとか仲良い人作ったりとか全然いいかなと思いますね僕の周りの友人でもそこで出会った人がたまたま実はスタートアップのCEOまで行ったみたいな。ありあり全然ありフロックのメンバーの中でも一人Amazonのエンジニアさんでワンピースカードがむちゃくちゃ趣味で何とかフロックのメンバーでワンピースカード好きな人いませんかみたいなそうコミュニティを広げていきたいみたいな人いたりするから見方を変えるんだったらAmazonのSDの4年くらい働いてる人と仲良くできるコミュニティっていうことにワンピースカードがもしかしたら作用するかもしれないしねそういう趣味を通すは全然ありだと思うそれはギブの一つだから。あとはIT系ってやっぱりめちゃくちゃホワイトじゃないですかで時間も早く終わるんでやっぱり趣味の時間を持ってる人多いんですよねだから僕個人的にバレーとかサッカーとかテニスとかやるんですけどやっぱりIT系の人多いですからねなんでその人たちと一緒に運動して運動するとしゃべらなくても仲良くなれるんですよほぼしゃべらなくても同じチームだっただけでなんか友達になれるみたいなのがあるんでそういう人たちでit系の人とかいたらこの頃仕事探してるんだよねぐらい言えば多分結構いいふうにしてくれるというかレファラルくれたりもすると思うんで確かにそういうのはお。すすめですね個人的に思ってるのがリファラルとかでもいいんですけどそういうのが有効な理由っていうか背景みたいなところで結局その情報、LinkedIみたいなコールドプラットフォームで人が集まりすぎてて選ぶ側が選べなくなってるうーん間違いない自分もその前のスタートアップで採用とかやってたんですけどやっぱその人をなんかその超客観的に評価するのってすごく難しいなって思って多分不可能だなって思ってやってくるとなんか特にその大きい会社だったらちゃんとした採用プロセスがあってそのためのリソースがあってっていうそうじゃない大多数の会社においてはなんかそこにいるいいやつを採用するのが間違いないみたいな思考になりがちなのかなと思ってて別になんか超トップの人材を取らなきゃいけないとかって縛りを自分たちに課してるわけでもないのでその場に居合わせてるかどうかみたいなと思っててなので別にネットワークに行ったり行かなかったりってのはいいんですけど事実そのリファレルによって就職するケースが多いっていうのはなんかそういう構造的な話とかも結構あるのかなと思って外に目を向けて暮らした方がいいっていうのは僕、カナダに来てから1年ぐらい逆にネットワークイベントに自分が行き出すまで全くそういうことをしなかったもしカナダに今来た瞬間何しますかって言われたらそういうコミュニティを作ることをもうちょっと戦略的にやるかな。なるほどですね素晴らしい次に来る人たちのめちゃくちゃ具体的なアドバイスありがとうございますするとフェーズ2もある程度見えてきてようやく仕事決まるんじゃないかなのフェーズ3だと思うんですがどう決まった。んでしょうフェーズ3は今のネットワークの話を若干覆すような話なんですけど結局コールドアプライで運がいいことに引っかかって多分職歴が書いてあったからだと思うんですけどその中の一者で担いでもらって今働いてるっていうネットワーク代表から。の普通にアプライしたって。いうそうですねフェーズの話を切らないとちょっとそこが。うまく伝わらない確かにとはいえフェーズ2のタイミングでフロックのボランティアのあれもそうかもしれないしランガラのお仕事もそうかもしれないしその辺も結局はネットワークとかコネクションとかコミュニティで生まれたものだと思うから全く繋がってないわけが。ないですよねそうですねあと仮に今の会社選んでなかったらネットワークで声かかったら多分フィンテックの会社うんうん、そうかよく似たようなことかな、ですけど僕がLinkedIで応募したのが12月から1月っていうイベントが全くなくて多分受給がちょっと緩んでるタイミングだったんで他にやることはなかったんですねなので一方で僕は12月に卒業してやることがなくなったんでもうじゃあ何もやらないでいいやと思って60件くらいですかね、そのタイミングで送って3件くらいからインタビューの招待が来て受かったのはその一社だけだったんですけど今運営事務所に働いて。いるっていう60件送って3社帰ってきて面談は1個だけっていうことかなるほどその1社が今のほうってことですよね。そうですねオファーが1個。だけオファーがっていうことですね素晴らしいでも未経験からっていう分で職歴はボランティアと学校の仕事っていう分だけで60件中3件結構打率はいいなっていうふうに思いますし実際それで面接の部分もその1社だけだったと思うんですがどういう流れでした。えっとなんかあのテイクホームの宿題を出される最初は何かビヘイビアルクエスチョンというか30分ぐらいの雑談みたいなことしてそういう人なんだみたいな感じでちょっとバックエンド系の質問出すから何かいつでもいいからできたらまたちょっとスケジュールを抑えて何分くらい話そうみたいなそこは今自分の会社はMongDBとかNode。\njsとかを使ってその辺りの細かい質問みたいなのがバーって書いてあってAI使って答えてもいいよみたいなそんなこと言うのは分かってやるからもうそういうのを使いながら自分なりに回答を考えてプレゼンしていくとはいえ僕の場合はジュニアなんでそんな時間かけても向こうの期待値が上がっていくだけだと思って1週間後にもう一回スケジュールを作ってもう一回プレゼンしてっていう感じでその後僕はビジネスの経歴があるんでビズの人とも話してほしいって言われて面接して最後にCTOと面接だったんですけど一般的にはそこで終わりかなっていう感じなんですけどそこでもう一個宿題を出されてAIエージェントについてこのライブラリーがあるからこのオープンソースプロジェクトがあるからこれを使って何ができるか何ができないかを教えて最後それをまた1週間後ぐらいにオファーいただくみたいな。リート。コードとかシステムデザインとかそんなコテコテの、よくあるやつよりは結構トリッキーなんですけど僕は仕事してなかったんでそのやり方の方がありがたかった。という面接の内容から完全にAIネイティブなエンジニアを雇いたいっていうのが丸見えな面接内容だなと思いましたけどやっぱりでもその辺はじゃあ弁説のタイミングでまあ1週間かなテイクホームしてまあ持って帰ってそれを提出してそれが評価されたってことですか。ねそうだと思いますね最初のバックエンド系のクエスチョンに関してはAIを使って回答するんですけどAIだけじゃなくて結構ビジネスコンテクストによって回答が変わるみたいなそういうテイストの話で僕が勝手にそう読み取っただけってのもあるんですけど自分は特にその経歴があるから面接に呼ばれたりっていうのも聞いてたんであえてこういう仮定を置くとこういう結論になるこういうデータモデルの方がいいと思うとかそういう伝え方をするようにしてましてそれは最後のAIエージェントの話ですねあんまり技術的なところに話を持っていくと自分は不利なんで全くそうならないように議論をまあでも。ジュニアとしてで考えるんたら相当受けのいい面接になるようになったんじゃないですかだってジュニアに対してやっぱり技術的な期待値って正直そこまで高くないと思うけれどもそれに対してビジネス部もやっぱり出てくるっていうことで考えたらやっぱりいっさんの過去のご経歴っていう部分には当然興味あったんだろうしそれに加えておそらくジュニアとしてのコミュニケーション能力とAIをどう活用して仕事に応用するかの部分で見るんだったらもうパーフェクトな内容だったんじゃないのってちょっと思い。ましたけどねああ、ありがとうございます。なんかそこまで自分で考えたことはなかった。ああ、。そうですか。それは失礼しました。いえいえ。でもまあ、そうですね。ちょっと面接やってる時は必死だったんで、何か意図もわからない。なんとか生き延びるためにこうだったですけど、まあでもやっぱりこうAIとかやってくると、あの、なんか学習のハードルがやっぱり下がるんで、スポーティングが大事じゃなくなるとかってよりは、その単純にジュニアに期待する内容もちょっと変わってきたりするのかなと思ってて、今、瀬名さんがおっしゃった通りで、他の経験があるとか、他のコンテキスト、例えばビジネスとの会話ができるとかビジネスの考え方ができるとか、そういうちょっと違うものがあるっていうのがジュニアだけど、むしろその価値が相対的に高まるみたいなのがあってちゃんと採用してもらったのはなんかある気がし。ますあとはなんかそのコミュニケーションがちゃんと取れてそのまあジュニアで技術はないかもしれないけどその自分が出した問題に対して意図を汲み取ってそれに対してちゃんとそった回答をした分してくれてるからあのジュニアだったとしてもそのなんだろう技術的な指摘をした時にあのコミュニケーションを取ってちゃんとあの達成その目標を達成してくれるんだろうなみたいなのが見えてたなって思いますよね今話を聞いてい。てもこれはそうですね、10年くらい働いた経験があるので多分意識的にそういうコミュニケーションを取ろうというのが僕もやってたかもしれないですね素晴らしい。もうウカるべくしてウカったっていう人の話を聞いた感じでしたね。あとフェーズ2とフェーズ3で全然違うようなやり方だったってことですけどフェーズ2のやり方コールドアプライじゃない方法でもきっと引っかかってたんだろうなというかもちろんジュニアで就職できるって今は運がいいって言われてるくらいの時代というかあれですけどでも何かしらできっと引っかかってたんだろうなぁみたいなその運を味方につけるだけの準備と土台があったんだろうなっていう。感じがしますよねそうですねあの今お話ちょっと聞いてて思い出したのがネットワーキングにフェーズ2でネットワーキングに行きまくって自分を頑張って売り込むみたいな作業を何回もやった結果なんか面接でそれが自然にできるようになったってこういう話し方をすれば相手が聞きやすくなるというのは。結構確かにあのやっぱりそのまず最初レジュメを出して読んでもらうところも難しいんですけど日本人のその面接スタイルって質問されて質問に返すみたいなそれが基本の面接スタイルでなんか聞かれてもないことは言わない方がいいみたいなのが日本では多分あると思うんですけどこっちは自分からこういうことできるよ俺これがすごいよこんななんだろう働き方どうみたいななんかそういうのを提案をしてやっと聞いてくれるみたいなもしなんか質問を待ってたらその人が話し続けてなんかなんか終わっちゃったみたいなやっぱりなりがちでそれをその最初の何回かの面接で学んでそこからみたいなのがあると思うんですけどそこをなんだろうその自分のフットワークの軽さだったり行動からスキップできたのはすごい確かに良かったのかなというかっていうふうに思い。ますねでも確かにそれはまさに学んだことですね。自分からどんどん言っていく、読んでいくっていう感じですね。日本だとそういうのはあんまり良しとしないみたいな、けらかすみたいなのがあるんですけど、ガンガン言うみたいな、やってないことも言うみたいな。ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "はいそれでは今回はIshiさんに来ていただきましたIshiさんはバンクーバーで働いていてまずは簡単に経歴。",
      "start": 28,
      "end": 7600,
      "timestamp": "00:00"
    },
    {
      "speaker": "Ishi",
      "text": "から教えてくださいはい、ありがとうございます。石と言います。僕はカナダに2年前に来て、こっちのカレッジを卒業して、今年の3月からこちらでエンジニアとしてキャリアをスタートさせてまして、いわゆる未経験就職したグミです。もうちょっと経歴を話すと、10年ぐらい日本の銀行なんですけど、そちらで働いていて、その後2年間日本のテックのスタートアップで働いてて職種としては金融というかファイナンス系の職種だったんですけど色々あってちょっとカナダでエンジニア就職したいと思いあってこっちに来てラッキーなことに就職して今働いて半年くらいっていうそういう感じですね医師さん。",
      "start": 7600,
      "end": 56824,
      "timestamp": "00:07"
    },
    {
      "speaker": "Ryo",
      "text": "はあれですよね、家族と来られてるんですよね。どんな感じの家族構成なんでしたっけ?",
      "start": 56824,
      "end": 63408,
      "timestamp": "00:56"
    },
    {
      "speaker": "Ishi",
      "text": "子供が2人いまして、今3歳と6歳で上の子は小学校に通ってるみたいな感じ。こうした時点では4歳と2歳っていう感じですね。妻と4人でこっちで暮らしてるっていう。",
      "start": 63408,
      "end": 79344,
      "timestamp": "01:03"
    },
    {
      "speaker": "Ryo",
      "text": "家族が必ずしも足枷になるってわけではないですけど未経験で別に英語系外資とかで働いてたみたいな英語を使って働いてたってわけでもない。",
      "start": 79354,
      "end": 90537,
      "timestamp": "01:19"
    },
    {
      "speaker": "Ishi",
      "text": "んですよねきっと銀行にいた時に海外駐在をしていて東南アジアなんで、お互い第2言語でやり取りするっていうレベル感ですけど、英語で仕事するっていう経験自体もしている状態そう。",
      "start": 90537,
      "end": 104736,
      "timestamp": "01:30"
    },
    {
      "speaker": "Ryo",
      "text": "なんですね、でもそれでも未経験で家族と一緒に来るって結構なハードルの高さと。",
      "start": 104736,
      "end": 111178,
      "timestamp": "01:44"
    },
    {
      "speaker": "Senna",
      "text": "いうかあれですけど間違いない、俺もだってイッサンの話を一番最初フロック相談来た時、正直ちょっとびっくりしましたもんしかも一山の場合は金融業界のスペシャリストということで過去のご経歴も相当キラキラしていてなんで今さらと言ったらいいかというと言い方が悪いけどエンジニアでしかも国も変えて北米で家族いてこの人ちゃんとカウンシングしたって3回くらい。",
      "start": 111178,
      "end": 139555,
      "timestamp": "01:51"
    },
    {
      "speaker": "Ishi",
      "text": "聞きましたもんそうですね、結構話すと長くなっちゃうんですけど自分のキャリアの話と子どもの教育環境の話といろんな理由があって一つこれですっていうのは僕の場合難しいんですけど結論だけ聞くとクレイジーな話。",
      "start": 139555,
      "end": 162711,
      "timestamp": "02:19"
    },
    {
      "speaker": "Senna",
      "text": "かなと間違いない、何考えてんだって。",
      "start": 162711,
      "end": 165833,
      "timestamp": "02:42"
    },
    {
      "speaker": "Ishi",
      "text": "家族に関して言うと子供が小さいうちにこっちに来て教育環境的にも多様性がある中で子育てをしたいこれは親のエゴかもしれないんですがそういう思いがあってカナダの場合現実的に僕みたいなまだ永住権も取ってないような人をただで学校に通わせられるっていうのもあったりとかしてすごくあの子育て組にとっては魅力的な国だなぁって思って彼女を選んだっていうのがあのそうですねこれ何から話せばいい。",
      "start": 168574,
      "end": 209234,
      "timestamp": "02:48"
    },
    {
      "speaker": "Ryo",
      "text": "ですかねエンジニアになんかその時にエンジニアになろうと思った経緯はどんな感じなんですかなんか前の職種でもなんかこっちに来たりとか他の国に行けたりっていうのはでき。",
      "start": 209234,
      "end": 221464,
      "timestamp": "03:29"
    },
    {
      "speaker": "Ishi",
      "text": "たんですかねそうですねあの銀行にいる場合は海外に行ってたっていう自分がそういう人材だったっていうのもあってもう一回海外駐在することは可能だったと思うんですけどよくこれは銀行だけじゃなくて日本の海外駐在でよくあるのは結局行ったところで日本の会社の海外法人海外支店ブランチみたいなところで日本の働き方とか日本の仕事をする海外でするっていう僕の場合は海外就職をしたいっていう思いがすごく強くてその時点でまだエンジニアとかあんまり頭なかったんですけど海外駐在をした時にラッキーだったのが銀行が海外の会社を買収したんですねその買収したところに送り込まれるっていうそういうポジションだったんで自分の労働環境的に完全に外資っていうか日本の会社じゃない環境で働いて、それがすごく自分の中でいい体験だったっていうのがあってそれを自分の力で実現したいっていうふうに思ったっていうのが、これ10年ぐらい前の話なんですけど、自分が海外駐在をしたときに感じた現体験というかだったんですねであの当時はそのまあそういうことを自分の例えば金融機関に勤めてる人間がやろうと思った時に一番高取り売り選択して例えば海外mbaに行ってうんあるいはダイレクトに就職するあると思うんですけど何にしてもこうまあ文系職なんですよハードスキルがないですと実際に海外でMBAに行かれた日本人ってすごく優秀な方が多いんですけど皆結局海外で自分の思ったようなキャリアに引っかからなくて帰ってきたりとか日本ですごくいいパッケージが用意されてるんでそもそもそこが魅力的に移ったりいろんな事情があって就職を目的にした時にあんまり費用対効果というか自分の目的を達成するのに一番確実な方法だと思えなかったのでで走行しているうちにコロナになりあの海外から日本に戻されみたいなあって一旦こうスタートアップに転職したんですね時にあのテックの会社で自分が資金調達をしているあするポジションだったんですけどそのいろんな個ステークフォルダーと話しているときに会社になぜお金が詰まってくるかってあの自分が何かやったわけじゃなくて、そのプロダクトがあるからなんですよね。しっかりしたプロダクトがあって、それが僕がいたのは金融業界だったんですけど、金融業界にとってその革新的なプロダクトだったんで、いろんな投資家が興味を持ってお金を提供してくださるみたいな。結局それってエンジニアがすごいんだよね、僕の中では思って。で、それと、あとさっき言ったMBAのハードスキルがない分系職の人間が海外就職するっていうのを結構僕の中でリンクして自分がエンジニアになれば海外就職もできるし、その時に委員長だとしながら会社が自分ができないことをできるようになるかもしれないいろんな観点でエンジニアになるっていうことが自分の中ではすごい合理的な選択というかお金の話とかにすればキャリアのステップとしては思ったんででみたいなと思っていろいろ探してたらフロックさんに出る感じです。",
      "start": 221464,
      "end": 442901,
      "timestamp": "03:41"
    },
    {
      "speaker": "Senna",
      "text": "ねなるほどですね改めてちゃんと聞くとちゃんと合理的な背景があったんだなっていうのも改めてびっくりしたところがあるんですが逆にでも僕が聞いていいのであればハードスキルっていう側面で言うのだったら正直エンジニア以外にもいくつかあるよねっていう気ももちろんするんですよもちろんソフトウェアを作るっていう文脈以外でもプロダクトを作る上だとUI作ったりもそうだしマーケット広げたりするのもある意味ハードスキルかもしれないしなんかその中で。",
      "start": 442901,
      "end": 468547,
      "timestamp": "07:22"
    },
    {
      "speaker": "Ishi",
      "text": "エンジニア王っていう部分におい。",
      "start": 468547,
      "end": 470068,
      "timestamp": "07:48"
    },
    {
      "speaker": "Senna",
      "text": "ては今の文脈だったら海外就職永住権とかっていう部分とやっぱりうまいことリンクしたっていう感じですか。",
      "start": 470068,
      "end": 476010,
      "timestamp": "07:50"
    },
    {
      "speaker": "Ishi",
      "text": "ねそうですねそれもありますねあとはテックとかもう一つは前スタートアップに行ったときにソフトウェアによって法人カード扱う会社だったんですけど法人カードのプロダクトが実はもう何十年も前からあったのにテックのスタートアップが形でサービスを届けた結果プロダクトのコアは変わってないのにものすごく売れるみたいな印象が発生していてそれがやっぱすごいなっていうふうに思ってなんかまあアセナさんがおっしゃる通り何か他にも多分よく考えれば選択肢ってあると思うんですけど自分はなんかこうエンジニアになりたいなっていうふうに思うのも理由があるんであとあれですね、もう今となっては何のあれもないですけど、当時その永住権を取るという観点でエンジニアになる、エンジニアだとこうPCPがかかるとかですね、いろんなベネフィットもあったんで。",
      "start": 476010,
      "end": 530704,
      "timestamp": "07:56"
    },
    {
      "speaker": "Senna",
      "text": "ありましたね、。",
      "start": 530704,
      "end": 531575,
      "timestamp": "08:50"
    },
    {
      "speaker": "Ishi",
      "text": "昔は。いい選択肢だなっていうふうに当時は映ってた。",
      "start": 531575,
      "end": 535478,
      "timestamp": "08:51"
    },
    {
      "speaker": "Ryo",
      "text": "確かにです。海外に来る時にどういうふうな観点であのカナダを。",
      "start": 535478,
      "end": 540781,
      "timestamp": "08:55"
    },
    {
      "speaker": "Ishi",
      "text": "選ばれたんですか?そうですね。いろいろあるんですけど、当時僕がそういうことを考えていたのが2022年とかだったんですけど、その当時、移民にオープンな国ってほとんどなかったっていうことがあって、カナダは今思えば結構ブーストしてた期間を僕はその時点だけ見てたっていうことなんですけど、すごい移民に積極的だなっていう印象があって、それはアイデンティティとして掲げているっていうふうに僕の目には映って、あとさっき言った教育の話もそうなんですけど、子どもを学校に通わせるとかって考えた時に、カナダほど恵まれた条件のところはなかった。",
      "start": 540781,
      "end": 593755,
      "timestamp": "09:00"
    },
    {
      "speaker": "Ryo",
      "text": "それは金銭的な意味でだけですか?それとも他にも何。",
      "start": 595600,
      "end": 599943,
      "timestamp": "09:55"
    },
    {
      "speaker": "Ishi",
      "text": "かあるんですか?カルチャー的な観点でも、例えばアメリカとかって、これも場所によると思うんですけど、いろんな人種がいるんですけど、やっぱり人種で分かれているという現実があったりとか、いろいろあると思うんですけど、カナダって相対的にはそういうのがあんまりないっていう。",
      "start": 599943,
      "end": 616614,
      "timestamp": "09:59"
    },
    {
      "speaker": "Ryo",
      "text": "ふうに。",
      "start": 616614,
      "end": 616855,
      "timestamp": "10:16"
    },
    {
      "speaker": "Ishi",
      "text": "現実的にはいろいろあるかもしれないんですけど、社会としてその多様性を重んじるということにトライしてるなっていう感じで、これは来てから実際にそうだなって思ったりもしたんですけど、その多様性を実現する前提として、自己肯定感が高くないと他者との違いを受け入れられないっていうのを僕自身が日本で働いたり海外で働いたりしながら学んだところもあって多分多様性とかその他人との違いを重んじられる社会ってそういうふうに自分自身を大事にするということをちゃんと教育してくれる環境なんじゃないかなっていうそれは親として僕は勝手に考えただけなんですけどそういう環境で育てたいな日本の教育ももちろん水準は高いと思うんですけど僕の記憶の限りだとやっぱり組織を重んじるとか学校の一員として社会に恥ずかしくないように振る舞いなさいみたいなのも結構あると思うんですねそれはそれで考え方として別にありだと思うんですけど子どもに学ばせたいのは何かって考えたときに、やっぱりそれよりも全然違う人たちと混じり合って成長していってほしいなっていうのがあって、カナダの教育環境をいいなと思った。また、実際にこっちに来ている人とかに話を聞いたりして、その人たちが結構カナダで教育を受けさせるとすごくいいよみたいなことを言ってたんでそういう期待があって来たって感じですね。",
      "start": 621658,
      "end": 727818,
      "timestamp": "10:21"
    },
    {
      "speaker": "Senna",
      "text": "なるほどですね実際フロックもこの仕事して長いんですけどやっぱりお子様連れてとか家族でいらっしゃるっていう方やっぱ一定数いらっしゃって僕もトカシさんもやっぱり子供がまだいないのでその辺に対してのすべてなんかそうなんだねっていう部分で聞くことしかできない部分はあるんですけどやっぱりでも多いですもんねこっちの教育環境がとかそういうダイバーシティーがとかでも実際のところどうなんですか日本ってそれこそインターナショナルスクールやっぱり通わせようという親御さんも多いわけじゃないですかその中でやっぱりリスクを取ってまでかなだっていう部分においてはやっぱり先ほどのダイバーシティーの部分だったり子供に与えられる何かっていうところがやっぱり重きを置いてかつ行動に移されたっていう。",
      "start": 727818,
      "end": 768138,
      "timestamp": "12:07"
    },
    {
      "speaker": "Ishi",
      "text": "ことですよねそうですね、子どもの教育という観点ではそうですね。日本でインターナショナルスクールはやっぱり高いという現実的な話もありますし、やっぱり社会の一部に同士になっちゃうので、日本の中でいうと、学校の外を出たらもう全然違う環境、カルチャーだったりしますし、中にはそれこそ自分がもともと働いていた銀行で、インターナショナルスクールで英語力を買われて入ったとか言ったんですけど、日本の会社とのカルチャーアンフィットに苦しんでいる。",
      "start": 768138,
      "end": 801144,
      "timestamp": "12:48"
    },
    {
      "speaker": "Senna",
      "text": "ああ、やっぱりあるんですね。",
      "start": 801144,
      "end": 802975,
      "timestamp": "13:21"
    },
    {
      "speaker": "Ishi",
      "text": "じゃあその人が急に海外就職して海外で働けるかって言ったら、まあそんなことはないと思って、なんでこう、エグジットとして結構難しさもあるなと思って。",
      "start": 802975,
      "end": 814351,
      "timestamp": "13:22"
    },
    {
      "speaker": "Senna",
      "text": "なるほどね、インター出た後どうするのっていう部分ってことですね。",
      "start": 814361,
      "end": 817963,
      "timestamp": "13:34"
    },
    {
      "speaker": "Ishi",
      "text": "そうですね。",
      "start": 817963,
      "end": 819223,
      "timestamp": "13:37"
    },
    {
      "speaker": "Ryo",
      "text": "今2年ぐらい、今もうこっちにいるってことですよね。",
      "start": 819223,
      "end": 822595,
      "timestamp": "13:39"
    },
    {
      "speaker": "Ishi",
      "text": "そうですね、僕は2023年のクラス。",
      "start": 822595,
      "end": 826917,
      "timestamp": "13:42"
    },
    {
      "speaker": "Ryo",
      "text": "実際行かせてみてというか、子供とかはどんな反応だったりとか、親から見た視点としてどんな感じですか。",
      "start": 826917,
      "end": 833382,
      "timestamp": "13:46"
    },
    {
      "speaker": "Ishi",
      "text": "この反応は、下の子はまだなんか言葉も日本語も怪しいみたいな状態で来たんであれなんですけど、上の子は結構もう日本で幼稚園に通ってから来たんで、なんかやっぱ帰りたいっていうのはすごい言ってますね。",
      "start": 833392,
      "end": 846641,
      "timestamp": "13:53"
    },
    {
      "speaker": "Ryo",
      "text": "それは友達的な面でですか?",
      "start": 846641,
      "end": 849713,
      "timestamp": "14:06"
    },
    {
      "speaker": "Ishi",
      "text": "そうですね、友達的な面と、あと英語はやっぱり最初できないんで、なんかそこでなかなかこう難しかったりっていうのは1年ぐらいあったんですけど、なんか直近半年ぐらいで急になんかペラペラ喋り出すよう。",
      "start": 849713,
      "end": 862354,
      "timestamp": "14:09"
    },
    {
      "speaker": "Senna",
      "text": "になっておーやっぱあるん。",
      "start": 862354,
      "end": 863735,
      "timestamp": "14:22"
    },
    {
      "speaker": "Ishi",
      "text": "だ僕の発音矯正とか。",
      "start": 863735,
      "end": 866016,
      "timestamp": "14:23"
    },
    {
      "speaker": "Senna",
      "text": "始めたりします言いますよねなんかこれはあるあるなんですけど子供になんか発音矯正されるってこっちに来る親子さんあるあるですよ。",
      "start": 866016,
      "end": 874239,
      "timestamp": "14:26"
    },
    {
      "speaker": "Ishi",
      "text": "ねそうなんですよこれ来たかと思ってパパ。",
      "start": 874239,
      "end": 877661,
      "timestamp": "14:34"
    },
    {
      "speaker": "Senna",
      "text": "のこの発音おかしいって言われますかまあまあショックかもしれんなちなみにごめんなさいね一個だけ多分注釈入れなくちゃいけないのがこっちに来られたインターナショナルの方々のご子様の学費が無料っていうのは確かにあるんですけどもやっぱりステータスにもちろんよるのでペアリンスもステータスにもちろんよるっていう部分で医師さんの場合ポストグラデーションビデオの出る効率化レジ行けたからっていう部分がもちろんあるっていうのはこれちょっと一応前提にはさせてもらえれ。",
      "start": 877661,
      "end": 906472,
      "timestamp": "14:37"
    },
    {
      "speaker": "Ishi",
      "text": "ばと思いますそうですねありがとうございますそしたらちょっと。",
      "start": 906472,
      "end": 910664,
      "timestamp": "15:06"
    },
    {
      "speaker": "Ryo",
      "text": "技術のところどうやって学んだかみたいなところに戻りたいんですけど今あったように公立の学校に通われたってことなんですけどじゃあそれまでは全く未経験未経験だったのはそうだと思うんですけど勉強も日本ではせずに来られたんですかそれとも日本でも準備とかされたんです。",
      "start": 910664,
      "end": 928822,
      "timestamp": "15:10"
    },
    {
      "speaker": "Senna",
      "text": "か。",
      "start": 928822,
      "end": 928842,
      "timestamp": "15:28"
    },
    {
      "speaker": "Ishi",
      "text": "あんまりできなかったっていうのが正直なところでUDEMYの講座を買って最低限のJavaScriptのシンタックスを勉強したっていう程度ですなので授業に出た時点でなんかこの単語って聞いたことないとかそういうのはないんですけど理解してるかって言われれば全然理解してないみたいなそんなレベル感で来たというか来ちゃったという学校は。",
      "start": 931012,
      "end": 953858,
      "timestamp": "15:31"
    },
    {
      "speaker": "Ryo",
      "text": "どんなコースに通われたん。",
      "start": 953858,
      "end": 955299,
      "timestamp": "15:53"
    },
    {
      "speaker": "Ishi",
      "text": "ですか学校はこちらの公立カレッジのランガラカレッジというところのウェブモバイルデザイン&デベロップメントWMDって呼んでるコースなんで1年4ヶ月ですね全部でそちらに通ってましたね内容としては全然コンピューターサイエンス的なことはやらなくてデザイナーとデベロッパーが半分半分ずつあの構成されているコースででwebアプリを作りましょうそれも完全に実装よりのあのこういうコース。",
      "start": 955299,
      "end": 995125,
      "timestamp": "15:55"
    },
    {
      "speaker": "Ryo",
      "text": "はい行ってみてどうですかあの勉強できたなぁって感じですかそれとも自分でもやっぱり自己学習が必要だったなぁとかまぁ今働いてると思うんですけどそれとのなんか働いてみてのギャップみたいなのとかってありますか。",
      "start": 995125,
      "end": 1007628,
      "timestamp": "16:35"
    },
    {
      "speaker": "Ishi",
      "text": "えっと実はそんなギャップの話から言うとそんなにはなくてあの乱柄でやっていることって極めて実践的なんでなんかベースが若干不安なところはあの正直例えばコンピュータサイエンスの知識そういう意味であるんですけどその現場に入ってなんかいきなりこうgithubとかってもらってこれやってくださいって言われると結構それに近いことをランガラの中で実際に体験することができるので割と実践的なコースだったかなというふうに僕は思っています具体的に言うと全部で4タームに分かれているんですけど2ターム目3ターム目4ターム目でUIXデザイナーと組んでプロジェクトを1個回して完成されたウェブアプリを作って出していくんですねでよくある他のコースだと例えばそれを最後のタームだけでやったりとかすると思うんですけどランガラはなんかそれがメインぐらいの感じでどんどん3ヶ月4ヶ月ごとにぐるぐるぐるぐる回していくみたいな感じなんでそれを3週ぐらいすると結構自分の中ではギャップはそんなに感じなかったっていうのがただもう一個ご質問であった学校の授業だけで十分かどうかっていう話で言うと自分で結構カバーしながらやった方がいいかなと思ってて内容的にはそんなに悪い内容じゃないと思うんですけど先生によってすごいクオリティが変わるっていうのがあるのともう一個授業の進度的にそんなに早くないので何かどこにタイムラインを置くかによるんですけど例えば卒業した後にすぐ就職したいっていう風に考えるのであれば学校のペースでやってたら多分間に合わないのでどんどん先取りして勉強していくっていうアクションが必要という感じですね。",
      "start": 1008653,
      "end": 1131117,
      "timestamp": "16:48"
    },
    {
      "speaker": "Ryo",
      "text": "教材というかプロジェクトを回す形学校の勉強でプロジェクトを回す形になるとそれこそシンタックスだったりとかプレームワークの勉強とかっていうのはもう自分自身でされたっていう感じ。",
      "start": 1133094,
      "end": 1148479,
      "timestamp": "18:53"
    },
    {
      "speaker": "Ishi",
      "text": "ですかそうですねおっしゃる通りで若干乱柄のコースが矛盾してるんですけど例えば第三ターン目にやるこのプロジェクトがリアクトなんですねリアクトを使ったアプリを作ってくださいって話なんですがランガラはその時点そのプロジェクトが始まった時点でまだ授業でリアクトを教えてないんですねなので多分本当は良くないっていうかもちろん改善のうちがある気がしてるんですけどただ現実そうなっちゃってるんでプロジェクトを純回転させて参加しようと思ったら自分で次のタイムのプロジェクトで使う技術を前のタイムで学習しておく必要。",
      "start": 1148479,
      "end": 1187782,
      "timestamp": "19:08"
    },
    {
      "speaker": "Ryo",
      "text": "があるっていうそのキャッチアップにはどの程度時間かかりましたか誰でもできそうかなって感じですかそれとも結構時間かけてやり。",
      "start": 1187782,
      "end": 1198644,
      "timestamp": "19:47"
    },
    {
      "speaker": "Ishi",
      "text": "ましたそうですね僕は結構時間かけてやったというかむしろそこの時間をどれだけ取れるかを学習のベンチマークにしてたっていう感じですねなんでランガラの授業に出る時点で例えばさっきの例でリアクトを第3ターン目からやりますってなった第3ターン目でリアクトを学ぶってベンチマークを自分の中で置かないようにしててそれも第2ターンまでに自分の中でやっておくっていうのをしてましたねそうなってくると結局全部の授業力入れてたら自分の時間が取れなくなっていくので偶然的にその必要のない授業とか自分の興味があまりない授業は最低限単位だけ取れればいいやみたいな感じで割とバッサリあのメリハリをつけながらやっててただしプロジェクトだけはめちゃくちゃ真剣スタンスで基本的になんで自分の勉強を多分3、4時間ぐらいは取ってやってましたねそれもなんかその自分の中で計画を立てて今週はここまでやるとか今月はこういうふうにやるとかそういうのをこうつぶつぶで立てながらあの学習してた気がありますねこの辺はあれ。",
      "start": 1198644,
      "end": 1278275,
      "timestamp": "19:58"
    },
    {
      "speaker": "Senna",
      "text": "だよね割と未経験から。",
      "start": 1278275,
      "end": 1279716,
      "timestamp": "21:18"
    },
    {
      "speaker": "Ishi",
      "text": "こっちへ就職しましたって。",
      "start": 1279716,
      "end": 1280897,
      "timestamp": "21:19"
    },
    {
      "speaker": "Senna",
      "text": "人割と今回いろいろポッドギャスを通して話してる気がするけどやっぱ共通してる部分かもしれないですね学校の授業だけフォローアップするっていう人は多分一人もいなくてむしろバッサリするっていうワードが結構よく聞かれるなって気がするのでなのでイスさんもそこにね上位に漏れずという形でその取捨選択はちゃんとできて。",
      "start": 1280897,
      "end": 1301826,
      "timestamp": "21:20"
    },
    {
      "speaker": "Ishi",
      "text": "たってことですねそうですねそこがむちゃくちゃ重要だと思い。",
      "start": 1301826,
      "end": 1305668,
      "timestamp": "21:41"
    },
    {
      "speaker": "Ryo",
      "text": "ますあのなんだろうわからないえっと新しい技術とか全く別のことを勉強するときにあの何がわかんないかわかんないみたいな状態になりがちだと思うんですけどなんかその勉強をする上でそのここまでとかってどういうふうに決めたんですかもしくはなんかメンターみたいな方がいたんですか。",
      "start": 1305668,
      "end": 1325230,
      "timestamp": "21:45"
    },
    {
      "speaker": "Ishi",
      "text": "なんかコマゴマと質問するようなメンターはCっていうなら学校のインストラクターがそうだったかなっていう感じですけどあのえっとどこまでっていうのはあんまり負荷を失いようにはしてましたね逆に言うとあの例えばあのまあリアクトの例をもっかい出すとなんかリアクトってあの中級とか上級とかいろいろあるじゃないですかよ放送買うとあれでなんかも初級とか中級でいいとこで止めてあの複雑なリアクトフックは必要性が生じるまでちゃんと勉強しないみたいなことをやってどんどんどんどん新しい知識を吸収してアウトプットするようにしてましたねアウトプットしたときにつまずいて初めて何が必要かって見えてくると思ってインプットするとどれが本当言う通りでどれが重要か分かんないし自分の中に何が分かんないかも分かんない分かった気になるだけで終わるみたいな経験的なパターンだと思うんでとにかく早く実装することに重きを置いてやってましたねその一つの例としてタームとタームの間にランガラって3週間ぐらい休みがあるんですけどデザイナーを一人声かけて二人で個人プロジェクトを回してLinkedIにアップしたりとかしてそれは二つの狙いがあって一つはアウトプット学習のためにやったもう一個は乱柄のプロジェクトの終了を待ってレジュメに載せてると遅れるんで自分で一個技術をマンスタックでアプリを作りたかったんで乱柄のプロジェクトの終了を待ってると自分の収穫が遅れちゃうのでその前にレジュメに載せれるレベルのやつを削って先に載せるためにですねやるっていうのを自分の時間を使ってやったりしてます。",
      "start": 1325230,
      "end": 1438682,
      "timestamp": "22:05"
    },
    {
      "speaker": "Ryo",
      "text": "なんかジュニアの鏡みたいな人ですね話を聞いているとやっぱなんかその初学者というか未経験で勉強するとやっぱりどこを勉強していいか分かんなくてやっぱりどんどんどんどん変なところ必要のないところに時間をかけたりとか深掘りをしちゃってさっき言われたように分かった気になっているんだけど実際現場でというか働いてみるとそんなに必要なかったりだとか結構初級それこそさっきのudemyとかで購入したときの初級中級みたいなところまででほとんどの仕事はできてそこからって結構なんだろうインターミデートだったりとかシニアの人たちのサポートももらえるから全然確かに最初の方は必要ないからそんな感じのやり方がすごいいいのかなって感じし。",
      "start": 1440414,
      "end": 1486676,
      "timestamp": "24:00"
    },
    {
      "speaker": "Ishi",
      "text": "ますよねありがとうございますあとちょっと1個話してなかったのがあってやっぱり人に聞くっていうのは結構大事かなと思います今言ったリアクトのどの分野を勉強するんだみたいな細かい話だけじゃなくてなんて言うんですかねその全体の学習プランとかどこどこに努力したらいいのかとかなんかそういうのはやっぱそのあの人の話を聞いて取り入れていった面があってあの僕の場合のえっと広一さんうんうんうんランガラにいらっしゃったはいあのランガラに入りたてぐらいの時にちょっとワンオンの時間をもらって学習のベンチマークをどうやって置いたらいいかって相談をしたんですね結局僕の中では学校を卒業して割とすぐ就職したいっていうのがあってそうなってくるとランガラの授業でいうとどこまでやればそのジュニアとしてのスタートライン立てるんで3ターン目が終わるぐらいつまり卒業4ヶ月前までのカリキュラム終了でスタートライン立てるってあるってエンジニアとしてフルタイムで就職するためにこれもフロックのいろんな人に言われたのが半年ぐらいの実務経験はレジ名に載せといた方がいいそうなってくると残り4ヶ月でスタートラインに立ってそこから就活してたら卒業時点で半年の職歴って絶対に載せられないんで間に合わないなって思ったんでなんで自分の中で2ターン目が終わる時点で卒業の8ヶ月前9ヶ月前ぐらいに自分が就活にアプライできる状態を作っておこうと思って、そこに向かって学習していった。これは自分の中で迷いなく計画を立てるっていう意味ですアドバイスというか。",
      "start": 1486676,
      "end": 1589173,
      "timestamp": "24:46"
    },
    {
      "speaker": "Senna",
      "text": "いや素晴らしいこいつさんはねよくフロックのスラックなんかでもメンターしてあげるよっていう風に言うてくれてる人やからもうほんと頭上がらないから今度ちょっと飯でも連れてったからなてか俺の手料理をね御馳走しようって言ってた思っててそれはどうでもいいんだけどでもやっぱりそうねそういうなんか人にすぐ切る人ってやっぱ強いなって俺改めて最近思ってることがあってね、なんでだろうね、逆に言うとなんでみんな聞かないんだろうねっていう全部自分の中で解決しよう。",
      "start": 1591221,
      "end": 1617594,
      "timestamp": "26:31"
    },
    {
      "speaker": "Ryo",
      "text": "するよねそれも何を聞いてわからないとかっていうのもあると思いますけどねなんかやっぱ話聞いててイシさんはすごい勉強の仕方とかも戦略的ですごい頭がいいなっていう感じなんでなんか聞くポイントもしっかりと心得ているんだろうなみたいなのを感じますよねいや本当にそれ。",
      "start": 1617594,
      "end": 1636524,
      "timestamp": "26:57"
    },
    {
      "speaker": "Senna",
      "text": "ちょっと共通点って言ったらもしかしたら失礼かもしれないけど前にやっぱ話した綾香さんもやっぱ未経験からこっちいらっしゃってワークデイ入ってっていう人だけどやっぱ同じちょっと空気を感じるもんね勉強するステップだったりとか分からないところを切り捨てるところだったりとか分からないじゃない必要ないところを切り捨てるところだったりとかすぐ人に聞くっていうところだったりとかやっぱりそういう共通項は実は見えてきそうだよねっていうところが俺実は結構ワクワクして話聞いてる。",
      "start": 1636524,
      "end": 1666461,
      "timestamp": "27:16"
    },
    {
      "speaker": "Ryo",
      "text": "んですけどなかなか再現性っていう意味ではなんかそれを誰でもできるようになるかって言ったらどういうふうにやったらそうなれるかっていうのが分からないからあれですけど確かにそういう共通点はなんか初学者で未経験からこっちで就職してる人たちにはちょっとそういう共通点がありそう。",
      "start": 1666461,
      "end": 1684446,
      "timestamp": "27:46"
    },
    {
      "speaker": "Senna",
      "text": "ですねそうですね共通項はないし再現性は難しいかもしれないけどでもやらなあかんよっていうことをとりあえずリスタップしておくことはできる気がしてて人に聞くとかもそうだしでも聞くっていうことが必要なことだと思ってない人がやっぱり多くて自分の力で何とか解決するこれこそが力になるんだみたいなあるじゃないですか人の力を頼ったらそれは本当の自分の力じゃないみたいなああいうのもちょっと邪魔してるんじゃないかなってそれ人育ちの話になるから何とも言えないん。",
      "start": 1684446,
      "end": 1718459,
      "timestamp": "28:04"
    },
    {
      "speaker": "Ishi",
      "text": "ですけどねまあでもそうですね、日本だとね、ググレカスでしたっけ?GKSみたいな人に聞くときに、「そんなことも知らないんですか?」ってやっぱり言われちゃう僕も経験があるんでそういうもんだと思ってるとなかなか人に聞きにくいというか、特に未経験ってエンジンだと何話したらいいかわかんないみたいなそうだったんですけどだったんでなんでここ1さんみたいにこう自分から歩み寄ってくれるというかなんか僕の時間を抑えてみたいに言える人めちゃくちゃ貴重でし。",
      "start": 1718459,
      "end": 1756459,
      "timestamp": "28:38"
    },
    {
      "speaker": "Senna",
      "text": "たねいやーそうですよね間違いない俺もちょっとたまにあのフロックの作で言うようにしようこいつさんみたいに俺暇よってそういうところからな気がしてきたなんか。",
      "start": 1756459,
      "end": 1767084,
      "timestamp": "29:16"
    },
    {
      "speaker": "Ryo",
      "text": "まあでも瀬名さんあんまり暇そうではないですけどねそれが出現するかどうか。",
      "start": 1768079,
      "end": 1773200,
      "timestamp": "29:28"
    },
    {
      "speaker": "Senna",
      "text": "いやだからほら頑張る頑張るまあ。",
      "start": 1773200,
      "end": 1778262,
      "timestamp": "29:33"
    },
    {
      "speaker": "Ryo",
      "text": "でもねこれを聞いてそういうふうに自分からそういうふうに質問してくれるような人が増えてくれるといいですねそしたら。",
      "start": 1778262,
      "end": 1790465,
      "timestamp": "29:38"
    },
    {
      "speaker": "Ishi",
      "text": "僕にも聞いてくれればっていう確かに一緒にぜひ。",
      "start": 1790465,
      "end": 1793766,
      "timestamp": "29:50"
    },
    {
      "speaker": "Senna",
      "text": "質問してほしいですねちょっと頑張って聞かせてもらいましょ。",
      "start": 1793766,
      "end": 1796807,
      "timestamp": "29:53"
    },
    {
      "speaker": "Ryo",
      "text": "うそしたら技術のことは大体なんだろう流れとしてはつかめたかなって思うんでそしたらちょっと英語について聞いていきたいんですけど英語はどのいつぐらいから勉強し始めたんですか?",
      "start": 1796807,
      "end": 1810847,
      "timestamp": "29:56"
    },
    {
      "speaker": "Ishi",
      "text": "英語はあのカナダに来るたびに改めて勉強したっていうことはあんまりなくて時間がなくてやれなかったっていうのもさっき冒頭話したように海外駐在の経験があって、曲がりなりにも英語で意思疎通してビジネスをしてたけど最低限なんて言うんですかね、仕事はできるみたいな状況で来ました。",
      "start": 1810847,
      "end": 1838292,
      "timestamp": "30:10"
    },
    {
      "speaker": "Ryo",
      "text": "それはその時の会社のその時の会社に働いてた時に勉強してって感じなんですか?それともなんか何だろう、その前から本当にやっぱ海外で働きたいみたいなのはずっとあって学生の頃から意識して英語を勉強してたとかそんな感じですか?",
      "start": 1838292,
      "end": 1854919,
      "timestamp": "30:38"
    },
    {
      "speaker": "Ishi",
      "text": "そうですね、学生の大学4年生ぐらいで英語をやりたいなみたいな、海外、もともと海外志向はそんな強くなかったんですけど大学3年生の時に大学でロンドンに行くっていうイベントがあってそこで緩和されてしまってそれから英語も自分でやるようになりました。実はその大学4年生の時にビクトリアに1ヶ月だけ、よくある夏休みを使って遊びの語学旅行とかに行きました。自分の中で結構その体験もでかくて、間違えて喋っても気にしないです。会社入ってから、人口入ったのも海外駐在行けるから安いっていう。で入ったのからもあの自分で勉強はいずっとやってましたねすごいなんかこう込ん詰めて行ったって感じじゃないんですけどなんか継続的にあのまあ勉強してだっていうかただ本当に使えるようになったのはあのまあ海外実際に払えてからありますけど海外。",
      "start": 1854919,
      "end": 1920686,
      "timestamp": "30:54"
    },
    {
      "speaker": "Senna",
      "text": "駐在者は僕も知り合い何人かいますけどやっぱ駐在がきっかけで本気で勉強しだしたとかやっぱり喋れるようになったといえば何らかんだいいって思うので仕事で使うようになったっていうのがやっぱり大きい。",
      "start": 1920686,
      "end": 1930773,
      "timestamp": "32:00"
    },
    {
      "speaker": "Ishi",
      "text": "んでしょうねそうですね僕の場合特に日本のブランチじゃなくて海外の法人に自分が日本人一人とかで乗り込んでいくみたいな感じで一つできないと情報開示。",
      "start": 1930773,
      "end": 1943741,
      "timestamp": "32:10"
    },
    {
      "speaker": "Senna",
      "text": "すらしてくれないそりゃそうか、ぶっちゃけでも今エンジニアとして働かれてる部分はあると思うんですけど正直金融の方がやっぱりその英語として詰めなくちゃいけない話っていうのはやっぱ多いんじゃないですかやっぱいや、。",
      "start": 1943741,
      "end": 1957669,
      "timestamp": "32:23"
    },
    {
      "speaker": "Ishi",
      "text": "なんか似てるところが、むしろ似てるかなと思ってて基本的なワードを使いまして意思疎通を図るみたいな感じなんでなんか日常会話より最終的に楽。",
      "start": 1957669,
      "end": 1972082,
      "timestamp": "32:37"
    },
    {
      "speaker": "Senna",
      "text": "みたいなあーなるほどねまあゴールが見えているところがありますよねお互いやらなくちゃいけないこととかそう。",
      "start": 1972082,
      "end": 1978658,
      "timestamp": "32:52"
    },
    {
      "speaker": "Ishi",
      "text": "ですねそうですねなんか色金融話ビジネスの話をするだけだったら周りと皆さん旅したと思うんですけどキャッチアップはむしろ早いん。",
      "start": 1978658,
      "end": 1990690,
      "timestamp": "32:58"
    },
    {
      "speaker": "Senna",
      "text": "じゃない素晴らしいそうするとやっぱり英語周りの分に関しては大学4年生の時の経験から既にもう意識して働きながらまた詰めていってっていう継続が物言っ。",
      "start": 1990690,
      "end": 2003020,
      "timestamp": "33:10"
    },
    {
      "speaker": "Ishi",
      "text": "たってことですねそうですね。",
      "start": 2003020,
      "end": 2004588,
      "timestamp": "33:23"
    },
    {
      "speaker": "Senna",
      "text": "僕の場合はありがとうございますじゃあそのままちょっと次行かせていただくんだったらやっぱりそうですね就活前の話だとは思うんですよねやっぱり英語の部分見えたし学校で相当勉強したっていうのも分かったしフロックのメンバーにも聞いてメンターもいてっていうところもだいぶ見えてきたので具体的にやっぱり元金融マンがこっちでカレッジ行って就職活動する果たしてそんなうまくいくもんなのかっていう話をちょっと聞いてみたいなと思いますが実際どうでした。",
      "start": 2004588,
      "end": 2032823,
      "timestamp": "33:24"
    },
    {
      "speaker": "Ishi",
      "text": "実際うまくいかなかったですね。",
      "start": 2033705,
      "end": 2034926,
      "timestamp": "33:53"
    },
    {
      "speaker": "Senna",
      "text": "そりゃそうっすよねなかなか厳しい。",
      "start": 2034926,
      "end": 2037429,
      "timestamp": "33:54"
    },
    {
      "speaker": "Ishi",
      "text": "ですよねでもねそういう厳しい厳しいって話をめちゃくちゃ聞いてたんで良かったかなっていう言い口は。",
      "start": 2037429,
      "end": 2046077,
      "timestamp": "33:57"
    },
    {
      "speaker": "Senna",
      "text": "現実は分かってたけどっていうまぁでもとはいえやっぱり心の中ではみんな思うじゃないですかとはいえ1ヶ月くらい頑張りゃなんかワンチャンあるんじゃねーのみたい。",
      "start": 2046077,
      "end": 2054965,
      "timestamp": "34:06"
    },
    {
      "speaker": "Ishi",
      "text": "なそうですねそれってで。",
      "start": 2054965,
      "end": 2057379,
      "timestamp": "34:14"
    },
    {
      "speaker": "Ryo",
      "text": "もなんかエンジニアに多いんじゃないんですかわかんないけどなんか日本のエンジニアでその楽してきた人たちはそう思うのかもしれないけど石井さんはエンジニアだったわけではないんで日本ではなんかそれはないのかなってわかん。",
      "start": 2057379,
      "end": 2069946,
      "timestamp": "34:17"
    },
    {
      "speaker": "Ishi",
      "text": "ないけどでもそうですねそれに近い感じですね簡単なわけがないっていう。",
      "start": 2069946,
      "end": 2076550,
      "timestamp": "34:29"
    },
    {
      "speaker": "Senna",
      "text": "近い。",
      "start": 2078309,
      "end": 2078509,
      "timestamp": "34:38"
    },
    {
      "speaker": "Ishi",
      "text": "かったっていうそれはで。",
      "start": 2078509,
      "end": 2081310,
      "timestamp": "34:38"
    },
    {
      "speaker": "Senna",
      "text": "も良かったかもしれないですねでも具体的にはいつ頃から何をしだした。",
      "start": 2081310,
      "end": 2085210,
      "timestamp": "34:41"
    },
    {
      "speaker": "Ishi",
      "text": "とかってそうですね多分あの3フェーズぐらいあるかなと思うまず最初のフェーズから話すと自分が始めたのは半年か経たないかぐらい。",
      "start": 2085210,
      "end": 2097175,
      "timestamp": "34:45"
    },
    {
      "speaker": "Senna",
      "text": "の時です何年か早い。",
      "start": 2097175,
      "end": 2099418,
      "timestamp": "34:57"
    },
    {
      "speaker": "Ishi",
      "text": "早いですねその時点ではVanilaJSCSJavaScriptしか知らなくてそれらを使ったプロジェクトがほぼ完成してるタイミングで1回就活というものをやってみないと何が必要か分からないっていうふうに失敗する前提でやりますその時もでもやるならちゃんとやらないとフィードバックも正しくいられないと思ったんであのランガラの先輩です日本人の先輩何人もいるんでレジュメを見てもらってだいたい皆さんのプロジェクト1個しか書いてないレジュメは通らないよっていうフィードバックなんですけどそれはそうだけどでもこういうふうに書いたらいいよとかあとまあいろいろ教えてくれますしまあリンクトインとかのジョブポスティングを見てこういう感じなんだっていうのがわかっでも、70件ぐらいですかね、その時点で応募して本当ワンクリックでバーってトガシ。",
      "start": 2099418,
      "end": 2160453,
      "timestamp": "34:59"
    },
    {
      "speaker": "Senna",
      "text": "用方式じゃないですかトガシさんもこっち来てわけわかんないのにいきなり就活したやつやろ、。",
      "start": 2160453,
      "end": 2166045,
      "timestamp": "36:00"
    },
    {
      "speaker": "Ryo",
      "text": "確かでも僕今から思うと結構それって良くてメンタル的に大変なことを細切りにすると2回目3回目今でいうとレジュメ作ってレジュメ出して全く帰ってこなくてっていう流れを最初の方に経験しておくと2回目そこからのアップデートになるし知識も溜まってるんでなんかメンタル的にはあんまり来ないのかもしれないですねちょっと今。",
      "start": 2166045,
      "end": 2194782,
      "timestamp": "36:06"
    },
    {
      "speaker": "Senna",
      "text": "聞いてて思ったんですけど悪くなることはないもんねだって最初の時より。",
      "start": 2194782,
      "end": 2198768,
      "timestamp": "36:34"
    },
    {
      "speaker": "Ishi",
      "text": "それは今聞いててすごいそうだなって思いましたね。",
      "start": 2201308,
      "end": 2206232,
      "timestamp": "36:41"
    },
    {
      "speaker": "Ryo",
      "text": "僕も今本当に聞いてて思ったんですけど僕も本当に2,3回に分けてやってたのもあるしあと僕リートコードを僕もCSとか出てたわけじゃないんでちょっと大手とかを受けるときにはリートコードとかシステムデザインとかって勉強したんですけどそれを結構3回4回ぐらいに分けてやったんですよねリートコードのイージーができるようになって一社目を買ってもうちょっとできるようになって二社目を買ってで他の残りを全部ミディアムは絶対いけるかなぐらいになって今の三社目になるんですけどそういうふうにレジュメもそうだしそういう大変なことをちょっと細切りにしてやると楽だったなっていうふうに思ったんでそれはなんか特にあのレジュメっていうそのレジュメというかその最初の送って返信が来るまでの流れってすごいメンタルにめちゃくちゃ来るじゃないですか最初返信帰ってこないとなんでそこをちょっとなんか細切りにできたのはすごい良かったのかな。",
      "start": 2206232,
      "end": 2266395,
      "timestamp": "36:46"
    },
    {
      "speaker": "Ishi",
      "text": "みたいな思いましたね今思えばそれを自分もなんかやってた感じです最初は来ないんですよ。でも来ないけどあえて早めに始めてるっていう感覚で、そういう気持ちで自分も臨んでたんで別に帰ってこなくても想定の範囲内みたいな余裕がありますよねそう受け止められましたねこれがなんか完璧にしてから進んでたら来なかった時に完璧なのに来ないともうこれ以上やることないみたいなもうどうしようもない気持ちになってたかもしれないです。",
      "start": 2266395,
      "end": 2300503,
      "timestamp": "37:46"
    },
    {
      "speaker": "Senna",
      "text": "ね確かにいやーそうよね実際にやっぱり契機もあるしもちろんポジションが悪くタイミングもあるしっていうね自分以外の余裕も大きいんだけどやっぱり自分のせいにしたくなりますもんね完璧にここまでやったのにっていうそう。",
      "start": 2300503,
      "end": 2312527,
      "timestamp": "38:20"
    },
    {
      "speaker": "Ishi",
      "text": "ですねなんであのまだ僕はソフトウェア開発がどうとかって言えるくらいの経験もないですけど、アジャイルの話じゃないですけど、早くトライして、早くフェイルして、次に繋げるっていう。それをいかに早くスモールにやれるかっていうのは結構、就活でも同じかなっていうふうにしましたね。",
      "start": 2312527,
      "end": 2333989,
      "timestamp": "38:32"
    },
    {
      "speaker": "Ryo",
      "text": "なんか履歴書からレジュメに変えるので結構やっぱインプットが多いというかその履歴書ってなんか誰が書い誰がなんか経歴というか経歴が同じであれば誰が書いても同じものになると思うんですけど基本的にはレジュメってやっぱもう何通りでも書き方があってそのまず自分の経験を洗い出すみたいなところでも結構大変だったりするしそれを英語にしないといけなくてまた大変で今はAIとかがあるんでちょっと楽にはなった気もするんですけどそこからアプライしてみてなんだろううまくいかなくてATSみたいなの知ってみたいなやっぱインプットがすごい膨大でなんで全部最初から完璧っていうのは多分そもそも結構難しいんですよね。",
      "start": 2333999,
      "end": 2380379,
      "timestamp": "38:53"
    },
    {
      "speaker": "Senna",
      "text": "や素晴らしいではまあそれで実際目レジュメ最初送ってみて当然最初帰ってこないんでしょうけど具体的にどうですかその就職するまでの間ねやっぱり就職活動を振り返ってフェーズねまだ今1個目くらいかなと思います。",
      "start": 2383595,
      "end": 2396482,
      "timestamp": "39:43"
    },
    {
      "speaker": "Ishi",
      "text": "2を離さないといけないですね。その後やっぱりダメで、少なくともマンスタックのプロジェクトはやらなきゃダメだろうと思って、それをさっき言った個人プロジェクトでささっと書けるものを作って、載せてもう一度やったっていうのが去年の6月ぐらいなので来てから10ヶ月目ぐらいの話ですねそこで確か4,50件ぐらい送ったんですけど帰ってこなくてさすがに今の自分にこの手法はダメだと思ってネットワーク、ネットワーキングですね、ネットワーキングに行くっていう手段を切り替えたっていうのがフェーズ2ネットワーキングっていろんな意見があって意味あるよっていう人もいれば意味ないよっていう人もある僕個人としてはどこに行くかによるかなって思ってて要は自分が提供できるもの、ギブできるものが何でもいいんであればそこに自分が行く価値があるんで何か引っかかるかもしれないただそれがないと自分がテイクするだけになるんで雑踏に紛れるみたいなそういう整理なのかなと思って結構意味ないって言ってる方によくあるのがなんかテック系のミートアップに未経験なのに当然こう雇ってください以外の発言がないみたいな自分から提供できるものも当然ないしそうなってくると同じような人もいっぱいいますとそこの中で自分に就職の話がまあこんだけ競争激しい中で来るわけないよねってあるかなと思って僕も最初それを知らずにあのテック系のイベントに参加してた意味ないなっていうふうに思って自分の場合スタートアップでの経験があったりとかドメインで言うと金融ですねのドメインがあるんでそういうワードに興味があるありそうな人が来るイベントに行こうと思ってスタートアップのピッチイベントとかそういう系のやつはあんまなかったんですけどそういうワードがイベントの名前についてるやつとかに自分の身の上を話して誰か紹介してほしいと言ってましたねそれがちょうど1年ぐらい6月7月8月ぐらいちょうど夏でイベントも多かったんで2,3回ぐらいそういうイベントに行ってすごいたくさんの人とリンクしてコーヒーチャットしてみたいなことをやってましたねその活動を通じていきなり就職できたってわけじゃないんですけどこれを続けてるといいことが起きそうだなっていう感覚は自分の中であっていろいろあるんですけど、一個具体例をあげると、フィンテックの会社のCTOがスタートアップのイベントにいて、その人に声かけたらデベロッパーじゃないんですけど、僕がクレジットカード業界にちょっと詳しかったんで、その話を教えてほしいみたいに言われて、インターナルミーティングに何回か参加するっていう謎のイベントが発生してで、そうこうしているうちにでも僕はビジネスじゃなくてディベロッパーになりたくてこっちに来てるんだけどみたいなからなんかあのちょっと今はまだプロダクトっていうかなんかそのポジションを上げられないけど君が学校を卒業したらもう一回相談してくれるって言われてで、今実際働いている会社は違う会社なんですけど学校卒業したタイミングで向こうから連絡が来て雇ってあげるよみたいなインターンでいいんだったら雇おうよみたいなたのがあっいましたねえっともう1個はこれ実際にあの自分があのレジュメに乗ったってすごい大きな話だったしフロックも関わってる話なんですけどあのボランティアですねボランティアにえっとなんかすることができるようになったっていうのがあってあの僕は勝手にこじつけてるだけかもしれないんですけどもとあるイベントでそのえっと終わるイベントでファウンダーの方を見てその人に僕個人的に興味持っててイベント中には話しかける時間がなかったんですけど一方的にリンクトインとかのメッセージとか送っててたまたまなんですけどその3週間後ぐらいにフロックでその人がやってる会社のボランティアの募集がフロックで出たんですねそれに応募してボランティアとして迎え入れてもらったっていうそれがまあその後僕のレジュメに乗って今の回それがフェーズ2の成果ですもう一個はあのランガラーからあのパートタイムの仕事をえっといただいたってのがまああの8月の末ぐらいにとってなんであの成果というか、フェーズ2の終わりに起こったことはボランティアと1個パートタイムと2つの仕事場をいただくことができたっていう感じですね素晴らしい、。",
      "start": 2398507,
      "end": 2708248,
      "timestamp": "39:58"
    },
    {
      "speaker": "Senna",
      "text": "それはだってね、卒業まで半年くらいのタイミングでそれを実際かけていたっていうことですもんね、。",
      "start": 2708248,
      "end": 2714070,
      "timestamp": "45:08"
    },
    {
      "speaker": "Ishi",
      "text": "そうするとそうですね、半年ちょっと切ったくらいでそうですね、そういう状況を持っていけたんでちょっと遅れましたけどよかったなっていや素晴らしい。",
      "start": 2714070,
      "end": 2725127,
      "timestamp": "45:14"
    },
    {
      "speaker": "Senna",
      "text": "だって当初の予定通りっちゃ通りだったんじゃないですかだって半年分くらいの何かしらの職歴をレジュメに載せなくっちゃねってそのフロックの他のメンバーからとかも聞いててどうにかやっぱりそれを行動にうつかさえないとなっていってフェーズ1で失敗し2でじゃあ。",
      "start": 2725127,
      "end": 2739550,
      "timestamp": "45:25"
    },
    {
      "speaker": "Ishi",
      "text": "っていうことで一心復帰まあ。",
      "start": 2739550,
      "end": 2741271,
      "timestamp": "45:39"
    },
    {
      "speaker": "Senna",
      "text": "でも2のタイミングは色々期待事ありますねやっぱりそのネットワーキングの部分においては正直賛否両論は間違いなくその通りでそう行っても意味ねーよなっていう人も相当フロックにもいるしいや絶対行くべきだっていう人もめちゃくちゃ多いからそうなんかこの辺は人に正直よるなーってずっと思っていたんだけどギブできるっていうワードは確かにあるかもしれないですねイベントに対し。",
      "start": 2741271,
      "end": 2762297,
      "timestamp": "45:41"
    },
    {
      "speaker": "Ryo",
      "text": "てあとは多分あの行っても意味ないっていうのはその人は行っても意味ないっていうことなのかと思うんですよね僕も多分行っても意味ない組なんですよねっていうのはまああんまりなんかそのなんだろう自分から発言していく方ではないしライトニングトークみたいなのをするような性格ではないっていうのがあって言っても意味ないって言ってる人たちはシャイだったり僕みたいにそういうことあんまりやりたくないかなっていうのでで、自分からもあんまり喋りかけにはいかないタイプなのであれば、確かにその人は行っても意味ないっていう。",
      "start": 2762297,
      "end": 2805480,
      "timestamp": "46:02"
    },
    {
      "speaker": "Ishi",
      "text": "で、。",
      "start": 2805480,
      "end": 2805760,
      "timestamp": "46:45"
    },
    {
      "speaker": "Ryo",
      "text": "まあなんかそういうふうにギブが与えられるものを探すっていうのもまあ一つですし、えっと、まあ登壇するっていうのも一つだし、で、そんなことギブできるものはないけど、えっと誰にでも、誰でも彼でももう話しかけれるよみたいな性格の持ち主だったら多分それも、あの、なんだろうね、行っても意味あるそう言った方がいいっていう人になるんだろうなぁみたいなまあその人のコンテキストがあってのなんかまあ賛否両論なんだろうなみたいな。",
      "start": 2805760,
      "end": 2833450,
      "timestamp": "46:45"
    },
    {
      "speaker": "Senna",
      "text": "のがありいや間違いないちょっとたまにかわいそうだなって思うのが明らかにそうトガシさんタイプというかまあ本当は行きたくないし行く必要も多分ないんだろうなっていう人がでもメンターからやっぱり行った方がいいよって聞いたからもう自分のケツむちゃくちゃぶっ叩きまくってもう嫌だけど行くみたいなね人もいたりするかそうなるとメンタルやられたりするからすねなかなかちょっと嘘万人にって言っては自分との会話が大事だなってあると。",
      "start": 2833450,
      "end": 2858317,
      "timestamp": "47:13"
    },
    {
      "speaker": "Ishi",
      "text": "思いますねそれはそうですねあと僕はその前の職歴にフックをかけていきましたけど趣味とかでも全然いいと思って趣味っていうとそのフレンドシップとかその趣味の知識とか興味関心がギブできるものとかみんなそれを期待しているのでそこで普通に友達作ったりとか仲良い人作ったりとか全然いいかなと思いますね僕の周りの友人でもそこで出会った人がたまたま実はスタートアップのCEOまで行ったみたいな。",
      "start": 2858317,
      "end": 2889823,
      "timestamp": "47:38"
    },
    {
      "speaker": "Senna",
      "text": "ありあり全然ありフロックのメンバーの中でも一人Amazonのエンジニアさんでワンピースカードがむちゃくちゃ趣味で何とかフロックのメンバーでワンピースカード好きな人いませんかみたいなそうコミュニティを広げていきたいみたいな人いたりするから見方を変えるんだったらAmazonのSDの4年くらい働いてる人と仲良くできるコミュニティっていうことにワンピースカードがもしかしたら作用するかもしれないしねそういう趣味を通すは全然ありだと思うそれはギブの一つだから。",
      "start": 2891735,
      "end": 2919014,
      "timestamp": "48:11"
    },
    {
      "speaker": "Ryo",
      "text": "あとはIT系ってやっぱりめちゃくちゃホワイトじゃないですかで時間も早く終わるんでやっぱり趣味の時間を持ってる人多いんですよねだから僕個人的にバレーとかサッカーとかテニスとかやるんですけどやっぱりIT系の人多いですからねなんでその人たちと一緒に運動して運動するとしゃべらなくても仲良くなれるんですよほぼしゃべらなくても同じチームだっただけでなんか友達になれるみたいなのがあるんでそういう人たちでit系の人とかいたらこの頃仕事探してるんだよねぐらい言えば多分結構いいふうにしてくれるというかレファラルくれたりもすると思うんで確かにそういうのはお。",
      "start": 2920737,
      "end": 2960188,
      "timestamp": "48:40"
    },
    {
      "speaker": "Ishi",
      "text": "すすめですね個人的に思ってるのがリファラルとかでもいいんですけどそういうのが有効な理由っていうか背景みたいなところで結局その情報、LinkedIみたいなコールドプラットフォームで人が集まりすぎてて選ぶ側が選べなくなってるうーん間違いない自分もその前のスタートアップで採用とかやってたんですけどやっぱその人をなんかその超客観的に評価するのってすごく難しいなって思って多分不可能だなって思ってやってくるとなんか特にその大きい会社だったらちゃんとした採用プロセスがあってそのためのリソースがあってっていうそうじゃない大多数の会社においてはなんかそこにいるいいやつを採用するのが間違いないみたいな思考になりがちなのかなと思ってて別になんか超トップの人材を取らなきゃいけないとかって縛りを自分たちに課してるわけでもないのでその場に居合わせてるかどうかみたいなと思っててなので別にネットワークに行ったり行かなかったりってのはいいんですけど事実そのリファレルによって就職するケースが多いっていうのはなんかそういう構造的な話とかも結構あるのかなと思って外に目を向けて暮らした方がいいっていうのは僕、カナダに来てから1年ぐらい逆にネットワークイベントに自分が行き出すまで全くそういうことをしなかったもしカナダに今来た瞬間何しますかって言われたらそういうコミュニティを作ることをもうちょっと戦略的にやるかな。",
      "start": 2960188,
      "end": 3057957,
      "timestamp": "49:20"
    },
    {
      "speaker": "Senna",
      "text": "なるほどですね素晴らしい次に来る人たちのめちゃくちゃ具体的なアドバイスありがとうございますするとフェーズ2もある程度見えてきてようやく仕事決まるんじゃないかなのフェーズ3だと思うんですがどう決まった。",
      "start": 3059124,
      "end": 3074406,
      "timestamp": "50:59"
    },
    {
      "speaker": "Ishi",
      "text": "んでしょうフェーズ3は今のネットワークの話を若干覆すような話なんですけど結局コールドアプライで運がいいことに引っかかって多分職歴が書いてあったからだと思うんですけどその中の一者で担いでもらって今働いてるっていうネットワーク代表から。",
      "start": 3074406,
      "end": 3096613,
      "timestamp": "51:14"
    },
    {
      "speaker": "Senna",
      "text": "の普通にアプライしたって。",
      "start": 3096613,
      "end": 3098614,
      "timestamp": "51:36"
    },
    {
      "speaker": "Ishi",
      "text": "いうそうですねフェーズの話を切らないとちょっとそこが。",
      "start": 3098614,
      "end": 3102519,
      "timestamp": "51:38"
    },
    {
      "speaker": "Senna",
      "text": "うまく伝わらない確かにとはいえフェーズ2のタイミングでフロックのボランティアのあれもそうかもしれないしランガラのお仕事もそうかもしれないしその辺も結局はネットワークとかコネクションとかコミュニティで生まれたものだと思うから全く繋がってないわけが。",
      "start": 3102519,
      "end": 3117629,
      "timestamp": "51:42"
    },
    {
      "speaker": "Ishi",
      "text": "ないですよねそうですねあと仮に今の会社選んでなかったらネットワークで声かかったら多分フィンテックの会社うんうん、そうかよく似たようなことかな、ですけど僕がLinkedIで応募したのが12月から1月っていうイベントが全くなくて多分受給がちょっと緩んでるタイミングだったんで他にやることはなかったんですねなので一方で僕は12月に卒業してやることがなくなったんでもうじゃあ何もやらないでいいやと思って60件くらいですかね、そのタイミングで送って3件くらいからインタビューの招待が来て受かったのはその一社だけだったんですけど今運営事務所に働いて。",
      "start": 3117629,
      "end": 3157869,
      "timestamp": "51:57"
    },
    {
      "speaker": "Senna",
      "text": "いるっていう60件送って3社帰ってきて面談は1個だけっていうことかなるほどその1社が今のほうってことですよね。",
      "start": 3157869,
      "end": 3167593,
      "timestamp": "52:37"
    },
    {
      "speaker": "Ishi",
      "text": "そうですねオファーが1個。",
      "start": 3167593,
      "end": 3168593,
      "timestamp": "52:47"
    },
    {
      "speaker": "Senna",
      "text": "だけオファーがっていうことですね素晴らしいでも未経験からっていう分で職歴はボランティアと学校の仕事っていう分だけで60件中3件結構打率はいいなっていうふうに思いますし実際それで面接の部分もその1社だけだったと思うんですがどういう流れでした。",
      "start": 3168593,
      "end": 3184577,
      "timestamp": "52:48"
    },
    {
      "speaker": "Ishi",
      "text": "えっとなんかあのテイクホームの宿題を出される最初は何かビヘイビアルクエスチョンというか30分ぐらいの雑談みたいなことしてそういう人なんだみたいな感じでちょっとバックエンド系の質問出すから何かいつでもいいからできたらまたちょっとスケジュールを抑えて何分くらい話そうみたいなそこは今自分の会社はMongDBとかNode。\njsとかを使ってその辺りの細かい質問みたいなのがバーって書いてあってAI使って答えてもいいよみたいなそんなこと言うのは分かってやるからもうそういうのを使いながら自分なりに回答を考えてプレゼンしていくとはいえ僕の場合はジュニアなんでそんな時間かけても向こうの期待値が上がっていくだけだと思って1週間後にもう一回スケジュールを作ってもう一回プレゼンしてっていう感じでその後僕はビジネスの経歴があるんでビズの人とも話してほしいって言われて面接して最後にCTOと面接だったんですけど一般的にはそこで終わりかなっていう感じなんですけどそこでもう一個宿題を出されてAIエージェントについてこのライブラリーがあるからこのオープンソースプロジェクトがあるからこれを使って何ができるか何ができないかを教えて最後それをまた1週間後ぐらいにオファーいただくみたいな。",
      "start": 3185441,
      "end": 3270988,
      "timestamp": "53:05"
    },
    {
      "speaker": "Ryo",
      "text": "リート。",
      "start": 3273212,
      "end": 3273532,
      "timestamp": "54:33"
    },
    {
      "speaker": "Ishi",
      "text": "コードとかシステムデザインとかそんなコテコテの、よくあるやつよりは結構トリッキーなんですけど僕は仕事してなかったんでそのやり方の方がありがたかった。",
      "start": 3273532,
      "end": 3284481,
      "timestamp": "54:33"
    },
    {
      "speaker": "Senna",
      "text": "という面接の内容から完全にAIネイティブなエンジニアを雇いたいっていうのが丸見えな面接内容だなと思いましたけどやっぱりでもその辺はじゃあ弁説のタイミングでまあ1週間かなテイクホームしてまあ持って帰ってそれを提出してそれが評価されたってことですか。",
      "start": 3284481,
      "end": 3304531,
      "timestamp": "54:44"
    },
    {
      "speaker": "Ishi",
      "text": "ねそうだと思いますね最初のバックエンド系のクエスチョンに関してはAIを使って回答するんですけどAIだけじゃなくて結構ビジネスコンテクストによって回答が変わるみたいなそういうテイストの話で僕が勝手にそう読み取っただけってのもあるんですけど自分は特にその経歴があるから面接に呼ばれたりっていうのも聞いてたんであえてこういう仮定を置くとこういう結論になるこういうデータモデルの方がいいと思うとかそういう伝え方をするようにしてましてそれは最後のAIエージェントの話ですねあんまり技術的なところに話を持っていくと自分は不利なんで全くそうならないように議論をまあでも。",
      "start": 3304531,
      "end": 3354490,
      "timestamp": "55:04"
    },
    {
      "speaker": "Senna",
      "text": "ジュニアとしてで考えるんたら相当受けのいい面接になるようになったんじゃないですかだってジュニアに対してやっぱり技術的な期待値って正直そこまで高くないと思うけれどもそれに対してビジネス部もやっぱり出てくるっていうことで考えたらやっぱりいっさんの過去のご経歴っていう部分には当然興味あったんだろうしそれに加えておそらくジュニアとしてのコミュニケーション能力とAIをどう活用して仕事に応用するかの部分で見るんだったらもうパーフェクトな内容だったんじゃないのってちょっと思い。",
      "start": 3354490,
      "end": 3379589,
      "timestamp": "55:54"
    },
    {
      "speaker": "Ishi",
      "text": "ましたけどねああ、ありがとうございます。なんかそこまで自分で考えたことはなかった。",
      "start": 3379589,
      "end": 3383790,
      "timestamp": "56:19"
    },
    {
      "speaker": "Ryo",
      "text": "ああ、。",
      "start": 3383790,
      "end": 3383880,
      "timestamp": "56:23"
    },
    {
      "speaker": "Senna",
      "text": "そうですか。それは失礼しました。",
      "start": 3383880,
      "end": 3386602,
      "timestamp": "56:23"
    },
    {
      "speaker": "Ishi",
      "text": "いえいえ。でもまあ、そうですね。ちょっと面接やってる時は必死だったんで、何か意図もわからない。なんとか生き延びるためにこうだったですけど、まあでもやっぱりこうAIとかやってくると、あの、なんか学習のハードルがやっぱり下がるんで、スポーティングが大事じゃなくなるとかってよりは、その単純にジュニアに期待する内容もちょっと変わってきたりするのかなと思ってて、今、瀬名さんがおっしゃった通りで、他の経験があるとか、他のコンテキスト、例えばビジネスとの会話ができるとかビジネスの考え方ができるとか、そういうちょっと違うものがあるっていうのがジュニアだけど、むしろその価値が相対的に高まるみたいなのがあってちゃんと採用してもらったのはなんかある気がし。",
      "start": 3386602,
      "end": 3433534,
      "timestamp": "56:26"
    },
    {
      "speaker": "Ryo",
      "text": "ますあとはなんかそのコミュニケーションがちゃんと取れてそのまあジュニアで技術はないかもしれないけどその自分が出した問題に対して意図を汲み取ってそれに対してちゃんとそった回答をした分してくれてるからあのジュニアだったとしてもそのなんだろう技術的な指摘をした時にあのコミュニケーションを取ってちゃんとあの達成その目標を達成してくれるんだろうなみたいなのが見えてたなって思いますよね今話を聞いてい。",
      "start": 3433534,
      "end": 3459784,
      "timestamp": "57:13"
    },
    {
      "speaker": "Ishi",
      "text": "てもこれはそうですね、10年くらい働いた経験があるので多分意識的にそういうコミュニケーションを取ろうというのが僕もやってたかもしれないですね素晴らしい。",
      "start": 3459784,
      "end": 3474382,
      "timestamp": "57:39"
    },
    {
      "speaker": "Senna",
      "text": "もうウカるべくしてウカったっていう人の話を聞いた感じでしたね。",
      "start": 3474382,
      "end": 3479023,
      "timestamp": "57:54"
    },
    {
      "speaker": "Ryo",
      "text": "あとフェーズ2とフェーズ3で全然違うようなやり方だったってことですけどフェーズ2のやり方コールドアプライじゃない方法でもきっと引っかかってたんだろうなというかもちろんジュニアで就職できるって今は運がいいって言われてるくらいの時代というかあれですけどでも何かしらできっと引っかかってたんだろうなぁみたいなその運を味方につけるだけの準備と土台があったんだろうなっていう。",
      "start": 3479023,
      "end": 3510371,
      "timestamp": "57:59"
    },
    {
      "speaker": "Ishi",
      "text": "感じがしますよねそうですねあの今お話ちょっと聞いてて思い出したのがネットワーキングにフェーズ2でネットワーキングに行きまくって自分を頑張って売り込むみたいな作業を何回もやった結果なんか面接でそれが自然にできるようになったってこういう話し方をすれば相手が聞きやすくなるというのは。",
      "start": 3510371,
      "end": 3533455,
      "timestamp": "58:30"
    },
    {
      "speaker": "Ryo",
      "text": "結構確かにあのやっぱりそのまず最初レジュメを出して読んでもらうところも難しいんですけど日本人のその面接スタイルって質問されて質問に返すみたいなそれが基本の面接スタイルでなんか聞かれてもないことは言わない方がいいみたいなのが日本では多分あると思うんですけどこっちは自分からこういうことできるよ俺これがすごいよこんななんだろう働き方どうみたいななんかそういうのを提案をしてやっと聞いてくれるみたいなもしなんか質問を待ってたらその人が話し続けてなんかなんか終わっちゃったみたいなやっぱりなりがちでそれをその最初の何回かの面接で学んでそこからみたいなのがあると思うんですけどそこをなんだろうその自分のフットワークの軽さだったり行動からスキップできたのはすごい確かに良かったのかなというかっていうふうに思い。",
      "start": 3533455,
      "end": 3584865,
      "timestamp": "58:53"
    },
    {
      "speaker": "Ishi",
      "text": "ますねでも確かにそれはまさに学んだことですね。自分からどんどん言っていく、読んでいくっていう感じですね。日本だとそういうのはあんまり良しとしないみたいな、けらかすみたいなのがあるんですけど、ガンガン言うみたいな、やってないことも言うみたいな。",
      "start": 3584865,
      "end": 3598483,
      "timestamp": "59:44"
    },
    {
      "speaker": "Ryo",
      "text": "ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 3598493,
      "end": 3616590,
      "timestamp": "59:58"
    }
  ]
}