{
  "episodeGuid": "39cf6d7a-a8fc-4f4f-a0f7-3ad0e8e1bc7d",
  "episodeTitle": "有給5週間＋冬休み1週間！Webディレクターから転職したエンジニアが語るカナダの超ホワイトな働き方（後半）#18",
  "transcribedAt": "2025-10-16T06:37:37.972Z",
  "duration": 3157,
  "fullText": "それでは前回に引き続きさとみさんに来ていただきました前回は就職活動とか英語をどうやって勉強したのとか聞いてたんですけど実際働いてみてどうかみたいなのを聞いていこうかなと思いますざっくりどうですか働いてみて日本の会社の違いとかこんなところいいよみたいなのとかあったら教えて。ください最高の一言につきますねもう日本に帰りたくない。ですその心は?もうその心はまず時短であることをその9時5時でみんないい意味でゆるく働いていらっしゃるなっていうのですごく自分のペースで働けているその快適だなと女だったらその金曜日なんかはもう3時からゲームタイムがあってみんなでオンラインゲームを最近はジオゲッサーをプレイして4時ぐらいに終わってみんなバイバイみたいな緩い雰囲気で働いていますしいかんせんそういう余裕がある環境だからかみんな基本的にチーム入ってみたらカナディアンばっかじゃないかみたいな雰囲気のチームなんですけどもこんな英語があまりうまくしゃべれないノンテイティブな私に対してもすごく優しくしてくれて何か困ってない?大丈夫?質問あったらいつでも連絡してねとかすごいこまめに確認してくれたりだとかすごいいつでも質問ウェルカムだよっていうような姿勢を見せてくれてやっぱり分からないこと、やっぱりジュニアっていうこともあって右も左も分からないっていう状況によくなるんですけども最近はそんなに抵抗感なくここが分からなくてっていったことも質問しやすくてすごく楽しく働いて。ますチームはどれぐらい人数いるんですか?エンジニアが何人でとか割合的には。よくよく考えたらごめんなさい会社がどういうサービスやってるかとかって説明したほうがよかったです。質問するの忘れてました一回じゃあそうですねまた他にもいいところどんどん聞いていこうかなと思うんですけど会社がどういうサービスやってるかと規模感とあとは自分のチームが何やってるかも教えていただいてもいいですか。まず会社のサービスについてはストックフォトサービスの会社でイメージしやすいのは暗出ブラッシュとかアイストックといったサービス会社自体はもともとアイストックで働いていた方が独立してその独立した理由もやっぱりそのアーティスト写真とかそういったイラストとかを提供してくれるアーティストの作品がちょっとやっぱ格安で買われているってところに問題意識を感じてできるだけアーティストに対してフェアな報酬が支払われるようなサービスを作りたいって言ったことで作られた会社ですなのでわりかし社会意識が高いというかもう会社ですね会社の規模感としては全員で50人ぐらいでそのストックフォトのその契約しているアーティストさんが今だと1900いかないぐらい約1900人ぐらいいらっしゃいます私のそのテックチームについては全体で11人私含めて11人いて私が所属しているチームがやっているのはその会社のその実際にそのストックフォトそういった作品を売っているウェブサイトのメンテナンスですね運用保守運用更新をしていましてそこのチームは私とシニアディベロッパーの方インターミディエイトの方と同じジュニアの方とUIXデザイナーの計5人のチームがクライアント側としてやってます技術的に。はどんな技術使われている。んですか技術はフロントエンドはリアクトバックエンドはPHPのララベルですねでもテストツールもいっぱいあってジェストをJSのために使っていたりあとはRubyが自動テストのためにRubyを使ったりいったことをしていますじゃあ。仕事は基本的にずっとフロントエンドの方をやってるって。感じなんですかそうですね私のポジションがフロントエンドのジュニアデベロッパーなので私は主にフロントエンドを扱って。ます初めてどれくらいっておっしゃってましたっけ。初めて今ちょうど1ヶ月ぐらいですね8月の初めに入社したので。1ヶ月ぐらいです最初にオンボーディング期間みたいな感じでいろいろ教えてもらう期間とかあったりしたんですか?はい、オンボーディングそうですね今オンボーディングはありましたまずそのHRの方がウェルカムウェルカムミーティングみたいな開いてくれて会社のHRのその人事系のツールだったり説明してくれたのとさらにはいろんな部署のこういろんな部署の方ともミーティングでその自己紹介というかイントロのミーティングも設けられて例えばマーケティング部署のプロデューサー枠の方だったりだとか財務の方だったりいろんな部署の方と初めの1,2週間は初めまして里見と申します日本から来ましたみたいな挨拶をめちゃめちゃしましたちなみ。にさっきネイティブが結構多いって言われてたんですけどどのぐらいの比率で非ネイティブの人がいる環境なんですか。ネイティブ本当どのぐらいいらっしゃるんだろうかってわからないぐらいに例えば会社のアバウトアースにチームの働いている人の経歴と写真が載っかってるんですけどもそこをざーって見てもあれかし例えば東アジア系の方があまりいらっしゃらないって言った雰囲気じゃあ。もうほとんどはみんなカナダ人みたいな感じなんですかね。そうですねもうそうですね、ほとんどの方がカナダ人だと思います。やっぱり面接するときに一応リンクドインでその方の経歴とかを調べたんですけども、その時もやっぱりビクトリアの大学を出てらっしゃるとかで、もう育ちからカナダなんだろうなっていう方が多かったですね。他にはなんか最高って言ってたけど、どんなところが良かったりとかありますか?なんか私としては1ヶ月で最高って思えるのってかなりいいなと思ってて、私最初に始めて、仕事始めた時1ヶ月なんてもうなんか死にたいと思ってたけど。そんなそんな。最高と思う理由として、ちょっと1個大きいのがその日本で働いてた時に、さっきも言ったように、日本で働いてた時はお客さん先に常駐して、すごい気を使うような環境でずっと働いていて、何か小さな修正をするにもお客さんに確認を出して問題ないですねって、もういろいろと細かい細かいやり取りをしてから実際にデプロイするっていった流れだったので正直ちょっとストレスが溜まるような環境だったのに対して今は確認も私からレビューをお願いしてやってもらうぐらいの感じだったりもしてすごい良い意味で自由で自分で判断して行動できるのが私としてはすごい楽というか楽でいいなと思って。やってますどんなチケットをするかとかどんなタスクに取り組むかとかって自分の採用で決められたりするんですか?それともシニアの人がアサインするとか決まってたりします?今はまだそのシニアの方にアサインしてもらってやっ。ていますミーティングとかどれぐらいあります?ミーティングは多分少ない方じゃないかなって思いますあの毎朝朝会みたいなスタンドアップのミーティングで何するかっていうのを共有と週2でえっとそのフロントライアントチームのえっとチケットの進捗確認チケットボードの一周ボードの確認があってで、月一で振り返り会みたいなものがあったりといったぐらいですかね。なので、ジュニアなんでしょう。多い方なのか少ない方なのかわからないですが。英語についてはどうですか?難しいなとか、日々どういうふうに感じてます?なんかさっき聞いて、ゲームが金曜の夕方というか、アフタヌーンか3時ぐらいからあるってことだったんですけど結構なんかよく聞くのは普通の仕事の会話はまあ割とすぐ慣れたんだけどその遊びだとかゲームは本当に慣れないですごいその時間が嫌だみたいな人も結構多いのかなって印象なんですけどなんかさとみさんはなんかさっき結構楽しそうに話されてたんでそういう時間は割と苦にならないぐらい英語はいいかなって感じですか。いや、全く良くないですよ。全く良くないんですけれども、なんかこう、つたないながらも、みんな聞いてくれるっていうのもありますし、基本的に自分、話す、聞くには何を言ってるかわかるっていう感じなので、まあそれでなんかこうパーって笑ったりだとかその一応その輪の中にはいるっていうので楽しんでもありますねただやっぱり自分でこうそこから冗談を言ったりみたいなそういった実際にその輪の中に積極的に気に入るってことはまだやっぱり難しくて実際に彼ともそういった話をするんですけど英語について話すんですけども2人の見解としては無理にネイティブの話の流れってやっぱりネイティブだと早いじゃないですかなんかそれを乱してちょっと異国しなくしてもお互いあんまり面白くないよなっていうので本当に自分が話せる範囲求められた範囲で話してまずはこう一緒にいることを楽しむってことを心がけて仕事をする中。では理解できてなんかちゃんと伝えられてるなぁと思いますかそれとも結構まだ頑張ってて感じですかついていってるって感じですか。まだ頑張って一生懸命やってますね。ネイティブの方で話すのが、みんなカナダ人なのも、そこまで聞き取りづらいっていうこともなくて、たまにわからないときとかは、ごめん、もう一回教えてください、これってこういうことだよねって一応聞き直したりとかで、頑張って理解するようにしております。そしたら仕事内容としてこれから取り組んでみたいこととかこういう風にしていきたいなとかっていうのがあったら教え。てください取り組んでみたいなって思うこととしてはもともと私のジョブポジションがただウェブサイトを運用するっていうわけじゃなくてマーケティング部の方と連携して成果を出していくっていったことがやっぱり目標として掲げられているので今後はマーケティング部の人ともミーティングに参加してウェブサイトをどう改善していくかだとかキャンペーンページでどうやったら効果的にできるかっていったことを実際にやってあわゆくは色々とテストツールマーケティング向けのテストツールヒートマップが見れたりだったことがあるので実際にそれも分析して何かこう自分からこういったことをやったらUIX改善できるんじゃないかっていうのを発案して何か会社のために会社に貢献できるようなことをしていきたいと思ってます。えっと日本でウェブディレクターとして働いてて3年ぐらいの経験があったって話ですよね5年だった5年ですねはいと思うんですけどなんか日本での経験が生きてるなっていうふうに感じる場面はあり。ますかもう多分気づかないところでもたくさんあると思っています具体的にはやっぱりそのディレクターっていうそのちょっと何でしょう客観的に見るべき立場でいたのであの例えばそのチケットの優先順位だとかどういうことを求められているだろうかっていうような視点にはやっぱり常に意識して動けているかなというふうに思うのでただあのコードコーリングができますっていうようなことではなくなぜこういうことをするのかって言ったところからじゃあそこからどうすべきかっていうようなことを常に意識する癖がついているので確実に生きていると思います。なんか聞いた感じだとプロジェクトマネージャーとかプロダクトマネージャーの働き方にちょっと近い感じだからなんかそういう面でどんどん自分でやれることが増えていくとエンジニアだけのなんだろうできることじゃなくてちょっとそこを超えてできるとすごい良さそう。ですよねそうですねこの。トピックでまだ聞きたいことってあります次行っちゃっても大丈夫かなあ、。ごめんなさい最高ネタがもう一つあってこれが実際に使えるかわからないんですけども2つありまして一つはいいところの会社のいいところの一つとしては福利構成がその50人ぐらいの小さい会社としてはわりかししっかりしてるなっていうので完全リモートで働けますし休みについても冬休み12月に1週間あってプラスバケーション有給が5週間分あったとかもちろん有給とは別に執行負もありますし面白いのがボランティアデーって言って何かボランティアに参加したら全然会社に関連したことでなくても会社からちょっとお給料が出たりみたいなことがあったり。その5週間は25日もらえるんですか?だと思いますまだあのプロベーション開けてないので具体的な日付がどう来てるかわからないんですけどもそうだと契約書にそうある。ので5週間と次休みってまあ1週間ぐらい24からとかですよねきっとそうですねそれめっちゃすごくない?えっと、あやかさんの会社ってどんな感じです?いや、その年末年始ホリデーも自分たちのPTOを使わないといけないんでPTOは全部で5週あるけどその中に含まれちゃうから別でもらえるってめっちゃいいですよねじゃ、。単純に1週間多いって感じかなうん、。うらやましいそれ使い切れなかったらどうなるんですか?キャリーオーバーできたりするんですか?次の年。契約書見た時は確か多少キャリーオーバーはできたはずな雰囲気だった気がします。なんか結構募集ってね、計画的に使わないとなくならないんですよ。なんかうちの会社最近給料でセイオフしてくれるようになったから買い切れなかったらお金でもらえると思って、まあいいかってなってるけど、5週目だったら結構ね、計画的にここで旅行とかってやらないと、最後12月全く行かないことになっちゃって、まあそれもいいんだけど。一瞬でなくなっちゃうけどな、。僕。まとめて撮るからでしょ。でもさ、やっぱさ、1年に1回日本帰りたいじゃん。一年に一回日本帰りたくて、一回日本帰るんだったら2週間はいたいじゃん。それでもう一回あわゆくばなんか違う国に遊びに行きたいじゃん。で、それも2週間になるじゃん。そうするともう4週間なくなっちゃうからさ。で、年末年始も休みたいじゃんって言ったら5週間にならない。そんなことない?なりません。でもそれが計画的に使えてるから、その例として。いやでもできるならあと1週間僕欲しいなって思うけどうちはちなみに前の会社もそうだったんだけど一応なんかアンリミテッドっていういくらでも取っていいですよっていう体の会社なんだけどでもそれって全然別になんか良くなくて多分6週間もらえるんだったら全然そっちの方が良くてなんでかっていうとそのペイオフもないしキャリーオーバーも絶対ないんですよそもそも数が決まってないんでであとはそのそのチームのなんか雰囲気によるんでそのチームの雰囲気がみんなそんな取らない感じだと全然取れない。しあーきつかって、。とれないみたいなそれでもとるんですけどでもなんか基本的には暗黙の了解で4週間だよねみたいなまあ確かにますプラス年末年始まあちょっと休んでもいいかもね年末年始って言うか年末かあのだいたいこっちの会社って1月2日とか3日ぐらいから働き始めちゃうんでだからなんかクリスマスの25は休みでそこからなんか休みみたいなのはあるけどだ。から周りをチラチラって見ながら休みを取らなきゃいけないという。そう、だからなんか消化しないといけないっていう気分になれる6週間、5週間、6週間っていうのがあるのであれば、アニメだったよりそっちの方がいいなってこの頃は思うんですけど。でも、サナガの中でもめちゃくちゃそれは良い方ですよね。5週間プラス年末。初めて聞いた。聞いたことないな。他のベネフィットはどんなのがあるんですか?なんか病院、歯医者さんとかだとか。そうですねあの雇用者負担のえっと医療保険とかの資格保険はもちろんついてますしあと年間1000ドルの教育健康手当っていうのがあって例えばマジあのやっぱりフルリモートだからかジム通いたいみたいな人はそういうものが使えたりあとはその例えばユーデミーだとかそういった学習に関することでもあの使えるっていう風にきました。いいですねアプロベーションが終わってからになるのかな。それはそうですね戻れも全部プロペーション終わってからになるので実際にどういうもののかっていうのはまだわかってないですかそういう。のってプロペーション終わってからなんですねおっなんか今までの僕の会社だとだいたい最初からもらってたような気がするけど、わかんない。会社によるのかな、そこらへんは。でもプロベーションといっても2ヶ月か3ヶ月ぐらいだと思うんで、そんな大した違いではないかなと思うんですけど。で、。あともう一個かな。いいこと、ミントあったと思うんですけど。これはあまり自慢になるのかわからないんですけどもあの人に恵まれたなぁの第2弾でさっきあの人が優しいというのはあるに加えてその直々の上司があの日本好きであのゲームとかアニメも好きでだから日本語ちょっと話せるっていう雑談とかもチャットでもうあの実は僕日本語話せますっていうのでもう聞いて初に約2日目ぐらいに連絡くれてゲーム話で盛り上がったりだとか実際に日本に行ってこうだったんだよえーすごいねめっちゃいいじゃんみたいなのを英語と日本語で混ぜて話したりっていうのでそういう直属の上司と仕事以外で信頼関係を築けるようなこう得体の知れない人間からこの子はこういうのが好きであのこういう人間なんだなっていうのを話しやすい状況なのは良かったなって思うのとあと会社の入所するときにいくつか質問に答えるその人事用のツールに乗っけるための質問があってその中で、その質問もちょっと変わっててあなたが植物になるなら何がいい?なんで?とかっていうそういう抽象的なちょっと答えづらいやつだったんですけどもその中の憧れの人っていうのの中で私はゲームが好きなのでカービィとかスマブラのゲームディレクターをしている桜井雅宏さんという方を憧れの人に挙げていたら結構ちょっとニッチな話ではあるんですけども最近入られたデザイナーの方が桜井雅宏好きなの!私も好き!っていうので人間のフレンドだねっていうふうに盛り上がって実際にその子は同じバンクーバーに住んでいるので今度一緒にご飯行こうねって言った友達というか、話しやすい仕事の仲間ができたりというので、本当にあまりアウェイを感じないのでよかったなって思います。職場で友達できるとめちゃくちゃいいですよね。私もほぼ同期で入った友達と毎日ペチャクチャ喋りながら仕事してたりわからないこととかその会社全体で言える質問とかベネフィットどうやって使うかとか気軽に聞ける人がいるっていうのはすごい心強いことだなと思います。ですね私の場合同期がいなかったので本当にそこはやっぱりそうやって話せる人がいるのは大きいです。ね。僕も同期っていうのかな1週間僕の1週間後に入った人を毎日なんかカフェラテを作るんですけどラテアートをしようって言って1回なんかその仕事帰りの時間にラテアートのなんかクラスみたいなのに行ってそこから毎日2人でラテアート作ってうちのアプリアサナのアプリなんでそのアプリになんかまぁアップロードしてっていうプロジェクトがありますだからもう毎日15分くらい絶対時間取られる、それに時間取られるっていう、よくわかんないことを毎日やってます。決めて可愛いことしてますね。あとは喋る時間としてちょうどいいというか、喋りながら2人でラテアート作って、そのままちょっと喋って仕事に戻るみたいなのをやってるんですけど、そういう友達がいるのはいいですよね、心強いというか。あとなんか日本語、日本人好きとか日本語喋れるっていうのは割とあれあれですよね多分あのあやかさん。の会社でも私も日本語チューターしてますよ1on1して日本語勉強したい人とその人シニアテックリードだからめちゃくちゃできる人なんですけど日本語に関しては私の方が先生だから30分、2週に1回30分シューターしてます。ちょっと私もそれ、上司に提案してみようかな、なんたらこうチャットで、なんたらそのチャットするのも日本語練習したいからっていうような気持ちがあるみたいなので、多分それ提案したら喜んで、やりたいって言ってくれるような気がします。僕もあの木曜日の昼の時間帯になんか日本語を学びましょうっていうなんかミーティングがあって僕は別にいつも行かないんですけどなんか勝手に入れられてたまーに遊びに行ったりとかなんかこの間えっとそのさっき言った同僚がその人も日本語好きなんですけどその人とあと何人かがN5日本語技術試験だって言うんだっけ?レベルがいますよねそう。そうそうあのL5だかN5だかを受けるからテストするのにちょっと付き合ってみたいなの言われて行ったりとかあとはあの日本好きな人が多いっていうなんて言うんだろうあのバックグラウンド言うと僕のチーム10何人いるんですけど去年と今年のうちにみんな日本に日本に行っ。てるっていうすごいあるある私のチームもほぼほぼ日本行ってなんかノートにここのご飯が美味しいよとか全部まとめてもう毎回毎回あの一人一人に質問返すのめんどくさいからこれ見てって言ってる全部おすすめをまとめたノートがある。そういう機会があるとあれですよねそこから仲良くなって他のことを聞きやすかったりだとかそういうことを教えてあげることによって確かりがないじゃないけどちょっと気持ち的に楽になったりだとかするんですごいそういう仕事外の交流があるのはいいのかな特に僕たちは飲みの文化ないじゃないですかこっちって妹っていうのもあるとは思うんですけどだからそういうところで仲良くなったりだとか喋れたりしておくと他のところに生きるというかコミュニケーションが円滑になるのでいいのかなと思いますね。その話の延長なんですけどジュニアでフルリモートってどういう感じですかなんか質問したいときにできないなとかコミュニケーションちょっと取りづらいなとかって思ったりしたことあります?いやそうですね初めのうちはやっぱりわからないことだらけだったので何から聞こうっていうのがあったんですけどもあのメンターって明確なポジションではないものの初めの入ってきてその開発環境を整えたりって言った時にすごい助けてくれたインターミディエットのディベロッパーの方がすごい優しくてもう毎日1回ぐらいその初めのその1,2週間3週目ぐらいまでは毎日進捗どう何か詰まってない困ったことあったらあのラックを使っているので待ったことあったらあのハードルやろうみたいな風にすごい声かけしてくれているのでもちろん困ってない時はあ今進捗こんな感じで大丈夫だよって答えたりだとか逆に困ってる時はもちろんそれに甘えたり私もやっぱりそのそうあのフルスタッフルリモートでジュニアっていうポジションで周りからこの子ほんと何やってるんだろうって思われないように極力そのクライアントのそのちっちゃい5人のチームがあるのでそこのチームスラッグに今進捗こんな感じこの機能詰まってたけどできたとかできるだけ報告して進捗がわかるように頑張っているのとまあ優しいのがそれに何かこうできたみたいなことをナイスワークみたいな感じでみんなも褒めてくれてグッジョブグッジョブみたいな感じで褒めてくれるので何でしょう、周りの方々に先輩方に見守られながら頑張ってますいいですね、。オンボーディングバーディーが優しかったのと確かになんかジュニアの時って結構みんなサポーティブですごいあんまりオーバーベルミングにならないように気使ってくれますよね周り私もそれにだいぶ助けられたことがあったなーって今思い出しました。なんか2年くらい経って、思いなくなったなーと思って、今ちょっと思いなくなったけど。じゃあそれは今のうちなんですね。じゃあ今のうちを楽しんでおくようにします。今のうちだけかもしれない。レベルが上がってきたりとか、質問しなくてよくなったりするっていうのは自分の成長でもあるから、いいことかもしれないし。あとはなんか後続の人にパスできたらいいですよねその新しいジュニアの人とかが入ってきた時にまあ自分もそういうふうにしてあげれたらジュニアの人が働きやすいとすごい進捗も良いと思うしそしたらなんか文化的なところさっきまあなんか結構こっちでいいところみたいなのは言ってもらったんですけど何だろう日本とこっちで働いてみてここが違うなとか驚いたこととかあります。かちょっと細かいニッチな話になってしまうんですけどもびっくりしたのは給料の支払われ方にびっくりしまして初任給が給料の支払われ方がまず2週間に1回っていうのは契約の時に教えてもらったんですけどもその初任給働き始めてもう2週間後の日に支払われたっていうのが私的にはすごい衝撃でどういうことかというと日本で働いていた時は年報契約じゃなくてまず時間換算での給与を支払っていることもあって例えば8月に入社したら8月で占められて9月に経理の方を計算して9月中に支払われるないしは10月に支払われるっていうような形だったと思うんですけどもこちらと年報契約の成果も自分がどう働いたかっていうのがないままにも支払われた2週間後に支払われたっていうのでそこはカルチャーの違いなのかなって私はびっくりしたんですけどもお二方どうでした確かに。残業ないですもんね残業なければそっかその2週間後にそのまま払えるってことなのか確かになんかあんま気にしなかったけどそう。なのかもしれない確かになんかギリギリで生活してたら2週間後にすぐ入ってくるからあの助かりますよね、日本みたいに待たなくていいし入所に1回の給料もらえるのは私好きかも。こっちの人って結構ギリギリで生きてる人多分多くてなんか結構そういうそういうことなんだって思ったのが何回かあってちょっと前に会社に入るはずだった人がなんか資料のミスで1週間遅れたらしくてでもその人違う国から来るかなんかでだから支払いが1週間遅れるわけじゃないですかだから他の同僚の人たちがそれすっごいかわいそうだよねみたいなお金なくなったらどうすればいいんだよって話じゃんみたいなっていうのがあって結構なんかこっちの人ってその2週間の支払いに結構頼って生きてるというかそんな一瞬なんで大きな。問題にはなかなかならないだろうって日本人からするのツッコミがしたくなるけどだから。なんかっていうのを感じたことが何回かあったんでなんかそういうことなのかなっていうのもありましたでも確かにそれを言われてみるとそうですねあとはなんか給料日が2回あるのは普通になんか気持ち的には嬉しいですよね。嬉しいですね正直バイトは6月7月から週2で極力抑えていたのでもちろん貯金はあるのでそれを崩せばいいんですけれども自分の中でこの範囲で生活したいなってところがだいぶギリギリになってたのでそれで初任給入ったとしてもきっと8月末か9月だろうなって思ってた中で8月中に支払われたのはめちゃめちゃ嬉しかったしそういうとこ初めのそのさっき言った財務の方とのミーティングの時に初任給この日だよって8月の2週目の金曜日だよって言ってくれてたんですけども私の脳内の中でこの日って言ったけどまさかそんなわけないよな8月30日とかの間違いだよなみたいな勝手に思うぐらいにイメージとのギャップがありましたね全然、。どうだったんだろう、僕あんまり考えることもなくお金入ってきてやったーぐらいしか考えてなかった気がするけどでも確かにそうですね日本から来ると驚くのかもしれないまあ。それこそ3年前とかにいや、。でも思ったのかもしれないです。僕も7年前とか、全然その頃のあれを思い出せないというか、今ではもう、結構IT業界なのかな?どこでもそうなのかな?わかんないけど。例えば、彼に私の衝撃を話した時には全然理解してくれなくて、え、普通じゃんみたいなことを言われたので、なんでしょう、やっぱりお国によっては、まあそういうもんなんです。かねまあでもそうですよねIT業界は特に大体ほぼ2週間のサイクルで働くれるのと残業はないから確かにその残業代みたいなのはあんまり計算しなくていいからっていうのがあるのかな他に何かありますか何だろう驚いたことなんか逆に日本の方が良かったこととか。でも驚いたこととしてあの打刻がないっていうのに驚きましてまぁスラックで一応フルリモートでやってるのでそのおはようの挨拶とお昼行ってくる戻ったっていう連絡と最後にあの終わりますっていうそのみんなハーバーグッナイってこうグッナイトにしては4時5時で早いなっていう感じなんですけどもそんな感じで挨拶するだけでなくてそういったゆるさにも朝。するのもかわいいですねみんな毎日言うんですか?おはようとみんなも律儀に言っ。てますよグッドモーニングかわいいランチはみんなスラックでランチ行くときは絵文字のご飯系のアイコンパスタだったりラーメンだったりサンドイッチで面白いのが例えばサンドイッチ買いに行くっていうのをサンドイッチのアイコンと人が歩いてるアイコン、絵文字を付け足してこうやってる人がいたりとかみんなちょっとなんかちょっとふざけてます。ね私の感じたカルチャーやっぱだけどなんか絵文字めっちゃ使いますよねなんかスラックの動く絵文字あの日本だったら考えられないぐらいあのメッセージってフランクにカジュアルになされているからなんかすっごい上司相手でもどんだけレベルの上の人相手にでもすっごい賑やかな踊り狂った絵文字とか作ったりしててかヘイリーみたいな感じだから確かにコミュニケーションのハードルってすごい低いなっていうのは私も感じたなって今思いまし。た私もスラックのそういうちょっと砕けた絵文字は多用してますねパーティーパロットがカラフルに動く鳥のインコの絵文字だったりとかそれ。めっちゃみんな使いますよね僕も使うけどとりあえず困ったらそれぐらいの勢いで使ってます。わかります金曜日だとそのパロットを見る機会が増えてる気がします心なしか。私。たちめっちゃ使うの、土下座パンダ。みんな土下座をそんななんか、土下座って日本で言うと結構シリアスな場で使う。謝るって感じだけど、なんか土下座をすごいなんか、おじきと同じくらいのカジュアルさで使うから、すごい土下座しまくるパンダが並ぶ。コードルビューお願いします、ドゲザーみたいなでも私な。んだったらもう私からドゲザーを使いたいんですけどみんなどう受け取られるかなってわからないのでむしろそれが共通認識というか使えるような環境なのうらやましいです確かに。ドゲザーも理解してないかもしれないうちのチームの人たちはでもあと絵文字も結構認識違うのはありますよねなんか日本だとよく使うのだけどこっちだと使っちゃいけないみたいななんか微妙な内容になったりするのとかもあったりするからたまにありません?なんかこれどういう意味でこの絵文字使ってんだろうとかって結構僕あるんですけどまあよく考えないようにしてるんだけど。でもめっちゃわかりますなので私も極力ミミックするというか他の人が使っているものをこの時にこれ使うといい感じかなっていうので真似したり。とか。こっちでよく見るのが、このピース…ごめんなさい、フォトキャストだからダメだ。絵文字で言うと、Iloveyuって説明が出るんですけども、親指と人差し指と小指を立てたサインとかっていうのは使ってるので、その絵文字をどう使うかっていうのは文化の違いだなって思いますね。それ、Iloveyuって意味なんですか?僕はウェイとかかなって思ってました。多分ウェイで使ってると思うんですけどもスラックで私もあれこれどういう意味で使ってるんだろうでカーソル合わせると。意味が出てくるやつです。よねそうです意味が出。てくるえーそうなんだじゃあそうだったのかな。わかんないわ親指をたたんで人差し指と小指だけを立てた状態だとホーンでそれもよく使ってるんですけどもホーンに関してはどういう意味なんだろう?でもとりあえずウェイで使ってるなっていう風に受け取られ。てますそうな、全然多分あんまりちゃんと見ないまま全部ウェイだと思ってまし。たでもそれでいいと。思います指文字はね、ちょっと気をつけないと間違ってるとなんかちょっとセクシャルな意味になったりとかするから私は避けたりしてい。ますそれも賢いですね私実はそのチームがあのそのテックチームが男性だらけ私しか女性ないんですよだからその子やっぱこうわかんないですけども何かと男同士のノリとかあるかもなっていうちょっとある中でそれをこまれてなんか変なことになってないしないかなっていう。多分ないんじゃないかなそういうのこっちしないですよねでもさっきの話聞いてると結構なんかその会社得意なのかなっていうのが何個かあったから例えばさっきのおはようとか帰るねみたいなのとかランチ行きますとかって僕たち全くないじゃないですかだから何ならみんななんか適当な時間に行ってたり。するしそれはフロリディングになっ。てるかなってないかなってフルリモートじゃないからなのかもしれないけど、なんだろう、そんなに結果さえ出していれば、どこにいようが、何をしていようがあんまり気にされてない。マネージャーも気にしてないと思うけど、でも一応自分のステータスのところにberightackとかなんかちょっとオフィスから離れるときはoutficeでしたりとかっていうのは周りの人に対しての配慮としてやったりするけどおはようランチ行くでとかはちょっとかわいいなと思ったことないかもしれないもしかしたらそういった。カルチャーから来た人からすると逆にここまで言わなきゃいけないのめんどくさいって思っちゃう人もいるかもしれないですね。でもそのくらいだったらアリかな?なんか僕が多分言うのは大体あの連絡してこないでっていう意味で何でも言うんでなんか例えばドクターアポイントメントとかぐらいしか言わない?逆にあとランチちょっと友達と行くから眺めに行くねみたいなのとかなんかそのミーティング勝手に入れないでくださいっていうのを言いたいから言うだけっていうのは僕はあるんですけどまあでも別になんかそんなチーム同士でカジュアルな感じだったら全然ね言ってもいいかなとは思うけど初めて聞いたなと思ってちょっとやってみましたそしたらえっとなんだろう今一社目だと思うんですけど今後のまあ留まるっていうのもアリだと思うんですけどなんかキャリアの今後の展望とかやりたいこととかこういうエンジニアになりたい、みたいなことがあれば教えてください。まずは、とりあえずはその3ヶ月の使用期間を乗り越えるというところが直近の目標。その後は、私としては永住権、彼とカナダで暮らしたいというところがあるので、永住権を取るために頑張りたいと思っています。それのためには、今の会社で経験を積むというような気持ちでおります。予定としてはまずこの今の学校のコープが今年の年末に切れて幸いワンホリーが2年どちらも使えるので最低3年、2年半ぐらいですね切られるのでその間で経験を積むというのと彼の方が先に永住権申請しているのでもしそれが取ればこのローとして取れればと思いますし取れなかったら取れないなりで頑張って取れるまでしがみつくようにカナダに残ろうと思ってますただ今の会社で経験を積みたいとは言ったんですけれどもまだビザサポートの話はしたことがなくてさっき言ったようにカナディアンばっかりでそういうサポートとかもできるのかわからないプロベーション終わったぐらいにはもちろんその直続の上司にまずは聞いてみようと思ってるんですけどももしビザサポートができないってことはないと思うんですけども難しいってことが分かれば転職も考えなきゃいけないだろうなというふうに思ってますその永住権っていうその身体のどう残るかっていうのはまた別でその自分のエンジニアとしてのキャリアとしてはもちろん今の会社で成果を出すさっき言ったようにマーケティング部として何か具体的な数値を出して成果を出してなんとなくレジュメにこういうことをしてUXI改善をして具体的には例えばあのクリック率だとかあのコンバージョン率がどう上がったみたいなことができるようなことをしていきたいなというふうに思っていますやっぱりマーケティングとかそういう部署を超えて何か働けるエンジニアっていうのは日本では強いと思いますし多分それはきっと海外のカナダでも同じことかなと思う思っているので頑張りたいと思ってますがどう思いますかいいと。思います僕はもちろんエンジニアとして強くなるっていうのは基本的にはキャリアを上げていく上ではいいと思うんですけどそれプラスアルファで自分の強みみたいなのがあるとすごくいいかなって思うしあとシニアとかどんどん上がっていくと会議まとめるだとかメンタリングするだとかいろんなところでマネジメントするみたいなところも増えていくんで今日本での5年のディレクターの経験を活かしたりだとかもうちょっと高い視点でプロジェクトだったりとかを考えていくっていうのもすごいいいのかなって。僕は思いましたありがとうござい。ますそしたら最後に未経験からカナダとか他の国に渡航してエンジニーになりたいっていう人に何かアドバイスできることがあれば教えてください。自分の中でも頑張り切った就活ではなかったのであまり偉そうなことは言えないんですけれども例えば過去の自分にこうしたらいいよっていうことを前提にして言うならば渡航前と渡航後と就活中の3つのポイントでアドバイスが言えればなと思うんですけれどもまず渡航前については情報収集が大事だなというふうに思っていてあのこっちだと幸いのことにこうやってあのポッドキャストで実際に就労経験あのあのカナダでの就職に成功したっていう方の話が聞けるっていうのは私が日本に行ったときはもうめちゃめちゃポッドキャストとかで聞いていてゆやさんとあのセナさんのバンクーバーのエンジニアをあの聞いてカナダで働くってのはどういうことかっていう知識をつけて解像度を上げたりとか就活インタビューみたいなものもあるのでそういったことを調べて自分の中でのカナダの働くことのイメージっていうのを具体化させておくといいのかなって思いますいかんせん時勢がすごいよく変わるというかもう2年前の情報が古いとかあるのでできるだけ最近のカナダの就労情報を集められると一番いいのかなっていうふうに思いますでそうですね情報収集をしてその後に自分の中でどういうふうな海外でのキャリアを積みたいかとイメージできたらまあ私はやっぱりフロークさんに相談するのをお勧めします相談してそのフロークさん経由でこっち来るだけでコミュニティに入れてコミュニティの中で情報交換できるというのはすごいもちろん友達だとか一緒に就活頑張る仲間とかできたりするので私としてはやっぱり心強かったですね何だったらセナーさんとかも結構いつでも相談してくださいみたいな感じで言ってくださったので私は甘えて渡航直後と就活始めて2、3ヶ月後ぐらいに甘えさせていただいたのでそういうのが活用できると大きいのかなって思いますあとはやっぱり技術力は最低限抑えておくとUNEMIでリアクトHTMLCSもちろんリアクトぐらいまでは学べておくといいのかなっていうふうに思いますもし学校で通う場合はですね学校で通わない場合は学校で通わない場合はちょっと私はわからないのでごめんなさい学校で通う場合学校で通う場合を想定して言うと技術力はUDEMYでREACTくらい自分で使って何かできるくらいまで身につけられているといいかなって思います二つ目の渡航後については私はエンジニアの体でも職力があったっていうのが大きいのかなっていうふうに感じているのでボランティアも見つけるのも難しいかもしれないんですけどもそういった無休のボランティアでもこちらではレジュメにかけるので何か経験を得られるといいんじゃないかなって思います私の友達にも実際にまだちょっと技術的にボランティアさえもできるか不安みたいなふうにいう子がいたんですけれども私の認識としてはボランティアセナさんもおっしゃってたんですけれどもボランティアだったらそこまで向こうもとりあえずこっちは経験を得るためにっていうので挑戦することに恐れることはないかなというふうに思いますで、就活中についてはえっと何でしょうテクニック的なことは他の方の方が多分いろいろと詳しいと思うので私からはもうとりあえずメンタル管理頑張ってっていうことをお伝えしたいなと思いますた時も本当にもうちょっとベッドから動きたくないなぁみたいなyoutbeめっちゃ見ちゃうみたいななんかもう何もできなくなっちゃう時も来ちゃうんですけどもそうなってもあんまり追い込みすぎないでなかなか見つからない時間かかる方が当たり前ぐらいの気持ちでで学校のキャリアアドバイザーの人が言ってて確かになって思ったのがあのクラスメイトのクラスの中でキラキラしたスター生徒は大体あのそういうキラキラしたスター生徒でも3ヶ月ぐらいあのショート見つけるのに時間かかるし普通の生徒だったら6ヶ月ぐらいかかるよっていうふうに言ったのでそれぐらいが当たり前なのかなって思っておくとなかなか成果が出さなくても思いますなので追い込みすぎないあのその就活中メンタル止まないためにも支えとなるものを早々に見つけながらゲームが好きならば一応ゲームを持っていくとかあのやっぱり息抜きはあるに越したことはないなって。思います確かにカナダとかバンクーバーっていうコンテクストで言うとやっぱり結構2年ぐらい働ける期間2、3年ぐらいかな働ける期間を用意してくる人って多いと思うんですけどその日本はこっちであの働かないで帰る人ってやっぱり基本的にはみんなそこのいっぱいいっぱい使うっていうよりはその前に結構諦めちゃう人が多分多くてそういう人たちってやっぱりずっと仕事を見つけられなくても辛くなって帰るってことが多分ほとんどだと思うんでやっぱりそのメンタル管理はすごい大切なのかなって。思いますよねいやほんとそうですねあの私もあのクラスメイトがやっぱりもう座学期間1年終わって交付が始まるよっていうタイミングでも帰られたりする子も何人かいてそれに私もちょっとそれを見て私はやっぱりあのこっちでのキャリア築くのをあきらめた方がいいのかもしれないっていう弱気になる瞬間もあったのでそうですね自分で何を目標とするかっていうのをちゃんと明確にして頑張れたらなと思いますし意外と。なんかバンクーバーの人たちみんな優しいから結構ね話聞いてくれるしなんかそのこういうところに出てきた人とかに直接連絡してもいいしそういうフロックとかのイベントみたいなのに行って友達作るのもありかなと思うんでそこら辺はできるだけやまないようにというかできるだけ吐き出すところを用意したまま準備していけるといいですよ。ねそうですねなので私もまともなアドバイスはできるかちょっとわからないんですけども頑張れとかも応援はもちろんできますしあと何よりこう現地でエンジニア職が見つかって働けた時の開放感半端ないのでなんかそうこうどういうものが待ってるよみたいな期待を持って頑張れって応援はできるかなと思う。のでありがとうございましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "それでは前回に引き続きさとみさんに来ていただきました前回は就職活動とか英語をどうやって勉強したのとか聞いてたんですけど実際働いてみてどうかみたいなのを聞いていこうかなと思いますざっくりどうですか働いてみて日本の会社の違いとかこんなところいいよみたいなのとかあったら教えて。",
      "start": 108,
      "end": 18513,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "ください最高の一言につきますねもう日本に帰りたくない。",
      "start": 18513,
      "end": 23574,
      "timestamp": "00:18"
    },
    {
      "speaker": "Ryo",
      "text": "ですその心は?",
      "start": 23574,
      "end": 28037,
      "timestamp": "00:23"
    },
    {
      "speaker": "B",
      "text": "もうその心はまず時短であることをその9時5時でみんないい意味でゆるく働いていらっしゃるなっていうのですごく自分のペースで働けているその快適だなと女だったらその金曜日なんかはもう3時からゲームタイムがあってみんなでオンラインゲームを最近はジオゲッサーをプレイして4時ぐらいに終わってみんなバイバイみたいな緩い雰囲気で働いていますしいかんせんそういう余裕がある環境だからかみんな基本的にチーム入ってみたらカナディアンばっかじゃないかみたいな雰囲気のチームなんですけどもこんな英語があまりうまくしゃべれないノンテイティブな私に対してもすごく優しくしてくれて何か困ってない?大丈夫?質問あったらいつでも連絡してねとかすごいこまめに確認してくれたりだとかすごいいつでも質問ウェルカムだよっていうような姿勢を見せてくれてやっぱり分からないこと、やっぱりジュニアっていうこともあって右も左も分からないっていう状況によくなるんですけども最近はそんなに抵抗感なくここが分からなくてっていったことも質問しやすくてすごく楽しく働いて。",
      "start": 28047,
      "end": 107635,
      "timestamp": "00:28"
    },
    {
      "speaker": "C",
      "text": "ますチームはどれぐらい人数いるんですか?エンジニアが何人でとか割合的には。",
      "start": 107635,
      "end": 114577,
      "timestamp": "01:47"
    },
    {
      "speaker": "B",
      "text": "よくよく考えたらごめんなさい会社がどういうサービスやってるかとかって説明したほうがよかったです。",
      "start": 118460,
      "end": 123743,
      "timestamp": "01:58"
    },
    {
      "speaker": "Ryo",
      "text": "質問するの忘れてました一回じゃあそうですねまた他にもいいところどんどん聞いていこうかなと思うんですけど会社がどういうサービスやってるかと規模感とあとは自分のチームが何やってるかも教えていただいてもいいですか。",
      "start": 123743,
      "end": 139351,
      "timestamp": "02:03"
    },
    {
      "speaker": "B",
      "text": "まず会社のサービスについてはストックフォトサービスの会社でイメージしやすいのは暗出ブラッシュとかアイストックといったサービス会社自体はもともとアイストックで働いていた方が独立してその独立した理由もやっぱりそのアーティスト写真とかそういったイラストとかを提供してくれるアーティストの作品がちょっとやっぱ格安で買われているってところに問題意識を感じてできるだけアーティストに対してフェアな報酬が支払われるようなサービスを作りたいって言ったことで作られた会社ですなのでわりかし社会意識が高いというかもう会社ですね会社の規模感としては全員で50人ぐらいでそのストックフォトのその契約しているアーティストさんが今だと1900いかないぐらい約1900人ぐらいいらっしゃいます私のそのテックチームについては全体で11人私含めて11人いて私が所属しているチームがやっているのはその会社のその実際にそのストックフォトそういった作品を売っているウェブサイトのメンテナンスですね運用保守運用更新をしていましてそこのチームは私とシニアディベロッパーの方インターミディエイトの方と同じジュニアの方とUIXデザイナーの計5人のチームがクライアント側としてやってます技術的に。",
      "start": 141145,
      "end": 253296,
      "timestamp": "02:21"
    },
    {
      "speaker": "Ryo",
      "text": "はどんな技術使われている。",
      "start": 253296,
      "end": 254517,
      "timestamp": "04:13"
    },
    {
      "speaker": "B",
      "text": "んですか技術はフロントエンドはリアクトバックエンドはPHPのララベルですねでもテストツールもいっぱいあってジェストをJSのために使っていたりあとはRubyが自動テストのためにRubyを使ったりいったことをしていますじゃあ。",
      "start": 254517,
      "end": 282204,
      "timestamp": "04:14"
    },
    {
      "speaker": "Ryo",
      "text": "仕事は基本的にずっとフロントエンドの方をやってるって。",
      "start": 282204,
      "end": 284845,
      "timestamp": "04:42"
    },
    {
      "speaker": "B",
      "text": "感じなんですかそうですね私のポジションがフロントエンドのジュニアデベロッパーなので私は主にフロントエンドを扱って。",
      "start": 284845,
      "end": 292890,
      "timestamp": "04:44"
    },
    {
      "speaker": "C",
      "text": "ます初めてどれくらいっておっしゃってましたっけ。",
      "start": 292890,
      "end": 296832,
      "timestamp": "04:52"
    },
    {
      "speaker": "B",
      "text": "初めて今ちょうど1ヶ月ぐらいですね8月の初めに入社したので。",
      "start": 299924,
      "end": 306127,
      "timestamp": "04:59"
    },
    {
      "speaker": "C",
      "text": "1ヶ月ぐらいです最初にオンボーディング期間みたいな感じでいろいろ教えてもらう期間とかあったりしたんですか?",
      "start": 306127,
      "end": 316132,
      "timestamp": "05:06"
    },
    {
      "speaker": "B",
      "text": "はい、オンボーディングそうですね今オンボーディングはありましたまずそのHRの方がウェルカムウェルカムミーティングみたいな開いてくれて会社のHRのその人事系のツールだったり説明してくれたのとさらにはいろんな部署のこういろんな部署の方ともミーティングでその自己紹介というかイントロのミーティングも設けられて例えばマーケティング部署のプロデューサー枠の方だったりだとか財務の方だったりいろんな部署の方と初めの1,2週間は初めまして里見と申します日本から来ましたみたいな挨拶をめちゃめちゃしましたちなみ。",
      "start": 316132,
      "end": 361195,
      "timestamp": "05:16"
    },
    {
      "speaker": "Ryo",
      "text": "にさっきネイティブが結構多いって言われてたんですけどどのぐらいの比率で非ネイティブの人がいる環境なんですか。",
      "start": 361195,
      "end": 369440,
      "timestamp": "06:01"
    },
    {
      "speaker": "B",
      "text": "ネイティブ本当どのぐらいいらっしゃるんだろうかってわからないぐらいに例えば会社のアバウトアースにチームの働いている人の経歴と写真が載っかってるんですけどもそこをざーって見てもあれかし例えば東アジア系の方があまりいらっしゃらないって言った雰囲気じゃあ。",
      "start": 371669,
      "end": 392835,
      "timestamp": "06:11"
    },
    {
      "speaker": "Ryo",
      "text": "もうほとんどはみんなカナダ人みたいな感じなんですかね。",
      "start": 392835,
      "end": 396476,
      "timestamp": "06:32"
    },
    {
      "speaker": "B",
      "text": "そうですねもうそうですね、ほとんどの方がカナダ人だと思います。やっぱり面接するときに一応リンクドインでその方の経歴とかを調べたんですけども、その時もやっぱりビクトリアの大学を出てらっしゃるとかで、もう育ちからカナダなんだろうなっていう方が多かったですね。",
      "start": 396476,
      "end": 422291,
      "timestamp": "06:36"
    },
    {
      "speaker": "C",
      "text": "他にはなんか最高って言ってたけど、どんなところが良かったりとかありますか?なんか私としては1ヶ月で最高って思えるのってかなりいいなと思ってて、私最初に始めて、仕事始めた時1ヶ月なんてもうなんか死にたいと思ってたけど。",
      "start": 422301,
      "end": 438626,
      "timestamp": "07:02"
    },
    {
      "speaker": "B",
      "text": "そんなそんな。最高と思う理由として、ちょっと1個大きいのがその日本で働いてた時に、さっきも言ったように、日本で働いてた時はお客さん先に常駐して、すごい気を使うような環境でずっと働いていて、何か小さな修正をするにもお客さんに確認を出して問題ないですねって、もういろいろと細かい細かいやり取りをしてから実際にデプロイするっていった流れだったので正直ちょっとストレスが溜まるような環境だったのに対して今は確認も私からレビューをお願いしてやってもらうぐらいの感じだったりもしてすごい良い意味で自由で自分で判断して行動できるのが私としてはすごい楽というか楽でいいなと思って。",
      "start": 438626,
      "end": 497879,
      "timestamp": "07:18"
    },
    {
      "speaker": "C",
      "text": "やってますどんなチケットをするかとかどんなタスクに取り組むかとかって自分の採用で決められたりするんですか?それともシニアの人がアサインするとか決まってたりします?",
      "start": 497879,
      "end": 513743,
      "timestamp": "08:17"
    },
    {
      "speaker": "B",
      "text": "今はまだそのシニアの方にアサインしてもらってやっ。",
      "start": 513743,
      "end": 516943,
      "timestamp": "08:33"
    },
    {
      "speaker": "C",
      "text": "ていますミーティングとかどれぐらいあります?",
      "start": 516943,
      "end": 521616,
      "timestamp": "08:36"
    },
    {
      "speaker": "B",
      "text": "ミーティングは多分少ない方じゃないかなって思いますあの毎朝朝会みたいなスタンドアップのミーティングで何するかっていうのを共有と週2でえっとそのフロントライアントチームのえっとチケットの進捗確認チケットボードの一周ボードの確認があってで、月一で振り返り会みたいなものがあったりといったぐらいですかね。なので、ジュニアなんでしょう。多い方なのか少ない方なのかわからないですが。",
      "start": 521626,
      "end": 555811,
      "timestamp": "08:41"
    },
    {
      "speaker": "Ryo",
      "text": "英語についてはどうですか?難しいなとか、日々どういうふうに感じてます?なんかさっき聞いて、ゲームが金曜の夕方というか、アフタヌーンか3時ぐらいからあるってことだったんですけど結構なんかよく聞くのは普通の仕事の会話はまあ割とすぐ慣れたんだけどその遊びだとかゲームは本当に慣れないですごいその時間が嫌だみたいな人も結構多いのかなって印象なんですけどなんかさとみさんはなんかさっき結構楽しそうに話されてたんでそういう時間は割と苦にならないぐらい英語はいいかなって感じですか。",
      "start": 555811,
      "end": 590277,
      "timestamp": "09:15"
    },
    {
      "speaker": "B",
      "text": "いや、全く良くないですよ。全く良くないんですけれども、なんかこう、つたないながらも、みんな聞いてくれるっていうのもありますし、基本的に自分、話す、聞くには何を言ってるかわかるっていう感じなので、まあそれでなんかこうパーって笑ったりだとかその一応その輪の中にはいるっていうので楽しんでもありますねただやっぱり自分でこうそこから冗談を言ったりみたいなそういった実際にその輪の中に積極的に気に入るってことはまだやっぱり難しくて実際に彼ともそういった話をするんですけど英語について話すんですけども2人の見解としては無理にネイティブの話の流れってやっぱりネイティブだと早いじゃないですかなんかそれを乱してちょっと異国しなくしてもお互いあんまり面白くないよなっていうので本当に自分が話せる範囲求められた範囲で話してまずはこう一緒にいることを楽しむってことを心がけて仕事をする中。",
      "start": 592237,
      "end": 656476,
      "timestamp": "09:52"
    },
    {
      "speaker": "Ryo",
      "text": "では理解できてなんかちゃんと伝えられてるなぁと思いますかそれとも結構まだ頑張ってて感じですかついていってるって感じですか。",
      "start": 656476,
      "end": 664498,
      "timestamp": "10:56"
    },
    {
      "speaker": "B",
      "text": "まだ頑張って一生懸命やってますね。ネイティブの方で話すのが、みんなカナダ人なのも、そこまで聞き取りづらいっていうこともなくて、たまにわからないときとかは、ごめん、もう一回教えてください、これってこういうことだよねって一応聞き直したりとかで、頑張って理解するようにしております。",
      "start": 665278,
      "end": 690884,
      "timestamp": "11:05"
    },
    {
      "speaker": "Ryo",
      "text": "そしたら仕事内容としてこれから取り組んでみたいこととかこういう風にしていきたいなとかっていうのがあったら教え。",
      "start": 690894,
      "end": 698862,
      "timestamp": "11:30"
    },
    {
      "speaker": "B",
      "text": "てください取り組んでみたいなって思うこととしてはもともと私のジョブポジションがただウェブサイトを運用するっていうわけじゃなくてマーケティング部の方と連携して成果を出していくっていったことがやっぱり目標として掲げられているので今後はマーケティング部の人ともミーティングに参加してウェブサイトをどう改善していくかだとかキャンペーンページでどうやったら効果的にできるかっていったことを実際にやってあわゆくは色々とテストツールマーケティング向けのテストツールヒートマップが見れたりだったことがあるので実際にそれも分析して何かこう自分からこういったことをやったらUIX改善できるんじゃないかっていうのを発案して何か会社のために会社に貢献できるようなことをしていきたいと思ってます。",
      "start": 698862,
      "end": 757147,
      "timestamp": "11:38"
    },
    {
      "speaker": "Ryo",
      "text": "えっと日本でウェブディレクターとして働いてて3年ぐらいの経験があったって話ですよね5年だった5年ですねはいと思うんですけどなんか日本での経験が生きてるなっていうふうに感じる場面はあり。",
      "start": 759494,
      "end": 774684,
      "timestamp": "12:39"
    },
    {
      "speaker": "B",
      "text": "ますかもう多分気づかないところでもたくさんあると思っています具体的にはやっぱりそのディレクターっていうそのちょっと何でしょう客観的に見るべき立場でいたのであの例えばそのチケットの優先順位だとかどういうことを求められているだろうかっていうような視点にはやっぱり常に意識して動けているかなというふうに思うのでただあのコードコーリングができますっていうようなことではなくなぜこういうことをするのかって言ったところからじゃあそこからどうすべきかっていうようなことを常に意識する癖がついているので確実に生きていると思います。",
      "start": 774684,
      "end": 824559,
      "timestamp": "12:54"
    },
    {
      "speaker": "Ryo",
      "text": "なんか聞いた感じだとプロジェクトマネージャーとかプロダクトマネージャーの働き方にちょっと近い感じだからなんかそういう面でどんどん自分でやれることが増えていくとエンジニアだけのなんだろうできることじゃなくてちょっとそこを超えてできるとすごい良さそう。",
      "start": 826950,
      "end": 842819,
      "timestamp": "13:46"
    },
    {
      "speaker": "B",
      "text": "ですよねそうですねこの。",
      "start": 842819,
      "end": 847022,
      "timestamp": "14:02"
    },
    {
      "speaker": "Ryo",
      "text": "トピックでまだ聞きたいことってあります次行っちゃっても大丈夫かなあ、。",
      "start": 847022,
      "end": 853853,
      "timestamp": "14:07"
    },
    {
      "speaker": "B",
      "text": "ごめんなさい最高ネタがもう一つあってこれが実際に使えるかわからないんですけども2つありまして一つはいいところの会社のいいところの一つとしては福利構成がその50人ぐらいの小さい会社としてはわりかししっかりしてるなっていうので完全リモートで働けますし休みについても冬休み12月に1週間あってプラスバケーション有給が5週間分あったとかもちろん有給とは別に執行負もありますし面白いのがボランティアデーって言って何かボランティアに参加したら全然会社に関連したことでなくても会社からちょっとお給料が出たりみたいなことがあったり。",
      "start": 853853,
      "end": 905028,
      "timestamp": "14:13"
    },
    {
      "speaker": "Ryo",
      "text": "その5週間は25日もらえるんですか?",
      "start": 907474,
      "end": 913868,
      "timestamp": "15:07"
    },
    {
      "speaker": "B",
      "text": "だと思いますまだあのプロベーション開けてないので具体的な日付がどう来てるかわからないんですけどもそうだと契約書にそうある。",
      "start": 913868,
      "end": 922183,
      "timestamp": "15:13"
    },
    {
      "speaker": "Ryo",
      "text": "ので5週間と次休みってまあ1週間ぐらい24からとかですよねきっとそうですねそれめっちゃすごくない?えっと、あやかさんの会社ってどんな感じです?",
      "start": 922183,
      "end": 938325,
      "timestamp": "15:22"
    },
    {
      "speaker": "C",
      "text": "いや、その年末年始ホリデーも自分たちのPTOを使わないといけないんでPTOは全部で5週あるけどその中に含まれちゃうから別でもらえるってめっちゃいいですよねじゃ、。",
      "start": 938325,
      "end": 954677,
      "timestamp": "15:38"
    },
    {
      "speaker": "Ryo",
      "text": "単純に1週間多いって感じかなうん、。",
      "start": 954677,
      "end": 958369,
      "timestamp": "15:54"
    },
    {
      "speaker": "C",
      "text": "うらやましいそれ使い切れなかったらどうなるんですか?キャリーオーバーできたりするんですか?次の年。",
      "start": 958369,
      "end": 965634,
      "timestamp": "15:58"
    },
    {
      "speaker": "B",
      "text": "契約書見た時は確か多少キャリーオーバーはできたはずな雰囲気だった気がします。",
      "start": 965634,
      "end": 973657,
      "timestamp": "16:05"
    },
    {
      "speaker": "C",
      "text": "なんか結構募集ってね、計画的に使わないとなくならないんですよ。なんかうちの会社最近給料でセイオフしてくれるようになったから買い切れなかったらお金でもらえると思って、まあいいかってなってるけど、5週目だったら結構ね、計画的にここで旅行とかってやらないと、最後12月全く行かないことになっちゃって、まあそれもいいんだけど。",
      "start": 973657,
      "end": 1000405,
      "timestamp": "16:13"
    },
    {
      "speaker": "Ryo",
      "text": "一瞬でなくなっちゃうけどな、。",
      "start": 1000405,
      "end": 1002896,
      "timestamp": "16:40"
    },
    {
      "speaker": "C",
      "text": "僕。まとめて撮るからでしょ。",
      "start": 1002896,
      "end": 1007258,
      "timestamp": "16:42"
    },
    {
      "speaker": "Ryo",
      "text": "でもさ、やっぱさ、1年に1回日本帰りたいじゃん。一年に一回日本帰りたくて、一回日本帰るんだったら2週間はいたいじゃん。それでもう一回あわゆくばなんか違う国に遊びに行きたいじゃん。で、それも2週間になるじゃん。そうするともう4週間なくなっちゃうからさ。で、年末年始も休みたいじゃんって言ったら5週間にならない。そんなことない?",
      "start": 1007258,
      "end": 1033774,
      "timestamp": "16:47"
    },
    {
      "speaker": "B",
      "text": "なりません。",
      "start": 1033774,
      "end": 1034294,
      "timestamp": "17:13"
    },
    {
      "speaker": "C",
      "text": "でもそれが計画的に使えてるから、その例として。",
      "start": 1034294,
      "end": 1038214,
      "timestamp": "17:14"
    },
    {
      "speaker": "Ryo",
      "text": "いやでもできるならあと1週間僕欲しいなって思うけどうちはちなみに前の会社もそうだったんだけど一応なんかアンリミテッドっていういくらでも取っていいですよっていう体の会社なんだけどでもそれって全然別になんか良くなくて多分6週間もらえるんだったら全然そっちの方が良くてなんでかっていうとそのペイオフもないしキャリーオーバーも絶対ないんですよそもそも数が決まってないんでであとはそのそのチームのなんか雰囲気によるんでそのチームの雰囲気がみんなそんな取らない感じだと全然取れない。",
      "start": 1038224,
      "end": 1076913,
      "timestamp": "17:18"
    },
    {
      "speaker": "B",
      "text": "しあーきつかって、。",
      "start": 1076913,
      "end": 1079042,
      "timestamp": "17:56"
    },
    {
      "speaker": "Ryo",
      "text": "とれないみたいなそれでもとるんですけどでもなんか基本的には暗黙の了解で4週間だよねみたいなまあ確かにますプラス年末年始まあちょっと休んでもいいかもね年末年始って言うか年末かあのだいたいこっちの会社って1月2日とか3日ぐらいから働き始めちゃうんでだからなんかクリスマスの25は休みでそこからなんか休みみたいなのはあるけどだ。",
      "start": 1079042,
      "end": 1105625,
      "timestamp": "17:59"
    },
    {
      "speaker": "B",
      "text": "から周りをチラチラって見ながら休みを取らなきゃいけないという。",
      "start": 1105625,
      "end": 1111378,
      "timestamp": "18:25"
    },
    {
      "speaker": "Ryo",
      "text": "そう、だからなんか消化しないといけないっていう気分になれる6週間、5週間、6週間っていうのがあるのであれば、アニメだったよりそっちの方がいいなってこの頃は思うんですけど。でも、サナガの中でもめちゃくちゃそれは良い方ですよね。5週間プラス年末。",
      "start": 1111378,
      "end": 1128301,
      "timestamp": "18:31"
    },
    {
      "speaker": "C",
      "text": "初めて聞いた。",
      "start": 1128301,
      "end": 1128761,
      "timestamp": "18:48"
    },
    {
      "speaker": "Ryo",
      "text": "聞いたことないな。",
      "start": 1128761,
      "end": 1130712,
      "timestamp": "18:48"
    },
    {
      "speaker": "C",
      "text": "他のベネフィットはどんなのがあるんですか?なんか病院、歯医者さんとかだとか。",
      "start": 1130712,
      "end": 1137559,
      "timestamp": "18:50"
    },
    {
      "speaker": "B",
      "text": "そうですねあの雇用者負担のえっと医療保険とかの資格保険はもちろんついてますしあと年間1000ドルの教育健康手当っていうのがあって例えばマジあのやっぱりフルリモートだからかジム通いたいみたいな人はそういうものが使えたりあとはその例えばユーデミーだとかそういった学習に関することでもあの使えるっていう風にきました。",
      "start": 1137569,
      "end": 1161594,
      "timestamp": "18:57"
    },
    {
      "speaker": "C",
      "text": "いいですねアプロベーションが終わってからになるのかな。",
      "start": 1164304,
      "end": 1167507,
      "timestamp": "19:24"
    },
    {
      "speaker": "B",
      "text": "それはそうですね戻れも全部プロペーション終わってからになるので実際にどういうもののかっていうのはまだわかってないですかそういう。",
      "start": 1167507,
      "end": 1176536,
      "timestamp": "19:27"
    },
    {
      "speaker": "Ryo",
      "text": "のってプロペーション終わってからなんですねおっなんか今までの僕の会社だとだいたい最初からもらってたような気がするけど、わかんない。会社によるのかな、そこらへんは。でもプロベーションといっても2ヶ月か3ヶ月ぐらいだと思うんで、そんな大した違いではないかなと思うんですけど。",
      "start": 1176536,
      "end": 1194823,
      "timestamp": "19:36"
    },
    {
      "speaker": "B",
      "text": "で、。",
      "start": 1194823,
      "end": 1194963,
      "timestamp": "19:54"
    },
    {
      "speaker": "Ryo",
      "text": "あともう一個かな。いいこと、ミントあったと思うんですけど。",
      "start": 1194963,
      "end": 1200255,
      "timestamp": "19:54"
    },
    {
      "speaker": "B",
      "text": "これはあまり自慢になるのかわからないんですけどもあの人に恵まれたなぁの第2弾でさっきあの人が優しいというのはあるに加えてその直々の上司があの日本好きであのゲームとかアニメも好きでだから日本語ちょっと話せるっていう雑談とかもチャットでもうあの実は僕日本語話せますっていうのでもう聞いて初に約2日目ぐらいに連絡くれてゲーム話で盛り上がったりだとか実際に日本に行ってこうだったんだよえーすごいねめっちゃいいじゃんみたいなのを英語と日本語で混ぜて話したりっていうのでそういう直属の上司と仕事以外で信頼関係を築けるようなこう得体の知れない人間からこの子はこういうのが好きであのこういう人間なんだなっていうのを話しやすい状況なのは良かったなって思うのとあと会社の入所するときにいくつか質問に答えるその人事用のツールに乗っけるための質問があってその中で、その質問もちょっと変わっててあなたが植物になるなら何がいい?なんで?とかっていうそういう抽象的なちょっと答えづらいやつだったんですけどもその中の憧れの人っていうのの中で私はゲームが好きなのでカービィとかスマブラのゲームディレクターをしている桜井雅宏さんという方を憧れの人に挙げていたら結構ちょっとニッチな話ではあるんですけども最近入られたデザイナーの方が桜井雅宏好きなの!私も好き!っていうので人間のフレンドだねっていうふうに盛り上がって実際にその子は同じバンクーバーに住んでいるので今度一緒にご飯行こうねって言った友達というか、話しやすい仕事の仲間ができたりというので、本当にあまりアウェイを感じないのでよかったなって思います。",
      "start": 1200265,
      "end": 1333581,
      "timestamp": "20:00"
    },
    {
      "speaker": "C",
      "text": "職場で友達できるとめちゃくちゃいいですよね。私もほぼ同期で入った友達と毎日ペチャクチャ喋りながら仕事してたりわからないこととかその会社全体で言える質問とかベネフィットどうやって使うかとか気軽に聞ける人がいるっていうのはすごい心強いことだなと思います。",
      "start": 1333581,
      "end": 1355700,
      "timestamp": "22:13"
    },
    {
      "speaker": "B",
      "text": "ですね私の場合同期がいなかったので本当にそこはやっぱりそうやって話せる人がいるのは大きいです。",
      "start": 1355700,
      "end": 1362505,
      "timestamp": "22:35"
    },
    {
      "speaker": "C",
      "text": "ね。",
      "start": 1362505,
      "end": 1362525,
      "timestamp": "22:42"
    },
    {
      "speaker": "Ryo",
      "text": "僕も同期っていうのかな1週間僕の1週間後に入った人を毎日なんかカフェラテを作るんですけどラテアートをしようって言って1回なんかその仕事帰りの時間にラテアートのなんかクラスみたいなのに行ってそこから毎日2人でラテアート作ってうちのアプリアサナのアプリなんでそのアプリになんかまぁアップロードしてっていうプロジェクトがありますだからもう毎日15分くらい絶対時間取られる、それに時間取られるっていう、よくわかんないことを毎日やってます。決めて可愛いことしてますね。あとは喋る時間としてちょうどいいというか、喋りながら2人でラテアート作って、そのままちょっと喋って仕事に戻るみたいなのをやってるんですけど、そういう友達がいるのはいいですよね、心強いというか。あとなんか日本語、日本人好きとか日本語喋れるっていうのは割とあれあれですよね多分あのあやかさん。",
      "start": 1364773,
      "end": 1422624,
      "timestamp": "22:44"
    },
    {
      "speaker": "C",
      "text": "の会社でも私も日本語チューターしてますよ1on1して日本語勉強したい人とその人シニアテックリードだからめちゃくちゃできる人なんですけど日本語に関しては私の方が先生だから30分、2週に1回30分シューターしてます。",
      "start": 1422624,
      "end": 1447816,
      "timestamp": "23:42"
    },
    {
      "speaker": "B",
      "text": "ちょっと私もそれ、上司に提案してみようかな、なんたらこうチャットで、なんたらそのチャットするのも日本語練習したいからっていうような気持ちがあるみたいなので、多分それ提案したら喜んで、やりたいって言ってくれるような気がします。",
      "start": 1447816,
      "end": 1463448,
      "timestamp": "24:07"
    },
    {
      "speaker": "Ryo",
      "text": "僕もあの木曜日の昼の時間帯になんか日本語を学びましょうっていうなんかミーティングがあって僕は別にいつも行かないんですけどなんか勝手に入れられてたまーに遊びに行ったりとかなんかこの間えっとそのさっき言った同僚がその人も日本語好きなんですけどその人とあと何人かがN5日本語技術試験だって言うんだっけ?",
      "start": 1463458,
      "end": 1488017,
      "timestamp": "24:23"
    },
    {
      "speaker": "B",
      "text": "レベルがいますよねそう。",
      "start": 1488017,
      "end": 1489298,
      "timestamp": "24:48"
    },
    {
      "speaker": "Ryo",
      "text": "そうそうあのL5だかN5だかを受けるからテストするのにちょっと付き合ってみたいなの言われて行ったりとかあとはあの日本好きな人が多いっていうなんて言うんだろうあのバックグラウンド言うと僕のチーム10何人いるんですけど去年と今年のうちにみんな日本に日本に行っ。",
      "start": 1489298,
      "end": 1508855,
      "timestamp": "24:49"
    },
    {
      "speaker": "C",
      "text": "てるっていうすごいあるある私のチームもほぼほぼ日本行ってなんかノートにここのご飯が美味しいよとか全部まとめてもう毎回毎回あの一人一人に質問返すのめんどくさいからこれ見てって言ってる全部おすすめをまとめたノートがある。",
      "start": 1508855,
      "end": 1529671,
      "timestamp": "25:08"
    },
    {
      "speaker": "Ryo",
      "text": "そういう機会があるとあれですよねそこから仲良くなって他のことを聞きやすかったりだとかそういうことを教えてあげることによって確かりがないじゃないけどちょっと気持ち的に楽になったりだとかするんですごいそういう仕事外の交流があるのはいいのかな特に僕たちは飲みの文化ないじゃないですかこっちって妹っていうのもあるとは思うんですけどだからそういうところで仲良くなったりだとか喋れたりしておくと他のところに生きるというかコミュニケーションが円滑になるのでいいのかなと思いますね。",
      "start": 1531724,
      "end": 1567514,
      "timestamp": "25:31"
    },
    {
      "speaker": "C",
      "text": "その話の延長なんですけどジュニアでフルリモートってどういう感じですかなんか質問したいときにできないなとかコミュニケーションちょっと取りづらいなとかって思ったりしたことあります?",
      "start": 1567514,
      "end": 1583820,
      "timestamp": "26:07"
    },
    {
      "speaker": "B",
      "text": "いやそうですね初めのうちはやっぱりわからないことだらけだったので何から聞こうっていうのがあったんですけどもあのメンターって明確なポジションではないものの初めの入ってきてその開発環境を整えたりって言った時にすごい助けてくれたインターミディエットのディベロッパーの方がすごい優しくてもう毎日1回ぐらいその初めのその1,2週間3週目ぐらいまでは毎日進捗どう何か詰まってない困ったことあったらあのラックを使っているので待ったことあったらあのハードルやろうみたいな風にすごい声かけしてくれているのでもちろん困ってない時はあ今進捗こんな感じで大丈夫だよって答えたりだとか逆に困ってる時はもちろんそれに甘えたり私もやっぱりそのそうあのフルスタッフルリモートでジュニアっていうポジションで周りからこの子ほんと何やってるんだろうって思われないように極力そのクライアントのそのちっちゃい5人のチームがあるのでそこのチームスラッグに今進捗こんな感じこの機能詰まってたけどできたとかできるだけ報告して進捗がわかるように頑張っているのとまあ優しいのがそれに何かこうできたみたいなことをナイスワークみたいな感じでみんなも褒めてくれてグッジョブグッジョブみたいな感じで褒めてくれるので何でしょう、周りの方々に先輩方に見守られながら頑張ってますいいですね、。",
      "start": 1583820,
      "end": 1684077,
      "timestamp": "26:23"
    },
    {
      "speaker": "C",
      "text": "オンボーディングバーディーが優しかったのと確かになんかジュニアの時って結構みんなサポーティブですごいあんまりオーバーベルミングにならないように気使ってくれますよね周り私もそれにだいぶ助けられたことがあったなーって今思い出しました。なんか2年くらい経って、思いなくなったなーと思って、今ちょっと思いなくなったけど。",
      "start": 1684077,
      "end": 1710571,
      "timestamp": "28:04"
    },
    {
      "speaker": "B",
      "text": "じゃあそれは今のうちなんですね。じゃあ今のうちを楽しんでおくようにします。",
      "start": 1710571,
      "end": 1716026,
      "timestamp": "28:30"
    },
    {
      "speaker": "C",
      "text": "今のうちだけかもしれない。レベルが上がってきたりとか、質問しなくてよくなったりするっていうのは自分の成長でもあるから、いいことかもしれないし。",
      "start": 1716026,
      "end": 1726463,
      "timestamp": "28:36"
    },
    {
      "speaker": "Ryo",
      "text": "あとはなんか後続の人にパスできたらいいですよねその新しいジュニアの人とかが入ってきた時にまあ自分もそういうふうにしてあげれたらジュニアの人が働きやすいとすごい進捗も良いと思うしそしたらなんか文化的なところさっきまあなんか結構こっちでいいところみたいなのは言ってもらったんですけど何だろう日本とこっちで働いてみてここが違うなとか驚いたこととかあります。",
      "start": 1726862,
      "end": 1754192,
      "timestamp": "28:46"
    },
    {
      "speaker": "B",
      "text": "かちょっと細かいニッチな話になってしまうんですけどもびっくりしたのは給料の支払われ方にびっくりしまして初任給が給料の支払われ方がまず2週間に1回っていうのは契約の時に教えてもらったんですけどもその初任給働き始めてもう2週間後の日に支払われたっていうのが私的にはすごい衝撃でどういうことかというと日本で働いていた時は年報契約じゃなくてまず時間換算での給与を支払っていることもあって例えば8月に入社したら8月で占められて9月に経理の方を計算して9月中に支払われるないしは10月に支払われるっていうような形だったと思うんですけどもこちらと年報契約の成果も自分がどう働いたかっていうのがないままにも支払われた2週間後に支払われたっていうのでそこはカルチャーの違いなのかなって私はびっくりしたんですけどもお二方どうでした確かに。",
      "start": 1754192,
      "end": 1826428,
      "timestamp": "29:14"
    },
    {
      "speaker": "Ryo",
      "text": "残業ないですもんね残業なければそっかその2週間後にそのまま払えるってことなのか確かになんかあんま気にしなかったけどそう。",
      "start": 1826428,
      "end": 1835350,
      "timestamp": "30:26"
    },
    {
      "speaker": "C",
      "text": "なのかもしれない確かになんかギリギリで生活してたら2週間後にすぐ入ってくるからあの助かりますよね、日本みたいに待たなくていいし入所に1回の給料もらえるのは私好きかも。",
      "start": 1835350,
      "end": 1849700,
      "timestamp": "30:35"
    },
    {
      "speaker": "Ryo",
      "text": "こっちの人って結構ギリギリで生きてる人多分多くてなんか結構そういうそういうことなんだって思ったのが何回かあってちょっと前に会社に入るはずだった人がなんか資料のミスで1週間遅れたらしくてでもその人違う国から来るかなんかでだから支払いが1週間遅れるわけじゃないですかだから他の同僚の人たちがそれすっごいかわいそうだよねみたいなお金なくなったらどうすればいいんだよって話じゃんみたいなっていうのがあって結構なんかこっちの人ってその2週間の支払いに結構頼って生きてるというかそんな一瞬なんで大きな。",
      "start": 1849700,
      "end": 1891874,
      "timestamp": "30:49"
    },
    {
      "speaker": "B",
      "text": "問題にはなかなかならないだろうって日本人からするのツッコミがしたくなるけどだから。",
      "start": 1891874,
      "end": 1899037,
      "timestamp": "31:31"
    },
    {
      "speaker": "Ryo",
      "text": "なんかっていうのを感じたことが何回かあったんでなんかそういうことなのかなっていうのもありましたでも確かにそれを言われてみるとそうですねあとはなんか給料日が2回あるのは普通になんか気持ち的には嬉しいですよね。",
      "start": 1899037,
      "end": 1913643,
      "timestamp": "31:39"
    },
    {
      "speaker": "B",
      "text": "嬉しいですね正直バイトは6月7月から週2で極力抑えていたのでもちろん貯金はあるのでそれを崩せばいいんですけれども自分の中でこの範囲で生活したいなってところがだいぶギリギリになってたのでそれで初任給入ったとしてもきっと8月末か9月だろうなって思ってた中で8月中に支払われたのはめちゃめちゃ嬉しかったしそういうとこ初めのそのさっき言った財務の方とのミーティングの時に初任給この日だよって8月の2週目の金曜日だよって言ってくれてたんですけども私の脳内の中でこの日って言ったけどまさかそんなわけないよな8月30日とかの間違いだよなみたいな勝手に思うぐらいにイメージとのギャップがありましたね全然、。",
      "start": 1914465,
      "end": 1974768,
      "timestamp": "31:54"
    },
    {
      "speaker": "Ryo",
      "text": "どうだったんだろう、僕あんまり考えることもなくお金入ってきてやったーぐらいしか考えてなかった気がするけどでも確かにそうですね日本から来ると驚くのかもしれないまあ。",
      "start": 1974768,
      "end": 1987039,
      "timestamp": "32:54"
    },
    {
      "speaker": "B",
      "text": "それこそ3年前とかにいや、。",
      "start": 1987039,
      "end": 1989576,
      "timestamp": "33:07"
    },
    {
      "speaker": "Ryo",
      "text": "でも思ったのかもしれないです。僕も7年前とか、全然その頃のあれを思い出せないというか、今ではもう、結構IT業界なのかな?どこでもそうなのかな?わかんないけど。",
      "start": 1989576,
      "end": 2004530,
      "timestamp": "33:09"
    },
    {
      "speaker": "B",
      "text": "例えば、彼に私の衝撃を話した時には全然理解してくれなくて、え、普通じゃんみたいなことを言われたので、なんでしょう、やっぱりお国によっては、まあそういうもんなんです。",
      "start": 2004530,
      "end": 2019005,
      "timestamp": "33:24"
    },
    {
      "speaker": "Ryo",
      "text": "かねまあでもそうですよねIT業界は特に大体ほぼ2週間のサイクルで働くれるのと残業はないから確かにその残業代みたいなのはあんまり計算しなくていいからっていうのがあるのかな他に何かありますか何だろう驚いたことなんか逆に日本の方が良かったこととか。",
      "start": 2019005,
      "end": 2041173,
      "timestamp": "33:39"
    },
    {
      "speaker": "B",
      "text": "でも驚いたこととしてあの打刻がないっていうのに驚きましてまぁスラックで一応フルリモートでやってるのでそのおはようの挨拶とお昼行ってくる戻ったっていう連絡と最後にあの終わりますっていうそのみんなハーバーグッナイってこうグッナイトにしては4時5時で早いなっていう感じなんですけどもそんな感じで挨拶するだけでなくてそういったゆるさにも朝。",
      "start": 2041173,
      "end": 2076219,
      "timestamp": "34:01"
    },
    {
      "speaker": "C",
      "text": "するのもかわいいですねみんな毎日言うんですか?おはようとみんなも律儀に言っ。",
      "start": 2076219,
      "end": 2082804,
      "timestamp": "34:36"
    },
    {
      "speaker": "B",
      "text": "てますよグッドモーニングかわいいランチはみんなスラックでランチ行くときは絵文字のご飯系のアイコンパスタだったりラーメンだったりサンドイッチで面白いのが例えばサンドイッチ買いに行くっていうのをサンドイッチのアイコンと人が歩いてるアイコン、絵文字を付け足してこうやってる人がいたりとかみんなちょっとなんかちょっとふざけてます。",
      "start": 2082804,
      "end": 2109968,
      "timestamp": "34:42"
    },
    {
      "speaker": "C",
      "text": "ね私の感じたカルチャーやっぱだけどなんか絵文字めっちゃ使いますよねなんかスラックの動く絵文字あの日本だったら考えられないぐらいあのメッセージってフランクにカジュアルになされているからなんかすっごい上司相手でもどんだけレベルの上の人相手にでもすっごい賑やかな踊り狂った絵文字とか作ったりしててかヘイリーみたいな感じだから確かにコミュニケーションのハードルってすごい低いなっていうのは私も感じたなって今思いまし。",
      "start": 2109968,
      "end": 2150543,
      "timestamp": "35:09"
    },
    {
      "speaker": "B",
      "text": "た私もスラックのそういうちょっと砕けた絵文字は多用してますねパーティーパロットがカラフルに動く鳥のインコの絵文字だったりとかそれ。",
      "start": 2150543,
      "end": 2163442,
      "timestamp": "35:50"
    },
    {
      "speaker": "Ryo",
      "text": "めっちゃみんな使いますよね僕も使うけどとりあえず困ったらそれぐらいの勢いで使ってます。",
      "start": 2163442,
      "end": 2169486,
      "timestamp": "36:03"
    },
    {
      "speaker": "B",
      "text": "わかります金曜日だとそのパロットを見る機会が増えてる気がします心なしか。",
      "start": 2169486,
      "end": 2174630,
      "timestamp": "36:09"
    },
    {
      "speaker": "Ryo",
      "text": "私。",
      "start": 2176680,
      "end": 2177280,
      "timestamp": "36:16"
    },
    {
      "speaker": "C",
      "text": "たちめっちゃ使うの、土下座パンダ。みんな土下座をそんななんか、土下座って日本で言うと結構シリアスな場で使う。謝るって感じだけど、なんか土下座をすごいなんか、おじきと同じくらいのカジュアルさで使うから、すごい土下座しまくるパンダが並ぶ。コードルビューお願いします、ドゲザーみたいなでも私な。",
      "start": 2177280,
      "end": 2202602,
      "timestamp": "36:17"
    },
    {
      "speaker": "B",
      "text": "んだったらもう私からドゲザーを使いたいんですけどみんなどう受け取られるかなってわからないのでむしろそれが共通認識というか使えるような環境なのうらやましいです確かに。",
      "start": 2202602,
      "end": 2216226,
      "timestamp": "36:42"
    },
    {
      "speaker": "Ryo",
      "text": "ドゲザーも理解してないかもしれないうちのチームの人たちはでもあと絵文字も結構認識違うのはありますよねなんか日本だとよく使うのだけどこっちだと使っちゃいけないみたいななんか微妙な内容になったりするのとかもあったりするからたまにありません?なんかこれどういう意味でこの絵文字使ってんだろうとかって結構僕あるんですけどまあよく考えないようにしてるんだけど。",
      "start": 2216226,
      "end": 2242937,
      "timestamp": "36:56"
    },
    {
      "speaker": "B",
      "text": "でもめっちゃわかりますなので私も極力ミミックするというか他の人が使っているものをこの時にこれ使うといい感じかなっていうので真似したり。",
      "start": 2242937,
      "end": 2254140,
      "timestamp": "37:22"
    },
    {
      "speaker": "Ryo",
      "text": "とか。",
      "start": 2254140,
      "end": 2254340,
      "timestamp": "37:34"
    },
    {
      "speaker": "B",
      "text": "こっちでよく見るのが、このピース…ごめんなさい、フォトキャストだからダメだ。絵文字で言うと、Iloveyuって説明が出るんですけども、親指と人差し指と小指を立てたサインとかっていうのは使ってるので、その絵文字をどう使うかっていうのは文化の違いだなって思いますね。",
      "start": 2256801,
      "end": 2278865,
      "timestamp": "37:36"
    },
    {
      "speaker": "Ryo",
      "text": "それ、Iloveyuって意味なんですか?僕はウェイとかかなって思ってました。",
      "start": 2278865,
      "end": 2285023,
      "timestamp": "37:58"
    },
    {
      "speaker": "B",
      "text": "多分ウェイで使ってると思うんですけどもスラックで私もあれこれどういう意味で使ってるんだろうでカーソル合わせると。",
      "start": 2285023,
      "end": 2293044,
      "timestamp": "38:05"
    },
    {
      "speaker": "Ryo",
      "text": "意味が出てくるやつです。",
      "start": 2293044,
      "end": 2294004,
      "timestamp": "38:13"
    },
    {
      "speaker": "B",
      "text": "よねそうです意味が出。",
      "start": 2294004,
      "end": 2295245,
      "timestamp": "38:14"
    },
    {
      "speaker": "Ryo",
      "text": "てくるえーそうなんだじゃあそうだったのかな。",
      "start": 2295245,
      "end": 2298105,
      "timestamp": "38:15"
    },
    {
      "speaker": "B",
      "text": "わかんないわ親指をたたんで人差し指と小指だけを立てた状態だとホーンでそれもよく使ってるんですけどもホーンに関してはどういう意味なんだろう?でもとりあえずウェイで使ってるなっていう風に受け取られ。",
      "start": 2298105,
      "end": 2312284,
      "timestamp": "38:18"
    },
    {
      "speaker": "Ryo",
      "text": "てますそうな、全然多分あんまりちゃんと見ないまま全部ウェイだと思ってまし。",
      "start": 2312284,
      "end": 2319450,
      "timestamp": "38:32"
    },
    {
      "speaker": "B",
      "text": "たでもそれでいいと。",
      "start": 2319450,
      "end": 2320231,
      "timestamp": "38:39"
    },
    {
      "speaker": "C",
      "text": "思います指文字はね、ちょっと気をつけないと間違ってるとなんかちょっとセクシャルな意味になったりとかするから私は避けたりしてい。",
      "start": 2320231,
      "end": 2329338,
      "timestamp": "38:40"
    },
    {
      "speaker": "B",
      "text": "ますそれも賢いですね私実はそのチームがあのそのテックチームが男性だらけ私しか女性ないんですよだからその子やっぱこうわかんないですけども何かと男同士のノリとかあるかもなっていうちょっとある中でそれをこまれてなんか変なことになってないしないかなっていう。",
      "start": 2329338,
      "end": 2351773,
      "timestamp": "38:49"
    },
    {
      "speaker": "Ryo",
      "text": "多分ないんじゃないかなそういうのこっちしないですよねでもさっきの話聞いてると結構なんかその会社得意なのかなっていうのが何個かあったから例えばさっきのおはようとか帰るねみたいなのとかランチ行きますとかって僕たち全くないじゃないですかだから何ならみんななんか適当な時間に行ってたり。",
      "start": 2354932,
      "end": 2377904,
      "timestamp": "39:14"
    },
    {
      "speaker": "B",
      "text": "するしそれはフロリディングになっ。",
      "start": 2377904,
      "end": 2381266,
      "timestamp": "39:37"
    },
    {
      "speaker": "C",
      "text": "てるかなってないかなってフルリモートじゃないからなのかもしれないけど、なんだろう、そんなに結果さえ出していれば、どこにいようが、何をしていようがあんまり気にされてない。マネージャーも気にしてないと思うけど、でも一応自分のステータスのところにberightackとかなんかちょっとオフィスから離れるときはoutficeでしたりとかっていうのは周りの人に対しての配慮としてやったりするけどおはようランチ行くでとかはちょっとかわいいなと思ったことないかもしれないもしかしたらそういった。",
      "start": 2381266,
      "end": 2422248,
      "timestamp": "39:41"
    },
    {
      "speaker": "B",
      "text": "カルチャーから来た人からすると逆にここまで言わなきゃいけないのめんどくさいって思っちゃう人もいるかもしれないですね。",
      "start": 2422248,
      "end": 2428392,
      "timestamp": "40:22"
    },
    {
      "speaker": "Ryo",
      "text": "でもそのくらいだったらアリかな?なんか僕が多分言うのは大体あの連絡してこないでっていう意味で何でも言うんでなんか例えばドクターアポイントメントとかぐらいしか言わない?逆にあとランチちょっと友達と行くから眺めに行くねみたいなのとかなんかそのミーティング勝手に入れないでくださいっていうのを言いたいから言うだけっていうのは僕はあるんですけどまあでも別になんかそんなチーム同士でカジュアルな感じだったら全然ね言ってもいいかなとは思うけど初めて聞いたなと思ってちょっとやってみましたそしたらえっとなんだろう今一社目だと思うんですけど今後のまあ留まるっていうのもアリだと思うんですけどなんかキャリアの今後の展望とかやりたいこととかこういうエンジニアになりたい、みたいなことがあれば教えてください。",
      "start": 2430442,
      "end": 2484368,
      "timestamp": "40:30"
    },
    {
      "speaker": "B",
      "text": "まずは、とりあえずはその3ヶ月の使用期間を乗り越えるというところが直近の目標。その後は、私としては永住権、彼とカナダで暮らしたいというところがあるので、永住権を取るために頑張りたいと思っています。それのためには、今の会社で経験を積むというような気持ちでおります。予定としてはまずこの今の学校のコープが今年の年末に切れて幸いワンホリーが2年どちらも使えるので最低3年、2年半ぐらいですね切られるのでその間で経験を積むというのと彼の方が先に永住権申請しているのでもしそれが取ればこのローとして取れればと思いますし取れなかったら取れないなりで頑張って取れるまでしがみつくようにカナダに残ろうと思ってますただ今の会社で経験を積みたいとは言ったんですけれどもまだビザサポートの話はしたことがなくてさっき言ったようにカナディアンばっかりでそういうサポートとかもできるのかわからないプロベーション終わったぐらいにはもちろんその直続の上司にまずは聞いてみようと思ってるんですけどももしビザサポートができないってことはないと思うんですけども難しいってことが分かれば転職も考えなきゃいけないだろうなというふうに思ってますその永住権っていうその身体のどう残るかっていうのはまた別でその自分のエンジニアとしてのキャリアとしてはもちろん今の会社で成果を出すさっき言ったようにマーケティング部として何か具体的な数値を出して成果を出してなんとなくレジュメにこういうことをしてUXI改善をして具体的には例えばあのクリック率だとかあのコンバージョン率がどう上がったみたいなことができるようなことをしていきたいなというふうに思っていますやっぱりマーケティングとかそういう部署を超えて何か働けるエンジニアっていうのは日本では強いと思いますし多分それはきっと海外のカナダでも同じことかなと思う思っているので頑張りたいと思ってますがどう思いますかいいと。",
      "start": 2484368,
      "end": 2642404,
      "timestamp": "41:24"
    },
    {
      "speaker": "Ryo",
      "text": "思います僕はもちろんエンジニアとして強くなるっていうのは基本的にはキャリアを上げていく上ではいいと思うんですけどそれプラスアルファで自分の強みみたいなのがあるとすごくいいかなって思うしあとシニアとかどんどん上がっていくと会議まとめるだとかメンタリングするだとかいろんなところでマネジメントするみたいなところも増えていくんで今日本での5年のディレクターの経験を活かしたりだとかもうちょっと高い視点でプロジェクトだったりとかを考えていくっていうのもすごいいいのかなって。",
      "start": 2642404,
      "end": 2675567,
      "timestamp": "44:02"
    },
    {
      "speaker": "B",
      "text": "僕は思いましたありがとうござい。",
      "start": 2675567,
      "end": 2678168,
      "timestamp": "44:35"
    },
    {
      "speaker": "Ryo",
      "text": "ますそしたら最後に未経験からカナダとか他の国に渡航してエンジニーになりたいっていう人に何かアドバイスできることがあれば教えてください。",
      "start": 2678168,
      "end": 2689852,
      "timestamp": "44:38"
    },
    {
      "speaker": "B",
      "text": "自分の中でも頑張り切った就活ではなかったのであまり偉そうなことは言えないんですけれども例えば過去の自分にこうしたらいいよっていうことを前提にして言うならば渡航前と渡航後と就活中の3つのポイントでアドバイスが言えればなと思うんですけれどもまず渡航前については情報収集が大事だなというふうに思っていてあのこっちだと幸いのことにこうやってあのポッドキャストで実際に就労経験あのあのカナダでの就職に成功したっていう方の話が聞けるっていうのは私が日本に行ったときはもうめちゃめちゃポッドキャストとかで聞いていてゆやさんとあのセナさんのバンクーバーのエンジニアをあの聞いてカナダで働くってのはどういうことかっていう知識をつけて解像度を上げたりとか就活インタビューみたいなものもあるのでそういったことを調べて自分の中でのカナダの働くことのイメージっていうのを具体化させておくといいのかなって思いますいかんせん時勢がすごいよく変わるというかもう2年前の情報が古いとかあるのでできるだけ最近のカナダの就労情報を集められると一番いいのかなっていうふうに思いますでそうですね情報収集をしてその後に自分の中でどういうふうな海外でのキャリアを積みたいかとイメージできたらまあ私はやっぱりフロークさんに相談するのをお勧めします相談してそのフロークさん経由でこっち来るだけでコミュニティに入れてコミュニティの中で情報交換できるというのはすごいもちろん友達だとか一緒に就活頑張る仲間とかできたりするので私としてはやっぱり心強かったですね何だったらセナーさんとかも結構いつでも相談してくださいみたいな感じで言ってくださったので私は甘えて渡航直後と就活始めて2、3ヶ月後ぐらいに甘えさせていただいたのでそういうのが活用できると大きいのかなって思いますあとはやっぱり技術力は最低限抑えておくとUNEMIでリアクトHTMLCSもちろんリアクトぐらいまでは学べておくといいのかなっていうふうに思いますもし学校で通う場合はですね学校で通わない場合は学校で通わない場合はちょっと私はわからないのでごめんなさい学校で通う場合学校で通う場合を想定して言うと技術力はUDEMYでREACTくらい自分で使って何かできるくらいまで身につけられているといいかなって思います二つ目の渡航後については私はエンジニアの体でも職力があったっていうのが大きいのかなっていうふうに感じているのでボランティアも見つけるのも難しいかもしれないんですけどもそういった無休のボランティアでもこちらではレジュメにかけるので何か経験を得られるといいんじゃないかなって思います私の友達にも実際にまだちょっと技術的にボランティアさえもできるか不安みたいなふうにいう子がいたんですけれども私の認識としてはボランティアセナさんもおっしゃってたんですけれどもボランティアだったらそこまで向こうもとりあえずこっちは経験を得るためにっていうので挑戦することに恐れることはないかなというふうに思いますで、就活中についてはえっと何でしょうテクニック的なことは他の方の方が多分いろいろと詳しいと思うので私からはもうとりあえずメンタル管理頑張ってっていうことをお伝えしたいなと思いますた時も本当にもうちょっとベッドから動きたくないなぁみたいなyoutbeめっちゃ見ちゃうみたいななんかもう何もできなくなっちゃう時も来ちゃうんですけどもそうなってもあんまり追い込みすぎないでなかなか見つからない時間かかる方が当たり前ぐらいの気持ちでで学校のキャリアアドバイザーの人が言ってて確かになって思ったのがあのクラスメイトのクラスの中でキラキラしたスター生徒は大体あのそういうキラキラしたスター生徒でも3ヶ月ぐらいあのショート見つけるのに時間かかるし普通の生徒だったら6ヶ月ぐらいかかるよっていうふうに言ったのでそれぐらいが当たり前なのかなって思っておくとなかなか成果が出さなくても思いますなので追い込みすぎないあのその就活中メンタル止まないためにも支えとなるものを早々に見つけながらゲームが好きならば一応ゲームを持っていくとかあのやっぱり息抜きはあるに越したことはないなって。",
      "start": 2692174,
      "end": 3017292,
      "timestamp": "44:52"
    },
    {
      "speaker": "Ryo",
      "text": "思います確かにカナダとかバンクーバーっていうコンテクストで言うとやっぱり結構2年ぐらい働ける期間2、3年ぐらいかな働ける期間を用意してくる人って多いと思うんですけどその日本はこっちであの働かないで帰る人ってやっぱり基本的にはみんなそこのいっぱいいっぱい使うっていうよりはその前に結構諦めちゃう人が多分多くてそういう人たちってやっぱりずっと仕事を見つけられなくても辛くなって帰るってことが多分ほとんどだと思うんでやっぱりそのメンタル管理はすごい大切なのかなって。",
      "start": 3017292,
      "end": 3050919,
      "timestamp": "50:17"
    },
    {
      "speaker": "B",
      "text": "思いますよねいやほんとそうですねあの私もあのクラスメイトがやっぱりもう座学期間1年終わって交付が始まるよっていうタイミングでも帰られたりする子も何人かいてそれに私もちょっとそれを見て私はやっぱりあのこっちでのキャリア築くのをあきらめた方がいいのかもしれないっていう弱気になる瞬間もあったのでそうですね自分で何を目標とするかっていうのをちゃんと明確にして頑張れたらなと思いますし意外と。",
      "start": 3050919,
      "end": 3086257,
      "timestamp": "50:50"
    },
    {
      "speaker": "Ryo",
      "text": "なんかバンクーバーの人たちみんな優しいから結構ね話聞いてくれるしなんかそのこういうところに出てきた人とかに直接連絡してもいいしそういうフロックとかのイベントみたいなのに行って友達作るのもありかなと思うんでそこら辺はできるだけやまないようにというかできるだけ吐き出すところを用意したまま準備していけるといいですよ。",
      "start": 3086257,
      "end": 3109844,
      "timestamp": "51:26"
    },
    {
      "speaker": "B",
      "text": "ねそうですねなので私もまともなアドバイスはできるかちょっとわからないんですけども頑張れとかも応援はもちろんできますしあと何よりこう現地でエンジニア職が見つかって働けた時の開放感半端ないのでなんかそうこうどういうものが待ってるよみたいな期待を持って頑張れって応援はできるかなと思う。",
      "start": 3109844,
      "end": 3133310,
      "timestamp": "51:49"
    },
    {
      "speaker": "Ryo",
      "text": "のでありがとうございましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 3133310,
      "end": 3156003,
      "timestamp": "52:13"
    }
  ]
}