{
  "episodeGuid": "56929b5c-abb6-4d03-a449-7d49b9f34bea",
  "episodeTitle": "ShopifyのSREがカルガリーへ行き着いた理由、日本→イギリス→ドイツ→カナダ、4カ国を渡り歩いたエンジニアの軌跡（後半）#26",
  "transcribedAt": "2025-12-08T01:40:46.842Z",
  "duration": 2941,
  "fullText": "はいそれでは今回は雄星さんの第2回目前回はいつもと違ってちょっとSILEの仕事内容みたいな感じでインタビューさせてもらったんですけど後半はいつものインタビューの内容を一つにまとめてやっていきたいと思いますイントロのところちょっと撮り忘れちゃったんですけどもし雄星さんの自己紹介を聞きたいなという方は前回のポッドキャストを聞いていただけたらなと思いますそれでは本編へどうぞちょっとすごい話を戻ってクックパッドにいた時にすでに海外に出られてると思うんですけどUKに行ったのかなそれは自分で行きたくて社内移動みたいなので行かれたん。ですかそうですね結構運用相もあったんですけど新卒で入った会社にいて2年ぐらい経ってそこそこ仕事慣れてきたかなみたいな時にまあ海外もどこかで出れたらなみたいなふうに思ってた時にクッパッド多分そんなにウェブ系の会社で海外事業をやってますみたいなとこってあんまりなくて当時だとクッパッドとかメルカリとかメルカリもっと後かもしんないですね本当に数社ぐらいしかなくてクッパッド海外事業やってやり始めますみたいな話をチラッと聞いてそれやらせてもらえたらいいなと思って入社はしてるんですけどただ最初は国内事業のフットに入ってるんでできたらいいなと思いつつも別になんかそのポジションで採用されたわけではないって感じですねただその1回があったらやりたいですみたいな話をしてたので。マネージャーとか上のレベルの人がまあちょっと多分拾ってくれてやってみたいんだったらいいよみたいな感じでやらしてもらったみたいな感じがあるんでも半分自分からプッシュしてるし半分は運って感じ。ちなみにその移動の時にはなんかインタビューみたいなものがあるんですかそれともなんかもう明日から行ってきてみたいな感じでそれで言う。と海外拠点ができるまでは日本国内で海外の事業のサービスを作ってたんでなんか社内で海外事業部みたいなのができてで、なんか妙に海外の人が多い島みたいなのが社内にあってみたいな感じでそこで、まあ日本国内にいるんだけど同僚は結構外国人が多いみたいな環境が最初あってで、ある時点で海外に拠点作るんでそっち行くみたいな話もあってやっちゃいけない感じだったんではい。その人たちはもうじゃあ一気にみんなで大移動みたいな感じだったんですかいや。まあもちろんそのそもそもそう言いたくないって人もまあいたと思いますし全員がってわけではないんですけどただまあ僕とかはそのそのプロジェクトの本当に最初期のメンバーとかだったりするんでまああの自分も行きたいしまあ多分会社としてもまあ行ってくれた方がありがたいっていうところはあったと思うんでその海外拠点に移ってそこからも市からチーム作りたいみたいな感じだったんで本当にもう最初の多分5人ぐらい金もんので第一陣みたいな感じで。いましたねいやすごいですよね。なかなか日本じゃ効かないやっぱりね、路線だったですし、実際今もそんなに多いわけじゃないでしょうからね。うまくいかないケースも多いですからね。そんなに数はたくさんないですよね、。こういう事態。間違いない。さっきチラッと出たメルカリさんもね、政府の方に作られましたけど、結局人数だいぶ減っちゃったらしいですからね。ここまでちょっと結構ずっと技術的な質問に偏ってきたんですけどその当時じゃあその行くって決まった時点なのかなそれもしくは海外で働きたいと思ったあのクックパッドに入った時点で英語とかのレベルはもうじゃあ海外で働けるようぐらいにはなってたんですかなん。ですかね僕のなんか自己評価としては今言ってるんですけど日本国内で教育を受けて英語が別に嫌いではない大卒4年生大卒っていう感じなんで別にすごいできるわけではないです苦手意識がないっていうだけなのでそういうとこから始めてなので別に喋れたりはしない喋れるというわけではないと読み書きは多分悪くないけど喋れないっていうよくあるよくあるパターンから始まって。ただ自分の場合幸いだったのが、日本国内にいる中で外国人の同僚が増えていって、みたいな感じでちょっとずつ英語を日常的に使える環境にじわりとなっていってその環境が1年多分2年ぐらいあってから海外に行ってるんでまあそのワンクッション挟んでって感じですかね日本で英語環境っていうクッション挟んで海外に行ってるんでなんかそのそこまで負荷を感じなかったのは多分そういうステップを踏めたから。だと思います僕たちとかみたいに結構、いきなり海外来て働くみたいな、僕元々外資にいたけど、全然英語の使ってない外資だったんで、僕も含めてそういう人だって結構のジャンプが多分あって、英語大変だみたいな瞬間があるけど、そこら辺はあんまり感じずに日本にいる時から結構鳴らしながらいけたみたいなめちゃくちゃいいですね羨ましいですよね。俺それ知らなかったっすわユウセイさんなんかクックパッドから行きたいです言って結構1ヶ月くらいでイギリス行ったんかなーって思ってたら1年くらいじゃあ間あったってことですか1年とか。2年とかそうですねクックパッドに4年間いて多分最初の2年弱ぐらいは日本で働いてますま。あじゃあ早いタイミングで海外行きたいんだよねっていうのは伝えておいてその外国人文書みたいなところにちょっとジョインして2年間くらいってことですねそうだったんですねじゃあ結構助成期間はちゃんとあったんだなるほど。なるほど。あとこれ結構多分海外にいる人たち聞きたい話だと思うんですけどその次の会社行くときにあの国が移られている、国移られてるんですよねきっとUKからドイツに行かれてると思うんですけどなんかビザ回りとかってどういう感じで行かれた。んですか基本的に今までだから全部会社経由でしか移動してないんですよねその転職かじゃない転職かきっかけでしか移動してないんで、基本的に全部会社のサポートでやってもらってます。じゃあ最初からビザ出してもらってみたいな。そうですそうです。そうよね。全部会社持ちだとぶっちゃけビザの内容とかよくわかんないですよね多分。そうですね。なので、ただその時もイギリスにいた時にヨーロッパのカンファレンスとかに直々行ってて、なんかたどたどしいながら頑張ってプレゼンとかしたりとかしてたんですそこで知り合ったサウンドクラウドにいた人と知り合ってうちの会社エンジニア採用してるけどどう?みたいな話になってそのリファラルがどれくらい効いてるのか分かんないんですけどある程度ポジションがあってビザサポートもしてるよっていうのを直接聞いて応募してるんでそこはそんなに最初からクリアだったって感じ。そういうことですね。あとあれかな、イギリスまだその当時ってEUの一部だった時のイギリスですかね。ってすると横の移動はだいぶしやすかったですよね、おそらく。ただ僕はその社内転席なんで、いわゆるイギリスのビザ事情はあんまり詳しい人はそこまでいないと思うんですけど、いわゆるアメリカのLビザみたいなやつで家内に転籍用のビザでイギリスに行ってるんで基本的に別にそのEUビザっていうわけではなくてそこは割とやり直しです。ねやり直しですよそいつとか。はそういうエンジニア向けのビザブルーカードっていうのがあるんですけどそういうのは多分今はちょっとわかんないですけどそんなに見にくいイメージがなくて割と。分かんないですけど適当なこと言ってもらえますかねでもそうですよね簡単に出るんじゃないかなと思います割とそう。ですねうちもビザ周りでいいんだったらドイツも専門じゃないですけど行った人は結構いてやっぱり唯一はいませんが割とフリーランスとかそういったところでもやっぱりビザが出やすい国でもありますし技術職に関して僕もドイツすごい難しいってイメージはなかったので最近はちょっとあれですが厳しくしようとしていますけどねなるほどというわけでビザ周りの部分も会社がほぼほぼ全部札幌としての移動ができたってことです。ね。ちなみになんかUKもやだなーみたいなとかあのベルリーに行ってみたいなみたいなそういう気持ちはあったんですかなんか今その日本から含めて4カ国目だと思うんですけどなんかその国で選んでるところとかなんかそういうのもあるのかなってちょっと気に。なるんですけどでも性格は間違いなくあって例えばそのモバイルカメラやめてなんかインフラ行ったりするのもそうなんですけどまあ開きやすいみたいなのは間違いなくどっ。かにあると思いますまあ。ちょっと自分も子供二人いるんであんまりもう小学校も行ってるしあんまりこっから移動しまくるイメージはないんですけど少なくともそれまではまあ飽きたらもう他のとこ行ってもいいかなみたいな感じではやってたんでそれはまず一つあるっていうのとあとはやっぱり海外で働いてて、日系の会社でいるし、たてつけ的な出向社員で所属は日本のままだしみたいなってなると、もし自分が海外で仕事を見つけたいってなったら見つけられるのかみたいなのって全然自信はつかないんですよねこのポジションだからここに入れるんだけどもしこの現地で他の会社受けたら入れてくれるのかなみたいなのは疑問に思ってある意味その待遇もしてくれたし多分困ったら日本に帰ったらいいみたいな環境をやらせてもらってたと思うんですけどそれだからこそなんか自分が実はここでできるのかなってイメージがあんまりわからなくてそれだったらヨーロッパで現地で現職してみようっていうふうに思ってなのが最初で、特にその当時のドラマクッカーとかイギリス時代に不満があったってことは全然ない。ちなみになんですけど、言えなかったら全然いいんですけど、日本の企業ってカナダでは結構なんかあんまりお金出してくれないみたいなあれがあるんですけど、そんなことはなかったんですか?あの別に具体的な金額とかは全然いらないんですけど。そんなになんかそうですね、そんななんかすごい良いとか言うわけではないですけどそんなすごいめちゃくちゃ渋いことをされた感じもなくてそうですね、当時だから海外拠点を作るぞってなった時に多分その庁舎とかから来た人とかもチームとかにいて多分その日本上の海外進出の。なんて言うんですかねこう手当とかそういうその設計福利構成の設計とかに関しても多分まあいろいろ言ってくれてた人がいるんじゃないかなと思うんですよねなのですごい有料企業なんかすごい嫌な思いをしたことは本当にないそのめちゃくちゃ高待遇というわけではないですけど普通にあの全然ちゃんと生活できてちょっと。バンクーバーには日系といえばみたいなのがいくつかあってそこら辺の印象があまりよろしくないっていうのがちょっとあるかもしれませんが天下のクックパッド先生ですからさすがにそんなさそんなことはしないでしょそんなこと。はじゃあクックパッドは結構じゃあそこらへんに関しては有料なものだったんです。ねちなみにグレーなことをされたりとかはないっていうのはあの明言し。ておきます間違いないですも朝良い会社ですかねドイツ。からそのカナダに来たみのもじゃあなんだろう秋田のもありなんか会社会用みたいなもありみたいな感じなん。ですかあとでもこれ、こっちの方が割とトラブルキーンだったような気はするんですよねまあ仕事はそこまで不満もなかったんですけどやっぱ生活が結構辛いっていうのもまあそのベルリンよねそうですねまあそうですねその一般化しすぎるのも良くないと思うんですけど当然言語の壁はまずあるんで仕事は100%英語なんだけど生活面でドイツ語を全くできなくて一体不便がないかというとそういうわけではないみたいな生活できるんだけど不便っていう感じですなので結構いろんなとこで不安があることが蓄積されていってトラブル処理も結構難しい人に頼らないといけないケースとかも多かったりとかして、ちょっとずつ日々の生活のストレスも溜まっていくし、さらに子供のことを考えた時に、幼稚園みたいなところはバイリンガルの幼稚園に入れてたんですけど、小学校行きだしたらほぼドイツ語になるし、こういうふうに育てたいっていう希望があるわけでもないんで自分がわからない言語で子供を教育を見ることができないしなみたいなそういう結構現実的な問題もありこれは結構欲しいなって思って巻き込まれには分かれよっていう感じなんですけどまあまあまあ言ってみないとねやっぱり英語圏で海外で生活するのよりはだいぶハードルが高いっていうことがわかったんでまあその多分ストレス体制にもよるんですけど僕はそれはかなりストレスに感じてやっぱり英語研に戻る方がいいなっていうことがまずあってそういうパスがある会社を探してShopifyに入ったって感じです。ね。ありますもんたまに来ますよねベルリンとかいる人とかに話聞いても役所とか行く時は割とガチャってねあのなんか英語全然大丈夫よって人だったらいいけどなんかドイツ語全然ダメだったら何お前みたいな感じで言われることもあるみたいなのもよく聞くのでそうなん。ですが一貫性があればいいんですけど予約もまず予約もなかなかできなくて頑張って予約していて担当者が悪くて控えされるみたいなんとかもうだいぶ心折れるんで間違いないちょっとずつダメージ効いてきてここにあんま長くいるイメージないな。ってなりますねなんかベルリン言ったら英語で全部いけるからええやんみたいなのをよく聞くからですねなかなか生の声聞くとわかんないってこと。ですよね。ほんと。英語圏っていうとカナダ以外もUKに戻るとかっていう手もあったりしたと思うんですけどカナダを選んだのは何か理由があるんです。か?US多分選択肢にそんなに入れなかったのはこれは本当に飽き性なだけで何かもう一回戻るのも変だなと勝手に思って選択肢に入れなかっただけでUSは遠跡するにしてももう1年ここにいないといけないんで。要はあれですよねそのエルビザとかでラウンだったらこいつにあと少なくとも1年はいてそっから多分転席の交渉とかしてるといつ出れるかわかんないっていう確定要素が大きくて候補から外れてとかってなるとまあ全的にカナダからっていうことになって日本もまぁ一応検討はしたんですけどあんまりいいオファーがなくて。その中では一番マッチしたんでショピファイに入って当時はこれ本当にセナさんとかがあると思うんですけど経験にめちゃくちゃ左右されるんで僕が転職活動ショピファイの転職活動をしていたのって2021年とかなんでゼロ金利みたいなののやつの後半の方なんですねなので経営がいいんですよねすごく間違いないポジションもなんかめちゃくちゃあったしビザサポートしますみたいな会社も結構あったんで。いやすごかったですよねあの。時はこれはタイミングが正直。良かったなと思いますあの当時はすごかったですもんね。アマゾンなんかも日本にわざわざリクルインテックブースを、アマゾンカナダが出してたりとか、すごいバブリーな時代だったのね。2021年、本当後半のゼロ金利政策ちょっと始まりそうになって、で、22年からコロナバブルになっての、23年のリセッションまでのこの1、2年ですよね。素晴らしくいい時期だったな。そこの時のタイミングでそうか、転職されたの。か、。じゃあ。あともう一つ気になったのはそのカナダでえっとショッピファイって確かトロントかどっかにオフィスありますよねその中でトロントバンクまああといわゆるまあよくあるバンクーバーなんかバンクーバーもなんか結構その留学生とかまあ日本人には結構有名ななんてのポピュラーなシティだったあの街だと思うんですけどその中でアルバータなんか真ん中アカルガリーを選んだのはなんかわけがあるんです。か。お金が一番でかいような気がするのとショピファイに関して言うとバンクーバーとかトロントにいても別にプラスになることはそこまでないんでっていうのも一応本社はおたわにあるんですけど出社基本的にはフルリモートの会社なんで一応オフィス的なものはあるんですけどみんなが頻繁に通ってるっていうよりかはオフサイトしたりするのに使ったりとか本当にたまたま近くに住んでる人で注射した方がかかどるみたいな人がいってるぐらいの感じでチーム単位でこのオフィスにこのメンバーがたくさんいるみたいなとこって全然ないんで正直どこに住んでもあんまり変わらない時差だけですタイムゾーンさえ揃えば何でもいいみたいな感じが正直あって。とにかくドイツはベルって決めてたんでカナダ、要は北米時間だったら別にどこでもいいですよみたいな話になってどこでもいいのかみたいなどこでもよくて僕はちょっとその州にUSみたいに州によって給料の調整があるのかどうかみたいな公式の情報は持ってないんでわかんないんですけど多分そんなに大きな調整はないんじゃないかなと思った時にどう見ても家賃むちゃくちゃ高いんであんまメリットないんだったら家賃はまだおかえめでむちゃくちゃ不便ではなさそうなところを選ぼうということになってそうするともうそうです、要はトロント、バンクーバー高すぎるので外しますってなってその次って見ていくと、特にカルワリティ候補に出てくるんで、そういう感じで選びましたそう。か、景気は確かにいいけど、あの家賃がめちゃくちゃ上がり始めてた時期でもあったの。か、あの時期は確かにあの時期特によね、たぶん、特に差が激しかっ。た、たぶんなんかあんまり僕この知識はあんまり持ってないんですけどなんか子育てするとなんかその補助金とかなんかそういう制度も合わせるとあんまりなんか変わらないんじゃないかみたいなのも聞いたことあるんですけどなんかまあでもあんまり気にしないですかね他の他の。種のことをねまあそのいろいろ言いますよねまあ例えばこっちだと保険とこれ車の保険が異常に高いんでなんかそれだけでライブやられるんですけどでも家賃も多分10万ぐらいはまだ全然違うんじゃないんですかねちょっとわかんないんです。けど確かに保険どのぐらいな。んですかただ僕は日本から行ってる人は日本の保険をその無事故歴みたいな引き継いでる人とか多いんであんまりこのトラブルないのかもしれないですけど僕はもう国を転々としてるんで何も証明できなくて今日は免許を初めて運転する人というかわいそうな人だね。それもあってむちゃくちゃ高いんですけどただ本当にまず車多分バンクーバーとかよりもまだもっと車社会なのと。天候のせいで多分大きめの事故も多いっていうのもあって僕はだからそうですね、年間まだ30万ぐらい払っ。てる僕今20万いかないぐらい払ってるんで確かに。アブレディソンくらいのイメージだよ。ね。あるって感じですねまあそっ。かまあ確かに家賃と車の10万とかあったらまあ確かにそれは違うです。結構さを出そうねーに関してはそんななんかあるんですかお金めっちゃ出るみたいなのあるんです。か?なんかそう結構なんか結構たまに話聞くのはそれこそこの間なんか瀬名さんも言ったんですけどなんかパパ参会みたいなのがあって僕と瀬名さんは全然パパじゃないのに参加させてもらってでなんかそのうちの一人がちょうど言ってたのはなんかその家賃安くてアラバーター移ってみたけど実はなんか子育ての補助金が全然なくてなんかあんまり変わらなかったみたいな人もいるっていう話をなんかポロッとしててああそういうのもあるのかと思って聞いてたんですけど僕はあんまりちょっとその結構でもワンクーバーでいうとなんかその子供に関する補助金はめちゃくちゃ多いみたいなでもそれこそなんか聞いたあのこの間イスさんのポッドキャストとかでももしかしたらちょっと言ってたかもしれないけど1500とか2000円ぐらい出るって言っ。てたかなでもほらうちのビジネスパートナーがさあの保育理学とかそういうのでこっち親御さんと一緒に来られる方が多いけどやっぱ補助系の話はしょっちゅうやっぱりトピック出てくるので僕もね詳しいわけじゃないけどバンクーバーは特にその辺まあしっかりしてるよねっていうのはよく聞く話でありますね今度聞いてもいいかもねちょっとあいつら。してそうですね気になりますねまあえーとアルバータもあるのはあるはずなんですけど基本インカムベースなんでぶっちゃけテクニック業で働いているとほぼもらえなくなるぐらいの感じのキャップなんで。確かにそれで言うとそのエンジニアで結構もらっている人たちでもまあ多分15万20万ぐらいって言ってたんでまあそういう意味で言うと結構じゃあバンクーバーそういう意味ではなんかもらえるのかもねあとはなんかあの日本食ない問題とかアジア人いない問題とかってありませんまあなんかもともと違う国で慣れてたのかもしれないけど多分逆にバンクーバーがレアなのか。そこらへんはそれはですね多分日本から来る人にとってバンクーバーほど海外行った時にこうなんて言うんです。かね摩擦があるみたいな。環境がある国とか場所って他にはないと思うんですけどもうカナダっていう国を見るだけで他の国よりは全然楽っていうか僕だと例えばベルリンにいると移民が多いんだけど移民ってトルコとかロシアとかの国なんで全然違うんです日本人とかあんまりそもそもいないし移民のデモグラフィーが全然違うんでそういう意味ではまず結構居心地が良くないっていうのもあります。住むところにもよると思うんですけど、僕はあんまり日本人とか見ないなみたいな。アジア人も社会主義の名残があるんで、ベトナム人とかぐらいしかいなくて、中国人とか韓国人とか全然いないみたいな感じ。カルガリーはバンクーバーに比べるともちろん全然なんですけど、そうは言ってもアジア人めちゃくちゃいますしなんかそのそうですね、保守的みたいなふうに言われますけど、エトロポリタンエリア、エドモントンとカルガリーは結構普通にリベラルな人多いんで、移民もめちゃくちゃ多いし。この家の周りも中古風景の人めちゃくちゃいっぱいいるんでなんかそのすごいアウェー感っていうのはなくてむしろなんかアジア人めちゃくちゃいるカルガリーもアジア人めちゃくちゃいるなって僕は来たときに思いましたという。ことですよねバンクーバーと比べるとっていう風なのがねよく出てくるけどもやっぱりでもそれでもねカルガリーも含めてアジア比率それなりにやっぱ高いっていうのもあるので片身の狭さみたいなのは確かに。ないですよねあんまりないですね全然本当にまあそのめちゃくちゃいい日本食の店があるとかって言われるとまぁそんなことはないと思いますし日本語で最悪日本語でサービス受けられるみたいなのも聞いたことはないんでそこまではないんだけど全然そのアジア系の食品は全然揃うし日本人にこたわらなければアジア系の人もめちゃくちゃたくさんいるっていう感じなんで。ここでも他の国に比べるとだいぶあの横置はいいねだ。って4カ国知ってる人がねまあ3国が海外だともうそういうふうに言うんだからねまずも相当住みやすいんだろうなっていうだからあれもねその優勢さんのプレゼンがうまいからってのもあるけどさ俺があの背中で1回ガチで軽々に引っ越すか議論が生まれたのがほんと優勢さんの話を聞いた後で3年前くらいかな2年前かな本当にはコストオブリビングだったりとか割と郵政さんが結構こと細かにカルガリーのこと調べていたの。話聞いてたから割とガ。チでカルガリー行くかってふうに思っていたらその後割とカルガリーのほうもやっぱり家賃というか家の価格も上がってきてっていうのをニュース聞いてたから今どうなのかなってふうに正直思っていたんですけどやっぱり未だにバンクーバーとかと比べると全然安いよねってイメージは引き続きっていうことですよね。多分。めっちゃ高いイメージがあるんでなんか分かんないですよ40万ぐらい払ってるみたいなその僕だとその3ベッドルームぐらいはまああるといいなっていう感じなんでそれをバンクーバーで中心部だとまあ無理中心部か無理そうっていう感じになってそうすると結構。厳しいですねそうね。4、5千ドルかなやっぱ。それぐらい。でさすがにそこまでは払ったくないなーって思ってちょっと離れたところを調べだしていつも言ってるんですけどなんかオキトラムとかなんていうかねなんかそっちの方とかを見出してここでも全然高いなみたいなあーそうなのか南の方にあるなんかラングレーとか。ラングレーねーはいはいはいという。ところを見出してもうこんだけ遠いんだともうバンクーバーである意味も別になさそうなのでだったらもう全然ほかのとこでもいいや。ってなっていっいやー素晴らしいやそうなんですよねだからあの時ほんと軽々にマジで引っ越すかっていうので嫁とも嫁さんともずーっと喋っててまあ結果的にうちはちょっとあのビジネスがやっぱあるからっていうので行かなかったんですが深井。でも瀬名さんあんまオフィス行かないから別にゲーム部屋さえあれば生きていけそうだからいいんじゃないかもあるけど樋口何のために。家賃かかってるよね会社のまあでもイベントとかやるからなーっていうのがあるからね月に1回バンクーバー来るのも買ったりちゃ買ったりっていう。ね。ただやっぱりその最悪ローカル僕だって今リモートなんでここでもいいんですけどじゃあ最悪転職しますってなってローカルで要はその僕が引っ越した頃って普通にリモートワーク全然これから増えそうみたいなフェーズで映ってるんでこっち来た時はそんな不安なかったんですけど結局各社RTをやりだしてってなるとリモートの仕事ってそんなにないんでじゃあもし僕は今ここでオフィスに通勤しないといけない仕事を探すってなるとあんまり良いものは多分そこまで。ないんですねそうなん。ですかね例えば朝なもオフィスがあるっていう風に言いましたしテク各社まあ多分実は結構あると思うんでそういうのがどれくらいヘッドカウントがかかるのかわかんない選択肢にあるっていうのはバンクーバーの強みだ。なと思いますそうですよねリモートオフィスの大驚覚みたいなとこですからねShopifyとかGitLabとかそういうリモートの文化がそもそもあったよねっていうのがさらにコロナで緩くというか推奨されたっていうのがあったけど最近リターントオフィスばっかりですからねAmazonフルスッシャーになっちゃっ。たしね。なんかそれで言うとバンクーバーもまあそんなに多いわけじゃなくて結構朝なの人たちはみんななんか次の会社どこ行こうみたいなバンクーバーから出たくないしでもなんか他にいい会社ないしみたいなの言っててもうだからそこまで考えるとやっぱトロントとか行くしかないみたいな例えばなんかグーグルのオフィスとかなかったりだとかfacebokはあるけどエンジニアではないのかなとかnetflixもなんか聞いたことあるけどエンジニアではないいないしとかって考えるとやっぱそこらへん考えると本当にちょっとトロントのとかねうつるのうつらないといけないのかなみたいなのはあり。ますよねうんアンクーバー言ったらもうアマゾンシティやからねもはやそのビッグテクの界隈で言うのであればマイクロ。ソフトもありますけどねうーん。まあだから本当トロントにねもはやヘッドカウントの数で言うんだったらもうなっちゃうから。っすねーじゃあ今後転職するときはまた全然違う街でもいいかなっていうのは。あるんですかまあそうねもうそれはもうその時考えようっていう感じであんまりそこまで先読みしてないっていうのが正直な答えですねもう正直まあそうですね今こういう情勢ですから仕事があるんだけありがたいっていう気持ち。で。その時は全然、カナダ国外も考えようかなっていう感じです。か?どうなんですかね。その時に自分がどういうフェーズにあるかっていう方が多いと思うんですけどね。日本に帰ってもいいみたいな選択肢が出てるぐらいの先だったら、そういうことも考えるかもしれないし、そういうフェーズじゃないそれより早い段階で、他の仕事を探さないといけないという状況になったら、カナダに行こうとも、もうちょっと考えてみようかなっていう感じはあるんで、そうですね、それがいつになるかで結構変わってくるかなって気はし。ます。そうですよね。ご家族のフェーズもあるでしょうから。ね、当然。そうですよね。特にそっちの方がプライオリティ高そう。なんかやっぱ結構、この間そのパパさん会みたいに言ってても、やっぱ子供の教育とか、地理的にとか言語的に動くことでのやっぱそのなんだろうストレスみたいなのってすごい特に子供には大きくかかるから選べる自分で選べるわけでもないですしだからやっぱりなんかそのカナダに1回来たら結構そのカナダで住めようみたいに考えてる人が多そうだなっていうイメージ。がありましたねそうよ。ね間違いない日本の教育に切り替えれるかどうかっていうところで言うと。テッドラインって言うとちょっと言い過ぎですけど今上のグレード4とかなんで次中学受験があるからそこがタイミングなのかみたいなそこを逃したら次はどうなるんだとか考えると正直心の中では耐えるかなと思いつつもなかなかこう上手いことやるのはかなり難しいなっていう現実が今見えてるっていう状況ですタイミング。のね合うか合わないかもね含めてちょっと大変ですよねその辺はなんか。あのクックパッド時代にクックパッドじゃないかその次かななんか日本からもえっとオファーもらってたのかなとか探したみたいな話されてたと思うんですけどなんか働き方的にはまだ何だろう海外の方が合ってるなまあカナダとかukとかドイツでちょっとは違うかもしれないですけどあのそっちの方が合ってるなって感じですかそれとも全然オファーさえあれば日本でも全然良いオファーさえあれば日本でもいいかなみたいに考えられてるんです。かどうなんですかねなんかそんなに僕はあのまあいろんなモチベーションの人がいると思うんですけど僕はその海外の環境その前提として僕はその日本で働いた会社はそんなに環境悪くなかったんで日本の労働環境みたいなのが嫌だみたいなのとかっていうのはそんなにはなくてどっちかっていうと自分の知見を広げたいっていうとで出てきてる感じなので別に戻ることに対してそんなネガティブなイメージはないんですけどまあとはいえ僕なんかはそんなにこう特定のことをめちゃくちゃ深くやってこれた人間じゃないんで海外は外資で働いてるっていうところをレバレッジを利かせないとあんまりいいことはいいポジションはないっていうのも正直あってそういう意味だと日本に帰るにしても外資の方が選択肢があるし、おそらく待遇もいい可能性が高いとかってなってくると、必然的に外資が選択肢にどうしても上位に入ってしまうっていうところがあってそうですね、これは多分お金の話とかにもなって。くるんでしょうけどそれでいうとあれですよね、なんかそのさっきのバンクーバーの話に通ずるところだと思うんですけどなんか東京でその中心とかそのオフィスに近くに住みたいでもそんなに狭いところじゃないって思うと僕も何回か考えて日本東京の家賃とか調べたんですけどそれこそ40万とか別そんな大きくなくても2LDKとかかなとかでも40万50万って言っちゃうじゃないですかだからなんかそこら辺は多分こっちで働いてる人みんな思ってるところだけどそれ考えるとしかもそれよりあの日本カナダのバンクーバーとかに比べても全然日本のちょっとエンジニアの給料って安いじゃないですかそれ考えるといいなってきっとみんな思っ。てるんだろうね難しいよね。そうですねまあ住宅環境は間違いなくありますねこっちの家はまあやっぱ広いのは広いんでなんかまあ子供がいてそのもしあの一人だけとかまあ子供いなければその彼方でもいい感じの今度とかにすんうーんようなタイプの人間だと思うんですけど子供いるとあんまりやっぱ狭いとちゃくちゃ行きがちまっとくリモートワークしてるとさすがに気が散るんでまあそうですねそこそこ広いと見たいとかっ日本もどっ電車通勤とかもう多分できないしなーみたいなやり出した人はいるんでしょうけどそこをできれば避けたいみたいなふうにやっぱ間違いないそうなってくると実はあんまり選択肢ないんです。よねまあそうですよねーゆかしですね一緒です本当に。あのトガイスさんとねあの何ユーセイさんはそこをちょっと似てるなーって思ってるわトガイスさんの今住んでるとこ。やばいっすよ1800度だっけあんたそうですね、まだ1800で住めてて、広さも、ワンベッドルームだけど800スクエアフィートぐらいあるから、でも僕の場合はすごいいい時に引っ越して、たまたまなんですよね、その一番安い時に引っ越して、そこから国の何パーセントまでしか毎年上げられないみたいなのがあって、それで上がり続けてるけどまだ安いみたいなのがあっ。て、アパートメントはそこが穴だよねアパートメントってさあのその棟ごとに全部あの家賃あげなくちゃたしかいけないはずであのコンドとかだとね。できるんじゃないですかでき。ますよあれ本当あのなんかウォーナーが一人しかいないんだったらあの棟ごとに全部数パーセント上げるみたいなことしなくちゃいけないと聞いたことあるけどそのオーナーやから。えっといやでもそのルール的にはコンドだとしてもあのアパートメントだとしてもその1年の繰り返しのタイミングでその年に決められたところまでしか上げられないでも抜けるタイミングでは全然上げられはするんであー。そうか抜けるタイミングではそう。かなるほどねだからあとはなんかその会社がやってるアパートメントだと基本的には会社がやってるんでその会社だとそのその何パーセントって決められたもの以上は上げてこないやっぱその評判だとかとか訴えられるとかリスクみたいなのもあるんでそれが個人だとするとなんかああいやもうあの違う人に自分が住むからとかってなんか適当な理由をつけるとあげられちゃうみたいなのがあるんでそういうのが少ないみたいな意味ではアパート良かっ。たりするんですけどそういうわけでちょっとコストブリビングの特に家賃の部分に対してのちょっとアンテナみたいなのがちょっとお二人若干似てるなーって思っ。たので確かに素晴らしいいつも最後に、自分のような留学渡航を考える人にアドバイスっていうのを聞いてるんですけど、郵政さんみたいな、海外の出方する人が、今の時期、時代にいるのかっていうの。が、なん。か、あんまなんか、今ってあるんですか?ぶっちゃけ。クックパッドとか、メルカリとかで、その海外転勤?みたいなの。って。もちろんあの事情は知らないんであれですけどまぁあんまりないだろうなっていうのはありますよねそもそも多分テナさんがそれこそ多分詳しいと思いますけどどこも一緒ですからねやっぱ基本的には留学とか就労ビザとかまあ厳しくなっている状況だとは思うんであんまりこうやりやすい環境では今なさそうって。いう。間違いない、もう確率にだってインターナトランスファーの海外枠だったり外資のなんかこっちに来る枠だったりっていうのも相当減ってるって聞くのでまあビザ事情も含め反グローバリズムな環境に今なりつつは正直あるので難易度上がってますよ。ね。あとじゃあもう一つだけあのキャリーなんかちょっとキャリアの話にまた戻るんですけど今の会社が多分3年4年ぐらいなのかなもう働いてると思うんですけど今後なんだろうどういうふうにキャリアを進めようみたいなのってありますもちろんなんかさっき言われたようになんか子供のこともあるし家族のこともあるからかなり言おうとかなんかそこら辺で結構変わってくると思うんですけどなんか大まかに自分なんかこういうふうにキャリア進めていきたいなみたいなのってあれば教えていただけます。か。なんかいいことは言えたらいいなと思ったんですけど本当に今あんまりそういうのなくてまあ本当もうやっぱり前lmで働き方はめちゃくちゃ変わったっていうのもあるんですけどまあ本当に何かゼロベースであのこれからどうしようかなっていう考えているフェーズでもあってうーんまあ一方でなんか具体的なあれはないんですけどなんか全然別のことしたいなと思うようなところもあったりして。そうですあんまり今はなるようになれみたいな感じでやってるフェーズ。ではあって全然別のことっていうとなんだろうエンジニアとは別のことですかそれともエンジニアの中でまあなんかさっきこの前に話していただいたようにiOSからSREみたいなそういうなんかマイナーチェンジなんですかそれともメジャーチェンジなんですか。どうなんですかねまあそのなんかお金を気にしなくても。良くなったらやってみたいことみたいなのっていうのはまぁちらほらあるんですけどまぁいつそうなるのかみたいなそういうその時期とふところ事情とかの兼ね合いとかもあるんで今はまだ稼がないといけないっていうところがあってやること決めてるんですけどそれの優先順位がちょっと変わるといいなと思いつつ。まあ日々過ごしてるんですけどまぁそんな上手い話もなくまあ頑張って働くかっていう感じ。ですねということですね郵政さんのキャリアで見るんだったら正直開発もやってきたしねsreもやってきたし内部の事情も僕が入るその車内向けもね環境も知ってるし開発もしてるして部分だったらワンチャン次例えばわかんないですけどctoだったりとかねなんか僕も思ったね、そこまでも行ってもいいフェーズなんじゃないかなと勝手に思いはしましたけどその辺には興味あんまない感じです。か?でもまあそれもさっきの話に多少は近くてじゃあそういうでも僕自身がすごいこういうビジネスがしたいとかっていう別にあるわけじゃないんでじゃあ例えばこのビジネス良さそうだなみたいな自分ができること何あるかなみたいなそういうそのやりたいこととかやった方が良さそうなことっていうのを最優先に考えて仕事を決められるようになればそういうことをやれたらいいなとは正直。思っています深井なるほどですねいやでも大変よねトカシさんもだってさっきの朝田の話じゃないけど次のキャリアどうするって言うとバンクーバンもうないじゃんってねなるからじゃあもうCTOかとかもう次会社こすかみたいなね話になっ。ちゃうのかなトカシいやいやいや僕とユイセンさんじゃ全然違うんでちょっと隣に並べないでもらってちょっと恥ずかしいですもん深井ちょっとやめろトカシ。あそうっすかなるほどねいやでもそうよねカナダの次ショピファイの次とかアサナの次とかってやれるとみんな困るんだろうなーって思いますも正直うーん確かに。そうですよねだから何確かにそのそういうそのまあ金銭的なこととか労働環境みたいなことだけをどんどん上げていくみたいなことはもちろん全然顔天井ではあると思うんですけどそこにフォーカスしていくとまあある程度もこれしかないっていうのが決まってくるので、そっちに乗り続けて頑張るのかそうじゃないでも、もちろんその結果的に金銭的なメリットあるともちろん良くはあるんですけどそこだけをバチバチ狙いに行かなくてもいいようになれたらいいなっていうのは正直思う。ときはありますねなるほどね。調子は分かりますね素晴らしい皆悩んでらっしゃるんですよその辺にはねそんなところですかねそんなところでしょうか僕もだってSREの話だいぶ聞けたのでだいぶちょっとこれからSRE目指してこられる方々には今日の話をちょっと聞いてもらえればなと思って。いるので確かにそうですねSREに関してはやっぱりジョブディスクリプション見て本当に今的に結構違う応用件だったりとかビジネスフェーズで本当に違ってくるんで。いろいろ試してみるっていうのが正直いいんじゃないかなと思いますただその上である程度そういう意味ではある程度触れ幅を持ってやらないといけないんでめちゃくちゃ盲点があるみたいなのが多分そうした方がいいのかなと思って本当にめちゃくちゃよくあるあれなんですけどじゃあブラウザでこのサイトにアクセスしますみたいなその時に何が起きるかを最初から最後まで説明してくださいみたいなやつをまずやってみるもちろんそういうの特にできる人もいると思うんですけどそういうのがまあなんとなく考えてみてあれあんまりわかんないぞみたいなのがあったらちゃんとこう一個一個通していくなるほどね。でキャッシュにどういうレイヤーがあるのかとかDNSどうなってるんだっけとか例えばデータの書き込みがあったらどこでデータの書き込みが起こってるんだっけみたいなとかそういうのを考えるある程度最低限説明できるみたいなところにはまず持っていってインフラ周りで全くなんか分かってないところがあるみたいなところは多分無視した方がいいんじゃないかなと思いますと。いうことですねまあ具体的。なドバイスをするとそう。いうことですねまあだから結構モーラ的にというか本当に開発によりすぎていてもインフラ全然わかりませんだと怖いしインフラばっかりわかってても多分開発全く去ったことありませんはもしかしたら怖いしっていうところですよねネットワークうちの知識ゼロですっていうのは多分怖いだろうしいろんなところのちょっと網羅的にいろいろ興味をちゃんと持ってる人がまあいいのかなと僕は思ったのでそういうアドバイスを少し心がけさせていただければと思いますはいありがとうございます。ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "A",
      "text": "はいそれでは今回は雄星さんの第2回目前回はいつもと違ってちょっとSILEの仕事内容みたいな感じでインタビューさせてもらったんですけど後半はいつものインタビューの内容を一つにまとめてやっていきたいと思いますイントロのところちょっと撮り忘れちゃったんですけどもし雄星さんの自己紹介を聞きたいなという方は前回のポッドキャストを聞いていただけたらなと思いますそれでは本編へどうぞちょっとすごい話を戻ってクックパッドにいた時にすでに海外に出られてると思うんですけどUKに行ったのかなそれは自分で行きたくて社内移動みたいなので行かれたん。",
      "start": 1250,
      "end": 41921,
      "timestamp": "00:01"
    },
    {
      "speaker": "B",
      "text": "ですかそうですね結構運用相もあったんですけど新卒で入った会社にいて2年ぐらい経ってそこそこ仕事慣れてきたかなみたいな時にまあ海外もどこかで出れたらなみたいなふうに思ってた時にクッパッド多分そんなにウェブ系の会社で海外事業をやってますみたいなとこってあんまりなくて当時だとクッパッドとかメルカリとかメルカリもっと後かもしんないですね本当に数社ぐらいしかなくてクッパッド海外事業やってやり始めますみたいな話をチラッと聞いてそれやらせてもらえたらいいなと思って入社はしてるんですけどただ最初は国内事業のフットに入ってるんでできたらいいなと思いつつも別になんかそのポジションで採用されたわけではないって感じですねただその1回があったらやりたいですみたいな話をしてたので。",
      "start": 41921,
      "end": 112332,
      "timestamp": "00:41"
    },
    {
      "speaker": "B",
      "text": "マネージャーとか上のレベルの人がまあちょっと多分拾ってくれてやってみたいんだったらいいよみたいな感じでやらしてもらったみたいな感じがあるんでも半分自分からプッシュしてるし半分は運って感じ。",
      "start": 114700,
      "end": 127979,
      "timestamp": "01:54"
    },
    {
      "speaker": "A",
      "text": "ちなみにその移動の時にはなんかインタビューみたいなものがあるんですかそれともなんかもう明日から行ってきてみたいな感じでそれで言う。",
      "start": 129958,
      "end": 139301,
      "timestamp": "02:09"
    },
    {
      "speaker": "B",
      "text": "と海外拠点ができるまでは日本国内で海外の事業のサービスを作ってたんでなんか社内で海外事業部みたいなのができてで、なんか妙に海外の人が多い島みたいなのが社内にあってみたいな感じでそこで、まあ日本国内にいるんだけど同僚は結構外国人が多いみたいな環境が最初あってで、ある時点で海外に拠点作るんでそっち行くみたいな話もあってやっちゃいけない感じだったんではい。",
      "start": 139301,
      "end": 178414,
      "timestamp": "02:19"
    },
    {
      "speaker": "A",
      "text": "その人たちはもうじゃあ一気にみんなで大移動みたいな感じだったんですかいや。",
      "start": 178414,
      "end": 184097,
      "timestamp": "02:58"
    },
    {
      "speaker": "B",
      "text": "まあもちろんそのそもそもそう言いたくないって人もまあいたと思いますし全員がってわけではないんですけどただまあ僕とかはそのそのプロジェクトの本当に最初期のメンバーとかだったりするんでまああの自分も行きたいしまあ多分会社としてもまあ行ってくれた方がありがたいっていうところはあったと思うんでその海外拠点に移ってそこからも市からチーム作りたいみたいな感じだったんで本当にもう最初の多分5人ぐらい金もんので第一陣みたいな感じで。",
      "start": 184097,
      "end": 223044,
      "timestamp": "03:04"
    },
    {
      "speaker": "C",
      "text": "いましたねいやすごいですよね。なかなか日本じゃ効かないやっぱりね、路線だったですし、実際今もそんなに多いわけじゃないでしょうからね。",
      "start": 223044,
      "end": 234031,
      "timestamp": "03:43"
    },
    {
      "speaker": "B",
      "text": "うまくいかないケースも多いですからね。そんなに数はたくさんないですよね、。",
      "start": 234031,
      "end": 239572,
      "timestamp": "03:54"
    },
    {
      "speaker": "A",
      "text": "こういう事態。",
      "start": 239572,
      "end": 241163,
      "timestamp": "03:59"
    },
    {
      "speaker": "C",
      "text": "間違いない。さっきチラッと出たメルカリさんもね、政府の方に作られましたけど、結局人数だいぶ減っちゃったらしいですからね。",
      "start": 241163,
      "end": 250204,
      "timestamp": "04:01"
    },
    {
      "speaker": "A",
      "text": "ここまでちょっと結構ずっと技術的な質問に偏ってきたんですけどその当時じゃあその行くって決まった時点なのかなそれもしくは海外で働きたいと思ったあのクックパッドに入った時点で英語とかのレベルはもうじゃあ海外で働けるようぐらいにはなってたんですかなん。",
      "start": 250214,
      "end": 269800,
      "timestamp": "04:10"
    },
    {
      "speaker": "B",
      "text": "ですかね僕のなんか自己評価としては今言ってるんですけど日本国内で教育を受けて英語が別に嫌いではない大卒4年生大卒っていう感じなんで別にすごいできるわけではないです苦手意識がないっていうだけなのでそういうとこから始めてなので別に喋れたりはしない喋れるというわけではないと読み書きは多分悪くないけど喋れないっていうよくあるよくあるパターンから始まって。",
      "start": 269800,
      "end": 304451,
      "timestamp": "04:29"
    },
    {
      "speaker": "B",
      "text": "ただ自分の場合幸いだったのが、日本国内にいる中で外国人の同僚が増えていって、みたいな感じでちょっとずつ英語を日常的に使える環境にじわりとなっていってその環境が1年多分2年ぐらいあってから海外に行ってるんでまあそのワンクッション挟んでって感じですかね日本で英語環境っていうクッション挟んで海外に行ってるんでなんかそのそこまで負荷を感じなかったのは多分そういうステップを踏めたから。",
      "start": 306172,
      "end": 343713,
      "timestamp": "05:06"
    },
    {
      "speaker": "A",
      "text": "だと思います僕たちとかみたいに結構、いきなり海外来て働くみたいな、僕元々外資にいたけど、全然英語の使ってない外資だったんで、僕も含めてそういう人だって結構のジャンプが多分あって、英語大変だみたいな瞬間があるけど、そこら辺はあんまり感じずに日本にいる時から結構鳴らしながらいけたみたいなめちゃくちゃいいですね羨ましいですよね。",
      "start": 343713,
      "end": 368839,
      "timestamp": "05:43"
    },
    {
      "speaker": "C",
      "text": "俺それ知らなかったっすわユウセイさんなんかクックパッドから行きたいです言って結構1ヶ月くらいでイギリス行ったんかなーって思ってたら1年くらいじゃあ間あったってことですか1年とか。",
      "start": 368839,
      "end": 378909,
      "timestamp": "06:08"
    },
    {
      "speaker": "B",
      "text": "2年とかそうですねクックパッドに4年間いて多分最初の2年弱ぐらいは日本で働いてますま。",
      "start": 378909,
      "end": 388525,
      "timestamp": "06:18"
    },
    {
      "speaker": "C",
      "text": "あじゃあ早いタイミングで海外行きたいんだよねっていうのは伝えておいてその外国人文書みたいなところにちょっとジョインして2年間くらいってことですねそうだったんですねじゃあ結構助成期間はちゃんとあったんだなるほど。",
      "start": 388525,
      "end": 399967,
      "timestamp": "06:28"
    },
    {
      "speaker": "A",
      "text": "なるほど。",
      "start": 399967,
      "end": 400188,
      "timestamp": "06:39"
    },
    {
      "speaker": "A",
      "text": "あとこれ結構多分海外にいる人たち聞きたい話だと思うんですけどその次の会社行くときにあの国が移られている、国移られてるんですよねきっとUKからドイツに行かれてると思うんですけどなんかビザ回りとかってどういう感じで行かれた。",
      "start": 401707,
      "end": 419018,
      "timestamp": "06:41"
    },
    {
      "speaker": "B",
      "text": "んですか基本的に今までだから全部会社経由でしか移動してないんですよねその転職かじゃない転職かきっかけでしか移動してないんで、基本的に全部会社のサポートでやってもらってます。",
      "start": 419018,
      "end": 437463,
      "timestamp": "06:59"
    },
    {
      "speaker": "A",
      "text": "じゃあ最初からビザ出してもらってみたいな。",
      "start": 437463,
      "end": 439814,
      "timestamp": "07:17"
    },
    {
      "speaker": "B",
      "text": "そうですそうです。",
      "start": 439814,
      "end": 441746,
      "timestamp": "07:19"
    },
    {
      "speaker": "C",
      "text": "そうよね。全部会社持ちだとぶっちゃけビザの内容とかよくわかんないですよね多分。",
      "start": 441746,
      "end": 448691,
      "timestamp": "07:21"
    },
    {
      "speaker": "B",
      "text": "そうですね。なので、ただその時もイギリスにいた時にヨーロッパのカンファレンスとかに直々行ってて、なんかたどたどしいながら頑張ってプレゼンとかしたりとかしてたんですそこで知り合ったサウンドクラウドにいた人と知り合ってうちの会社エンジニア採用してるけどどう?みたいな話になってそのリファラルがどれくらい効いてるのか分かんないんですけどある程度ポジションがあってビザサポートもしてるよっていうのを直接聞いて応募してるんでそこはそんなに最初からクリアだったって感じ。",
      "start": 448691,
      "end": 493257,
      "timestamp": "07:28"
    },
    {
      "speaker": "C",
      "text": "そういうことですね。あとあれかな、イギリスまだその当時ってEUの一部だった時のイギリスですかね。ってすると横の移動はだいぶしやすかったですよね、おそらく。",
      "start": 493257,
      "end": 505528,
      "timestamp": "08:13"
    },
    {
      "speaker": "B",
      "text": "ただ僕はその社内転席なんで、いわゆるイギリスのビザ事情はあんまり詳しい人はそこまでいないと思うんですけど、いわゆるアメリカのLビザみたいなやつで家内に転籍用のビザでイギリスに行ってるんで基本的に別にそのEUビザっていうわけではなくてそこは割とやり直しです。",
      "start": 505528,
      "end": 526986,
      "timestamp": "08:25"
    },
    {
      "speaker": "C",
      "text": "ねやり直しですよそいつとか。",
      "start": 526986,
      "end": 529487,
      "timestamp": "08:46"
    },
    {
      "speaker": "B",
      "text": "はそういうエンジニア向けのビザブルーカードっていうのがあるんですけどそういうのは多分今はちょっとわかんないですけどそんなに見にくいイメージがなくて割と。",
      "start": 529487,
      "end": 541471,
      "timestamp": "08:49"
    },
    {
      "speaker": "B",
      "text": "分かんないですけど適当なこと言ってもらえますかねでもそうですよね簡単に出るんじゃないかなと思います割とそう。",
      "start": 543927,
      "end": 549130,
      "timestamp": "09:03"
    },
    {
      "speaker": "C",
      "text": "ですねうちもビザ周りでいいんだったらドイツも専門じゃないですけど行った人は結構いてやっぱり唯一はいませんが割とフリーランスとかそういったところでもやっぱりビザが出やすい国でもありますし技術職に関して僕もドイツすごい難しいってイメージはなかったので最近はちょっとあれですが厳しくしようとしていますけどねなるほどというわけでビザ周りの部分も会社がほぼほぼ全部札幌としての移動ができたってことです。",
      "start": 549130,
      "end": 571203,
      "timestamp": "09:09"
    },
    {
      "speaker": "A",
      "text": "ね。",
      "start": 571203,
      "end": 571223,
      "timestamp": "09:31"
    },
    {
      "speaker": "A",
      "text": "ちなみになんかUKもやだなーみたいなとかあのベルリーに行ってみたいなみたいなそういう気持ちはあったんですかなんか今その日本から含めて4カ国目だと思うんですけどなんかその国で選んでるところとかなんかそういうのもあるのかなってちょっと気に。",
      "start": 572846,
      "end": 592004,
      "timestamp": "09:32"
    },
    {
      "speaker": "B",
      "text": "なるんですけどでも性格は間違いなくあって例えばそのモバイルカメラやめてなんかインフラ行ったりするのもそうなんですけどまあ開きやすいみたいなのは間違いなくどっ。",
      "start": 592004,
      "end": 603857,
      "timestamp": "09:52"
    },
    {
      "speaker": "C",
      "text": "かにあると思いますまあ。",
      "start": 603857,
      "end": 605798,
      "timestamp": "10:03"
    },
    {
      "speaker": "B",
      "text": "ちょっと自分も子供二人いるんであんまりもう小学校も行ってるしあんまりこっから移動しまくるイメージはないんですけど少なくともそれまではまあ飽きたらもう他のとこ行ってもいいかなみたいな感じではやってたんでそれはまず一つあるっていうのとあとはやっぱり海外で働いてて、日系の会社でいるし、たてつけ的な出向社員で所属は日本のままだしみたいなってなると、もし自分が海外で仕事を見つけたいってなったら見つけられるのかみたいなのって全然自信はつかないんですよねこのポジションだからここに入れるんだけどもしこの現地で他の会社受けたら入れてくれるのかなみたいなのは疑問に思ってある意味その待遇もしてくれたし多分困ったら日本に帰ったらいいみたいな環境をやらせてもらってたと思うんですけどそれだからこそなんか自分が実はここでできるのかなってイメージがあんまりわからなくてそれだったらヨーロッパで現地で現職してみようっていうふうに思ってなのが最初で、特にその当時のドラマクッカーとかイギリス時代に不満があったってことは全然ない。",
      "start": 605798,
      "end": 696692,
      "timestamp": "10:05"
    },
    {
      "speaker": "A",
      "text": "ちなみになんですけど、言えなかったら全然いいんですけど、日本の企業ってカナダでは結構なんかあんまりお金出してくれないみたいなあれがあるんですけど、そんなことはなかったんですか?あの別に具体的な金額とかは全然いらないんですけど。",
      "start": 696692,
      "end": 712824,
      "timestamp": "11:36"
    },
    {
      "speaker": "B",
      "text": "そんなになんかそうですね、そんななんかすごい良いとか言うわけではないですけどそんなすごいめちゃくちゃ渋いことをされた感じもなくてそうですね、当時だから海外拠点を作るぞってなった時に多分その庁舎とかから来た人とかもチームとかにいて多分その日本上の海外進出の。",
      "start": 712824,
      "end": 740945,
      "timestamp": "11:52"
    },
    {
      "speaker": "B",
      "text": "なんて言うんですかねこう手当とかそういうその設計福利構成の設計とかに関しても多分まあいろいろ言ってくれてた人がいるんじゃないかなと思うんですよねなのですごい有料企業なんかすごい嫌な思いをしたことは本当にないそのめちゃくちゃ高待遇というわけではないですけど普通にあの全然ちゃんと生活できてちょっと。",
      "start": 742619,
      "end": 769108,
      "timestamp": "12:22"
    },
    {
      "speaker": "C",
      "text": "バンクーバーには日系といえばみたいなのがいくつかあってそこら辺の印象があまりよろしくないっていうのがちょっとあるかもしれませんが天下のクックパッド先生ですからさすがにそんなさそんなことはしないでしょそんなこと。",
      "start": 769108,
      "end": 784672,
      "timestamp": "12:49"
    },
    {
      "speaker": "A",
      "text": "はじゃあクックパッドは結構じゃあそこらへんに関しては有料なものだったんです。",
      "start": 784672,
      "end": 791133,
      "timestamp": "13:04"
    },
    {
      "speaker": "B",
      "text": "ねちなみにグレーなことをされたりとかはないっていうのはあの明言し。",
      "start": 791133,
      "end": 795715,
      "timestamp": "13:11"
    },
    {
      "speaker": "C",
      "text": "ておきます間違いないですも朝良い会社ですかねドイツ。",
      "start": 795715,
      "end": 801697,
      "timestamp": "13:15"
    },
    {
      "speaker": "A",
      "text": "からそのカナダに来たみのもじゃあなんだろう秋田のもありなんか会社会用みたいなもありみたいな感じなん。",
      "start": 801697,
      "end": 809601,
      "timestamp": "13:21"
    },
    {
      "speaker": "B",
      "text": "ですかあとでもこれ、こっちの方が割とトラブルキーンだったような気はするんですよねまあ仕事はそこまで不満もなかったんですけどやっぱ生活が結構辛いっていうのもまあそのベルリンよねそうですねまあそうですねその一般化しすぎるのも良くないと思うんですけど当然言語の壁はまずあるんで仕事は100%英語なんだけど生活面でドイツ語を全くできなくて一体不便がないかというとそういうわけではないみたいな生活できるんだけど不便っていう感じですなので結構いろんなとこで不安があることが蓄積されていってトラブル処理も結構難しい人に頼らないといけないケースとかも多かったりとかして、ちょっとずつ日々の生活のストレスも溜まっていくし、さらに子供のことを考えた時に、幼稚園みたいなところはバイリンガルの幼稚園に入れてたんですけど、小学校行きだしたらほぼドイツ語になるし、こういうふうに育てたいっていう希望があるわけでもないんで自分がわからない言語で子供を教育を見ることができないしなみたいなそういう結構現実的な問題もありこれは結構欲しいなって思って巻き込まれには分かれよっていう感じなんですけどまあまあまあ言ってみないとねやっぱり英語圏で海外で生活するのよりはだいぶハードルが高いっていうことがわかったんでまあその多分ストレス体制にもよるんですけど僕はそれはかなりストレスに感じてやっぱり英語研に戻る方がいいなっていうことがまずあってそういうパスがある会社を探してShopifyに入ったって感じです。",
      "start": 809601,
      "end": 937319,
      "timestamp": "13:29"
    },
    {
      "speaker": "C",
      "text": "ね。",
      "start": 937319,
      "end": 937339,
      "timestamp": "15:37"
    },
    {
      "speaker": "C",
      "text": "ありますもんたまに来ますよねベルリンとかいる人とかに話聞いても役所とか行く時は割とガチャってねあのなんか英語全然大丈夫よって人だったらいいけどなんかドイツ語全然ダメだったら何お前みたいな感じで言われることもあるみたいなのもよく聞くのでそうなん。",
      "start": 939297,
      "end": 953332,
      "timestamp": "15:39"
    },
    {
      "speaker": "B",
      "text": "ですが一貫性があればいいんですけど予約もまず予約もなかなかできなくて頑張って予約していて担当者が悪くて控えされるみたいなんとかもうだいぶ心折れるんで間違いないちょっとずつダメージ効いてきてここにあんま長くいるイメージないな。",
      "start": 953332,
      "end": 972500,
      "timestamp": "15:53"
    },
    {
      "speaker": "C",
      "text": "ってなりますねなんかベルリン言ったら英語で全部いけるからええやんみたいなのをよく聞くからですねなかなか生の声聞くとわかんないってこと。",
      "start": 972500,
      "end": 980884,
      "timestamp": "16:12"
    },
    {
      "speaker": "B",
      "text": "ですよね。",
      "start": 980884,
      "end": 981184,
      "timestamp": "16:20"
    },
    {
      "speaker": "A",
      "text": "ほんと。",
      "start": 981184,
      "end": 981344,
      "timestamp": "16:21"
    },
    {
      "speaker": "A",
      "text": "英語圏っていうとカナダ以外もUKに戻るとかっていう手もあったりしたと思うんですけどカナダを選んだのは何か理由があるんです。",
      "start": 983323,
      "end": 990325,
      "timestamp": "16:23"
    },
    {
      "speaker": "B",
      "text": "か?US多分選択肢にそんなに入れなかったのはこれは本当に飽き性なだけで何かもう一回戻るのも変だなと勝手に思って選択肢に入れなかっただけでUSは遠跡するにしてももう1年ここにいないといけないんで。",
      "start": 990325,
      "end": 1009170,
      "timestamp": "16:30"
    },
    {
      "speaker": "B",
      "text": "要はあれですよねそのエルビザとかでラウンだったらこいつにあと少なくとも1年はいてそっから多分転席の交渉とかしてるといつ出れるかわかんないっていう確定要素が大きくて候補から外れてとかってなるとまあ全的にカナダからっていうことになって日本もまぁ一応検討はしたんですけどあんまりいいオファーがなくて。",
      "start": 1010698,
      "end": 1039161,
      "timestamp": "16:50"
    },
    {
      "speaker": "B",
      "text": "その中では一番マッチしたんでショピファイに入って当時はこれ本当にセナさんとかがあると思うんですけど経験にめちゃくちゃ左右されるんで僕が転職活動ショピファイの転職活動をしていたのって2021年とかなんでゼロ金利みたいなののやつの後半の方なんですねなので経営がいいんですよねすごく間違いないポジションもなんかめちゃくちゃあったしビザサポートしますみたいな会社も結構あったんで。",
      "start": 1041060,
      "end": 1086732,
      "timestamp": "17:21"
    },
    {
      "speaker": "C",
      "text": "いやすごかったですよねあの。",
      "start": 1086732,
      "end": 1088553,
      "timestamp": "18:06"
    },
    {
      "speaker": "B",
      "text": "時はこれはタイミングが正直。",
      "start": 1088553,
      "end": 1090954,
      "timestamp": "18:08"
    },
    {
      "speaker": "C",
      "text": "良かったなと思いますあの当時はすごかったですもんね。アマゾンなんかも日本にわざわざリクルインテックブースを、アマゾンカナダが出してたりとか、すごいバブリーな時代だったのね。2021年、本当後半のゼロ金利政策ちょっと始まりそうになって、で、22年からコロナバブルになっての、23年のリセッションまでのこの1、2年ですよね。素晴らしくいい時期だったな。そこの時のタイミングでそうか、転職されたの。",
      "start": 1090954,
      "end": 1118157,
      "timestamp": "18:10"
    },
    {
      "speaker": "B",
      "text": "か、。",
      "start": 1118157,
      "end": 1118287,
      "timestamp": "18:38"
    },
    {
      "speaker": "A",
      "text": "じゃあ。あともう一つ気になったのはそのカナダでえっとショッピファイって確かトロントかどっかにオフィスありますよねその中でトロントバンクまああといわゆるまあよくあるバンクーバーなんかバンクーバーもなんか結構その留学生とかまあ日本人には結構有名ななんてのポピュラーなシティだったあの街だと思うんですけどその中でアルバータなんか真ん中アカルガリーを選んだのはなんかわけがあるんです。",
      "start": 1118287,
      "end": 1146985,
      "timestamp": "18:38"
    },
    {
      "speaker": "B",
      "text": "か。",
      "start": 1146985,
      "end": 1147005,
      "timestamp": "19:06"
    },
    {
      "speaker": "B",
      "text": "お金が一番でかいような気がするのとショピファイに関して言うとバンクーバーとかトロントにいても別にプラスになることはそこまでないんでっていうのも一応本社はおたわにあるんですけど出社基本的にはフルリモートの会社なんで一応オフィス的なものはあるんですけどみんなが頻繁に通ってるっていうよりかはオフサイトしたりするのに使ったりとか本当にたまたま近くに住んでる人で注射した方がかかどるみたいな人がいってるぐらいの感じでチーム単位でこのオフィスにこのメンバーがたくさんいるみたいなとこって全然ないんで正直どこに住んでもあんまり変わらない時差だけですタイムゾーンさえ揃えば何でもいいみたいな感じが正直あって。",
      "start": 1148801,
      "end": 1205850,
      "timestamp": "19:08"
    },
    {
      "speaker": "B",
      "text": "とにかくドイツはベルって決めてたんでカナダ、要は北米時間だったら別にどこでもいいですよみたいな話になってどこでもいいのかみたいなどこでもよくて僕はちょっとその州にUSみたいに州によって給料の調整があるのかどうかみたいな公式の情報は持ってないんでわかんないんですけど多分そんなに大きな調整はないんじゃないかなと思った時にどう見ても家賃むちゃくちゃ高いんであんまメリットないんだったら家賃はまだおかえめでむちゃくちゃ不便ではなさそうなところを選ぼうということになってそうするともうそうです、要はトロント、バンクーバー高すぎるので外しますってなってその次って見ていくと、特にカルワリティ候補に出てくるんで、そういう感じで選びましたそう。",
      "start": 1208099,
      "end": 1273999,
      "timestamp": "20:08"
    },
    {
      "speaker": "A",
      "text": "か、景気は確かにいいけど、あの家賃がめちゃくちゃ上がり始めてた時期でもあったの。",
      "start": 1273999,
      "end": 1279982,
      "timestamp": "21:13"
    },
    {
      "speaker": "C",
      "text": "か、あの時期は確かにあの時期特によね、たぶん、特に差が激しかっ。",
      "start": 1279982,
      "end": 1284484,
      "timestamp": "21:19"
    },
    {
      "speaker": "A",
      "text": "た、たぶんなんかあんまり僕この知識はあんまり持ってないんですけどなんか子育てするとなんかその補助金とかなんかそういう制度も合わせるとあんまりなんか変わらないんじゃないかみたいなのも聞いたことあるんですけどなんかまあでもあんまり気にしないですかね他の他の。",
      "start": 1284484,
      "end": 1304232,
      "timestamp": "21:24"
    },
    {
      "speaker": "B",
      "text": "種のことをねまあそのいろいろ言いますよねまあ例えばこっちだと保険とこれ車の保険が異常に高いんでなんかそれだけでライブやられるんですけどでも家賃も多分10万ぐらいはまだ全然違うんじゃないんですかねちょっとわかんないんです。",
      "start": 1304232,
      "end": 1327680,
      "timestamp": "21:44"
    },
    {
      "speaker": "A",
      "text": "けど確かに保険どのぐらいな。",
      "start": 1327680,
      "end": 1330181,
      "timestamp": "22:07"
    },
    {
      "speaker": "B",
      "text": "んですかただ僕は日本から行ってる人は日本の保険をその無事故歴みたいな引き継いでる人とか多いんであんまりこのトラブルないのかもしれないですけど僕はもう国を転々としてるんで何も証明できなくて今日は免許を初めて運転する人というかわいそうな人だね。それもあってむちゃくちゃ高いんですけどただ本当にまず車多分バンクーバーとかよりもまだもっと車社会なのと。",
      "start": 1330181,
      "end": 1366884,
      "timestamp": "22:10"
    },
    {
      "speaker": "B",
      "text": "天候のせいで多分大きめの事故も多いっていうのもあって僕はだからそうですね、年間まだ30万ぐらい払っ。",
      "start": 1368809,
      "end": 1379260,
      "timestamp": "22:48"
    },
    {
      "speaker": "A",
      "text": "てる僕今20万いかないぐらい払ってるんで確かに。",
      "start": 1379260,
      "end": 1384126,
      "timestamp": "22:59"
    },
    {
      "speaker": "C",
      "text": "アブレディソンくらいのイメージだよ。",
      "start": 1384126,
      "end": 1385407,
      "timestamp": "23:04"
    },
    {
      "speaker": "B",
      "text": "ね。",
      "start": 1385407,
      "end": 1385427,
      "timestamp": "23:05"
    },
    {
      "speaker": "B",
      "text": "あるって感じですねまあそっ。",
      "start": 1388634,
      "end": 1390097,
      "timestamp": "23:08"
    },
    {
      "speaker": "A",
      "text": "かまあ確かに家賃と車の10万とかあったらまあ確かにそれは違うです。",
      "start": 1390097,
      "end": 1396810,
      "timestamp": "23:10"
    },
    {
      "speaker": "B",
      "text": "結構さを出そうねーに関してはそんななんかあるんですかお金めっちゃ出るみたいなのあるんです。",
      "start": 1396810,
      "end": 1402390,
      "timestamp": "23:16"
    },
    {
      "speaker": "A",
      "text": "か?なんかそう結構なんか結構たまに話聞くのはそれこそこの間なんか瀬名さんも言ったんですけどなんかパパ参会みたいなのがあって僕と瀬名さんは全然パパじゃないのに参加させてもらってでなんかそのうちの一人がちょうど言ってたのはなんかその家賃安くてアラバーター移ってみたけど実はなんか子育ての補助金が全然なくてなんかあんまり変わらなかったみたいな人もいるっていう話をなんかポロッとしててああそういうのもあるのかと思って聞いてたんですけど僕はあんまりちょっとその結構でもワンクーバーでいうとなんかその子供に関する補助金はめちゃくちゃ多いみたいなでもそれこそなんか聞いたあのこの間イスさんのポッドキャストとかでももしかしたらちょっと言ってたかもしれないけど1500とか2000円ぐらい出るって言っ。",
      "start": 1402390,
      "end": 1451617,
      "timestamp": "23:22"
    },
    {
      "speaker": "C",
      "text": "てたかなでもほらうちのビジネスパートナーがさあの保育理学とかそういうのでこっち親御さんと一緒に来られる方が多いけどやっぱ補助系の話はしょっちゅうやっぱりトピック出てくるので僕もね詳しいわけじゃないけどバンクーバーは特にその辺まあしっかりしてるよねっていうのはよく聞く話でありますね今度聞いてもいいかもねちょっとあいつら。",
      "start": 1451617,
      "end": 1469782,
      "timestamp": "24:11"
    },
    {
      "speaker": "B",
      "text": "してそうですね気になりますねまあえーとアルバータもあるのはあるはずなんですけど基本インカムベースなんでぶっちゃけテクニック業で働いているとほぼもらえなくなるぐらいの感じのキャップなんで。",
      "start": 1469782,
      "end": 1488656,
      "timestamp": "24:29"
    },
    {
      "speaker": "A",
      "text": "確かにそれで言うとそのエンジニアで結構もらっている人たちでもまあ多分15万20万ぐらいって言ってたんでまあそういう意味で言うと結構じゃあバンクーバーそういう意味ではなんかもらえるのかもねあとはなんかあの日本食ない問題とかアジア人いない問題とかってありませんまあなんかもともと違う国で慣れてたのかもしれないけど多分逆にバンクーバーがレアなのか。",
      "start": 1488656,
      "end": 1512254,
      "timestamp": "24:48"
    },
    {
      "speaker": "B",
      "text": "そこらへんはそれはですね多分日本から来る人にとってバンクーバーほど海外行った時にこうなんて言うんです。",
      "start": 1512254,
      "end": 1525278,
      "timestamp": "25:12"
    },
    {
      "speaker": "A",
      "text": "かね摩擦があるみたいな。",
      "start": 1525278,
      "end": 1526939,
      "timestamp": "25:25"
    },
    {
      "speaker": "B",
      "text": "環境がある国とか場所って他にはないと思うんですけどもうカナダっていう国を見るだけで他の国よりは全然楽っていうか僕だと例えばベルリンにいると移民が多いんだけど移民ってトルコとかロシアとかの国なんで全然違うんです日本人とかあんまりそもそもいないし移民のデモグラフィーが全然違うんでそういう意味ではまず結構居心地が良くないっていうのもあります。住むところにもよると思うんですけど、僕はあんまり日本人とか見ないなみたいな。アジア人も社会主義の名残があるんで、ベトナム人とかぐらいしかいなくて、中国人とか韓国人とか全然いないみたいな感じ。",
      "start": 1526939,
      "end": 1585203,
      "timestamp": "25:26"
    },
    {
      "speaker": "B",
      "text": "カルガリーはバンクーバーに比べるともちろん全然なんですけど、そうは言ってもアジア人めちゃくちゃいますしなんかそのそうですね、保守的みたいなふうに言われますけど、エトロポリタンエリア、エドモントンとカルガリーは結構普通にリベラルな人多いんで、移民もめちゃくちゃ多いし。",
      "start": 1586915,
      "end": 1608872,
      "timestamp": "26:26"
    },
    {
      "speaker": "B",
      "text": "この家の周りも中古風景の人めちゃくちゃいっぱいいるんでなんかそのすごいアウェー感っていうのはなくてむしろなんかアジア人めちゃくちゃいるカルガリーもアジア人めちゃくちゃいるなって僕は来たときに思いましたという。",
      "start": 1610908,
      "end": 1625236,
      "timestamp": "26:50"
    },
    {
      "speaker": "C",
      "text": "ことですよねバンクーバーと比べるとっていう風なのがねよく出てくるけどもやっぱりでもそれでもねカルガリーも含めてアジア比率それなりにやっぱ高いっていうのもあるので片身の狭さみたいなのは確かに。",
      "start": 1625236,
      "end": 1635823,
      "timestamp": "27:05"
    },
    {
      "speaker": "B",
      "text": "ないですよねあんまりないですね全然本当にまあそのめちゃくちゃいい日本食の店があるとかって言われるとまぁそんなことはないと思いますし日本語で最悪日本語でサービス受けられるみたいなのも聞いたことはないんでそこまではないんだけど全然そのアジア系の食品は全然揃うし日本人にこたわらなければアジア系の人もめちゃくちゃたくさんいるっていう感じなんで。",
      "start": 1635823,
      "end": 1661569,
      "timestamp": "27:15"
    },
    {
      "speaker": "B",
      "text": "ここでも他の国に比べるとだいぶあの横置はいいねだ。",
      "start": 1663963,
      "end": 1669768,
      "timestamp": "27:43"
    },
    {
      "speaker": "C",
      "text": "って4カ国知ってる人がねまあ3国が海外だともうそういうふうに言うんだからねまずも相当住みやすいんだろうなっていうだからあれもねその優勢さんのプレゼンがうまいからってのもあるけどさ俺があの背中で1回ガチで軽々に引っ越すか議論が生まれたのがほんと優勢さんの話を聞いた後で3年前くらいかな2年前かな本当にはコストオブリビングだったりとか割と郵政さんが結構こと細かにカルガリーのこと調べていたの。",
      "start": 1669768,
      "end": 1696109,
      "timestamp": "27:49"
    },
    {
      "speaker": "A",
      "text": "話聞いてたから割とガ。",
      "start": 1696109,
      "end": 1698590,
      "timestamp": "28:16"
    },
    {
      "speaker": "C",
      "text": "チでカルガリー行くかってふうに思っていたらその後割とカルガリーのほうもやっぱり家賃というか家の価格も上がってきてっていうのをニュース聞いてたから今どうなのかなってふうに正直思っていたんですけどやっぱり未だにバンクーバーとかと比べると全然安いよねってイメージは引き続きっていうことですよね。",
      "start": 1698590,
      "end": 1714399,
      "timestamp": "28:18"
    },
    {
      "speaker": "B",
      "text": "多分。",
      "start": 1714399,
      "end": 1714559,
      "timestamp": "28:34"
    },
    {
      "speaker": "B",
      "text": "めっちゃ高いイメージがあるんでなんか分かんないですよ40万ぐらい払ってるみたいなその僕だとその3ベッドルームぐらいはまああるといいなっていう感じなんでそれをバンクーバーで中心部だとまあ無理中心部か無理そうっていう感じになってそうすると結構。",
      "start": 1717667,
      "end": 1740461,
      "timestamp": "28:37"
    },
    {
      "speaker": "A",
      "text": "厳しいですねそうね。",
      "start": 1740461,
      "end": 1742463,
      "timestamp": "29:00"
    },
    {
      "speaker": "C",
      "text": "4、5千ドルかなやっぱ。",
      "start": 1742463,
      "end": 1744604,
      "timestamp": "29:02"
    },
    {
      "speaker": "B",
      "text": "それぐらい。",
      "start": 1744604,
      "end": 1745024,
      "timestamp": "29:04"
    },
    {
      "speaker": "B",
      "text": "でさすがにそこまでは払ったくないなーって思ってちょっと離れたところを調べだしていつも言ってるんですけどなんかオキトラムとかなんていうかねなんかそっちの方とかを見出してここでも全然高いなみたいなあーそうなのか南の方にあるなんかラングレーとか。",
      "start": 1746698,
      "end": 1769017,
      "timestamp": "29:06"
    },
    {
      "speaker": "C",
      "text": "ラングレーねーはいはいはいという。",
      "start": 1769017,
      "end": 1770739,
      "timestamp": "29:29"
    },
    {
      "speaker": "B",
      "text": "ところを見出してもうこんだけ遠いんだともうバンクーバーである意味も別になさそうなのでだったらもう全然ほかのとこでもいいや。",
      "start": 1770739,
      "end": 1781925,
      "timestamp": "29:30"
    },
    {
      "speaker": "C",
      "text": "ってなっていっいやー素晴らしいやそうなんですよねだからあの時ほんと軽々にマジで引っ越すかっていうので嫁とも嫁さんともずーっと喋っててまあ結果的にうちはちょっとあのビジネスがやっぱあるからっていうので行かなかったんですが深井。",
      "start": 1781925,
      "end": 1797675,
      "timestamp": "29:41"
    },
    {
      "speaker": "A",
      "text": "でも瀬名さんあんまオフィス行かないから別にゲーム部屋さえあれば生きていけそうだからいいんじゃないかもあるけど樋口何のために。",
      "start": 1797675,
      "end": 1802619,
      "timestamp": "29:57"
    },
    {
      "speaker": "C",
      "text": "家賃かかってるよね会社のまあでもイベントとかやるからなーっていうのがあるからね月に1回バンクーバー来るのも買ったりちゃ買ったりっていう。",
      "start": 1802619,
      "end": 1811587,
      "timestamp": "30:02"
    },
    {
      "speaker": "B",
      "text": "ね。",
      "start": 1811587,
      "end": 1811607,
      "timestamp": "30:11"
    },
    {
      "speaker": "B",
      "text": "ただやっぱりその最悪ローカル僕だって今リモートなんでここでもいいんですけどじゃあ最悪転職しますってなってローカルで要はその僕が引っ越した頃って普通にリモートワーク全然これから増えそうみたいなフェーズで映ってるんでこっち来た時はそんな不安なかったんですけど結局各社RTをやりだしてってなるとリモートの仕事ってそんなにないんでじゃあもし僕は今ここでオフィスに通勤しないといけない仕事を探すってなるとあんまり良いものは多分そこまで。",
      "start": 1813680,
      "end": 1849858,
      "timestamp": "30:13"
    },
    {
      "speaker": "A",
      "text": "ないんですねそうなん。",
      "start": 1849858,
      "end": 1851539,
      "timestamp": "30:49"
    },
    {
      "speaker": "B",
      "text": "ですかね例えば朝なもオフィスがあるっていう風に言いましたしテク各社まあ多分実は結構あると思うんでそういうのがどれくらいヘッドカウントがかかるのかわかんない選択肢にあるっていうのはバンクーバーの強みだ。",
      "start": 1851539,
      "end": 1870636,
      "timestamp": "30:51"
    },
    {
      "speaker": "C",
      "text": "なと思いますそうですよねリモートオフィスの大驚覚みたいなとこですからねShopifyとかGitLabとかそういうリモートの文化がそもそもあったよねっていうのがさらにコロナで緩くというか推奨されたっていうのがあったけど最近リターントオフィスばっかりですからねAmazonフルスッシャーになっちゃっ。",
      "start": 1870636,
      "end": 1889463,
      "timestamp": "31:10"
    },
    {
      "speaker": "A",
      "text": "たしね。",
      "start": 1889463,
      "end": 1889643,
      "timestamp": "31:29"
    },
    {
      "speaker": "A",
      "text": "なんかそれで言うとバンクーバーもまあそんなに多いわけじゃなくて結構朝なの人たちはみんななんか次の会社どこ行こうみたいなバンクーバーから出たくないしでもなんか他にいい会社ないしみたいなの言っててもうだからそこまで考えるとやっぱトロントとか行くしかないみたいな例えばなんかグーグルのオフィスとかなかったりだとかfacebokはあるけどエンジニアではないのかなとかnetflixもなんか聞いたことあるけどエンジニアではないいないしとかって考えるとやっぱそこらへん考えると本当にちょっとトロントのとかねうつるのうつらないといけないのかなみたいなのはあり。",
      "start": 1891546,
      "end": 1929939,
      "timestamp": "31:31"
    },
    {
      "speaker": "C",
      "text": "ますよねうんアンクーバー言ったらもうアマゾンシティやからねもはやそのビッグテクの界隈で言うのであればマイクロ。",
      "start": 1929939,
      "end": 1936844,
      "timestamp": "32:09"
    },
    {
      "speaker": "A",
      "text": "ソフトもありますけどねうーん。",
      "start": 1936844,
      "end": 1939065,
      "timestamp": "32:16"
    },
    {
      "speaker": "C",
      "text": "まあだから本当トロントにねもはやヘッドカウントの数で言うんだったらもうなっちゃうから。",
      "start": 1939065,
      "end": 1943408,
      "timestamp": "32:19"
    },
    {
      "speaker": "A",
      "text": "っすねーじゃあ今後転職するときはまた全然違う街でもいいかなっていうのは。",
      "start": 1943408,
      "end": 1950429,
      "timestamp": "32:23"
    },
    {
      "speaker": "B",
      "text": "あるんですかまあそうねもうそれはもうその時考えようっていう感じであんまりそこまで先読みしてないっていうのが正直な答えですねもう正直まあそうですね今こういう情勢ですから仕事があるんだけありがたいっていう気持ち。",
      "start": 1950429,
      "end": 1972376,
      "timestamp": "32:30"
    },
    {
      "speaker": "A",
      "text": "で。",
      "start": 1972376,
      "end": 1972396,
      "timestamp": "32:52"
    },
    {
      "speaker": "A",
      "text": "その時は全然、カナダ国外も考えようかなっていう感じです。",
      "start": 1975065,
      "end": 1979168,
      "timestamp": "32:55"
    },
    {
      "speaker": "B",
      "text": "か?どうなんですかね。その時に自分がどういうフェーズにあるかっていう方が多いと思うんですけどね。日本に帰ってもいいみたいな選択肢が出てるぐらいの先だったら、そういうことも考えるかもしれないし、そういうフェーズじゃないそれより早い段階で、他の仕事を探さないといけないという状況になったら、カナダに行こうとも、もうちょっと考えてみようかなっていう感じはあるんで、そうですね、それがいつになるかで結構変わってくるかなって気はし。",
      "start": 1979168,
      "end": 2015661,
      "timestamp": "32:59"
    },
    {
      "speaker": "C",
      "text": "ます。そうですよね。ご家族のフェーズもあるでしょうから。",
      "start": 2015661,
      "end": 2018401,
      "timestamp": "33:35"
    },
    {
      "speaker": "A",
      "text": "ね、当然。そうですよね。特にそっちの方がプライオリティ高そう。なんかやっぱ結構、この間そのパパさん会みたいに言ってても、やっぱ子供の教育とか、地理的にとか言語的に動くことでのやっぱそのなんだろうストレスみたいなのってすごい特に子供には大きくかかるから選べる自分で選べるわけでもないですしだからやっぱりなんかそのカナダに1回来たら結構そのカナダで住めようみたいに考えてる人が多そうだなっていうイメージ。",
      "start": 2018401,
      "end": 2047137,
      "timestamp": "33:38"
    },
    {
      "speaker": "C",
      "text": "がありましたねそうよ。",
      "start": 2047137,
      "end": 2049099,
      "timestamp": "34:07"
    },
    {
      "speaker": "B",
      "text": "ね間違いない日本の教育に切り替えれるかどうかっていうところで言うと。",
      "start": 2049099,
      "end": 2055524,
      "timestamp": "34:09"
    },
    {
      "speaker": "B",
      "text": "テッドラインって言うとちょっと言い過ぎですけど今上のグレード4とかなんで次中学受験があるからそこがタイミングなのかみたいなそこを逃したら次はどうなるんだとか考えると正直心の中では耐えるかなと思いつつもなかなかこう上手いことやるのはかなり難しいなっていう現実が今見えてるっていう状況ですタイミング。",
      "start": 2057635,
      "end": 2087038,
      "timestamp": "34:17"
    },
    {
      "speaker": "C",
      "text": "のね合うか合わないかもね含めてちょっと大変ですよねその辺はなんか。",
      "start": 2087038,
      "end": 2092380,
      "timestamp": "34:47"
    },
    {
      "speaker": "A",
      "text": "あのクックパッド時代にクックパッドじゃないかその次かななんか日本からもえっとオファーもらってたのかなとか探したみたいな話されてたと思うんですけどなんか働き方的にはまだ何だろう海外の方が合ってるなまあカナダとかukとかドイツでちょっとは違うかもしれないですけどあのそっちの方が合ってるなって感じですかそれとも全然オファーさえあれば日本でも全然良いオファーさえあれば日本でもいいかなみたいに考えられてるんです。",
      "start": 2092380,
      "end": 2120624,
      "timestamp": "34:52"
    },
    {
      "speaker": "B",
      "text": "かどうなんですかねなんかそんなに僕はあのまあいろんなモチベーションの人がいると思うんですけど僕はその海外の環境その前提として僕はその日本で働いた会社はそんなに環境悪くなかったんで日本の労働環境みたいなのが嫌だみたいなのとかっていうのはそんなにはなくてどっちかっていうと自分の知見を広げたいっていうとで出てきてる感じなので別に戻ることに対してそんなネガティブなイメージはないんですけどまあとはいえ僕なんかはそんなにこう特定のことをめちゃくちゃ深くやってこれた人間じゃないんで海外は外資で働いてるっていうところをレバレッジを利かせないとあんまりいいことはいいポジションはないっていうのも正直あってそういう意味だと日本に帰るにしても外資の方が選択肢があるし、おそらく待遇もいい可能性が高いとかってなってくると、必然的に外資が選択肢にどうしても上位に入ってしまうっていうところがあってそうですね、これは多分お金の話とかにもなって。",
      "start": 2120624,
      "end": 2205239,
      "timestamp": "35:20"
    },
    {
      "speaker": "A",
      "text": "くるんでしょうけどそれでいうとあれですよね、なんかそのさっきのバンクーバーの話に通ずるところだと思うんですけどなんか東京でその中心とかそのオフィスに近くに住みたいでもそんなに狭いところじゃないって思うと僕も何回か考えて日本東京の家賃とか調べたんですけどそれこそ40万とか別そんな大きくなくても2LDKとかかなとかでも40万50万って言っちゃうじゃないですかだからなんかそこら辺は多分こっちで働いてる人みんな思ってるところだけどそれ考えるとしかもそれよりあの日本カナダのバンクーバーとかに比べても全然日本のちょっとエンジニアの給料って安いじゃないですかそれ考えるといいなってきっとみんな思っ。",
      "start": 2205239,
      "end": 2251185,
      "timestamp": "36:45"
    },
    {
      "speaker": "C",
      "text": "てるんだろうね難しいよね。",
      "start": 2251185,
      "end": 2252445,
      "timestamp": "37:31"
    },
    {
      "speaker": "B",
      "text": "そうですねまあ住宅環境は間違いなくありますねこっちの家はまあやっぱ広いのは広いんでなんかまあ子供がいてそのもしあの一人だけとかまあ子供いなければその彼方でもいい感じの今度とかにすんうーんようなタイプの人間だと思うんですけど子供いるとあんまりやっぱ狭いとちゃくちゃ行きがちまっとくリモートワークしてるとさすがに気が散るんでまあそうですねそこそこ広いと見たいとかっ日本もどっ電車通勤とかもう多分できないしなーみたいなやり出した人はいるんでしょうけどそこをできれば避けたいみたいなふうにやっぱ間違いないそうなってくると実はあんまり選択肢ないんです。",
      "start": 2252445,
      "end": 2303659,
      "timestamp": "37:32"
    },
    {
      "speaker": "A",
      "text": "よねまあそうですよねーゆかしですね一緒です本当に。",
      "start": 2303659,
      "end": 2309142,
      "timestamp": "38:23"
    },
    {
      "speaker": "C",
      "text": "あのトガイスさんとねあの何ユーセイさんはそこをちょっと似てるなーって思ってるわトガイスさんの今住んでるとこ。",
      "start": 2309142,
      "end": 2315106,
      "timestamp": "38:29"
    },
    {
      "speaker": "A",
      "text": "やばいっすよ1800度だっけあんたそうですね、まだ1800で住めてて、広さも、ワンベッドルームだけど800スクエアフィートぐらいあるから、でも僕の場合はすごいいい時に引っ越して、たまたまなんですよね、その一番安い時に引っ越して、そこから国の何パーセントまでしか毎年上げられないみたいなのがあって、それで上がり続けてるけどまだ安いみたいなのがあっ。",
      "start": 2315106,
      "end": 2341261,
      "timestamp": "38:35"
    },
    {
      "speaker": "C",
      "text": "て、アパートメントはそこが穴だよねアパートメントってさあのその棟ごとに全部あの家賃あげなくちゃたしかいけないはずであのコンドとかだとね。",
      "start": 2341261,
      "end": 2351327,
      "timestamp": "39:01"
    },
    {
      "speaker": "A",
      "text": "できるんじゃないですかでき。",
      "start": 2351327,
      "end": 2353028,
      "timestamp": "39:11"
    },
    {
      "speaker": "C",
      "text": "ますよあれ本当あのなんかウォーナーが一人しかいないんだったらあの棟ごとに全部数パーセント上げるみたいなことしなくちゃいけないと聞いたことあるけどそのオーナーやから。",
      "start": 2353028,
      "end": 2363155,
      "timestamp": "39:13"
    },
    {
      "speaker": "A",
      "text": "えっといやでもそのルール的にはコンドだとしてもあのアパートメントだとしてもその1年の繰り返しのタイミングでその年に決められたところまでしか上げられないでも抜けるタイミングでは全然上げられはするんであー。",
      "start": 2363155,
      "end": 2377040,
      "timestamp": "39:23"
    },
    {
      "speaker": "C",
      "text": "そうか抜けるタイミングではそう。",
      "start": 2377040,
      "end": 2378742,
      "timestamp": "39:37"
    },
    {
      "speaker": "A",
      "text": "かなるほどねだからあとはなんかその会社がやってるアパートメントだと基本的には会社がやってるんでその会社だとそのその何パーセントって決められたもの以上は上げてこないやっぱその評判だとかとか訴えられるとかリスクみたいなのもあるんでそれが個人だとするとなんかああいやもうあの違う人に自分が住むからとかってなんか適当な理由をつけるとあげられちゃうみたいなのがあるんでそういうのが少ないみたいな意味ではアパート良かっ。",
      "start": 2378742,
      "end": 2409423,
      "timestamp": "39:38"
    },
    {
      "speaker": "C",
      "text": "たりするんですけどそういうわけでちょっとコストブリビングの特に家賃の部分に対してのちょっとアンテナみたいなのがちょっとお二人若干似てるなーって思っ。",
      "start": 2409423,
      "end": 2418647,
      "timestamp": "40:09"
    },
    {
      "speaker": "A",
      "text": "たので確かに素晴らしいいつも最後に、自分のような留学渡航を考える人にアドバイスっていうのを聞いてるんですけど、郵政さんみたいな、海外の出方する人が、今の時期、時代にいるのかっていうの。",
      "start": 2418647,
      "end": 2440367,
      "timestamp": "40:18"
    },
    {
      "speaker": "B",
      "text": "が、なん。",
      "start": 2440367,
      "end": 2441048,
      "timestamp": "40:40"
    },
    {
      "speaker": "A",
      "text": "か、あんまなんか、今ってあるんですか?ぶっちゃけ。クックパッドとか、メルカリとかで、その海外転勤?みたいなの。",
      "start": 2441048,
      "end": 2449776,
      "timestamp": "40:41"
    },
    {
      "speaker": "B",
      "text": "って。もちろんあの事情は知らないんであれですけどまぁあんまりないだろうなっていうのはありますよねそもそも多分テナさんがそれこそ多分詳しいと思いますけどどこも一緒ですからねやっぱ基本的には留学とか就労ビザとかまあ厳しくなっている状況だとは思うんであんまりこうやりやすい環境では今なさそうって。",
      "start": 2449776,
      "end": 2480970,
      "timestamp": "40:49"
    },
    {
      "speaker": "C",
      "text": "いう。",
      "start": 2480970,
      "end": 2481030,
      "timestamp": "41:20"
    },
    {
      "speaker": "C",
      "text": "間違いない、もう確率にだってインターナトランスファーの海外枠だったり外資のなんかこっちに来る枠だったりっていうのも相当減ってるって聞くのでまあビザ事情も含め反グローバリズムな環境に今なりつつは正直あるので難易度上がってますよ。",
      "start": 2482851,
      "end": 2497420,
      "timestamp": "41:22"
    },
    {
      "speaker": "A",
      "text": "ね。",
      "start": 2497420,
      "end": 2497440,
      "timestamp": "41:37"
    },
    {
      "speaker": "A",
      "text": "あとじゃあもう一つだけあのキャリーなんかちょっとキャリアの話にまた戻るんですけど今の会社が多分3年4年ぐらいなのかなもう働いてると思うんですけど今後なんだろうどういうふうにキャリアを進めようみたいなのってありますもちろんなんかさっき言われたようになんか子供のこともあるし家族のこともあるからかなり言おうとかなんかそこら辺で結構変わってくると思うんですけどなんか大まかに自分なんかこういうふうにキャリア進めていきたいなみたいなのってあれば教えていただけます。",
      "start": 2499290,
      "end": 2527422,
      "timestamp": "41:39"
    },
    {
      "speaker": "B",
      "text": "か。",
      "start": 2527422,
      "end": 2527442,
      "timestamp": "42:07"
    },
    {
      "speaker": "B",
      "text": "なんかいいことは言えたらいいなと思ったんですけど本当に今あんまりそういうのなくてまあ本当もうやっぱり前lmで働き方はめちゃくちゃ変わったっていうのもあるんですけどまあ本当に何かゼロベースであのこれからどうしようかなっていう考えているフェーズでもあってうーんまあ一方でなんか具体的なあれはないんですけどなんか全然別のことしたいなと思うようなところもあったりして。",
      "start": 2529600,
      "end": 2556908,
      "timestamp": "42:09"
    },
    {
      "speaker": "B",
      "text": "そうですあんまり今はなるようになれみたいな感じでやってるフェーズ。",
      "start": 2559807,
      "end": 2566311,
      "timestamp": "42:39"
    },
    {
      "speaker": "A",
      "text": "ではあって全然別のことっていうとなんだろうエンジニアとは別のことですかそれともエンジニアの中でまあなんかさっきこの前に話していただいたようにiOSからSREみたいなそういうなんかマイナーチェンジなんですかそれともメジャーチェンジなんですか。",
      "start": 2566311,
      "end": 2582599,
      "timestamp": "42:46"
    },
    {
      "speaker": "B",
      "text": "どうなんですかねまあそのなんかお金を気にしなくても。",
      "start": 2582599,
      "end": 2587482,
      "timestamp": "43:02"
    },
    {
      "speaker": "B",
      "text": "良くなったらやってみたいことみたいなのっていうのはまぁちらほらあるんですけどまぁいつそうなるのかみたいなそういうその時期とふところ事情とかの兼ね合いとかもあるんで今はまだ稼がないといけないっていうところがあってやること決めてるんですけどそれの優先順位がちょっと変わるといいなと思いつつ。",
      "start": 2589841,
      "end": 2618063,
      "timestamp": "43:09"
    },
    {
      "speaker": "B",
      "text": "まあ日々過ごしてるんですけどまぁそんな上手い話もなくまあ頑張って働くかっていう感じ。",
      "start": 2619628,
      "end": 2628250,
      "timestamp": "43:39"
    },
    {
      "speaker": "C",
      "text": "ですねということですね郵政さんのキャリアで見るんだったら正直開発もやってきたしねsreもやってきたし内部の事情も僕が入るその車内向けもね環境も知ってるし開発もしてるして部分だったらワンチャン次例えばわかんないですけどctoだったりとかねなんか僕も思ったね、そこまでも行ってもいいフェーズなんじゃないかなと勝手に思いはしましたけどその辺には興味あんまない感じです。",
      "start": 2628250,
      "end": 2653416,
      "timestamp": "43:48"
    },
    {
      "speaker": "B",
      "text": "か?でもまあそれもさっきの話に多少は近くてじゃあそういうでも僕自身がすごいこういうビジネスがしたいとかっていう別にあるわけじゃないんでじゃあ例えばこのビジネス良さそうだなみたいな自分ができること何あるかなみたいなそういうそのやりたいこととかやった方が良さそうなことっていうのを最優先に考えて仕事を決められるようになればそういうことをやれたらいいなとは正直。",
      "start": 2653416,
      "end": 2682464,
      "timestamp": "44:13"
    },
    {
      "speaker": "C",
      "text": "思っています深井なるほどですねいやでも大変よねトカシさんもだってさっきの朝田の話じゃないけど次のキャリアどうするって言うとバンクーバンもうないじゃんってねなるからじゃあもうCTOかとかもう次会社こすかみたいなね話になっ。",
      "start": 2682464,
      "end": 2697452,
      "timestamp": "44:42"
    },
    {
      "speaker": "A",
      "text": "ちゃうのかなトカシいやいやいや僕とユイセンさんじゃ全然違うんでちょっと隣に並べないでもらってちょっと恥ずかしいですもん深井ちょっとやめろトカシ。",
      "start": 2697452,
      "end": 2706939,
      "timestamp": "44:57"
    },
    {
      "speaker": "C",
      "text": "あそうっすかなるほどねいやでもそうよねカナダの次ショピファイの次とかアサナの次とかってやれるとみんな困るんだろうなーって思いますも正直うーん確かに。",
      "start": 2706939,
      "end": 2719314,
      "timestamp": "45:06"
    },
    {
      "speaker": "B",
      "text": "そうですよねだから何確かにそのそういうそのまあ金銭的なこととか労働環境みたいなことだけをどんどん上げていくみたいなことはもちろん全然顔天井ではあると思うんですけどそこにフォーカスしていくとまあある程度もこれしかないっていうのが決まってくるので、そっちに乗り続けて頑張るのかそうじゃないでも、もちろんその結果的に金銭的なメリットあるともちろん良くはあるんですけどそこだけをバチバチ狙いに行かなくてもいいようになれたらいいなっていうのは正直思う。",
      "start": 2719314,
      "end": 2763986,
      "timestamp": "45:19"
    },
    {
      "speaker": "A",
      "text": "ときはありますねなるほどね。",
      "start": 2763986,
      "end": 2766887,
      "timestamp": "46:03"
    },
    {
      "speaker": "C",
      "text": "調子は分かりますね素晴らしい皆悩んでらっしゃるんですよその辺にはねそんなところですかねそんなところでしょうか僕もだってSREの話だいぶ聞けたのでだいぶちょっとこれからSRE目指してこられる方々には今日の話をちょっと聞いてもらえればなと思って。",
      "start": 2766887,
      "end": 2781705,
      "timestamp": "46:06"
    },
    {
      "speaker": "B",
      "text": "いるので確かにそうですねSREに関してはやっぱりジョブディスクリプション見て本当に今的に結構違う応用件だったりとかビジネスフェーズで本当に違ってくるんで。",
      "start": 2781705,
      "end": 2798178,
      "timestamp": "46:21"
    },
    {
      "speaker": "B",
      "text": "いろいろ試してみるっていうのが正直いいんじゃないかなと思いますただその上である程度そういう意味ではある程度触れ幅を持ってやらないといけないんでめちゃくちゃ盲点があるみたいなのが多分そうした方がいいのかなと思って本当にめちゃくちゃよくあるあれなんですけどじゃあブラウザでこのサイトにアクセスしますみたいなその時に何が起きるかを最初から最後まで説明してくださいみたいなやつをまずやってみるもちろんそういうの特にできる人もいると思うんですけどそういうのがまあなんとなく考えてみてあれあんまりわかんないぞみたいなのがあったらちゃんとこう一個一個通していくなるほどね。",
      "start": 2801417,
      "end": 2852427,
      "timestamp": "46:41"
    },
    {
      "speaker": "B",
      "text": "でキャッシュにどういうレイヤーがあるのかとかDNSどうなってるんだっけとか例えばデータの書き込みがあったらどこでデータの書き込みが起こってるんだっけみたいなとかそういうのを考えるある程度最低限説明できるみたいなところにはまず持っていってインフラ周りで全くなんか分かってないところがあるみたいなところは多分無視した方がいいんじゃないかなと思いますと。",
      "start": 2854257,
      "end": 2885406,
      "timestamp": "47:34"
    },
    {
      "speaker": "C",
      "text": "いうことですねまあ具体的。",
      "start": 2885406,
      "end": 2886787,
      "timestamp": "48:05"
    },
    {
      "speaker": "B",
      "text": "なドバイスをするとそう。",
      "start": 2886787,
      "end": 2888348,
      "timestamp": "48:06"
    },
    {
      "speaker": "C",
      "text": "いうことですねまあだから結構モーラ的にというか本当に開発によりすぎていてもインフラ全然わかりませんだと怖いしインフラばっかりわかってても多分開発全く去ったことありませんはもしかしたら怖いしっていうところですよねネットワークうちの知識ゼロですっていうのは多分怖いだろうしいろんなところのちょっと網羅的にいろいろ興味をちゃんと持ってる人がまあいいのかなと僕は思ったのでそういうアドバイスを少し心がけさせていただければと思いますはいありがとうございます。",
      "start": 2888348,
      "end": 2914205,
      "timestamp": "48:08"
    },
    {
      "speaker": "A",
      "text": "ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2915748,
      "end": 2933867,
      "timestamp": "48:35"
    }
  ],
  "highlight1": "クックパッドの海外事業を始めた時に、ほとんどのウェブ系企業では海外事業が少なかったので、海外で働きたいと考えていた。",
  "highlight2": "日本人の同僚ではなく外国人の同僚が多く、英語を日常的に使える環境に慣れたことで、海外に移るための大きな障壁がなくなった。",
  "highlight3": "現在はShopifyで働いており、カナダに引っ越す際は、家賃が高くないアルバータ州を選んだが、家族の生活環境や子どもの教育などを考えて決めた。"
}