{
  "episodeGuid": "5c4aa922-b6e4-4c6d-9ad7-829f8d6f3456",
  "episodeTitle": "日本のブラック企業からカナダへ渡り10年。IC→EM→ICと渡り歩いたエンジニアのキャリア論（前半）#33",
  "transcribedAt": "2026-02-08T23:40:02.187Z",
  "duration": 3871,
  "fullText": "はい今回は渡辺さんに来ていただきました渡辺さんも僕や瀬名さんと同じくバンクーバーに住んでいて今はシビックテック系のSaaSの会社に勤めてるっていうことで。よろしいですかそうですねシビックテック系ガベッジマネジメントの会社で働い。てますねそしたら最初に簡単に経歴を教えてくださいはい、。経歴2013年くらいにカナダに行きましてこちらで語学学校に通ってカレッジに通ってその後仕事を見つけてこっちで働いてもう10年くらいになります最初にシビックテクの会社に行ってじゃないや、印刷の会社か、印刷系の会社に行ってシビックテクの会社に行ってユニティの会社ユニティっていうゲームの会社に行って戻りという形で今になるという感じですね素晴らしい期間で。言うとセナさんより長い?いやさすがに俺の方が長いよ俺さすがに18年いますよ私それか全然。違ったキャリアがちでキャリアが。つってちなみに俺それ懸念だったらわたるさんのさ一番最初の印刷の会社は多分ジュークボックスですよねですよね割とねあの日本人何人か働いてる人実は知っててあのこっちでなんか特殊印刷とかもね含めて割と有名な印刷の会社さんなのでそんなところで最初のキャリアとしてカナダで始まったってのはちょっとびっくり。しましたけどね実は今どなたか働いてるんですか?日本人いや今はわかんないですねあのちょっと前に多分日本の多分グラフィックデザイナーさんかなんかかな働いててっていうのと一回連絡いただいたことがあったのであー日本人働いてんだーって思って。ちなみに来る前からエンジニアされてたんですか?そうですね、こっちに必ず来る前は日本で5年くらいエンジニアリング、SEですね。SEをやっていて、その前はコンピューターサイエンス系の学校を卒業してますね。あ、。コンピューターサイエンス系の学科なんですね。知らなかった。え、。来る時はえっとフロック使われてきたんですか?それは多分当時当時ないです。ねそう当時なかったんじゃないそもそも10年以上前そうワタルさん来た時多分そんなフロックも大きくなかったですもん。ね多分ないでしょうねうん多分。使ってないと思うで俺もワタルさんのこと知ったのって割とフロックできてちょっと時間いやまあ結構ほんと土俗記の時だったんでそうすると多分使ってないです。ねじゃあ学校とかももう自分で調べて自分で何だろう見つけて入ってみたいな感じなんですか?そうですね、。ある程度のエージェントの方から情報もらってっていう形で学校絞ったりはしましたけどほぼほぼ、当時その情報なかったんだよね。そうですよね。なんかその情報のない中、なんでカナダ、バンクーバーに決めたんですか?最初はほんとただ単に英語を勉強したいっていうところだけだったんですね、モチベーションとしては。別にその先は英語を勉強して、こっちで学校行って、で、まあ転職というか、SEからWeb系っていうのはちょっとシフトチェンジなので、技術を持って帰って日本で働こうかなっていうふうに考えてたので、そんな中、新国にどの国に骨を埋めるかみたいな考え方では得られなかったですね。うーんそういうことですよね俺なんかこれちょっと後で話をするのかもしれないけどなんか割と渡るさんのね日本でのなんか働き方みたいなって結構過酷だったみたいな話を前聞いたことがあった気がするんですけどその辺って別にモチベーションというかあの海外行こうっていうのに関係。はなかったんですかまあその時はその回その会社が悪いと思ってたんですよ社会的な問題ではなくて、その会社だけの問題かなと。まだ若かったんだよね。自分20、20歳から24歳、25歳のあたり。それはなんかブラックみたいな意味ですか?そうですね。よくはなかったですね。まああるあるですよね特に僕も日本で働いた時は製作系の会社だったっていうのもあるんですがまあ俺もまあまあ大変だったもんねやっぱり寝袋を持って家帰ればラッキーみたいな。何回かオフィスで夜を過ごして朝を終わったこと。はありますね僕も結構いっぱいありますねなんか割と渡辺さんに似てるかもしれない僕もそうですねSIA系の会社で始めてなんか延長のプロジェクトは2個ぐらいあってその時はなんか椅子並べて寝るみたいなの結構いっぱいありました。ねありますねほんとにで最終的にはデスクの下には目袋低いなるんだ。よそこまでは至らなかったけどでもなんか僕結構なんか運動部ずっと運動部だったんで体力があったのかあんまりなんかそれが悪いこととも思ってないなんかブラックとも思ってなかったし確かにね残業代もらえるしラッキーってなってましたね僕は確かに、。そんな悪いとは思ってなかったな正直。若かったんだね、体力はあったと思います。同僚と血塗られた残業代といったのが笑ってましたね。ちなみにその当時はプログラミングはできたんですか?なんかSIRって結構いろんな種類というかあるじゃないですか。そうですね、多岐に渡ると思うんですけどもともとコンピュータサイエンス系の学科だったのでプログラミングはもちろんできていましたし会社の入社研修とかでもプログラミングを教えるのがつまらなすぎてですね自分でゲーム作ってたりとか、逆に講師にプログラミングを教えたりとかいうことはし。てましたすごいな、意外と言ってあれかもしれないけどそうか、CSバリバリ出てたかだっ。たんだな、。知らなかったなんかcs出てる人ってなんか割となんかサース系に行くイメージがあったんだけどそういうわけではないんですねでも。渡るさんのキャリアの始まった頃のその十何年前なのかねっていう時ってサースってそもそもそんな一般。的だったのか確かに。ではなかったですね当時はAWSとかそういうのもあったのかななかったのかなっていう話だいたいオンプレですもんねきっとGithubもなかったかなそうっすね。僕の時はサブバージョンでしたね、。ちなみに。僕もサブバージョン使ったことありますね。ほんと?懐かしいな。懐かしいですね。で、カナダに来るっていうのを決めて、英語はその当時どのぐらいから始めたんですか?もともと大学の時に得意だったとかなんですか?それとももう…1からみたい。な。1からですね。日本で仕事をしている間に駅前留学ですね。に通ってて。でも週に1回って全然英語力伸びないんですよね。しゃべる度胸はつくんですけど、英語力は伸びないので。こっちに来た時、TOEICも300何点とかそういう。300何。点?すーごい。な。僕あんまり駅前留学がわかってないんですけど、駅前留学って。どんな?なんかこうプライベートの英会話学校です。ね。じゃあなんか外国の方がいて、なんかネイティブなのかなと話せるみたい。な。1時間話して、まあ今日はこの本、このチャプターをベースに英会話しましょうみたいな、そんな感じ。です。あ、でもそれ、なんかそれでも結構じゃあその喋る努力、喋る度胸みたいなのってつくんです。ね。そうですね。日曜会話とかもするので。あと東京にいたんでミートアップとかもたくさんで、ミートアップで英語喋ってるとかそういうことやってました。ね。ちなみになんかどういう心境の変化でその海外に行こうってなったんですかそのまあもともとじゃあ英語がなんか多分もともと好きとか海外で働きたいみたいなのはあったんです。か?はなかったんですけどまぁエンジニアやってる限り英語って絶対使うじゃないですかうんはいはいはい一時情報ももちろん英語ですしだいたいなのでエラーメッセージ読むにも英語だし英語ですしなのでまぁこれ英語は絶対必要だなっていう危機感とあとまぁ単に日本での仕事が嫌だったっていうのはあります。ね。そうですよ。ね。本当にじゃあ最初はもう1年なんか2年なのかいって、英語もできるようになって、現地での就職経験みたいなのが得られて、日本で活躍できればいいなぐらいの感じで、じゃあ最初は来たって。ことなんですかね。そうですね就職経験までも考えてなくて英語ができてウェブ系の作れるようになったらもっと就職活動楽になるだろうなみたいなこのぐらいの浅い考えできました。ねいやそうよねだって俺も正直ってか10何年前とかフロックみたいなのもなかったし正直俺も現地で就職はうんぬんこんぬんってそもそもイメージすらしげなかったですからねおまけに、やっぱりこう何、英語を勉強するっていうのも今みたいに何だろう、こうなんかオンライン英会話みたいなもそんななかっただろうし、なんか割といろんな、そう、情報が閉ざされてた時代ですよね、そう考える。と。そうですね、オンライン英会話できるほどのバンドビデオですが多分、なかったですね、ネットワークとし。て。なかったっすね、本当に。ビデオ通話が云々とかも。ね、って。いう。フィリピン留学とかも多分なかったですよ。ね。あったんか。な。いや多分僕がそのそれこそ10年前ぐらいに行ったんですよフィリピン留学その時で結構まだ誰も知らないみたいななんか今でこそ結構フィリピン留学ってそのスタンダードになってきてるじゃないですか日本の中ではでも僕があのそれこそそのSARSの会社にいてあのフィリピン留学っていうのがあるらしいってなってそれ行くって決めてそれを行くんであの会社辞めますって言ったらあのフィリピンだからなんか女遊びかみたいなのをなんかおじさんたちに言われてああなんかそういうふうに考えるんだと思ってまあその時僕も全然なんか純粋だったしそういうなんかねなんだろう東南アジアであの女遊びしてくるみたいなのもなんか全然考えたこともなんかまあ全然それも知らなくてなんかああって思ったイメージがあるんでなんで多分その当時フィリピン留学ちょっと流行りかけ流行り始めてきたぐらいな時だったんで多分そういうのもないんでしょう。ね、きっと。当時確か日本円が高かったかな。そんなことないか。な。まあなんか低くはないぐらいです。ね、きっとね。だからカナダに行ってもそんなって感じでした。あとカナダ選んでる理由一個あって、シビックテックの関係のテッドトークを見たんですよ。で、その人がアメリカの方で、カナダがアメリカにしようってなった時に、アメリカはビザが売りにくいっていうのを確かどっかで調べて、じゃあカナダにしようみたいな感じです。ね。そうっすよね。だいたい消費票で最初アメリカから考えて、何かしらでやっぱカナダに。なるって感じですよね。そうです。ね。じゃあもうなんか僕イメージなんですけど渡辺さんといえばシビックテックみたいなあのフロックの中でもイメージがあるんですけどじゃあもう結構その頃からそのシビックテックっていう分野に興味があったん。ですかありましたねその当時は本当に今コード4ジャパンっていう団体が日本にあるんですけどこのコード4ジャパンが発足したのも私が留学する1年前とかという時期で参加したいなと思いつつ、でも留学するからなっていう感じでちなみにCivcTech。って何なんですか?なんか僕もあんまりよくわかってないし、多分聞いてる人たちもあんまりわかんない人が多いのかなと思うんですけど。なんかこう人が集まって政府の抱えている問題を解決しようみたいなのがあって例えばまあ市役所と。か。行政が抱えてる問題ってあるじゃないですか。これやりにくいなとか。この組織たくさんあって大変だなとかって。わからないこともあったりとかするんですけど、それを民間の人たちが変えられるところを変えていこうと。か。それはなんか日本の国としても発足したじゃないですか。なんて言うんだっけあれ、名前忘れちゃっ。た。デジタル。庁?そうそうそう、ああいうものなのかなって思ったんですけど、それはもう民間じゃないといけないです。か?ガブテックと…ガブテックと近所みたいなところはあり。ますよねそうですよね多分一般的に知られてるって言ってあるかもしれないけどだけガバメントテックっていう形でガブテックっていうのはよくあって民間のほうがどっちかというとシビックテックってイメージですよねどちら。かといえばそうですね行政って動きが遅いじゃないですか何決めるのも遅いですしお金もないしっていうところででもじゃあプライベートのところから何ができるかっていうのを探していくのがシビックテックの楽しさかなと思ってます。ねなるほどですよねこれでも今改めて話聞いてそういえばなって思ったのが渡辺さんガブテックには興味なかったんですか民間からやることに意義がある。みたいなガブテックっていう言葉当時なかったですねあなかっ。たのかあそうなん。ですねうんそうかじゃあなんかカテゴリ的にはそのアグリテックだったりとかフィンテックだったりの一つみたいな。多分話なんですよねでもその辺多分バズワードというか自分をクラシファイングするためだけの言葉なんでまあ要は自分の技術を使って誰かを助けてあげたいっていうそういう。のがモチベーションですねなんか代表的なものとかってあるんですかなんだろそのシビックテックの中でなんかうまくいった例みたいなのがあって興味が出始めたん。ですかそれはそうですねそのテッドトークの中でそのシビックテックのプロジェクトをいくつか紹介していてでまぁこういうテクノロジーの使い方があるんだっていうのを知ってなのでまぁこのポッドキャスト多分リンクつけれると思うんで後でテッドトーク。のリンク送っておきますね。ありがとうございます日本とかでもね割とコロナの時とかにアプリ作られたりとかしてましたもんねああいうのも多分CivcTechの多分一員ですよねおそらくそう。ですねまさにその通りですね。素晴らしいそしたら就職活動とかについて聞いていきたいなと思うんですけどちなみに今ってカナダの会社。で何社目なんですか3回目?転職3回目か。な4回目かな4回目かそうよねjukeboxcivctechunitycivctechですもんねそう。ですねどうしよう大体いつも大体なんか1回か2回ぐらいだからあの最新のを聞いてるんですけどなんかあれですよね渡辺さんといえばそのcivctechから確かunityに行ってまた戻って戻りしたのかなっていうのをなんか聞いたことあるんですけどそしたら一社目からなんとなくでいいんですけどそんな多分結構前で覚えてないと思うんですけど最初のなんか就職活動はどんな感じでし。たか一番最初は本当にマスドロップですねレズメを作ってメールで送ってとかリンクとインタープラインしてとかっていうのをひたすら繰り返していて確か80社ぐらいに応募しましたね応募というかメールを送り。ましたねなんか今で言うと結構あの一つのポジションに対してなんか300とか500とかなんかまぁポジションによっては1000とかってくると思うんですけどやっぱその当時からその状況はそんな感じではあったん。ですか一つのポジションに対するいくつ募集といういくつ何人人が行ったか分からないですけどまぁそうですねコンペティティブではあったと思いますしもちろん私は外国人ですしビザも、何でしたっけワーキングプリゼビザか、ワーキングプリゼビザだけだったので結構リスト行くのかディスアドバンテージ。ありましたねじゃあ結構やっぱ送っても帰ってこないみたいなそう。ですね、送っても帰ってこないのがたくさんありませ。んそうよねしかも渡るさんが入ってた彼氏多分バーンアーツですよねそうですねいうそう彼じゃあそこだもコープもなかっただろうから本当には掘り1本だけでねあの収穫されてた。ってことですもんねそうですねラッキーな人はなんかワークビザを入れたんですけど学校からうんあーそうねー。いたがなんかボスぐらいがなんかなんかオフィサーがミスってかなんかでなかでラッキーで出たみたいな。もうそうそうまあなんかそういう話はなんか今でも結構聞きますよねなんか1年のところ2年だとか言うねなんか3年とかなんか聞くからまあそういう人はきっといるんでしょうねそうですねトライするそしたら1社目でワークホリーの後のビザはなんかもらえたみたいな感じになる。んですかそれがそうじゃなくてですね1社目のとこにはもちろん交渉したんですよワークホリーでしかないからその後のワークビザ出してくださいってもちろん足元見られてですね最低というかクラリファイス最低限の給料でここからここまで働いてくださいみたいな感じのことを言われていて言ってましたねなので最初の企業に打診はしてプロセスは始まっておいたんですけれどもちょうどその時ヘッドハンティングしていただきまして2。社。目にいやまあ結局そのワークビザは2社目から出ましたねいやで。も良かったですよね実際だってあの当時一番ひどかったんじゃないかなそのなんかワークビザを要するに出してあげるからむちゃくちゃ足元見てきて最低賃金ギリギリみたいなので会社によってはね渡したお金をちょっとキャッシュバックするみたいなこともやってましたからね会社で。そうですねジョークロフトはもうその典型ですよ外国人いっぱい。雇ってやっぱそうなんすね会社名出してよかったんやろかやってるからねまあやってるとこ多いですよね多かったからね当時は。ね特にそうですねなんかヘッドハンティングってワードってなんかなかなかこっちらは聞かないなぁと思うんですけどそれはどういう経緯でそのヘッドハンティングし。てもらったんですかそれを確か1社目働き始めてすぐなんたりですかねミートアップに出ていてそのミートアップで知り合ったCTOの人と仲良くなりましてその時は何もなかったんですけどその後数ヶ月かな数ヶ月後にうちで働かないって声かけて。もらってそのヘッドハンティングは何だろう普通の面接のプロセスを経て結局就職することに。なったんですか面接してないですね面接らしいこと。はしてないですねその数ヶ月の後に何かやりとりがあったりとかそのミートアップで出会った時に結構なんか話したとかなんですかなんかどういう全然ヘッドハンティングのイメージがわから。なくて確かに何ですかねミートアップで会ってでその後何回かやりとりして行き届をしてで今その時は採用してたんですよその人と会った時にでうちで働かないってなったんですけどその採用区が埋まっちゃってごめんね埋まっちゃったねーって言ってまた今度でもキープインタッチしてましょうって今しばらく落とすことなかったんですけどポジション空き家で空き家でというかもっと働く人が欲しいからっていう。感じで聞けば聞くほど結構僕のキャリアと似てるなと思ってsirのところも一緒だし僕も適当に学校が始まる前にミートアップ行ってそのレジュメ出して意気投合してでその時にプロセス進んだけどクローズしちゃってキープインタッチしましょうって言って僕その1年後にオファーもらったんですけどめちゃくちゃ似てるな。と思います似てるですね。そうですね似てるね東橋さんはでもあれだよね本当渡航して1か月目くらい確かワープライズして。たよねあそこにそうですねなんか暇だったのかな暇だったのかわかんないけどそうなんかミートアップとりあえず時間あるし行けるところは行っとこうみたいな感じでそしたらなんかなんでなのかわかんないけどその場で行き渡航してなので連絡取ってみたいな感じでし。たね素晴らしいちなみに俺も渡辺さんにはそれは聞いてみたかったんですけどMetupで生きとおうってやっぱりCivcTechの話で盛り上がってとかドメイン知識が結構共通点が多くてとかそういう意味で盛り上がったんですか。そういやそうですね興味の一致で盛り上がったっていうところが大きいですね面知識はまだまだなかったんですけど自分の情熱を伝えてそこで話し込んでっていうのはあり。ましたねじゃあもうそこがすでにシビックテックの会社で今もその会社に戻ってき。ているんですよねまあ。そういう感じですねちなみにユニティから帰ってきた時には面接はあったん。ですか軽い面接する相手全員。知ってたんでなさっすよね間違いない出戻りの楽。なとこ出てくるみたいな感じで結局雑談して形だけの面接やりましたね。なるほどいや素晴らしいじゃあそうよねだから最初のCivcTechのところはやっぱりMetupだからMetupも多分あれですよねCivcTech関連のMetupだったってことですよね議題がそうですねそういうなんかこれが好きだ。よねっていうのが一。個あったりするとやっぱその次繋がりやすいとかあります。よねありますね興味の話で盛り上がるのは結構周活に役に立つんじゃないかなと思いますね。確かになんかその面接とかでも1回盛り上げられるといいですよねなんかそのそれだけですごい次へのつながりが全然違う気がするなんかそのちゃんと正しいこと言ってちゃんと受け答えできててもなんかそのやっぱ印象に持ってもらうっていうのってめっちゃ大切だから確かにそこらへんのなんか興味の一致があるのはめちゃくちゃ大切なのかなと思いますね。でも就活的な意味で言うんだったらやっぱり一社目の部分そこは印刷の会社があってそんなあとヘッドハントがあって今のシビックテックのとこに一旦入って右翼曲折多分あったんだろうなっていうふうに思いながら次ユニティっていういきなりしかもエンジニアリングマネージャーっていうことでマネージメントポジションのほうへ移ったんです。よねそういやICで就職はしたんですけどそうか最初の就職はICかそう最初の就職はICでUnity入ってその後で自分のいたところのマネージャーが抜けて仮のマネージャーやってくれないかっていうことを頼まれてやってたって。感じですねすごいねちなみにこれも改めての部分かもしれませんがなんでまたUnityに転職しようと思った。んですかそういえばその当時はそのシビックテックの会社で結構長い、6、7年働いてたんですけどもあ、そんな長かったんだうん、すごい長いですよね多分、北米のスタンダードでは長いほどだと思うんですよ6、7年間間違いないうん、でまぁその中で自分の技術に自信が持てなくなったんですね自信が持てなくなったっていうのは何かっていうとまぁ6、7年もあれば学ぶこと全部学ぶじゃないですか間違いないですね自分の技術が伸びなくなってきたっていうところに危機感を持って他のエンジニアのレベルも分からないですしこの後自分の市場価値ってどうなってくんだっていうところでたまたまこれもユニティのリクルーターの方からメッセージもらっててリンクトですね受けてみないかっていうことで受けてみたんですねそしたら通ったみたいな。うんそのなんかなんだろそれはじゃあその時はえっとunityの時はなんだろ全く普通のなんだろうヘッドハンティングみたいな感じではなくてもうなんか面接があってみたいななんかいわゆるこっちの流れみたいな。のあったんですかそうですね普通の面接プロセスはやってますね。なるほどね、ちなみに多分視聴者の方もね、気になってる分だと思うんですけどやっぱりその最初のシビックデックの時が人数結構少なかったんです。よね多分入った当初は10人目とかで始まって、でも出た時には40人くらいいた。かなC50人ぐらいみたいな40人か数十人にな規模になってっていうやっぱりその規模感的な部分でもねユニティなんて言ったらもう誰もが知る大企業っていうのがねあるかなと思うんですけどやっぱりその大企業に対する挑戦みたいなのもさっきの技術的な習得と同じくらいやっぱりあったんすかそのモチベーションとして環境を変えるっていう。にはそうですね他がどんなことをしているか知りたいしその大企業って多分その企業に入る前大企業に入る前ってなんかこの人たちみんなスーパーエンジニアだ。って思うじゃないですか思ってます思ってましたね。みんな思ってるだからスーパーエンジニアの人たちから学ぶところがたくさんあるからビジネスはさておきそういうスーパーエンジニアの人たちと一緒に働きたいなっていうところで応募しましたね。ちなみになんですけど結構そのシビックテックに熱意があって他の会社とかはバンクーバーもしくはカナダではないないんですかシビックテックの業界。ありますありますありますカバメント系の仕事がいっぱいあるんですけど採用がそんなにないっていうのとまあ数が少ないんで会社も小さいです。しじゃあそっち考えるっていうよりはそんな募集もないしなんかその時ちょうどよくユニティのユニティの人にも誘われてたしみたいなのが。あったってことですねそうですね、そういうもんですねあと当時パンデミックの直前だったのかなだかで採用がどこの会社もガツガツやっ。てたんですよね確かに、それこそ僕も多分僕が一社目の時なのかなそこら辺。が大体あ、パンデミック始まってたかもしれないですね。はい。2020年。入社も簡単でし。たね。19年とか20年です。かね。19年。とか。20年。かな。20年。20年、そうね。20年だからそうよね。前半、本当に3、4月くらいから多分パンデミックそろそろやばくね?みたいな感じだったと思うから、まあ多分その辺です。よね。確かにあの時期は結構盛んだったみたいですよね。なんか後から。振り返ると。間違いない。19年あたりで一発ドーンって来てて、20年になってコロナになってむちゃくちゃ縮小傾向になり、どこの会社も全部クローズして、21年後半か22年くらいからコロナバブル来て。またバーンって来たっていう感じでし。たね。ちなみにそのなんかやっぱそのスーパーエンジニアがいるんじゃないかと思ってそのユニティに働いてみて割となんか1年9ヶ月なのかな働いてると思うんですけどそこがなんか短かったのは全然こいつらスーパーエンジニアじゃないじゃんって思ったんですかそれともなんかやっぱりシビックテクナーみたいになったのかなんかそこら辺のちょっと理由についても聞いてきたいなと思うん。ですけどどっちもですねその会社のブランドにビビってたっていうのはあります正直入ってみて働いてみたらなんだこいつらってなるほど。どうなんだとはいえ僕もあの小さい会社から小さめの会社から中くらいの会社を経て今は割と大きめの会社にいさせてもらってるんですけどとはいえ結構やっぱスーパーエンジニアというかすごい人たちは多いなっていう印象があるんですけどそこらへんはどうでした。ラッキーですねラッキー。ですね、たまたまあなたはラッキーの。だけですよ自分の言った部分が良くなかったかもしれないですそれは分かんないですよねこれ決してユニティっていう会社をけなすわけではないですしユニティジャポンの方たちは全然自分とは関係ない部署なんですけど彼らはもう確実にスーパーエンジニアだなっていう人たちも何人かお話しさせていただいてましたしっていうのはあるんですけど、まあ自分の部門はそんなに大したことなくてです。ねまあ時期によって。も変わりますしねきっとそうですね時期によっても変わると思うんですけど、まあでもそれもいい経験だなって今なって思うんですよねその前のシビックテクの会社にもう6年7年いて多分自分のキャリア的にもジュニアからシニアっていうところまで行ってたと思うんですけど他のエンジニアたちはほぼほぼみんなずっとシニアの人たちだったんで自分とそのシニアの人たち比べるじゃないですかはいはい確かにってなったらずっと追いつかないわけですよなのでまぁその社内の感覚的ではなんか自分インターミディエイトぐらいかなぐらいの感じでユニティ行ってみたらなんか俺も全然死ぬや。じゃんみたいな自分の立ち位置。を確認できたというそうですねそういうのありまし。たねこれちょっとでも俺二人にも聞いてみたいんだよなそれ東海オンエアさんの言っていたところのその朝にねじゃあ入ってっていうので多分スーパーエンジニアが何人かいらっしゃってで多分そのスーパーだって思う習慣が多分あるはずで多分渡るさんのねやっぱ行かれてっていうたまたま部署がねちょっとあかんかったかもしれないけどでもちょっと周りのレーベルがやっぱりそこまでじゃないなっていうふうに思うタイミング多分あるはずでなんかお互いがお互いがなんかどの辺をなんか判断記事に挙げてたのかな行動の書き方なのか人人間関係なのか仕事の進め方なのかって。ちょっとそう気になったん。ですがえっと僕はあのまあでもいろんなタイプですごいなっていう人がいるんですけどあのスタッフって呼ばれる人たちは漏れなく何かがすごいなっていうのが今のところの僕の印象です僕みたいなICエンジニアはだいたいそのスタッフレベルの人たちまでとまあ自分のEMまあ自分のスキップマネージャーぐらいまでは絡むんですけどそうですよねそのスタッフって呼ばれている人たちはまあコードの読むのが早かったりだとかインタビューを一緒にまあなんかやったりするんですけどその中でえっとすごい僕がなんだろう見てるところとなんか違う次元でも話せてるとかあのまあコードリーディングがめちゃくちゃすごい早かったりだとかなんだろう設計の速さだったり判断だったりその深さだったりとかも全然違うなっていうのがありつつ逆の例で言うとああそうでもないなっていう人たちも確かにいたりはするんですけどちゃんとあのクビになってるというかちゃんとなってたりするんでまあもちろんねチームによってとか僕が全員見れてるわけじゃないですけどまあ僕は割とあのチームもこの今もうすぐ2年とかなんですけど中でチーム移動したりだとかあのオンコールウェブのオンコールチームに入ってたりで結構いろんな人と話したりだとかあの割とワイドに見れてると思うんですけど結構そうですね僕が見た中ではちゃんとすごい人はちゃんとすごいしあそうでもないなーって人ちゃんとなんかクビになってるイメージがあるなっていうそういう意味ではすごいラッキーだったの。かもしれないですね確かになるほどねオトロさんは逆に期待してた期待値の部分とっていうところの差はさすがにあったんじゃないかなと思うんですけど具体的に何を期待してらっしゃったと。かありますもうちょっとちゃんとしたアーキテクチャーとかちゃんとしたコードとかっていうのを期待はしてたんですよ入ってみたらアーキテクチャーはそんなにちゃんとしてなくて今コードメンテナンスもなんかすごい秘伝のタレを継ぎ足すような感じのでまぁガッカリしたの結構大きいですね今コードの規模もそんなに大きい規模じゃなかったんですけど大きい規模じゃなかったからか結構早く早めにキャッチアップができたんですよねどうやって動いてるか何が動いてるかっていうのがあるんですけどそこからものを作るまでのステップが遅かったり。だったりとか大平なるほどね本流から外れてたからって可能性はありますUnityっつったらそれはもちろんエンジンが有名でっていうのがありますけど渡辺さんが多分言いちゃったポジションってそのパブリッシャー側。のほうですかね渡辺広告。周りだったんですよ大平。広告周りか渡辺うんなのでお金を作る部門だったので、部門的なインパクトは大きいはずです。よね。そう。よね、。確かに。あんまり部門がちょっとハズレだったっていうよりも、もしかしたらそういうところにあんまりお金をかけられていなかったのか、採用する人たちがちょっとあかんかったのか、なんかあったってことです。よね、たぶんね。なんでしょうね。きっとまあ古い構図でも良しとする文化があったのかもしれない。ですし。まあなんかあとはなんかそのもともとシビックテックの会社で働いて、一緒に働いてた人たちのレベルがそもそも基準値として高かったっていう可能性もあります。よね。それもあり。ますね。まあ今その経験を経ててやっぱり戻ってきたいと思えるってね、戻ってきてるわけだからまあなんかその僕まあ今までの会社で戻るかって言ったら戻りはしないなって感じなんでその行動のレベルとかも考えてもだからやっぱそこの多分元のなんかあれの高さみたいなのはあったのかなっていう。感じですね深井確かにねそれもちょっと聞いてみたいですね渡辺さんは一回自分のフィビテックの会社で大きい会社出て外からやっぱり自分の今までいた会社を外から見れたわけじゃないですかやっぱレベル高かったなっていうふうに思った人とかもしくは技術だったりと。かがあったってことですかそうですねレベル高かったなってリーダーシップも含めてですけど仕事のやり方もっとちゃんとしてたなっていうのもありますしもっと良かったなっていうのもあります。ねなるほどねなんかタイキーを。言ったらもっとタイキーだって言ってたよごめんなさいCivcTechの会社の方も古いコードはそのままだったりとかするんですけれどもそれでも何だろうベストプラクティスは踏んでいたりだとかコミュニケーションもちゃんとしてたりだとか透明性が高いっていう性格はありましたねなるほど。ねなんか大きい会社に行けば行くほどやっぱり体系立てられたねアーキテクチャーもそうだし設計もそうだし人の動かし方もそうだしっていうのはもっと体系立てててすごく感動するものなのかなって思ったらそうではなかった。ですもんねそうですね大きい会社は多分もっとステージが上手くならないとステップアップできないとかっていうところはあったりするかもしれないです。ね本当にまあ大きい会社って言っても会社に寄りきりですよねそうですよね本当になんか僕がその開発とかで思うのは本当に何だろうちゃんとあの古いコードはもちろんいっぱいもう10年選手とかなんでコード自体ももう10年以上なのかななんであれですけど古いコードは全然あるけどそれにでもやっぱなんかアップデートちゃんとされてるし割と綺麗になっているなっていう印象だしなんかやりたいこと新しいことやるときになんかその探すとちゃんとあのドキュメントだったりとか人だったりでちゃんとなんかえっと今までのなんか範例みたいなのがあってそれにのっとってそれがちゃんとフレームワークみたいになってて使うだけで新しいものができるみたいなのが結構あって僕はそこらへんにはすごい満足しててまあそういう意味でもまだまだちょっと今の場所で学べるかなみたいなの。はあるんで素晴らしいなるほどねまあ会社による部署によるってことですね結局そう。ですね本当にはいちなみになんですけどあのEMに7ヶ月かなUnityではICをやられた後にエンジニアリングマネージャーに移動されてると思うんですけど移動っていうかポジションチェンジなのかな役職チェンジなのかな。してみてどうでした比較的簡単でしたねっていうの簡単って言うとあれなんですけど誘われたからやってみるやってみたって言うだけなんですよねエンジニアリングマネージャーっていうポジションがあるけどやってみない?いいよっていうそのぐらいの本当に軽いノリなのでそんなに認めたしなかったけどやってみてよかったたのはもっとビジネスのことを知れたっていうことプロダクトマネージャーともっと密接に一緒に仕事をすることができたっていうのは一つの大きな財産かなと思いますねまあネガティブな理由で8エンジンicからマネージャーになったっていうのはもうこのコードベース見たくなかった。っていうのはああそうなんだちなみになんかあのエンジニアリングマネージャーって言っても結構そのどのぐらいその自分も作業するかとかって違ってくるじゃないですかもう本当に行動は全く見ないもうピーポーマネジメントに徹したっていう。感じなんですかコードを書く時間自分から書く時間はなかったですねコードレビューする時間とメンタリングする時間だとか資料を詰めたりだとかプロダクトとかクロスチームのコミュニケーションするとかそういうところのほうが大きかったですね。三宅わたるさんのエンジニアマネージャーして実際管理というかマネジメントするエンジニアの方々ってどのくらいの人数いるものなんです。かちなみにこのチームは4。人いました4人かなるほどね東海オンエアさんとかもそれあるでしょ大体。そんなもんエンジニアは1人の。EMに作っていただくかも。しれないけどうちは小さかったらいくらでも小さい出来立てのチームとかあるんであれなんですけど基本的には4人から8人エンジニアが。いるかなそうなんだ。なるほどねそうですね何十。人とかそんな規模でやっぱり管理する人とかもいたりするのかなと思ったけどそんなことはないん。ですねそうするとなんか多段階的になって多分あのグループみたいなのができるのかなと思いますそうかそうかなんか僕もこの頃やっぱちょっとなんだろうな年数とかも上がってきて結構そのマネジメントとかは全然しないもちろんしないですけどプロジェクトリードだったりとかあのメンタリングとかをやる機会が多くなってきてちょっと困ってるというかなんか僕どこまで行ってもやっぱなんか日本の文化で育ってきてなんかマイクロマネジメントをしてしまう自分がいて困ってるんですけどそこらへんなんかこっちの人ってすごいなんだろうなんかマイクロマネジメントをしないじゃないですかそこらへんのなんか違いとかには困ったりしなかった。ですか困ったことはないですねマイクロマネジメント自分も好きじゃなかったんで多分それ性格の話かもしれないですね日本ではマイクロマネジメントされてましたけどそれは好きじゃ。なかったですその僕も好きじゃないししないように気をつけてはいるんですけどその視点としてマイクロマネジメントしかされて日本ではねされてこなかったんでそういう視点があってあの気を抜くとそういう視点に戻ってしまうなみたいなのがあって多分まあ言動とかまでにはそれが出てないとは思いたいんですけどそのそこらへんをなんかのマネジメントって難しいなあって僕の的にはちょっと思って。てそこらへんは的な行動に移ってしまうタイミングってちなみにどういうときなん。ですか?イメージは行動っていうかそのなんかエクスペクテーション期待をしてしまう相手に対してこういうふうにした方がいいよねなんかその何か目標みたいなものがあってそれに対してその人が足りてなくてここをこうしたらいいよねみたいなのを言ってしまいそうになるとかとかなんだろうなその人を良さを生かすような動きをできればいいんだけどそのプロジェクトのゴールに対してこうで僕はこういうふうなことをしてるからこの人にはこういう動きをしてもらいたいだとかなんだろうその期待から入ってしまうなんかその100点っていうものがあってその人がなんか100点にどこまで近づけるかみたいな見方をしてしまってるなっていうなる。ほどねそれはインテント、自分の意図を最初に伝えられてないから多分起きると思うんですよねマイクロマネジメントって多分つい口出したくなっちゃうというか、そういう瞬間があると思うんですけどその口出したことによってそのプロセスが変わるかどうかっていうのを打ち出す前に考えたりとか大変もしなんかこの人の向かっている先が違うなって思ったらもう一回そこで立ち止まって自分はこのコミュニケーションで合っていたのかっていうところを見返してつなげていくって形にしてますねマイクロマネジメントは多分信頼を作るところから始まると思うんですよ信頼関係が十分にあればマイクロマネジメントはすることはないかなって思って。ますし確かに僕の中ではまだ全然なんでその経験もないし別になんかなってしまいそうだなっていうまあ思ってる段階であってまだなんか全然そこまで行ってないしまあ全然あのまだまだEMになるっていう予定もないのでいいのかなと思いつつなんか自分は人をそういう視点で見てるなっていうのをずっと思っててなんかそのなんだろうな、EMになる時に勉強というかなんか自発的に何かしたものはあるんですか?もしくは何かユニティの中でそういうプログラムがあっ。たりだとかないですね、なかったです何か覚えてはないですねまあもともとなんですかね、リーダーシップというかリードしていくのが好きだったっていうのもありますし、そういうのは性格によるものだとは思うんですけど、ピックアップゲームとピックアップファイトその喧嘩を買うのか売るのか、その必要があるのか、そこまで気にならなかったらそこは別に無視してもいいだろうっていうそういう考えはやりますね。なるほどね性格なのかなぁなんか確かに渡辺さんはなんかうまくやりそうな感じしますもんね僕はうまくやらなそうなまあ僕もともとあんまりチームプレイが得意ではないのかもしれないからまあでもそれの頑張る一つというかそれを学ぶ一つとしてちょっとフォトキャストのインタビューをやらせて。もらってたりするのでマイクロマネージメントできるっていうことはね他の人はよく見れてるってことなんでねそれ。はそれでいいですよね。そういうことやっぱりそういうこと言えるのが多分EM向きなのかな向き不向きわかんない。ですけど俺はマイクロマネジメント自体がなんかむちゃくちゃ悪いものってイメージあんまないんだよな正直なんか確かにこっちの人たちってマイクロマネジメント嫌うよねっていうのはあるけど渡辺さんのようになんだろうなあの割とその100点満点っていう部分に対してみんなが向かってくれてるだろうなっていう信頼関係を築くだから見なくても100点満点の方向にきっと進んでくれているだろうっていうふうに信頼する基盤をまずは築くっていうやり方も当然あるだろうし一緒に2人3局でそいつのことを1から10枚ちゃんと見といてその人が本当に困ったらただ意図はちゃんと伝えといてってことですよね自分はこういうふうな形のゴールを目指してるからみたいなそれはそれで一つの指導方法なんじゃないかなって気がし。ますけどねなんかちょっと僕の相談会みたいになっちゃってそっから打って変わって次の会社出戻りですけどではEMっていうのをやらなかったわけだと思うんですけどそれは何か理由があるんですかEMもうや。だってなったんですかEMもうやだっていうのは特に無かったんですけど出戻った時のポジション募集がスタッフだったっていうのが1つありましたねICだったっていうのはありますしあとまぁ1回マネジメントやるともうそのマネジメントのスキルって残るじゃないですか自分のスキルの中になんでまぁいつEMやってもまぁ問題ないだろうっていう自信はつきますし逆にそのICってどんどんテクノロジーって遷移するじゃないですか新しいものが出てくるのでまぁそういうところのキャッチアップはずっと続けていきたいなっていういうのはありましたねあともう一個の理由はその当時ユニティを離れるちょっと前からこのレイオフが今もその当時レイオフすごい多かったんですよ今もいて多いんですけど今もアマゾンすごいことになってますけどねうんまあそうですねでまぁマネジメントやる側からすると誰かをレイオフしなきゃいけない時が来るわけじゃない。ですか?そうです。よね。それは間違いない。それやりたいかって言ったらやりたくないんですよね。うん、間違いない。自分の意思じゃないけどレイオフしなきゃ。いけない。そうです。よね。そうです。やりたくなかったんで、まあ気が楽になったってのあり。ますね。なるほどなああんまりなんかそうかフロックの中でデモ取りっていうのをそもそも経験した人っていないんじゃ。ないかなそもそもまあEMまで行ってる人があんまりいないんじゃないかなっていうのはありますよね確かにそうかもスタッフとかはまあちょこちょこはちょこちょことかまあ一人二人ぐらいは知ってるけど周りだとそうですねでもなんかこのこの何回かあの結構その僕よりも年上の方に撮らせてもらってあのお願いしてるんですけどすごいなんか勉強になりますよね本当にそこらへんのやっぱレベルの人たちがあんまり周りにいないと思うんでそうですよね、デモ撮りみたいな経験。も含めていやそうそうだから先陣切ってくれてるねーの渡るさんたちには本当感謝しかないっていうのはあるんですがそれもちょっと含めてやっぱりデモ撮りっていう感覚というかなんかやっぱりそのなんだろうなやっぱりこっちのこの出戻り文化みたいなの聞くっちゃ聞くじゃないですか元いた会社に戻ったんだみたいな割と結構ウエルカムなもんなんですか1回抜けて何年かいなくなっててチームの構成なんかも変わってるだろうしキャッチアップすることも多いだろうし足手元にならないかなとかっていう不安も正直あったりするのかなとか割とどんな気分なのかみたいな。全体的に聞いてみなくてどうでしょうねそのデモ取ってきた人が入ってくる分にウェルカムだと思いますよもうコードベース知ってるしビジネスも知ってる人だしまあそうか確かにオンボーディングすごい簡単になるでしょう。しなんか辞める時に悪い気持ち、お互いに悪い気持ちにさせない辞め方ができるのが多いのかなみたいな日本でもそういう会社いっぱいあるとは思うんだけどなんか辞めるって言うとなんかその長期雇用、生涯雇用みたいなのの中でなんかなんで辞めんだよみたいなイメージが日本にはちょっとありますもんねあるよね、就寝雇用的なやつよね就寝雇用、それだ、それだそのイメージが。俺もちょっと引いててもう辞めるってなったら次のとこでも頑張ってねみたいな。うんそのくらいですよねですよねなんだろうなやっぱりどうしても俺もその終身雇用的なイメージっていうのがちょっと頭にへばりついてるとこがやっぱあってやめるっていうのがすごくもう心なんか後ろ指さされていてなんかもう1回出て行ったら戻れないみたいなそんな感覚ないですよねこっちの人たち。ってそういえばこっち多分こっちというかITのインダストリーにもよるのかもしれないんですけど転職が当たり前じゃないですかそうですねある人が転職することによってその人ともともと働いていた人たちがその人の移動した先の人とコネクションができるかもしれないその人の移動した先で就職先は見つかるかもしれないっていうチャンスがあるので確かに転職に関してはネットワーク広げるっていうぐらいの感覚で多分周りの。人も思ってると思うそうなんですよね、理屈で言えばわかるんですけどね、なんか間違いなくその転職される、もしくはするっていう人たちがいる中でその可能性を広げるっていう側面が間違いなくあるっていうのは理屈ではわかるんだけどなんかどっかで引っかかってるっていうのはやっぱり日本文化は俺も染まっちゃってるの。かなっていう確かに難しいですねちょっと戻ってそのじゃあunityの時にそのEMに変わってから今またICに戻って今のじゃあ気持ち的にはまだその自分がどっちで行くかは決めてないみたいなイメージなんですか。決める必要はあるんですか。ねっていうところではいやそうだと思うんですけどなんだろうさっき言われてたように多分EMに行ってそのコードを書かないでキャッチアップができなくなるとその決まっちゃうみたいなのはあるじゃないですかでなんか多分やっぱその人によりこっちが得意だなとかってあると思うんですよあのコードのキャッチアップってそのなんていうのキャッチアップはまずコードじゃないかえっとなんて言うんでしたっけそういうのスキルのキャッチアップみたいなのももう年も年だし疲れたみたいな人も多分結構いると思っててなんでなんだろうまあ決める必要がないよねって言われれば確かにそうなのかなぁと思いつつなんか決めてる人が多いなっていう印象なのと決めた方が。楽なのかなわかんないけど人によるんじゃないですかそのキャリアラダーの登り方っていろいろあると思うんですよねただまぁ1回マネジメントやったっていうのはねさっきも言ったんですけどもちろん自信にはつながるのでもう1回マネジメントやれって言われたらはいやりますって。できる準備はできてると思う。んですよもちろんICもそうですけどでもマネジメントする側になったとしても例えばアーキテクチャとかっていうのって抑えとかないといけないと思うのでそのキャッチアップが止まるわけではないと思うんですよね一。回そのマネジメントをやる視点に立ってみてなんかICをやる上で変わったこと。とかってありますそうですねトランスペレンシーを保つこととかコミュニケーションを大事にするっていうことは多分ウェイトをもっと置いているように感じますね。それはマネージャーとのってこと。ですか自分のマネージャーともそうですし自分のチームメイトともそうですし誰が責任を持ってるかっていうところ。ですよねそれはえっと自分のそのEMの経験から見えないことが多いなと思っ。たんですかemの経験からするとこういう情報がエンジニアから入ってくると嬉しいなってなりますよねそう。か確かにまあどっちが何のボールを持っているのかっていうのがねお互いにちゃんと分かった方がいいっていうのって割とボールを渡しているつもりなんだけども実は渡してもらっていないっていうふうに見えることなんかもあったりするのでそういったのってやっぱりEMの経験一回踏んだっていうので見えるものもやっぱ増えたって。いう話ですよねそうですね見えるもの見たいものっていうのがわかってきたのでそれを活かしてレポートとかもやってますし。コミュニケーションもできてますね素晴らしいちなみにごめんなさい僕あのさっき出戻りっていう言葉を多分途中から勘違いしててあのemとあのicの出戻りとあの会社の出戻りをあのごっちゃにしたまま話してました。ね確かになんかそうねどっちなんだろうって思いながら。だけど確かにちょっと付け加えるようにしましょう失礼し。ました。はいじゃあ次行っちゃっていいそうですねそろそろ最後の質問ぐらいにしましょうか時間も。そうですね最後っていうのもそうなんですがやっぱりねその大きいところがやっぱりシビックテクノロジーに戻ったっていうところで俺これちょっと聞いていいのかあれなんですがあのぶっちゃけ大企業の方が給料いいんじゃねーのって思ってるんですけどスタッフエンジニアにやっぱり戻るときってやっぱり今のEMポジションでもらっていた給与ベースをベースにやっぱり交渉はされたって。感じなんですかそうですね給与ベースでの交渉はありますけど正直多分若干下がったのかなと思うん。ですけどやっぱ下がるんだそう。よね会社の規模にもよりますし会社の様式にもよるじゃないですか例えばユニティってパブリックエクイティの会社ですけど今私がいるところはプライベートエクイティですしで大きな会社ってRSUとかそういうのついてくるじゃないですかそうですねなので一概に数字で上がれないっていうのはあると思うんですけれども、Unityで働いて、その辺のベースラインが新しくなった分、でも取った時に給与交渉ちゃんとしましたし、そんなにガクッと下がったっていうわけではない。ですね。ないってこと。ですね。ちなみに何だろう、そこすごい僕も聞きたかったけどよく瀬名さん聞いてくれたなって感じですけどそこらへん下げることに全然抵抗はなかったんですかきっとそのスタッフっていう今前のなんだろポジションがシニアででユニティに行ってでスタッフっていうのもあって多分上がってるとは思うんですけどやっぱり大きい企業でそのキャリアを続けるに比べたらやっぱりその下がることにはなるじゃないですかそこらへん。のなんか語るでは下がるかもしれないですねなんか。そこらへんのモチベーションみたいなのってどこにあるのか。なって多分自分が追いかけてるのって給与の数字じゃなくてどこまでのインパクトを与えられるかっていうところと自分のやってることが将来誇れることなのかっていうところは考えてますねわかるんです。けどね、いや僕も考えてるんですよ考えてるけどやっぱりお金に惑わされちゃうだんだん。としたよね若いですしね、そういうところはその後でいいと思うんですよでも例えば広告の業界で働くことに自分の場合はですね意味を見出せなくって広告の業界って結局お金を左から右へと知るだけじゃないですかみたいなところがあってそれが一部はゲームクリエイターに還元される広告集内ゲームクリエイターに還元されるからいいとこではあると思うんですけどそれをじゃあこの先5年10年とその業界に身を投じられるかって自分で考えた時にそれはないなって思ったんですよねでもそれが好きな人もいるんですよ広告のお金の動かし方とかそういうのも好きな人がいるからそういう人たちはこうユニティからFacebokとかGogleとかねFacebokもGogleも広告の会社じゃないですか、収入はそうですねそうですねそういうキャリアパスはあると思うんですけど自分はそこにうん、価値を見出せなかったってなり。ますね素晴らしいいい話といってあれかもしれないですけど幸せっちゃ幸せっすよね割とお金っていうのがやっぱり最初のベースにもちろんみんなキャリア的になりやすいだろうけどその次のインパクトって何かしら自分も持つべきだと思っててそれがユーザーへのインパクトなのかビジネスに対するインパクトなのかチームに対するインパクトなのかっていう部分って割と俺もいつも気にはしてる人はやっぱかっこいいなって思うしそこに出会うのって、正直、運の要素もあるんじゃないかなと思うので、渡辺さんはね、そういった意味だと、そういうインパクトを与える先っていうのが自分の人生の中で出会うことができたってことです。よね。そうですね今も本当に年に数回ですけどCodefrJapanの方と関わりを持たせてもらってたりとかもしますしこっちのCivcTechの方とのつながりも。ありますしいやそうですよね渡辺さんには以前フロックでもCivcTechTourっていうのを開いていただいてたくさんの人が来てくれてCivcTechについての話もちょっと聞いてもらったっていうのもあるのでやっぱりその活動の親族が好きなんだなっていうのもすごく伝わってきたからいやいいですよねそういう繋がりがネットワークもちゃんと広がってるっていうのが。素晴らしいと思いますあとなんかもう一つだけちょっと聞きたいんですけどなんか大きい会社とその小さい会社のなんかよくある比較としてその大きい会社お金はいいけどデベロッパーエクスペリエンスは良くないよねみたいなのってあると思っててそれは僕は朝菜はすごいいい会社だしコードも綺麗だしすごいけど確かに小さい会社のほうが自分1人から出るインパクトみたいなのが大きいしやっぱり大きい会社になれば大きい会社になるほどプロセスっていうのはゆっくりになってて例えば一つのフィーチャー出すにしてもabテストしてabテストもデータちゃんと欲しいから4週間やろうねとかでちょっと開発は自体は遅いし自分が作ったものがどんどん出ていかないみたいなデベロッパーエキスペリエンスの悪さみたいなのがあるかなとは思っててそこら辺は何か感じたり。しましたかそうですね遅いっていうのはありましたね遅いけどインパクトってでかいじゃないですか大きい会社ってエンドユーザーしかいないんで小さい会社ってエンドユーザーそんなに規模が大きくないんでバグ出しててもそんなに大した。ことないというか確かに。謝るべきだよねバグ出してそれがねレポートされるなりオブザバビリティで管理されてればユーザーのバグがそのまま品質管理につながるんで別にバグ出してもいいじゃんっていうそういう感じなんでそっちのほうがサイクル的には自分には合って。ますよね逆になんか大きい会社のほうがここはこっちのほうが良かったなみたいなのはありました。か大きい会社のほうがデータ管理というかデータを見るチャンスが多かったですかねデータを見るチャンスっていうのはデータを取ってるポイントが多いのでいわゆるビッグデータですかねビッグデータでユーザーの行動がほぼ可視化できるという状態になっているのはすごいなと思いました。ね確かにそれもなんか構造的にやっぱり小さい会社とか小さいシステムだと撮ったところで100人とか200人みたいなまあそのサイズによりますけどねそこらへんだと撮っても意味ないみたいなのがあったりとかまあ見えるようにして頑張ってデータ撮ってもみたいなところがあるからしょうがないのかなと思い。ますけどね確かに好き好みは絶対出ますよねビッグトライクを扱うようなやっぱりねエンジニアリングがしたいって人は絶対いるからねその辺は本当。好み出るようなって思います。ねだいたい最後に同じ渡辺さんのようなステータスの人がこれからカナダに出るとしたら海外に出るとしたらみたいなのを聞くんですけど来たの10何年。前です。もんね聞き方じゃ。ないですか聞き方じゃないですか最近なんだろうな渡るさんのような人がカナダにって言うともう十何年前のこと思い出すよっていうふうになっちゃうからなんかシンプルに海外挑戦するぞっていう人が渡るさんに相談とか来たらなんかどういうふうなアドバイスとかしてるとかあんすかちなみにそれだね来んなよとか人生は一度きりだ。とかいやなんですかねそのリスクを得るんだったらどんどんやったらいいと思いますよああ素晴らしい例えば俺がラッキーだったのは家族がまだ健康だし日本にいる家族ですよね日本にいる家族が健康だしこっちで何か起こってものは当時あったんでそういうセーフティネットがあるともうじゃあリスクって何なのぐらいな感じじゃないですかそうっすよねーカナダの渡航費用と留学費用と生活費それがまあなくなるぐらいだと思うんですけど100万時間かでもねそれと引き換えに英語は勉強できるようになるしこっちの業界の動きも分かるようになるし確かに考えたらそれ別にでっかいリスクではないと思うんでうんうん、帰ってくるのをね、見てみたらっていうなのでまあリスクを許容できるんだったらどんどん悩んでないでいいってしまう。って感じですね素晴らしいという。ことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうござい。",
  "utterances": [
    {
      "speaker": "A",
      "text": "はい今回は渡辺さんに来ていただきました渡辺さんも僕や瀬名さんと同じくバンクーバーに住んでいて今はシビックテック系のSaaSの会社に勤めてるっていうことで。",
      "start": 28,
      "end": 11994,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "よろしいですかそうですねシビックテック系ガベッジマネジメントの会社で働い。",
      "start": 11994,
      "end": 21118,
      "timestamp": "00:11"
    },
    {
      "speaker": "A",
      "text": "てますねそしたら最初に簡単に経歴を教えてくださいはい、。",
      "start": 21118,
      "end": 27617,
      "timestamp": "00:21"
    },
    {
      "speaker": "B",
      "text": "経歴2013年くらいにカナダに行きましてこちらで語学学校に通ってカレッジに通ってその後仕事を見つけてこっちで働いてもう10年くらいになります最初にシビックテクの会社に行ってじゃないや、印刷の会社か、印刷系の会社に行ってシビックテクの会社に行ってユニティの会社ユニティっていうゲームの会社に行って戻りという形で今になるという感じですね素晴らしい期間で。",
      "start": 27617,
      "end": 66314,
      "timestamp": "00:27"
    },
    {
      "speaker": "A",
      "text": "言うとセナさんより長い?",
      "start": 66314,
      "end": 68836,
      "timestamp": "01:06"
    },
    {
      "speaker": "C",
      "text": "いやさすがに俺の方が長いよ俺さすがに18年いますよ私それか全然。",
      "start": 68836,
      "end": 73879,
      "timestamp": "01:08"
    },
    {
      "speaker": "A",
      "text": "違ったキャリアがちでキャリアが。",
      "start": 73879,
      "end": 76801,
      "timestamp": "01:13"
    },
    {
      "speaker": "C",
      "text": "つってちなみに俺それ懸念だったらわたるさんのさ一番最初の印刷の会社は多分ジュークボックスですよねですよね割とねあの日本人何人か働いてる人実は知っててあのこっちでなんか特殊印刷とかもね含めて割と有名な印刷の会社さんなのでそんなところで最初のキャリアとしてカナダで始まったってのはちょっとびっくり。",
      "start": 76801,
      "end": 99236,
      "timestamp": "01:16"
    },
    {
      "speaker": "B",
      "text": "しましたけどね実は今どなたか働いてるんですか?",
      "start": 99236,
      "end": 103228,
      "timestamp": "01:39"
    },
    {
      "speaker": "C",
      "text": "日本人いや今はわかんないですねあのちょっと前に多分日本の多分グラフィックデザイナーさんかなんかかな働いててっていうのと一回連絡いただいたことがあったのであー日本人働いてんだーって思って。",
      "start": 103228,
      "end": 114164,
      "timestamp": "01:43"
    },
    {
      "speaker": "A",
      "text": "ちなみに来る前からエンジニアされてたんですか?",
      "start": 115949,
      "end": 119571,
      "timestamp": "01:55"
    },
    {
      "speaker": "B",
      "text": "そうですね、こっちに必ず来る前は日本で5年くらいエンジニアリング、SEですね。SEをやっていて、その前はコンピューターサイエンス系の学校を卒業してますね。",
      "start": 119571,
      "end": 132939,
      "timestamp": "01:59"
    },
    {
      "speaker": "A",
      "text": "あ、。",
      "start": 132939,
      "end": 133240,
      "timestamp": "02:12"
    },
    {
      "speaker": "C",
      "text": "コンピューターサイエンス系の学科なんですね。",
      "start": 133240,
      "end": 134570,
      "timestamp": "02:13"
    },
    {
      "speaker": "B",
      "text": "知らなかった。え、。",
      "start": 134570,
      "end": 136873,
      "timestamp": "02:14"
    },
    {
      "speaker": "A",
      "text": "来る時はえっとフロック使われてきたんですか?",
      "start": 136873,
      "end": 141105,
      "timestamp": "02:16"
    },
    {
      "speaker": "B",
      "text": "それは多分当時当時ないです。",
      "start": 141105,
      "end": 142986,
      "timestamp": "02:21"
    },
    {
      "speaker": "C",
      "text": "ねそう当時なかったんじゃないそもそも10年以上前そうワタルさん来た時多分そんなフロックも大きくなかったですもん。",
      "start": 142986,
      "end": 150791,
      "timestamp": "02:22"
    },
    {
      "speaker": "B",
      "text": "ね多分ないでしょうねうん多分。",
      "start": 150791,
      "end": 155393,
      "timestamp": "02:30"
    },
    {
      "speaker": "C",
      "text": "使ってないと思うで俺もワタルさんのこと知ったのって割とフロックできてちょっと時間いやまあ結構ほんと土俗記の時だったんでそうすると多分使ってないです。",
      "start": 155393,
      "end": 164818,
      "timestamp": "02:35"
    },
    {
      "speaker": "A",
      "text": "ねじゃあ学校とかももう自分で調べて自分で何だろう見つけて入ってみたいな感じなんですか?",
      "start": 164818,
      "end": 171557,
      "timestamp": "02:44"
    },
    {
      "speaker": "C",
      "text": "そうですね、。",
      "start": 171557,
      "end": 171957,
      "timestamp": "02:51"
    },
    {
      "speaker": "B",
      "text": "ある程度のエージェントの方から情報もらってっていう形で学校絞ったりはしましたけどほぼほぼ、当時その情報なかったんだよね。",
      "start": 171957,
      "end": 183530,
      "timestamp": "02:51"
    },
    {
      "speaker": "A",
      "text": "そうですよね。なんかその情報のない中、なんでカナダ、バンクーバーに決めたんですか?",
      "start": 183530,
      "end": 191747,
      "timestamp": "03:03"
    },
    {
      "speaker": "B",
      "text": "最初はほんとただ単に英語を勉強したいっていうところだけだったんですね、モチベーションとしては。別にその先は英語を勉強して、こっちで学校行って、で、まあ転職というか、SEからWeb系っていうのはちょっとシフトチェンジなので、技術を持って帰って日本で働こうかなっていうふうに考えてたので、そんな中、新国にどの国に骨を埋めるかみたいな考え方では得られなかったですね。",
      "start": 191757,
      "end": 221228,
      "timestamp": "03:11"
    },
    {
      "speaker": "C",
      "text": "うーんそういうことですよね俺なんかこれちょっと後で話をするのかもしれないけどなんか割と渡るさんのね日本でのなんか働き方みたいなって結構過酷だったみたいな話を前聞いたことがあった気がするんですけどその辺って別にモチベーションというかあの海外行こうっていうのに関係。",
      "start": 221238,
      "end": 235563,
      "timestamp": "03:41"
    },
    {
      "speaker": "B",
      "text": "はなかったんですかまあその時はその回その会社が悪いと思ってたんですよ社会的な問題ではなくて、その会社だけの問題かなと。まだ若かったんだよね。自分20、20歳から24歳、25歳のあたり。",
      "start": 235563,
      "end": 256469,
      "timestamp": "03:55"
    },
    {
      "speaker": "A",
      "text": "それはなんかブラックみたいな意味ですか?",
      "start": 256469,
      "end": 260734,
      "timestamp": "04:16"
    },
    {
      "speaker": "B",
      "text": "そうですね。よくはなかったですね。",
      "start": 260734,
      "end": 265357,
      "timestamp": "04:20"
    },
    {
      "speaker": "C",
      "text": "まああるあるですよね特に僕も日本で働いた時は製作系の会社だったっていうのもあるんですがまあ俺もまあまあ大変だったもんねやっぱり寝袋を持って家帰ればラッキーみたいな。",
      "start": 265367,
      "end": 278616,
      "timestamp": "04:25"
    },
    {
      "speaker": "B",
      "text": "何回かオフィスで夜を過ごして朝を終わったこと。",
      "start": 278616,
      "end": 283760,
      "timestamp": "04:38"
    },
    {
      "speaker": "A",
      "text": "はありますね僕も結構いっぱいありますねなんか割と渡辺さんに似てるかもしれない僕もそうですねSIA系の会社で始めてなんか延長のプロジェクトは2個ぐらいあってその時はなんか椅子並べて寝るみたいなの結構いっぱいありました。",
      "start": 283760,
      "end": 301605,
      "timestamp": "04:43"
    },
    {
      "speaker": "C",
      "text": "ねありますねほんとにで最終的にはデスクの下には目袋低いなるんだ。",
      "start": 301605,
      "end": 306406,
      "timestamp": "05:01"
    },
    {
      "speaker": "A",
      "text": "よそこまでは至らなかったけどでもなんか僕結構なんか運動部ずっと運動部だったんで体力があったのかあんまりなんかそれが悪いこととも思ってないなんかブラックとも思ってなかったし確かにね残業代もらえるしラッキーってなってましたね僕は確かに、。",
      "start": 306406,
      "end": 322605,
      "timestamp": "05:06"
    },
    {
      "speaker": "C",
      "text": "そんな悪いとは思ってなかったな正直。",
      "start": 322605,
      "end": 325778,
      "timestamp": "05:22"
    },
    {
      "speaker": "B",
      "text": "若かったんだね、体力はあったと思います。同僚と血塗られた残業代といったのが笑ってましたね。",
      "start": 325778,
      "end": 334887,
      "timestamp": "05:25"
    },
    {
      "speaker": "A",
      "text": "ちなみにその当時はプログラミングはできたんですか?なんかSIRって結構いろんな種類というかあるじゃないですか。",
      "start": 334887,
      "end": 342793,
      "timestamp": "05:34"
    },
    {
      "speaker": "B",
      "text": "そうですね、多岐に渡ると思うんですけどもともとコンピュータサイエンス系の学科だったのでプログラミングはもちろんできていましたし会社の入社研修とかでもプログラミングを教えるのがつまらなすぎてですね自分でゲーム作ってたりとか、逆に講師にプログラミングを教えたりとかいうことはし。",
      "start": 342803,
      "end": 362973,
      "timestamp": "05:42"
    },
    {
      "speaker": "C",
      "text": "てましたすごいな、意外と言ってあれかもしれないけどそうか、CSバリバリ出てたかだっ。",
      "start": 362973,
      "end": 368877,
      "timestamp": "06:02"
    },
    {
      "speaker": "B",
      "text": "たんだな、。",
      "start": 368877,
      "end": 369337,
      "timestamp": "06:08"
    },
    {
      "speaker": "A",
      "text": "知らなかったなんかcs出てる人ってなんか割となんかサース系に行くイメージがあったんだけどそういうわけではないんですねでも。",
      "start": 369337,
      "end": 378069,
      "timestamp": "06:09"
    },
    {
      "speaker": "C",
      "text": "渡るさんのキャリアの始まった頃のその十何年前なのかねっていう時ってサースってそもそもそんな一般。",
      "start": 378069,
      "end": 384612,
      "timestamp": "06:18"
    },
    {
      "speaker": "A",
      "text": "的だったのか確かに。",
      "start": 384612,
      "end": 386272,
      "timestamp": "06:24"
    },
    {
      "speaker": "B",
      "text": "ではなかったですね当時はAWSとかそういうのもあったのかななかったのかなっていう話だいたいオンプレですもんねきっとGithubもなかったかなそうっすね。",
      "start": 386272,
      "end": 401035,
      "timestamp": "06:26"
    },
    {
      "speaker": "C",
      "text": "僕の時はサブバージョンでしたね、。",
      "start": 401035,
      "end": 402915,
      "timestamp": "06:41"
    },
    {
      "speaker": "B",
      "text": "ちなみに。",
      "start": 402915,
      "end": 403915,
      "timestamp": "06:42"
    },
    {
      "speaker": "A",
      "text": "僕もサブバージョン使ったことありますね。",
      "start": 403915,
      "end": 405606,
      "timestamp": "06:43"
    },
    {
      "speaker": "C",
      "text": "ほんと?懐かしいな。",
      "start": 405606,
      "end": 407786,
      "timestamp": "06:45"
    },
    {
      "speaker": "A",
      "text": "懐かしいですね。で、カナダに来るっていうのを決めて、英語はその当時どのぐらいから始めたんですか?もともと大学の時に得意だったとかなんですか?それとももう…1からみたい。",
      "start": 407786,
      "end": 422952,
      "timestamp": "06:47"
    },
    {
      "speaker": "B",
      "text": "な。1からですね。日本で仕事をしている間に駅前留学ですね。に通ってて。でも週に1回って全然英語力伸びないんですよね。しゃべる度胸はつくんですけど、英語力は伸びないので。こっちに来た時、TOEICも300何点とかそういう。300何。",
      "start": 422952,
      "end": 442960,
      "timestamp": "07:02"
    },
    {
      "speaker": "C",
      "text": "点?すーごい。",
      "start": 442960,
      "end": 445169,
      "timestamp": "07:22"
    },
    {
      "speaker": "A",
      "text": "な。僕あんまり駅前留学がわかってないんですけど、駅前留学って。",
      "start": 445169,
      "end": 448512,
      "timestamp": "07:25"
    },
    {
      "speaker": "B",
      "text": "どんな?なんかこうプライベートの英会話学校です。",
      "start": 448512,
      "end": 454057,
      "timestamp": "07:28"
    },
    {
      "speaker": "A",
      "text": "ね。じゃあなんか外国の方がいて、なんかネイティブなのかなと話せるみたい。",
      "start": 454057,
      "end": 458741,
      "timestamp": "07:34"
    },
    {
      "speaker": "B",
      "text": "な。1時間話して、まあ今日はこの本、このチャプターをベースに英会話しましょうみたいな、そんな感じ。",
      "start": 458741,
      "end": 464586,
      "timestamp": "07:38"
    },
    {
      "speaker": "A",
      "text": "です。あ、でもそれ、なんかそれでも結構じゃあその喋る努力、喋る度胸みたいなのってつくんです。",
      "start": 464586,
      "end": 471392,
      "timestamp": "07:44"
    },
    {
      "speaker": "B",
      "text": "ね。そうですね。日曜会話とかもするので。あと東京にいたんでミートアップとかもたくさんで、ミートアップで英語喋ってるとかそういうことやってました。",
      "start": 471392,
      "end": 484425,
      "timestamp": "07:51"
    },
    {
      "speaker": "A",
      "text": "ね。ちなみになんかどういう心境の変化でその海外に行こうってなったんですかそのまあもともとじゃあ英語がなんか多分もともと好きとか海外で働きたいみたいなのはあったんです。",
      "start": 484425,
      "end": 497232,
      "timestamp": "08:04"
    },
    {
      "speaker": "B",
      "text": "か?はなかったんですけどまぁエンジニアやってる限り英語って絶対使うじゃないですかうんはいはいはい一時情報ももちろん英語ですしだいたいなのでエラーメッセージ読むにも英語だし英語ですしなのでまぁこれ英語は絶対必要だなっていう危機感とあとまぁ単に日本での仕事が嫌だったっていうのはあります。",
      "start": 497232,
      "end": 521099,
      "timestamp": "08:17"
    },
    {
      "speaker": "C",
      "text": "ね。そうですよ。",
      "start": 521099,
      "end": 521760,
      "timestamp": "08:41"
    },
    {
      "speaker": "A",
      "text": "ね。本当にじゃあ最初はもう1年なんか2年なのかいって、英語もできるようになって、現地での就職経験みたいなのが得られて、日本で活躍できればいいなぐらいの感じで、じゃあ最初は来たって。",
      "start": 521760,
      "end": 535684,
      "timestamp": "08:41"
    },
    {
      "speaker": "B",
      "text": "ことなんですかね。そうですね就職経験までも考えてなくて英語ができてウェブ系の作れるようになったらもっと就職活動楽になるだろうなみたいなこのぐらいの浅い考えできました。",
      "start": 535684,
      "end": 550275,
      "timestamp": "08:55"
    },
    {
      "speaker": "C",
      "text": "ねいやそうよねだって俺も正直ってか10何年前とかフロックみたいなのもなかったし正直俺も現地で就職はうんぬんこんぬんってそもそもイメージすらしげなかったですからねおまけに、やっぱりこう何、英語を勉強するっていうのも今みたいに何だろう、こうなんかオンライン英会話みたいなもそんななかっただろうし、なんか割といろんな、そう、情報が閉ざされてた時代ですよね、そう考える。",
      "start": 550275,
      "end": 572154,
      "timestamp": "09:10"
    },
    {
      "speaker": "B",
      "text": "と。そうですね、オンライン英会話できるほどのバンドビデオですが多分、なかったですね、ネットワークとし。",
      "start": 572154,
      "end": 580156,
      "timestamp": "09:32"
    },
    {
      "speaker": "C",
      "text": "て。なかったっすね、本当に。ビデオ通話が云々とかも。",
      "start": 580156,
      "end": 583757,
      "timestamp": "09:40"
    },
    {
      "speaker": "B",
      "text": "ね、って。",
      "start": 583757,
      "end": 584137,
      "timestamp": "09:43"
    },
    {
      "speaker": "A",
      "text": "いう。フィリピン留学とかも多分なかったですよ。",
      "start": 584137,
      "end": 586577,
      "timestamp": "09:44"
    },
    {
      "speaker": "C",
      "text": "ね。あったんか。",
      "start": 586577,
      "end": 588438,
      "timestamp": "09:46"
    },
    {
      "speaker": "A",
      "text": "な。いや多分僕がそのそれこそ10年前ぐらいに行ったんですよフィリピン留学その時で結構まだ誰も知らないみたいななんか今でこそ結構フィリピン留学ってそのスタンダードになってきてるじゃないですか日本の中ではでも僕があのそれこそそのSARSの会社にいてあのフィリピン留学っていうのがあるらしいってなってそれ行くって決めてそれを行くんであの会社辞めますって言ったらあのフィリピンだからなんか女遊びかみたいなのをなんかおじさんたちに言われてああなんかそういうふうに考えるんだと思ってまあその時僕も全然なんか純粋だったしそういうなんかねなんだろう東南アジアであの女遊びしてくるみたいなのもなんか全然考えたこともなんかまあ全然それも知らなくてなんかああって思ったイメージがあるんでなんで多分その当時フィリピン留学ちょっと流行りかけ流行り始めてきたぐらいな時だったんで多分そういうのもないんでしょう。",
      "start": 588438,
      "end": 646481,
      "timestamp": "09:48"
    },
    {
      "speaker": "B",
      "text": "ね、きっと。当時確か日本円が高かったかな。そんなことないか。",
      "start": 646481,
      "end": 653704,
      "timestamp": "10:46"
    },
    {
      "speaker": "A",
      "text": "な。まあなんか低くはないぐらいです。",
      "start": 653704,
      "end": 657205,
      "timestamp": "10:53"
    },
    {
      "speaker": "B",
      "text": "ね、きっとね。だからカナダに行ってもそんなって感じでした。あとカナダ選んでる理由一個あって、シビックテックの関係のテッドトークを見たんですよ。で、その人がアメリカの方で、カナダがアメリカにしようってなった時に、アメリカはビザが売りにくいっていうのを確かどっかで調べて、じゃあカナダにしようみたいな感じです。",
      "start": 657205,
      "end": 689731,
      "timestamp": "10:57"
    },
    {
      "speaker": "C",
      "text": "ね。そうっすよね。だいたい消費票で最初アメリカから考えて、何かしらでやっぱカナダに。",
      "start": 689731,
      "end": 695133,
      "timestamp": "11:29"
    },
    {
      "speaker": "B",
      "text": "なるって感じですよね。そうです。",
      "start": 695133,
      "end": 698095,
      "timestamp": "11:35"
    },
    {
      "speaker": "A",
      "text": "ね。じゃあもうなんか僕イメージなんですけど渡辺さんといえばシビックテックみたいなあのフロックの中でもイメージがあるんですけどじゃあもう結構その頃からそのシビックテックっていう分野に興味があったん。",
      "start": 698095,
      "end": 711390,
      "timestamp": "11:38"
    },
    {
      "speaker": "B",
      "text": "ですかありましたねその当時は本当に今コード4ジャパンっていう団体が日本にあるんですけどこのコード4ジャパンが発足したのも私が留学する1年前とかという時期で参加したいなと思いつつ、でも留学するからなっていう感じでちなみにCivcTech。",
      "start": 711390,
      "end": 734011,
      "timestamp": "11:51"
    },
    {
      "speaker": "A",
      "text": "って何なんですか?なんか僕もあんまりよくわかってないし、多分聞いてる人たちもあんまりわかんない人が多いのかなと思うんですけど。",
      "start": 734011,
      "end": 740584,
      "timestamp": "12:14"
    },
    {
      "speaker": "B",
      "text": "なんかこう人が集まって政府の抱えている問題を解決しようみたいなのがあって例えばまあ市役所と。",
      "start": 740584,
      "end": 747287,
      "timestamp": "12:20"
    },
    {
      "speaker": "A",
      "text": "か。",
      "start": 747287,
      "end": 747307,
      "timestamp": "12:27"
    },
    {
      "speaker": "B",
      "text": "行政が抱えてる問題ってあるじゃないですか。これやりにくいなとか。この組織たくさんあって大変だなとかって。わからないこともあったりとかするんですけど、それを民間の人たちが変えられるところを変えていこうと。",
      "start": 749828,
      "end": 763714,
      "timestamp": "12:29"
    },
    {
      "speaker": "A",
      "text": "か。それはなんか日本の国としても発足したじゃないですか。なんて言うんだっけあれ、名前忘れちゃっ。",
      "start": 763714,
      "end": 771814,
      "timestamp": "12:43"
    },
    {
      "speaker": "C",
      "text": "た。デジタル。",
      "start": 771814,
      "end": 773315,
      "timestamp": "12:51"
    },
    {
      "speaker": "A",
      "text": "庁?そうそうそう、ああいうものなのかなって思ったんですけど、それはもう民間じゃないといけないです。",
      "start": 773315,
      "end": 780257,
      "timestamp": "12:53"
    },
    {
      "speaker": "B",
      "text": "か?ガブテックと…ガブテックと近所みたいなところはあり。",
      "start": 780257,
      "end": 786032,
      "timestamp": "13:00"
    },
    {
      "speaker": "C",
      "text": "ますよねそうですよね多分一般的に知られてるって言ってあるかもしれないけどだけガバメントテックっていう形でガブテックっていうのはよくあって民間のほうがどっちかというとシビックテックってイメージですよねどちら。",
      "start": 786032,
      "end": 798015,
      "timestamp": "13:06"
    },
    {
      "speaker": "B",
      "text": "かといえばそうですね行政って動きが遅いじゃないですか何決めるのも遅いですしお金もないしっていうところででもじゃあプライベートのところから何ができるかっていうのを探していくのがシビックテックの楽しさかなと思ってます。",
      "start": 798015,
      "end": 815347,
      "timestamp": "13:18"
    },
    {
      "speaker": "C",
      "text": "ねなるほどですよねこれでも今改めて話聞いてそういえばなって思ったのが渡辺さんガブテックには興味なかったんですか民間からやることに意義がある。",
      "start": 815347,
      "end": 823617,
      "timestamp": "13:35"
    },
    {
      "speaker": "B",
      "text": "みたいなガブテックっていう言葉当時なかったですねあなかっ。",
      "start": 823617,
      "end": 827962,
      "timestamp": "13:43"
    },
    {
      "speaker": "C",
      "text": "たのかあそうなん。",
      "start": 827962,
      "end": 828903,
      "timestamp": "13:47"
    },
    {
      "speaker": "A",
      "text": "ですねうんそうかじゃあなんかカテゴリ的にはそのアグリテックだったりとかフィンテックだったりの一つみたいな。",
      "start": 828903,
      "end": 837723,
      "timestamp": "13:48"
    },
    {
      "speaker": "B",
      "text": "多分話なんですよねでもその辺多分バズワードというか自分をクラシファイングするためだけの言葉なんでまあ要は自分の技術を使って誰かを助けてあげたいっていうそういう。",
      "start": 837723,
      "end": 853257,
      "timestamp": "13:57"
    },
    {
      "speaker": "A",
      "text": "のがモチベーションですねなんか代表的なものとかってあるんですかなんだろそのシビックテックの中でなんかうまくいった例みたいなのがあって興味が出始めたん。",
      "start": 853257,
      "end": 863537,
      "timestamp": "14:13"
    },
    {
      "speaker": "B",
      "text": "ですかそれはそうですねそのテッドトークの中でそのシビックテックのプロジェクトをいくつか紹介していてでまぁこういうテクノロジーの使い方があるんだっていうのを知ってなのでまぁこのポッドキャスト多分リンクつけれると思うんで後でテッドトーク。",
      "start": 863537,
      "end": 880661,
      "timestamp": "14:23"
    },
    {
      "speaker": "A",
      "text": "のリンク送っておきますね。",
      "start": 880661,
      "end": 882542,
      "timestamp": "14:40"
    },
    {
      "speaker": "C",
      "text": "ありがとうございます日本とかでもね割とコロナの時とかにアプリ作られたりとかしてましたもんねああいうのも多分CivcTechの多分一員ですよねおそらくそう。",
      "start": 882542,
      "end": 891860,
      "timestamp": "14:42"
    },
    {
      "speaker": "B",
      "text": "ですねまさにその通りですね。",
      "start": 891860,
      "end": 893962,
      "timestamp": "14:51"
    },
    {
      "speaker": "A",
      "text": "素晴らしいそしたら就職活動とかについて聞いていきたいなと思うんですけどちなみに今ってカナダの会社。",
      "start": 893962,
      "end": 903549,
      "timestamp": "14:53"
    },
    {
      "speaker": "B",
      "text": "で何社目なんですか3回目?転職3回目か。",
      "start": 903549,
      "end": 909653,
      "timestamp": "15:03"
    },
    {
      "speaker": "C",
      "text": "な4回目かな4回目かそうよねjukeboxcivctechunitycivctechですもんねそう。",
      "start": 909653,
      "end": 917831,
      "timestamp": "15:09"
    },
    {
      "speaker": "A",
      "text": "ですねどうしよう大体いつも大体なんか1回か2回ぐらいだからあの最新のを聞いてるんですけどなんかあれですよね渡辺さんといえばそのcivctechから確かunityに行ってまた戻って戻りしたのかなっていうのをなんか聞いたことあるんですけどそしたら一社目からなんとなくでいいんですけどそんな多分結構前で覚えてないと思うんですけど最初のなんか就職活動はどんな感じでし。",
      "start": 917831,
      "end": 948443,
      "timestamp": "15:17"
    },
    {
      "speaker": "B",
      "text": "たか一番最初は本当にマスドロップですねレズメを作ってメールで送ってとかリンクとインタープラインしてとかっていうのをひたすら繰り返していて確か80社ぐらいに応募しましたね応募というかメールを送り。",
      "start": 948443,
      "end": 966813,
      "timestamp": "15:48"
    },
    {
      "speaker": "A",
      "text": "ましたねなんか今で言うと結構あの一つのポジションに対してなんか300とか500とかなんかまぁポジションによっては1000とかってくると思うんですけどやっぱその当時からその状況はそんな感じではあったん。",
      "start": 966813,
      "end": 979887,
      "timestamp": "16:06"
    },
    {
      "speaker": "B",
      "text": "ですか一つのポジションに対するいくつ募集といういくつ何人人が行ったか分からないですけどまぁそうですねコンペティティブではあったと思いますしもちろん私は外国人ですしビザも、何でしたっけワーキングプリゼビザか、ワーキングプリゼビザだけだったので結構リスト行くのかディスアドバンテージ。",
      "start": 979887,
      "end": 1007074,
      "timestamp": "16:19"
    },
    {
      "speaker": "A",
      "text": "ありましたねじゃあ結構やっぱ送っても帰ってこないみたいなそう。",
      "start": 1007074,
      "end": 1011600,
      "timestamp": "16:47"
    },
    {
      "speaker": "B",
      "text": "ですね、送っても帰ってこないのがたくさんありませ。",
      "start": 1011600,
      "end": 1014597,
      "timestamp": "16:51"
    },
    {
      "speaker": "C",
      "text": "んそうよねしかも渡るさんが入ってた彼氏多分バーンアーツですよねそうですねいうそう彼じゃあそこだもコープもなかっただろうから本当には掘り1本だけでねあの収穫されてた。",
      "start": 1014597,
      "end": 1025482,
      "timestamp": "16:54"
    },
    {
      "speaker": "B",
      "text": "ってことですもんねそうですねラッキーな人はなんかワークビザを入れたんですけど学校からうんあーそうねー。",
      "start": 1025482,
      "end": 1033026,
      "timestamp": "17:05"
    },
    {
      "speaker": "C",
      "text": "いたがなんかボスぐらいがなんかなんかオフィサーがミスってかなんかでなかでラッキーで出たみたいな。",
      "start": 1033026,
      "end": 1041030,
      "timestamp": "17:13"
    },
    {
      "speaker": "A",
      "text": "もうそうそうまあなんかそういう話はなんか今でも結構聞きますよねなんか1年のところ2年だとか言うねなんか3年とかなんか聞くからまあそういう人はきっといるんでしょうねそうですねトライするそしたら1社目でワークホリーの後のビザはなんかもらえたみたいな感じになる。",
      "start": 1041030,
      "end": 1061386,
      "timestamp": "17:21"
    },
    {
      "speaker": "B",
      "text": "んですかそれがそうじゃなくてですね1社目のとこにはもちろん交渉したんですよワークホリーでしかないからその後のワークビザ出してくださいってもちろん足元見られてですね最低というかクラリファイス最低限の給料でここからここまで働いてくださいみたいな感じのことを言われていて言ってましたねなので最初の企業に打診はしてプロセスは始まっておいたんですけれどもちょうどその時ヘッドハンティングしていただきまして2。",
      "start": 1061386,
      "end": 1097037,
      "timestamp": "17:41"
    },
    {
      "speaker": "A",
      "text": "社。",
      "start": 1097037,
      "end": 1097157,
      "timestamp": "18:17"
    },
    {
      "speaker": "B",
      "text": "目にいやまあ結局そのワークビザは2社目から出ましたねいやで。",
      "start": 1097157,
      "end": 1104017,
      "timestamp": "18:17"
    },
    {
      "speaker": "C",
      "text": "も良かったですよね実際だってあの当時一番ひどかったんじゃないかなそのなんかワークビザを要するに出してあげるからむちゃくちゃ足元見てきて最低賃金ギリギリみたいなので会社によってはね渡したお金をちょっとキャッシュバックするみたいなこともやってましたからね会社で。",
      "start": 1104017,
      "end": 1118632,
      "timestamp": "18:24"
    },
    {
      "speaker": "B",
      "text": "そうですねジョークロフトはもうその典型ですよ外国人いっぱい。",
      "start": 1118632,
      "end": 1122655,
      "timestamp": "18:38"
    },
    {
      "speaker": "C",
      "text": "雇ってやっぱそうなんすね会社名出してよかったんやろかやってるからねまあやってるとこ多いですよね多かったからね当時は。",
      "start": 1122655,
      "end": 1131895,
      "timestamp": "18:42"
    },
    {
      "speaker": "A",
      "text": "ね特にそうですねなんかヘッドハンティングってワードってなんかなかなかこっちらは聞かないなぁと思うんですけどそれはどういう経緯でそのヘッドハンティングし。",
      "start": 1131895,
      "end": 1143879,
      "timestamp": "18:51"
    },
    {
      "speaker": "B",
      "text": "てもらったんですかそれを確か1社目働き始めてすぐなんたりですかねミートアップに出ていてそのミートアップで知り合ったCTOの人と仲良くなりましてその時は何もなかったんですけどその後数ヶ月かな数ヶ月後にうちで働かないって声かけて。",
      "start": 1143879,
      "end": 1169425,
      "timestamp": "19:03"
    },
    {
      "speaker": "A",
      "text": "もらってそのヘッドハンティングは何だろう普通の面接のプロセスを経て結局就職することに。",
      "start": 1169425,
      "end": 1176647,
      "timestamp": "19:29"
    },
    {
      "speaker": "B",
      "text": "なったんですか面接してないですね面接らしいこと。",
      "start": 1176647,
      "end": 1182929,
      "timestamp": "19:36"
    },
    {
      "speaker": "A",
      "text": "はしてないですねその数ヶ月の後に何かやりとりがあったりとかそのミートアップで出会った時に結構なんか話したとかなんですかなんかどういう全然ヘッドハンティングのイメージがわから。",
      "start": 1182929,
      "end": 1194710,
      "timestamp": "19:42"
    },
    {
      "speaker": "B",
      "text": "なくて確かに何ですかねミートアップで会ってでその後何回かやりとりして行き届をしてで今その時は採用してたんですよその人と会った時にでうちで働かないってなったんですけどその採用区が埋まっちゃってごめんね埋まっちゃったねーって言ってまた今度でもキープインタッチしてましょうって今しばらく落とすことなかったんですけどポジション空き家で空き家でというかもっと働く人が欲しいからっていう。",
      "start": 1194710,
      "end": 1229492,
      "timestamp": "19:54"
    },
    {
      "speaker": "A",
      "text": "感じで聞けば聞くほど結構僕のキャリアと似てるなと思ってsirのところも一緒だし僕も適当に学校が始まる前にミートアップ行ってそのレジュメ出して意気投合してでその時にプロセス進んだけどクローズしちゃってキープインタッチしましょうって言って僕その1年後にオファーもらったんですけどめちゃくちゃ似てるな。",
      "start": 1229492,
      "end": 1259535,
      "timestamp": "20:29"
    },
    {
      "speaker": "B",
      "text": "と思います似てるですね。",
      "start": 1259535,
      "end": 1260675,
      "timestamp": "20:59"
    },
    {
      "speaker": "C",
      "text": "そうですね似てるね東橋さんはでもあれだよね本当渡航して1か月目くらい確かワープライズして。",
      "start": 1260675,
      "end": 1266058,
      "timestamp": "21:00"
    },
    {
      "speaker": "A",
      "text": "たよねあそこにそうですねなんか暇だったのかな暇だったのかわかんないけどそうなんかミートアップとりあえず時間あるし行けるところは行っとこうみたいな感じでそしたらなんかなんでなのかわかんないけどその場で行き渡航してなので連絡取ってみたいな感じでし。",
      "start": 1266058,
      "end": 1285911,
      "timestamp": "21:06"
    },
    {
      "speaker": "C",
      "text": "たね素晴らしいちなみに俺も渡辺さんにはそれは聞いてみたかったんですけどMetupで生きとおうってやっぱりCivcTechの話で盛り上がってとかドメイン知識が結構共通点が多くてとかそういう意味で盛り上がったんですか。",
      "start": 1285911,
      "end": 1298255,
      "timestamp": "21:25"
    },
    {
      "speaker": "B",
      "text": "そういやそうですね興味の一致で盛り上がったっていうところが大きいですね面知識はまだまだなかったんですけど自分の情熱を伝えてそこで話し込んでっていうのはあり。",
      "start": 1298255,
      "end": 1313188,
      "timestamp": "21:38"
    },
    {
      "speaker": "A",
      "text": "ましたねじゃあもうそこがすでにシビックテックの会社で今もその会社に戻ってき。",
      "start": 1313188,
      "end": 1319311,
      "timestamp": "21:53"
    },
    {
      "speaker": "B",
      "text": "ているんですよねまあ。",
      "start": 1319311,
      "end": 1320791,
      "timestamp": "21:59"
    },
    {
      "speaker": "A",
      "text": "そういう感じですねちなみにユニティから帰ってきた時には面接はあったん。",
      "start": 1320791,
      "end": 1328375,
      "timestamp": "22:00"
    },
    {
      "speaker": "B",
      "text": "ですか軽い面接する相手全員。",
      "start": 1328375,
      "end": 1333564,
      "timestamp": "22:08"
    },
    {
      "speaker": "C",
      "text": "知ってたんでなさっすよね間違いない出戻りの楽。",
      "start": 1333564,
      "end": 1338486,
      "timestamp": "22:13"
    },
    {
      "speaker": "B",
      "text": "なとこ出てくるみたいな感じで結局雑談して形だけの面接やりましたね。",
      "start": 1338486,
      "end": 1344648,
      "timestamp": "22:18"
    },
    {
      "speaker": "C",
      "text": "なるほどいや素晴らしいじゃあそうよねだから最初のCivcTechのところはやっぱりMetupだからMetupも多分あれですよねCivcTech関連のMetupだったってことですよね議題がそうですねそういうなんかこれが好きだ。",
      "start": 1344648,
      "end": 1359489,
      "timestamp": "22:24"
    },
    {
      "speaker": "A",
      "text": "よねっていうのが一。",
      "start": 1359489,
      "end": 1360110,
      "timestamp": "22:39"
    },
    {
      "speaker": "C",
      "text": "個あったりするとやっぱその次繋がりやすいとかあります。",
      "start": 1360110,
      "end": 1362372,
      "timestamp": "22:40"
    },
    {
      "speaker": "B",
      "text": "よねありますね興味の話で盛り上がるのは結構周活に役に立つんじゃないかなと思いますね。",
      "start": 1362372,
      "end": 1371339,
      "timestamp": "22:42"
    },
    {
      "speaker": "A",
      "text": "確かになんかその面接とかでも1回盛り上げられるといいですよねなんかそのそれだけですごい次へのつながりが全然違う気がするなんかそのちゃんと正しいこと言ってちゃんと受け答えできててもなんかそのやっぱ印象に持ってもらうっていうのってめっちゃ大切だから確かにそこらへんのなんか興味の一致があるのはめちゃくちゃ大切なのかなと思いますね。",
      "start": 1371339,
      "end": 1392393,
      "timestamp": "22:51"
    },
    {
      "speaker": "C",
      "text": "でも就活的な意味で言うんだったらやっぱり一社目の部分そこは印刷の会社があってそんなあとヘッドハントがあって今のシビックテックのとこに一旦入って右翼曲折多分あったんだろうなっていうふうに思いながら次ユニティっていういきなりしかもエンジニアリングマネージャーっていうことでマネージメントポジションのほうへ移ったんです。",
      "start": 1394091,
      "end": 1415006,
      "timestamp": "23:14"
    },
    {
      "speaker": "B",
      "text": "よねそういやICで就職はしたんですけどそうか最初の就職はICかそう最初の就職はICでUnity入ってその後で自分のいたところのマネージャーが抜けて仮のマネージャーやってくれないかっていうことを頼まれてやってたって。",
      "start": 1415006,
      "end": 1436758,
      "timestamp": "23:35"
    },
    {
      "speaker": "C",
      "text": "感じですねすごいねちなみにこれも改めての部分かもしれませんがなんでまたUnityに転職しようと思った。",
      "start": 1436758,
      "end": 1443503,
      "timestamp": "23:56"
    },
    {
      "speaker": "B",
      "text": "んですかそういえばその当時はそのシビックテックの会社で結構長い、6、7年働いてたんですけどもあ、そんな長かったんだうん、すごい長いですよね多分、北米のスタンダードでは長いほどだと思うんですよ6、7年間間違いないうん、でまぁその中で自分の技術に自信が持てなくなったんですね自信が持てなくなったっていうのは何かっていうとまぁ6、7年もあれば学ぶこと全部学ぶじゃないですか間違いないですね自分の技術が伸びなくなってきたっていうところに危機感を持って他のエンジニアのレベルも分からないですしこの後自分の市場価値ってどうなってくんだっていうところでたまたまこれもユニティのリクルーターの方からメッセージもらっててリンクトですね受けてみないかっていうことで受けてみたんですねそしたら通ったみたいな。",
      "start": 1443503,
      "end": 1500966,
      "timestamp": "24:03"
    },
    {
      "speaker": "A",
      "text": "うんそのなんかなんだろそれはじゃあその時はえっとunityの時はなんだろ全く普通のなんだろうヘッドハンティングみたいな感じではなくてもうなんか面接があってみたいななんかいわゆるこっちの流れみたいな。",
      "start": 1501673,
      "end": 1518984,
      "timestamp": "25:01"
    },
    {
      "speaker": "B",
      "text": "のあったんですかそうですね普通の面接プロセスはやってますね。",
      "start": 1518984,
      "end": 1523107,
      "timestamp": "25:18"
    },
    {
      "speaker": "C",
      "text": "なるほどね、ちなみに多分視聴者の方もね、気になってる分だと思うんですけどやっぱりその最初のシビックデックの時が人数結構少なかったんです。",
      "start": 1524642,
      "end": 1533309,
      "timestamp": "25:24"
    },
    {
      "speaker": "B",
      "text": "よね多分入った当初は10人目とかで始まって、でも出た時には40人くらいいた。",
      "start": 1533309,
      "end": 1541255,
      "timestamp": "25:33"
    },
    {
      "speaker": "C",
      "text": "かなC50人ぐらいみたいな40人か数十人にな規模になってっていうやっぱりその規模感的な部分でもねユニティなんて言ったらもう誰もが知る大企業っていうのがねあるかなと思うんですけどやっぱりその大企業に対する挑戦みたいなのもさっきの技術的な習得と同じくらいやっぱりあったんすかそのモチベーションとして環境を変えるっていう。",
      "start": 1541255,
      "end": 1560519,
      "timestamp": "25:41"
    },
    {
      "speaker": "B",
      "text": "にはそうですね他がどんなことをしているか知りたいしその大企業って多分その企業に入る前大企業に入る前ってなんかこの人たちみんなスーパーエンジニアだ。",
      "start": 1560519,
      "end": 1573088,
      "timestamp": "26:00"
    },
    {
      "speaker": "A",
      "text": "って思うじゃないですか思ってます思ってましたね。",
      "start": 1573088,
      "end": 1576930,
      "timestamp": "26:13"
    },
    {
      "speaker": "B",
      "text": "みんな思ってるだからスーパーエンジニアの人たちから学ぶところがたくさんあるからビジネスはさておきそういうスーパーエンジニアの人たちと一緒に働きたいなっていうところで応募しましたね。",
      "start": 1576930,
      "end": 1593499,
      "timestamp": "26:16"
    },
    {
      "speaker": "A",
      "text": "ちなみになんですけど結構そのシビックテックに熱意があって他の会社とかはバンクーバーもしくはカナダではないないんですかシビックテックの業界。",
      "start": 1594948,
      "end": 1606459,
      "timestamp": "26:34"
    },
    {
      "speaker": "B",
      "text": "ありますありますありますカバメント系の仕事がいっぱいあるんですけど採用がそんなにないっていうのとまあ数が少ないんで会社も小さいです。",
      "start": 1606459,
      "end": 1616849,
      "timestamp": "26:46"
    },
    {
      "speaker": "A",
      "text": "しじゃあそっち考えるっていうよりはそんな募集もないしなんかその時ちょうどよくユニティのユニティの人にも誘われてたしみたいなのが。",
      "start": 1616849,
      "end": 1629355,
      "timestamp": "26:56"
    },
    {
      "speaker": "B",
      "text": "あったってことですねそうですね、そういうもんですねあと当時パンデミックの直前だったのかなだかで採用がどこの会社もガツガツやっ。",
      "start": 1629355,
      "end": 1639702,
      "timestamp": "27:09"
    },
    {
      "speaker": "A",
      "text": "てたんですよね確かに、それこそ僕も多分僕が一社目の時なのかなそこら辺。",
      "start": 1639702,
      "end": 1646027,
      "timestamp": "27:19"
    },
    {
      "speaker": "B",
      "text": "が大体あ、パンデミック始まってたかもしれないですね。はい。2020年。入社も簡単でし。",
      "start": 1646027,
      "end": 1656925,
      "timestamp": "27:26"
    },
    {
      "speaker": "A",
      "text": "たね。19年とか20年です。",
      "start": 1656925,
      "end": 1658586,
      "timestamp": "27:36"
    },
    {
      "speaker": "C",
      "text": "かね。19年。",
      "start": 1658586,
      "end": 1659387,
      "timestamp": "27:38"
    },
    {
      "speaker": "B",
      "text": "とか。20年。",
      "start": 1659387,
      "end": 1660148,
      "timestamp": "27:39"
    },
    {
      "speaker": "A",
      "text": "かな。",
      "start": 1660148,
      "end": 1660818,
      "timestamp": "27:40"
    },
    {
      "speaker": "C",
      "text": "20年。20年、そうね。20年だからそうよね。前半、本当に3、4月くらいから多分パンデミックそろそろやばくね?みたいな感じだったと思うから、まあ多分その辺です。",
      "start": 1660818,
      "end": 1668995,
      "timestamp": "27:40"
    },
    {
      "speaker": "A",
      "text": "よね。確かにあの時期は結構盛んだったみたいですよね。なんか後から。",
      "start": 1668995,
      "end": 1673198,
      "timestamp": "27:48"
    },
    {
      "speaker": "C",
      "text": "振り返ると。間違いない。19年あたりで一発ドーンって来てて、20年になってコロナになってむちゃくちゃ縮小傾向になり、どこの会社も全部クローズして、21年後半か22年くらいからコロナバブル来て。",
      "start": 1673198,
      "end": 1688077,
      "timestamp": "27:53"
    },
    {
      "speaker": "B",
      "text": "またバーンって来たっていう感じでし。",
      "start": 1688077,
      "end": 1689379,
      "timestamp": "28:08"
    },
    {
      "speaker": "A",
      "text": "たね。ちなみにそのなんかやっぱそのスーパーエンジニアがいるんじゃないかと思ってそのユニティに働いてみて割となんか1年9ヶ月なのかな働いてると思うんですけどそこがなんか短かったのは全然こいつらスーパーエンジニアじゃないじゃんって思ったんですかそれともなんかやっぱりシビックテクナーみたいになったのかなんかそこら辺のちょっと理由についても聞いてきたいなと思うん。",
      "start": 1689379,
      "end": 1713205,
      "timestamp": "28:09"
    },
    {
      "speaker": "B",
      "text": "ですけどどっちもですねその会社のブランドにビビってたっていうのはあります正直入ってみて働いてみたらなんだこいつらってなるほど。",
      "start": 1713205,
      "end": 1725948,
      "timestamp": "28:33"
    },
    {
      "speaker": "A",
      "text": "どうなんだとはいえ僕もあの小さい会社から小さめの会社から中くらいの会社を経て今は割と大きめの会社にいさせてもらってるんですけどとはいえ結構やっぱスーパーエンジニアというかすごい人たちは多いなっていう印象があるんですけどそこらへんはどうでした。",
      "start": 1725948,
      "end": 1746618,
      "timestamp": "28:45"
    },
    {
      "speaker": "B",
      "text": "ラッキーですねラッキー。",
      "start": 1747444,
      "end": 1749765,
      "timestamp": "29:07"
    },
    {
      "speaker": "C",
      "text": "ですね、たまたまあなたはラッキーの。",
      "start": 1749765,
      "end": 1753106,
      "timestamp": "29:09"
    },
    {
      "speaker": "B",
      "text": "だけですよ自分の言った部分が良くなかったかもしれないですそれは分かんないですよねこれ決してユニティっていう会社をけなすわけではないですしユニティジャポンの方たちは全然自分とは関係ない部署なんですけど彼らはもう確実にスーパーエンジニアだなっていう人たちも何人かお話しさせていただいてましたしっていうのはあるんですけど、まあ自分の部門はそんなに大したことなくてです。",
      "start": 1753106,
      "end": 1779029,
      "timestamp": "29:13"
    },
    {
      "speaker": "A",
      "text": "ねまあ時期によって。",
      "start": 1779029,
      "end": 1781852,
      "timestamp": "29:39"
    },
    {
      "speaker": "B",
      "text": "も変わりますしねきっとそうですね時期によっても変わると思うんですけど、まあでもそれもいい経験だなって今なって思うんですよねその前のシビックテクの会社にもう6年7年いて多分自分のキャリア的にもジュニアからシニアっていうところまで行ってたと思うんですけど他のエンジニアたちはほぼほぼみんなずっとシニアの人たちだったんで自分とそのシニアの人たち比べるじゃないですかはいはい確かにってなったらずっと追いつかないわけですよなのでまぁその社内の感覚的ではなんか自分インターミディエイトぐらいかなぐらいの感じでユニティ行ってみたらなんか俺も全然死ぬや。",
      "start": 1781852,
      "end": 1827850,
      "timestamp": "29:41"
    },
    {
      "speaker": "C",
      "text": "じゃんみたいな自分の立ち位置。",
      "start": 1827850,
      "end": 1831075,
      "timestamp": "30:27"
    },
    {
      "speaker": "B",
      "text": "を確認できたというそうですねそういうのありまし。",
      "start": 1831075,
      "end": 1833438,
      "timestamp": "30:31"
    },
    {
      "speaker": "C",
      "text": "たねこれちょっとでも俺二人にも聞いてみたいんだよなそれ東海オンエアさんの言っていたところのその朝にねじゃあ入ってっていうので多分スーパーエンジニアが何人かいらっしゃってで多分そのスーパーだって思う習慣が多分あるはずで多分渡るさんのねやっぱ行かれてっていうたまたま部署がねちょっとあかんかったかもしれないけどでもちょっと周りのレーベルがやっぱりそこまでじゃないなっていうふうに思うタイミング多分あるはずでなんかお互いがお互いがなんかどの辺をなんか判断記事に挙げてたのかな行動の書き方なのか人人間関係なのか仕事の進め方なのかって。",
      "start": 1833438,
      "end": 1863552,
      "timestamp": "30:33"
    },
    {
      "speaker": "B",
      "text": "ちょっとそう気になったん。",
      "start": 1863552,
      "end": 1864372,
      "timestamp": "31:03"
    },
    {
      "speaker": "A",
      "text": "ですがえっと僕はあのまあでもいろんなタイプですごいなっていう人がいるんですけどあのスタッフって呼ばれる人たちは漏れなく何かがすごいなっていうのが今のところの僕の印象です僕みたいなICエンジニアはだいたいそのスタッフレベルの人たちまでとまあ自分のEMまあ自分のスキップマネージャーぐらいまでは絡むんですけどそうですよねそのスタッフって呼ばれている人たちはまあコードの読むのが早かったりだとかインタビューを一緒にまあなんかやったりするんですけどその中でえっとすごい僕がなんだろう見てるところとなんか違う次元でも話せてるとかあのまあコードリーディングがめちゃくちゃすごい早かったりだとかなんだろう設計の速さだったり判断だったりその深さだったりとかも全然違うなっていうのがありつつ逆の例で言うとああそうでもないなっていう人たちも確かにいたりはするんですけどちゃんとあのクビになってるというかちゃんとなってたりするんでまあもちろんねチームによってとか僕が全員見れてるわけじゃないですけどまあ僕は割とあのチームもこの今もうすぐ2年とかなんですけど中でチーム移動したりだとかあのオンコールウェブのオンコールチームに入ってたりで結構いろんな人と話したりだとかあの割とワイドに見れてると思うんですけど結構そうですね僕が見た中ではちゃんとすごい人はちゃんとすごいしあそうでもないなーって人ちゃんとなんかクビになってるイメージがあるなっていうそういう意味ではすごいラッキーだったの。",
      "start": 1864372,
      "end": 1969709,
      "timestamp": "31:04"
    },
    {
      "speaker": "C",
      "text": "かもしれないですね確かになるほどねオトロさんは逆に期待してた期待値の部分とっていうところの差はさすがにあったんじゃないかなと思うんですけど具体的に何を期待してらっしゃったと。",
      "start": 1969709,
      "end": 1979110,
      "timestamp": "32:49"
    },
    {
      "speaker": "B",
      "text": "かありますもうちょっとちゃんとしたアーキテクチャーとかちゃんとしたコードとかっていうのを期待はしてたんですよ入ってみたらアーキテクチャーはそんなにちゃんとしてなくて今コードメンテナンスもなんかすごい秘伝のタレを継ぎ足すような感じのでまぁガッカリしたの結構大きいですね今コードの規模もそんなに大きい規模じゃなかったんですけど大きい規模じゃなかったからか結構早く早めにキャッチアップができたんですよねどうやって動いてるか何が動いてるかっていうのがあるんですけどそこからものを作るまでのステップが遅かったり。",
      "start": 1979110,
      "end": 2025299,
      "timestamp": "32:59"
    },
    {
      "speaker": "C",
      "text": "だったりとか大平なるほどね本流から外れてたからって可能性はありますUnityっつったらそれはもちろんエンジンが有名でっていうのがありますけど渡辺さんが多分言いちゃったポジションってそのパブリッシャー側。",
      "start": 2025299,
      "end": 2038202,
      "timestamp": "33:45"
    },
    {
      "speaker": "B",
      "text": "のほうですかね渡辺広告。",
      "start": 2038202,
      "end": 2040642,
      "timestamp": "33:58"
    },
    {
      "speaker": "C",
      "text": "周りだったんですよ大平。",
      "start": 2040642,
      "end": 2041802,
      "timestamp": "34:00"
    },
    {
      "speaker": "B",
      "text": "広告周りか渡辺うんなのでお金を作る部門だったので、部門的なインパクトは大きいはずです。",
      "start": 2041802,
      "end": 2050168,
      "timestamp": "34:01"
    },
    {
      "speaker": "A",
      "text": "よね。そう。",
      "start": 2050168,
      "end": 2050547,
      "timestamp": "34:10"
    },
    {
      "speaker": "B",
      "text": "よね、。",
      "start": 2050547,
      "end": 2050818,
      "timestamp": "34:10"
    },
    {
      "speaker": "C",
      "text": "確かに。あんまり部門がちょっとハズレだったっていうよりも、もしかしたらそういうところにあんまりお金をかけられていなかったのか、採用する人たちがちょっとあかんかったのか、なんかあったってことです。",
      "start": 2050818,
      "end": 2063710,
      "timestamp": "34:10"
    },
    {
      "speaker": "B",
      "text": "よね、たぶんね。なんでしょうね。きっとまあ古い構図でも良しとする文化があったのかもしれない。",
      "start": 2063710,
      "end": 2072753,
      "timestamp": "34:23"
    },
    {
      "speaker": "A",
      "text": "ですし。まあなんかあとはなんかそのもともとシビックテックの会社で働いて、一緒に働いてた人たちのレベルがそもそも基準値として高かったっていう可能性もあります。",
      "start": 2072753,
      "end": 2083746,
      "timestamp": "34:32"
    },
    {
      "speaker": "C",
      "text": "よね。それもあり。",
      "start": 2083746,
      "end": 2084505,
      "timestamp": "34:43"
    },
    {
      "speaker": "A",
      "text": "ますね。まあ今その経験を経ててやっぱり戻ってきたいと思えるってね、戻ってきてるわけだからまあなんかその僕まあ今までの会社で戻るかって言ったら戻りはしないなって感じなんでその行動のレベルとかも考えてもだからやっぱそこの多分元のなんかあれの高さみたいなのはあったのかなっていう。",
      "start": 2084505,
      "end": 2106969,
      "timestamp": "34:44"
    },
    {
      "speaker": "C",
      "text": "感じですね深井確かにねそれもちょっと聞いてみたいですね渡辺さんは一回自分のフィビテックの会社で大きい会社出て外からやっぱり自分の今までいた会社を外から見れたわけじゃないですかやっぱレベル高かったなっていうふうに思った人とかもしくは技術だったりと。",
      "start": 2106969,
      "end": 2121740,
      "timestamp": "35:06"
    },
    {
      "speaker": "B",
      "text": "かがあったってことですかそうですねレベル高かったなってリーダーシップも含めてですけど仕事のやり方もっとちゃんとしてたなっていうのもありますしもっと良かったなっていうのもあります。",
      "start": 2121740,
      "end": 2134999,
      "timestamp": "35:21"
    },
    {
      "speaker": "C",
      "text": "ねなるほどねなんかタイキーを。",
      "start": 2134999,
      "end": 2138540,
      "timestamp": "35:34"
    },
    {
      "speaker": "B",
      "text": "言ったらもっとタイキーだって言ってたよごめんなさいCivcTechの会社の方も古いコードはそのままだったりとかするんですけれどもそれでも何だろうベストプラクティスは踏んでいたりだとかコミュニケーションもちゃんとしてたりだとか透明性が高いっていう性格はありましたねなるほど。",
      "start": 2138540,
      "end": 2157619,
      "timestamp": "35:38"
    },
    {
      "speaker": "C",
      "text": "ねなんか大きい会社に行けば行くほどやっぱり体系立てられたねアーキテクチャーもそうだし設計もそうだし人の動かし方もそうだしっていうのはもっと体系立てててすごく感動するものなのかなって思ったらそうではなかった。",
      "start": 2157619,
      "end": 2170287,
      "timestamp": "35:57"
    },
    {
      "speaker": "B",
      "text": "ですもんねそうですね大きい会社は多分もっとステージが上手くならないとステップアップできないとかっていうところはあったりするかもしれないです。",
      "start": 2170287,
      "end": 2182475,
      "timestamp": "36:10"
    },
    {
      "speaker": "A",
      "text": "ね本当にまあ大きい会社って言っても会社に寄りきりですよねそうですよね本当になんか僕がその開発とかで思うのは本当に何だろうちゃんとあの古いコードはもちろんいっぱいもう10年選手とかなんでコード自体ももう10年以上なのかななんであれですけど古いコードは全然あるけどそれにでもやっぱなんかアップデートちゃんとされてるし割と綺麗になっているなっていう印象だしなんかやりたいこと新しいことやるときになんかその探すとちゃんとあのドキュメントだったりとか人だったりでちゃんとなんかえっと今までのなんか範例みたいなのがあってそれにのっとってそれがちゃんとフレームワークみたいになってて使うだけで新しいものができるみたいなのが結構あって僕はそこらへんにはすごい満足しててまあそういう意味でもまだまだちょっと今の場所で学べるかなみたいなの。",
      "start": 2182475,
      "end": 2234748,
      "timestamp": "36:22"
    },
    {
      "speaker": "C",
      "text": "はあるんで素晴らしいなるほどねまあ会社による部署によるってことですね結局そう。",
      "start": 2234748,
      "end": 2239811,
      "timestamp": "37:14"
    },
    {
      "speaker": "A",
      "text": "ですね本当にはいちなみになんですけどあのEMに7ヶ月かなUnityではICをやられた後にエンジニアリングマネージャーに移動されてると思うんですけど移動っていうかポジションチェンジなのかな役職チェンジなのかな。",
      "start": 2239811,
      "end": 2263171,
      "timestamp": "37:19"
    },
    {
      "speaker": "B",
      "text": "してみてどうでした比較的簡単でしたねっていうの簡単って言うとあれなんですけど誘われたからやってみるやってみたって言うだけなんですよねエンジニアリングマネージャーっていうポジションがあるけどやってみない?いいよっていうそのぐらいの本当に軽いノリなのでそんなに認めたしなかったけどやってみてよかったたのはもっとビジネスのことを知れたっていうことプロダクトマネージャーともっと密接に一緒に仕事をすることができたっていうのは一つの大きな財産かなと思いますねまあネガティブな理由で8エンジンicからマネージャーになったっていうのはもうこのコードベース見たくなかった。",
      "start": 2263171,
      "end": 2313732,
      "timestamp": "37:43"
    },
    {
      "speaker": "A",
      "text": "っていうのはああそうなんだちなみになんかあのエンジニアリングマネージャーって言っても結構そのどのぐらいその自分も作業するかとかって違ってくるじゃないですかもう本当に行動は全く見ないもうピーポーマネジメントに徹したっていう。",
      "start": 2313732,
      "end": 2330101,
      "timestamp": "38:33"
    },
    {
      "speaker": "B",
      "text": "感じなんですかコードを書く時間自分から書く時間はなかったですねコードレビューする時間とメンタリングする時間だとか資料を詰めたりだとかプロダクトとかクロスチームのコミュニケーションするとかそういうところのほうが大きかったですね。",
      "start": 2330101,
      "end": 2349974,
      "timestamp": "38:50"
    },
    {
      "speaker": "C",
      "text": "三宅わたるさんのエンジニアマネージャーして実際管理というかマネジメントするエンジニアの方々ってどのくらいの人数いるものなんです。",
      "start": 2349974,
      "end": 2358900,
      "timestamp": "39:09"
    },
    {
      "speaker": "B",
      "text": "かちなみにこのチームは4。",
      "start": 2358900,
      "end": 2361273,
      "timestamp": "39:18"
    },
    {
      "speaker": "C",
      "text": "人いました4人かなるほどね東海オンエアさんとかもそれあるでしょ大体。",
      "start": 2361273,
      "end": 2365836,
      "timestamp": "39:21"
    },
    {
      "speaker": "A",
      "text": "そんなもんエンジニアは1人の。",
      "start": 2365836,
      "end": 2369859,
      "timestamp": "39:25"
    },
    {
      "speaker": "C",
      "text": "EMに作っていただくかも。",
      "start": 2369859,
      "end": 2370859,
      "timestamp": "39:29"
    },
    {
      "speaker": "A",
      "text": "しれないけどうちは小さかったらいくらでも小さい出来立てのチームとかあるんであれなんですけど基本的には4人から8人エンジニアが。",
      "start": 2370859,
      "end": 2381727,
      "timestamp": "39:30"
    },
    {
      "speaker": "C",
      "text": "いるかなそうなんだ。",
      "start": 2381727,
      "end": 2384569,
      "timestamp": "39:41"
    },
    {
      "speaker": "A",
      "text": "なるほどねそうですね何十。",
      "start": 2384569,
      "end": 2387059,
      "timestamp": "39:44"
    },
    {
      "speaker": "C",
      "text": "人とかそんな規模でやっぱり管理する人とかもいたりするのかなと思ったけどそんなことはないん。",
      "start": 2387059,
      "end": 2391061,
      "timestamp": "39:47"
    },
    {
      "speaker": "A",
      "text": "ですねそうするとなんか多段階的になって多分あのグループみたいなのができるのかなと思いますそうかそうかなんか僕もこの頃やっぱちょっとなんだろうな年数とかも上がってきて結構そのマネジメントとかは全然しないもちろんしないですけどプロジェクトリードだったりとかあのメンタリングとかをやる機会が多くなってきてちょっと困ってるというかなんか僕どこまで行ってもやっぱなんか日本の文化で育ってきてなんかマイクロマネジメントをしてしまう自分がいて困ってるんですけどそこらへんなんかこっちの人ってすごいなんだろうなんかマイクロマネジメントをしないじゃないですかそこらへんのなんか違いとかには困ったりしなかった。",
      "start": 2391061,
      "end": 2435481,
      "timestamp": "39:51"
    },
    {
      "speaker": "B",
      "text": "ですか困ったことはないですねマイクロマネジメント自分も好きじゃなかったんで多分それ性格の話かもしれないですね日本ではマイクロマネジメントされてましたけどそれは好きじゃ。",
      "start": 2435481,
      "end": 2449699,
      "timestamp": "40:35"
    },
    {
      "speaker": "A",
      "text": "なかったですその僕も好きじゃないししないように気をつけてはいるんですけどその視点としてマイクロマネジメントしかされて日本ではねされてこなかったんでそういう視点があってあの気を抜くとそういう視点に戻ってしまうなみたいなのがあって多分まあ言動とかまでにはそれが出てないとは思いたいんですけどそのそこらへんをなんかのマネジメントって難しいなあって僕の的にはちょっと思って。",
      "start": 2449699,
      "end": 2480218,
      "timestamp": "40:49"
    },
    {
      "speaker": "C",
      "text": "てそこらへんは的な行動に移ってしまうタイミングってちなみにどういうときなん。",
      "start": 2480218,
      "end": 2487362,
      "timestamp": "41:20"
    },
    {
      "speaker": "A",
      "text": "ですか?イメージは行動っていうかそのなんかエクスペクテーション期待をしてしまう相手に対してこういうふうにした方がいいよねなんかその何か目標みたいなものがあってそれに対してその人が足りてなくてここをこうしたらいいよねみたいなのを言ってしまいそうになるとかとかなんだろうなその人を良さを生かすような動きをできればいいんだけどそのプロジェクトのゴールに対してこうで僕はこういうふうなことをしてるからこの人にはこういう動きをしてもらいたいだとかなんだろうその期待から入ってしまうなんかその100点っていうものがあってその人がなんか100点にどこまで近づけるかみたいな見方をしてしまってるなっていうなる。",
      "start": 2487362,
      "end": 2541537,
      "timestamp": "41:27"
    },
    {
      "speaker": "B",
      "text": "ほどねそれはインテント、自分の意図を最初に伝えられてないから多分起きると思うんですよねマイクロマネジメントって多分つい口出したくなっちゃうというか、そういう瞬間があると思うんですけどその口出したことによってそのプロセスが変わるかどうかっていうのを打ち出す前に考えたりとか大変もしなんかこの人の向かっている先が違うなって思ったらもう一回そこで立ち止まって自分はこのコミュニケーションで合っていたのかっていうところを見返してつなげていくって形にしてますねマイクロマネジメントは多分信頼を作るところから始まると思うんですよ信頼関係が十分にあればマイクロマネジメントはすることはないかなって思って。",
      "start": 2541537,
      "end": 2595042,
      "timestamp": "42:21"
    },
    {
      "speaker": "A",
      "text": "ますし確かに僕の中ではまだ全然なんでその経験もないし別になんかなってしまいそうだなっていうまあ思ってる段階であってまだなんか全然そこまで行ってないしまあ全然あのまだまだEMになるっていう予定もないのでいいのかなと思いつつなんか自分は人をそういう視点で見てるなっていうのをずっと思っててなんかそのなんだろうな、EMになる時に勉強というかなんか自発的に何かしたものはあるんですか?もしくは何かユニティの中でそういうプログラムがあっ。",
      "start": 2595042,
      "end": 2641652,
      "timestamp": "43:15"
    },
    {
      "speaker": "B",
      "text": "たりだとかないですね、なかったです何か覚えてはないですねまあもともとなんですかね、リーダーシップというかリードしていくのが好きだったっていうのもありますし、そういうのは性格によるものだとは思うんですけど、ピックアップゲームとピックアップファイトその喧嘩を買うのか売るのか、その必要があるのか、そこまで気にならなかったらそこは別に無視してもいいだろうっていうそういう考えはやりますね。",
      "start": 2641652,
      "end": 2680309,
      "timestamp": "44:01"
    },
    {
      "speaker": "A",
      "text": "なるほどね性格なのかなぁなんか確かに渡辺さんはなんかうまくやりそうな感じしますもんね僕はうまくやらなそうなまあ僕もともとあんまりチームプレイが得意ではないのかもしれないからまあでもそれの頑張る一つというかそれを学ぶ一つとしてちょっとフォトキャストのインタビューをやらせて。",
      "start": 2680309,
      "end": 2700824,
      "timestamp": "44:40"
    },
    {
      "speaker": "B",
      "text": "もらってたりするのでマイクロマネージメントできるっていうことはね他の人はよく見れてるってことなんでねそれ。",
      "start": 2700824,
      "end": 2707755,
      "timestamp": "45:00"
    },
    {
      "speaker": "C",
      "text": "はそれでいいですよね。",
      "start": 2707755,
      "end": 2708796,
      "timestamp": "45:07"
    },
    {
      "speaker": "A",
      "text": "そういうことやっぱりそういうこと言えるのが多分EM向きなのかな向き不向きわかんない。",
      "start": 2710223,
      "end": 2716165,
      "timestamp": "45:10"
    },
    {
      "speaker": "C",
      "text": "ですけど俺はマイクロマネジメント自体がなんかむちゃくちゃ悪いものってイメージあんまないんだよな正直なんか確かにこっちの人たちってマイクロマネジメント嫌うよねっていうのはあるけど渡辺さんのようになんだろうなあの割とその100点満点っていう部分に対してみんなが向かってくれてるだろうなっていう信頼関係を築くだから見なくても100点満点の方向にきっと進んでくれているだろうっていうふうに信頼する基盤をまずは築くっていうやり方も当然あるだろうし一緒に2人3局でそいつのことを1から10枚ちゃんと見といてその人が本当に困ったらただ意図はちゃんと伝えといてってことですよね自分はこういうふうな形のゴールを目指してるからみたいなそれはそれで一つの指導方法なんじゃないかなって気がし。",
      "start": 2716165,
      "end": 2755368,
      "timestamp": "45:16"
    },
    {
      "speaker": "A",
      "text": "ますけどねなんかちょっと僕の相談会みたいになっちゃってそっから打って変わって次の会社出戻りですけどではEMっていうのをやらなかったわけだと思うんですけどそれは何か理由があるんですかEMもうや。",
      "start": 2755368,
      "end": 2776220,
      "timestamp": "45:55"
    },
    {
      "speaker": "B",
      "text": "だってなったんですかEMもうやだっていうのは特に無かったんですけど出戻った時のポジション募集がスタッフだったっていうのが1つありましたねICだったっていうのはありますしあとまぁ1回マネジメントやるともうそのマネジメントのスキルって残るじゃないですか自分のスキルの中になんでまぁいつEMやってもまぁ問題ないだろうっていう自信はつきますし逆にそのICってどんどんテクノロジーって遷移するじゃないですか新しいものが出てくるのでまぁそういうところのキャッチアップはずっと続けていきたいなっていういうのはありましたねあともう一個の理由はその当時ユニティを離れるちょっと前からこのレイオフが今もその当時レイオフすごい多かったんですよ今もいて多いんですけど今もアマゾンすごいことになってますけどねうんまあそうですねでまぁマネジメントやる側からすると誰かをレイオフしなきゃいけない時が来るわけじゃない。",
      "start": 2776220,
      "end": 2847359,
      "timestamp": "46:16"
    },
    {
      "speaker": "A",
      "text": "ですか?そうです。",
      "start": 2847359,
      "end": 2848179,
      "timestamp": "47:27"
    },
    {
      "speaker": "B",
      "text": "よね。それは間違いない。それやりたいかって言ったらやりたくないんですよね。うん、間違いない。自分の意思じゃないけどレイオフしなきゃ。",
      "start": 2848179,
      "end": 2858523,
      "timestamp": "47:28"
    },
    {
      "speaker": "C",
      "text": "いけない。そうです。",
      "start": 2858523,
      "end": 2860444,
      "timestamp": "47:38"
    },
    {
      "speaker": "B",
      "text": "よね。そうです。やりたくなかったんで、まあ気が楽になったってのあり。",
      "start": 2860444,
      "end": 2866227,
      "timestamp": "47:40"
    },
    {
      "speaker": "C",
      "text": "ますね。なるほどなああんまりなんかそうかフロックの中でデモ取りっていうのをそもそも経験した人っていないんじゃ。",
      "start": 2866227,
      "end": 2875585,
      "timestamp": "47:46"
    },
    {
      "speaker": "A",
      "text": "ないかなそもそもまあEMまで行ってる人があんまりいないんじゃないかなっていうのはありますよね確かにそうかもスタッフとかはまあちょこちょこはちょこちょことかまあ一人二人ぐらいは知ってるけど周りだとそうですねでもなんかこのこの何回かあの結構その僕よりも年上の方に撮らせてもらってあのお願いしてるんですけどすごいなんか勉強になりますよね本当にそこらへんのやっぱレベルの人たちがあんまり周りにいないと思うんでそうですよね、デモ撮りみたいな経験。",
      "start": 2875585,
      "end": 2908964,
      "timestamp": "47:55"
    },
    {
      "speaker": "C",
      "text": "も含めていやそうそうだから先陣切ってくれてるねーの渡るさんたちには本当感謝しかないっていうのはあるんですがそれもちょっと含めてやっぱりデモ撮りっていう感覚というかなんかやっぱりそのなんだろうなやっぱりこっちのこの出戻り文化みたいなの聞くっちゃ聞くじゃないですか元いた会社に戻ったんだみたいな割と結構ウエルカムなもんなんですか1回抜けて何年かいなくなっててチームの構成なんかも変わってるだろうしキャッチアップすることも多いだろうし足手元にならないかなとかっていう不安も正直あったりするのかなとか割とどんな気分なのかみたいな。",
      "start": 2908964,
      "end": 2942902,
      "timestamp": "48:28"
    },
    {
      "speaker": "B",
      "text": "全体的に聞いてみなくてどうでしょうねそのデモ取ってきた人が入ってくる分にウェルカムだと思いますよもうコードベース知ってるしビジネスも知ってる人だしまあそうか確かにオンボーディングすごい簡単になるでしょう。",
      "start": 2942902,
      "end": 2959752,
      "timestamp": "49:02"
    },
    {
      "speaker": "A",
      "text": "しなんか辞める時に悪い気持ち、お互いに悪い気持ちにさせない辞め方ができるのが多いのかなみたいな日本でもそういう会社いっぱいあるとは思うんだけどなんか辞めるって言うとなんかその長期雇用、生涯雇用みたいなのの中でなんかなんで辞めんだよみたいなイメージが日本にはちょっとありますもんねあるよね、就寝雇用的なやつよね就寝雇用、それだ、それだそのイメージが。",
      "start": 2959752,
      "end": 2987810,
      "timestamp": "49:19"
    },
    {
      "speaker": "B",
      "text": "俺もちょっと引いててもう辞めるってなったら次のとこでも頑張ってねみたいな。",
      "start": 2987810,
      "end": 2993317,
      "timestamp": "49:47"
    },
    {
      "speaker": "C",
      "text": "うんそのくらいですよねですよねなんだろうなやっぱりどうしても俺もその終身雇用的なイメージっていうのがちょっと頭にへばりついてるとこがやっぱあってやめるっていうのがすごくもう心なんか後ろ指さされていてなんかもう1回出て行ったら戻れないみたいなそんな感覚ないですよねこっちの人たち。",
      "start": 2993626,
      "end": 3013400,
      "timestamp": "49:53"
    },
    {
      "speaker": "B",
      "text": "ってそういえばこっち多分こっちというかITのインダストリーにもよるのかもしれないんですけど転職が当たり前じゃないですかそうですねある人が転職することによってその人ともともと働いていた人たちがその人の移動した先の人とコネクションができるかもしれないその人の移動した先で就職先は見つかるかもしれないっていうチャンスがあるので確かに転職に関してはネットワーク広げるっていうぐらいの感覚で多分周りの。",
      "start": 3013400,
      "end": 3047060,
      "timestamp": "50:13"
    },
    {
      "speaker": "C",
      "text": "人も思ってると思うそうなんですよね、理屈で言えばわかるんですけどね、なんか間違いなくその転職される、もしくはするっていう人たちがいる中でその可能性を広げるっていう側面が間違いなくあるっていうのは理屈ではわかるんだけどなんかどっかで引っかかってるっていうのはやっぱり日本文化は俺も染まっちゃってるの。",
      "start": 3047060,
      "end": 3062931,
      "timestamp": "50:47"
    },
    {
      "speaker": "A",
      "text": "かなっていう確かに難しいですねちょっと戻ってそのじゃあunityの時にそのEMに変わってから今またICに戻って今のじゃあ気持ち的にはまだその自分がどっちで行くかは決めてないみたいなイメージなんですか。",
      "start": 3062931,
      "end": 3083034,
      "timestamp": "51:02"
    },
    {
      "speaker": "B",
      "text": "決める必要はあるんですか。",
      "start": 3083034,
      "end": 3084215,
      "timestamp": "51:23"
    },
    {
      "speaker": "A",
      "text": "ねっていうところではいやそうだと思うんですけどなんだろうさっき言われてたように多分EMに行ってそのコードを書かないでキャッチアップができなくなるとその決まっちゃうみたいなのはあるじゃないですかでなんか多分やっぱその人によりこっちが得意だなとかってあると思うんですよあのコードのキャッチアップってそのなんていうのキャッチアップはまずコードじゃないかえっとなんて言うんでしたっけそういうのスキルのキャッチアップみたいなのももう年も年だし疲れたみたいな人も多分結構いると思っててなんでなんだろうまあ決める必要がないよねって言われれば確かにそうなのかなぁと思いつつなんか決めてる人が多いなっていう印象なのと決めた方が。",
      "start": 3084215,
      "end": 3136227,
      "timestamp": "51:24"
    },
    {
      "speaker": "B",
      "text": "楽なのかなわかんないけど人によるんじゃないですかそのキャリアラダーの登り方っていろいろあると思うんですよねただまぁ1回マネジメントやったっていうのはねさっきも言ったんですけどもちろん自信にはつながるのでもう1回マネジメントやれって言われたらはいやりますって。",
      "start": 3136227,
      "end": 3153480,
      "timestamp": "52:16"
    },
    {
      "speaker": "C",
      "text": "できる準備はできてると思う。",
      "start": 3153480,
      "end": 3155262,
      "timestamp": "52:33"
    },
    {
      "speaker": "B",
      "text": "んですよもちろんICもそうですけどでもマネジメントする側になったとしても例えばアーキテクチャとかっていうのって抑えとかないといけないと思うのでそのキャッチアップが止まるわけではないと思うんですよね一。",
      "start": 3155262,
      "end": 3173161,
      "timestamp": "52:35"
    },
    {
      "speaker": "A",
      "text": "回そのマネジメントをやる視点に立ってみてなんかICをやる上で変わったこと。",
      "start": 3173161,
      "end": 3178903,
      "timestamp": "52:53"
    },
    {
      "speaker": "B",
      "text": "とかってありますそうですねトランスペレンシーを保つこととかコミュニケーションを大事にするっていうことは多分ウェイトをもっと置いているように感じますね。",
      "start": 3178903,
      "end": 3194264,
      "timestamp": "52:58"
    },
    {
      "speaker": "A",
      "text": "それはマネージャーとのってこと。",
      "start": 3194264,
      "end": 3195585,
      "timestamp": "53:14"
    },
    {
      "speaker": "B",
      "text": "ですか自分のマネージャーともそうですし自分のチームメイトともそうですし誰が責任を持ってるかっていうところ。",
      "start": 3195585,
      "end": 3204894,
      "timestamp": "53:15"
    },
    {
      "speaker": "A",
      "text": "ですよねそれはえっと自分のそのEMの経験から見えないことが多いなと思っ。",
      "start": 3204894,
      "end": 3210399,
      "timestamp": "53:24"
    },
    {
      "speaker": "B",
      "text": "たんですかemの経験からするとこういう情報がエンジニアから入ってくると嬉しいなってなりますよねそう。",
      "start": 3210399,
      "end": 3223160,
      "timestamp": "53:30"
    },
    {
      "speaker": "C",
      "text": "か確かにまあどっちが何のボールを持っているのかっていうのがねお互いにちゃんと分かった方がいいっていうのって割とボールを渡しているつもりなんだけども実は渡してもらっていないっていうふうに見えることなんかもあったりするのでそういったのってやっぱりEMの経験一回踏んだっていうので見えるものもやっぱ増えたって。",
      "start": 3223160,
      "end": 3239840,
      "timestamp": "53:43"
    },
    {
      "speaker": "B",
      "text": "いう話ですよねそうですね見えるもの見たいものっていうのがわかってきたのでそれを活かしてレポートとかもやってますし。",
      "start": 3239840,
      "end": 3248299,
      "timestamp": "53:59"
    },
    {
      "speaker": "A",
      "text": "コミュニケーションもできてますね素晴らしいちなみにごめんなさい僕あのさっき出戻りっていう言葉を多分途中から勘違いしててあのemとあのicの出戻りとあの会社の出戻りをあのごっちゃにしたまま話してました。",
      "start": 3248299,
      "end": 3265242,
      "timestamp": "54:08"
    },
    {
      "speaker": "C",
      "text": "ね確かになんかそうねどっちなんだろうって思いながら。",
      "start": 3265242,
      "end": 3269683,
      "timestamp": "54:25"
    },
    {
      "speaker": "A",
      "text": "だけど確かにちょっと付け加えるようにしましょう失礼し。",
      "start": 3269683,
      "end": 3273004,
      "timestamp": "54:29"
    },
    {
      "speaker": "C",
      "text": "ました。",
      "start": 3273004,
      "end": 3273184,
      "timestamp": "54:33"
    },
    {
      "speaker": "A",
      "text": "はいじゃあ次行っちゃっていいそうですねそろそろ最後の質問ぐらいにしましょうか時間も。",
      "start": 3275718,
      "end": 3282665,
      "timestamp": "54:35"
    },
    {
      "speaker": "C",
      "text": "そうですね最後っていうのもそうなんですがやっぱりねその大きいところがやっぱりシビックテクノロジーに戻ったっていうところで俺これちょっと聞いていいのかあれなんですがあのぶっちゃけ大企業の方が給料いいんじゃねーのって思ってるんですけどスタッフエンジニアにやっぱり戻るときってやっぱり今のEMポジションでもらっていた給与ベースをベースにやっぱり交渉はされたって。",
      "start": 3282665,
      "end": 3305879,
      "timestamp": "54:42"
    },
    {
      "speaker": "B",
      "text": "感じなんですかそうですね給与ベースでの交渉はありますけど正直多分若干下がったのかなと思うん。",
      "start": 3305879,
      "end": 3312475,
      "timestamp": "55:05"
    },
    {
      "speaker": "C",
      "text": "ですけどやっぱ下がるんだそう。",
      "start": 3312475,
      "end": 3314336,
      "timestamp": "55:12"
    },
    {
      "speaker": "B",
      "text": "よね会社の規模にもよりますし会社の様式にもよるじゃないですか例えばユニティってパブリックエクイティの会社ですけど今私がいるところはプライベートエクイティですしで大きな会社ってRSUとかそういうのついてくるじゃないですかそうですねなので一概に数字で上がれないっていうのはあると思うんですけれども、Unityで働いて、その辺のベースラインが新しくなった分、でも取った時に給与交渉ちゃんとしましたし、そんなにガクッと下がったっていうわけではない。",
      "start": 3314336,
      "end": 3352556,
      "timestamp": "55:14"
    },
    {
      "speaker": "C",
      "text": "ですね。ないってこと。",
      "start": 3352556,
      "end": 3353757,
      "timestamp": "55:52"
    },
    {
      "speaker": "A",
      "text": "ですね。ちなみに何だろう、そこすごい僕も聞きたかったけどよく瀬名さん聞いてくれたなって感じですけどそこらへん下げることに全然抵抗はなかったんですかきっとそのスタッフっていう今前のなんだろポジションがシニアででユニティに行ってでスタッフっていうのもあって多分上がってるとは思うんですけどやっぱり大きい企業でそのキャリアを続けるに比べたらやっぱりその下がることにはなるじゃないですかそこらへん。",
      "start": 3353757,
      "end": 3386733,
      "timestamp": "55:53"
    },
    {
      "speaker": "B",
      "text": "のなんか語るでは下がるかもしれないですねなんか。",
      "start": 3386733,
      "end": 3390214,
      "timestamp": "56:26"
    },
    {
      "speaker": "A",
      "text": "そこらへんのモチベーションみたいなのってどこにあるのか。",
      "start": 3390214,
      "end": 3392735,
      "timestamp": "56:30"
    },
    {
      "speaker": "B",
      "text": "なって多分自分が追いかけてるのって給与の数字じゃなくてどこまでのインパクトを与えられるかっていうところと自分のやってることが将来誇れることなのかっていうところは考えてますねわかるんです。",
      "start": 3392735,
      "end": 3415102,
      "timestamp": "56:32"
    },
    {
      "speaker": "A",
      "text": "けどね、いや僕も考えてるんですよ考えてるけどやっぱりお金に惑わされちゃうだんだん。",
      "start": 3415102,
      "end": 3423904,
      "timestamp": "56:55"
    },
    {
      "speaker": "B",
      "text": "としたよね若いですしね、そういうところはその後でいいと思うんですよでも例えば広告の業界で働くことに自分の場合はですね意味を見出せなくって広告の業界って結局お金を左から右へと知るだけじゃないですかみたいなところがあってそれが一部はゲームクリエイターに還元される広告集内ゲームクリエイターに還元されるからいいとこではあると思うんですけどそれをじゃあこの先5年10年とその業界に身を投じられるかって自分で考えた時にそれはないなって思ったんですよねでもそれが好きな人もいるんですよ広告のお金の動かし方とかそういうのも好きな人がいるからそういう人たちはこうユニティからFacebokとかGogleとかねFacebokもGogleも広告の会社じゃないですか、収入はそうですねそうですねそういうキャリアパスはあると思うんですけど自分はそこにうん、価値を見出せなかったってなり。",
      "start": 3423904,
      "end": 3499069,
      "timestamp": "57:03"
    },
    {
      "speaker": "C",
      "text": "ますね素晴らしいいい話といってあれかもしれないですけど幸せっちゃ幸せっすよね割とお金っていうのがやっぱり最初のベースにもちろんみんなキャリア的になりやすいだろうけどその次のインパクトって何かしら自分も持つべきだと思っててそれがユーザーへのインパクトなのかビジネスに対するインパクトなのかチームに対するインパクトなのかっていう部分って割と俺もいつも気にはしてる人はやっぱかっこいいなって思うしそこに出会うのって、正直、運の要素もあるんじゃないかなと思うので、渡辺さんはね、そういった意味だと、そういうインパクトを与える先っていうのが自分の人生の中で出会うことができたってことです。",
      "start": 3499069,
      "end": 3534684,
      "timestamp": "58:19"
    },
    {
      "speaker": "B",
      "text": "よね。そうですね今も本当に年に数回ですけどCodefrJapanの方と関わりを持たせてもらってたりとかもしますしこっちのCivcTechの方とのつながりも。",
      "start": 3534684,
      "end": 3548932,
      "timestamp": "58:54"
    },
    {
      "speaker": "C",
      "text": "ありますしいやそうですよね渡辺さんには以前フロックでもCivcTechTourっていうのを開いていただいてたくさんの人が来てくれてCivcTechについての話もちょっと聞いてもらったっていうのもあるのでやっぱりその活動の親族が好きなんだなっていうのもすごく伝わってきたからいやいいですよねそういう繋がりがネットワークもちゃんと広がってるっていうのが。",
      "start": 3548932,
      "end": 3569037,
      "timestamp": "59:08"
    },
    {
      "speaker": "A",
      "text": "素晴らしいと思いますあとなんかもう一つだけちょっと聞きたいんですけどなんか大きい会社とその小さい会社のなんかよくある比較としてその大きい会社お金はいいけどデベロッパーエクスペリエンスは良くないよねみたいなのってあると思っててそれは僕は朝菜はすごいいい会社だしコードも綺麗だしすごいけど確かに小さい会社のほうが自分1人から出るインパクトみたいなのが大きいしやっぱり大きい会社になれば大きい会社になるほどプロセスっていうのはゆっくりになってて例えば一つのフィーチャー出すにしてもabテストしてabテストもデータちゃんと欲しいから4週間やろうねとかでちょっと開発は自体は遅いし自分が作ったものがどんどん出ていかないみたいなデベロッパーエキスペリエンスの悪さみたいなのがあるかなとは思っててそこら辺は何か感じたり。",
      "start": 3569037,
      "end": 3626181,
      "timestamp": "59:29"
    },
    {
      "speaker": "B",
      "text": "しましたかそうですね遅いっていうのはありましたね遅いけどインパクトってでかいじゃないですか大きい会社ってエンドユーザーしかいないんで小さい会社ってエンドユーザーそんなに規模が大きくないんでバグ出しててもそんなに大した。",
      "start": 3626181,
      "end": 3642546,
      "timestamp": "60:26"
    },
    {
      "speaker": "A",
      "text": "ことないというか確かに。",
      "start": 3642546,
      "end": 3643746,
      "timestamp": "60:42"
    },
    {
      "speaker": "B",
      "text": "謝るべきだよねバグ出してそれがねレポートされるなりオブザバビリティで管理されてればユーザーのバグがそのまま品質管理につながるんで別にバグ出してもいいじゃんっていうそういう感じなんでそっちのほうがサイクル的には自分には合って。",
      "start": 3643746,
      "end": 3662450,
      "timestamp": "60:43"
    },
    {
      "speaker": "A",
      "text": "ますよね逆になんか大きい会社のほうがここはこっちのほうが良かったなみたいなのはありました。",
      "start": 3662450,
      "end": 3669174,
      "timestamp": "61:02"
    },
    {
      "speaker": "B",
      "text": "か大きい会社のほうがデータ管理というかデータを見るチャンスが多かったですかねデータを見るチャンスっていうのはデータを取ってるポイントが多いのでいわゆるビッグデータですかねビッグデータでユーザーの行動がほぼ可視化できるという状態になっているのはすごいなと思いました。",
      "start": 3669174,
      "end": 3699876,
      "timestamp": "61:09"
    },
    {
      "speaker": "A",
      "text": "ね確かにそれもなんか構造的にやっぱり小さい会社とか小さいシステムだと撮ったところで100人とか200人みたいなまあそのサイズによりますけどねそこらへんだと撮っても意味ないみたいなのがあったりとかまあ見えるようにして頑張ってデータ撮ってもみたいなところがあるからしょうがないのかなと思い。",
      "start": 3699876,
      "end": 3720115,
      "timestamp": "61:39"
    },
    {
      "speaker": "C",
      "text": "ますけどね確かに好き好みは絶対出ますよねビッグトライクを扱うようなやっぱりねエンジニアリングがしたいって人は絶対いるからねその辺は本当。",
      "start": 3720115,
      "end": 3730020,
      "timestamp": "62:00"
    },
    {
      "speaker": "B",
      "text": "好み出るようなって思います。",
      "start": 3730020,
      "end": 3731361,
      "timestamp": "62:10"
    },
    {
      "speaker": "A",
      "text": "ねだいたい最後に同じ渡辺さんのようなステータスの人がこれからカナダに出るとしたら海外に出るとしたらみたいなのを聞くんですけど来たの10何年。",
      "start": 3731361,
      "end": 3747210,
      "timestamp": "62:11"
    },
    {
      "speaker": "C",
      "text": "前です。",
      "start": 3747210,
      "end": 3747550,
      "timestamp": "62:27"
    },
    {
      "speaker": "B",
      "text": "もんね聞き方じゃ。",
      "start": 3747550,
      "end": 3751875,
      "timestamp": "62:27"
    },
    {
      "speaker": "C",
      "text": "ないですか聞き方じゃないですか最近なんだろうな渡るさんのような人がカナダにって言うともう十何年前のこと思い出すよっていうふうになっちゃうからなんかシンプルに海外挑戦するぞっていう人が渡るさんに相談とか来たらなんかどういうふうなアドバイスとかしてるとかあんすかちなみにそれだね来んなよとか人生は一度きりだ。",
      "start": 3751875,
      "end": 3776298,
      "timestamp": "62:31"
    },
    {
      "speaker": "B",
      "text": "とかいやなんですかねそのリスクを得るんだったらどんどんやったらいいと思いますよああ素晴らしい例えば俺がラッキーだったのは家族がまだ健康だし日本にいる家族ですよね日本にいる家族が健康だしこっちで何か起こってものは当時あったんでそういうセーフティネットがあるともうじゃあリスクって何なのぐらいな感じじゃないですかそうっすよねーカナダの渡航費用と留学費用と生活費それがまあなくなるぐらいだと思うんですけど100万時間かでもねそれと引き換えに英語は勉強できるようになるしこっちの業界の動きも分かるようになるし確かに考えたらそれ別にでっかいリスクではないと思うんでうんうん、帰ってくるのをね、見てみたらっていうなのでまあリスクを許容できるんだったらどんどん悩んでないでいいってしまう。",
      "start": 3776298,
      "end": 3842204,
      "timestamp": "62:56"
    },
    {
      "speaker": "C",
      "text": "って感じですね素晴らしいという。",
      "start": 3842204,
      "end": 3844783,
      "timestamp": "64:02"
    },
    {
      "speaker": "A",
      "text": "ことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうござい。",
      "start": 3844783,
      "end": 3862532,
      "timestamp": "64:04"
    }
  ],
  "highlight1": "渡辺さんの日本での過酷な働き方がカナダでキャリアをスタートさせる大きな理由だったのか、詳しくはPodcastで話しています",
  "highlight2": "そのシビックテックの会社で6、7年働いて、技術に自信が持てなくなった時にユニティへの転職を決意したという転換点、詳しくはPodcastで話しています",
  "highlight3": "ワタルのようなスーパーエンジニアが多いと思っていたユニティでの実態はどうだったのか、またカナダで活躍するための具体的なアドバイスは何か、詳しくはPodcastで話しています"
}