{
  "episodeGuid": "760ff738-9ad6-44e8-901d-e087c043bd99",
  "episodeTitle": "【特別回】日本と北米のSESはどう違うのか？名門UBC大学のエンジニアと徹底討論！日米の内製化文化の違い",
  "transcribedAt": "2025-10-26T23:21:56.003Z",
  "duration": 3171,
  "fullText": "はい始めていきましょう今回も毎度ながら僕トガシーリョウとフロックの代表のセナさんあとはケイさんって言って今UBCっていうバンクーバーの大学の内製部隊みたいなところで働いていてちょっと今回のトピックに詳しいかなっていうのでちょっとゲストとして来ていただきましたケイさんよろしくお願いします簡単に自己紹介もお願いしていいですか。よろしくお願いします今ご紹介いただいたケイですご紹介いただいたとおりカナダのバンクバー大学UBCというところでWebアーキテクトとしてもう6年ぐらいになるのかなずっと働いていますタイトルはアーキテクトなんですけどやってるのはWebアプリケーションを作ったり大学で必要なウェブサイトを作ったりという形になりますね。なんかそのケイさんのインタビューもちょっと後々にお願いしていきたいんですけど今回ちょっとセナさんのなんて言うんだろう持ち込みというかあのトピックを持ち込んでいただいたのでちょっとトピックから聞いてみましょう。かねはいまあというわけでそう久しぶりにちょっとトピックを持ち込ませていただいたんですが最近なんかx界隈とかも含めてなんですがね日本がだいぶseの仕事なくなるんじゃねっていうのが実はちょっとバズっていてその文脈としてやっぱりまあ日本でやっぱり内製化を進めていらっしゃる会社さんが最近増えていると最近僕も海外就職周りのご相談とかで日本の明らかに今までSEに頼り切っていた会社が内政部隊に切り替えたっていう話を耳にする機会もあってそれもあってそういえば日本ってSEにずっと頼り切りだったけれども北米圏ってそういうSEみたいな会社ってほぼないよねって思って内政化はほぼ昔からもされている印象しかなかったんだけどそもそも北米における内政化って昔からあったのか今やられている方々ってどういうふうな仕事をしているのかそういった方々から見て日本のやっぱりSEに頼りきりの文化構造企業文化みたいなところってどうやったら変わると思うのかみたいなその辺の壁打ちもしくは情報交換みたいなのができればなというふうに思って今日K先生に来ていただいたということなんですがUBC6年もいらっしゃったんですね僕それ知らなかった3,4年くらいかなと。思ったんですよおだしょー。そうですねこれもキャリアで言えばよかったんですけど僕日本でもカナダに来る前働いていてそのときはまさにSIRのほうで働いていてそこもキャリアちょうど6年ぐらいなんですねちょうど今カナダでのこのUBCのキャリアが6年同じぐらいになったっていうところです。ねどうしようね、だからレアなキャラクターといったらちょっと言い方悪いかもしれませんが、大体北米来るなんかフロックメンバーって頑張ってSARS入るぞー!みたいなね、あの人たちがやっぱり多い中で、そうするとKさんのキャリア的にはSIRからのUBCっていう、逆にSARSは経由したことがないってことですか?そうですね個人的にはSaaSアプリケーションを主軸に置いた会社っていうのも働いてみたいなとは思っていたんですけれどこっちのカナダのほうに来て僕BCITで学んでたんですけどそこを卒業した後就職先探したときにUBCが一番最初に合格内定もらって入れたという形なんですねUBCを選んだ理由としてやっぱり強かった結構当時はビザのサポートかどうかとかあとは企業として安定してるかどうかっていう観点が強かったのでUBCがいいなって思ってそこに行った形ですね結果としてはそれでSaaS系の会社を経由してないっていう形になりますねちなみに。なんかちょっとあんまり理解できてないんですけどやられてること自体はwebアプリケーションの開発をされてるわけじゃないですかそれっていうのはSaaSなわけですよね。深井そうですねただいわゆるみんなの認識のあるSaaSとはちょっと違うやっぱり内部に向けたシステムの色が強いってことかなグローバルに他の企業とかに使ってもらうサービスを作ってるとかではなくて単純にどちらかというと自分のとこのお客さんに必要なサービスとかも逆に自分の内部の組織に必要なサービスを作るとかそういう色が強い。ですねそっかじゃあB2CにしろB2Bにしろそのサービスが外に向いてるかうちに向いてるかの違いなのかなそう。ですね一般的にやっぱSaaSの会社っていうと他の会社とかまあランダムなユーザーに使ってもらうのが前提になってると思うんですけどうちはやっぱうちの組織にすごい紐づいたところっていう色が強いおだしょーグロース。しようっていう意識は正直そんなないですよねおそらく自分たちの内部サービスとして運用するわけだから成長させなくっちゃみたいな一般的なサービス企業とのマインドとはさすがにちょっと変わるんじゃないかなと思いますけどね。三宅そうですねあんまりグローバルにどんどん展開していこうみたいなのはサービス地帯の中ではないっていう形ですかね自分の組織のビジネスをもっとグローバルに広げていってそれをサポートするITが必要だったらそのITも当然グローバルを目指したものになっていくっていうそういった色はちょっとあるんですけどただITだけのグローバルなサービスをいきなり作ろうみたいな流れはない。って感じですね基本的には自社製品を作るっていうのは人件費削減になるってことですよねすごい簡単に言うと基本的には外に向けてそれ自体で稼ぐっていうよりは今まで人間がやってたものをシステムを入れることで簡略化簡単にしようだったり人件費削減しようみたいな動きが基本的にはなのかなそうです。ね一番やっぱ色が強いのは業務の効率化っていうところがあると思います。そうよね、それも実は僕もちょっと気にはなっていて、やっぱり逆に北米圏のこの企業さん、大学だったりとかインフラだったりとか、銀行さんだったりとか、僕の知り合いでもBCITからRBCっていうこっちの銀行さんに内政部隊として入られた方もいらっしゃったので、やっぱりこっちの企業さんってそういう内製化されるソフトウェアエンジニア部隊とかエンジニア部隊っていうのをやっぱり持ってらっしゃるんだなっていうのはすごいなと思いつつなんで雇うんやろうなっていうのも持ってて一方でやっぱデブショップとか一応外部に何かお願いする能力を持った会社さんもないわけじゃないからもう別に外注してしまっても別にいいんじゃないかなっていうふうに思いながらやっぱり内製化する理由としてはさっきのファンシーにあった経費削減だったりとか、経費じゃないかコスト削減だったりとかパフォーマンスの向上だったりとかやっぱり内製化した方が都合がいいことの方が多いんだろうなというふうには思っていてそこら辺も先ほどKさんに答えていただいたような効率化だったりとかの側面が企業の内製化するモチベーションとしては高いってことですよね。僕が日本で、僕ももともとSIRに入ってて、2、3年は仕事してて思ったのは、結構その、住宅開発というか、SIRどっかに行って開発するみたいな感じになると思うんですけど、結構その、仕様の聞き取りみたいなのをすごいしないといけなくて、それってなんか自分のそれが自分の社内にあった方がやりやすいのはやりやすいのかなって思うんですよね結構なんかよくその客先に行ってビーティングしてでなんか仕様を聞き取りに行ってで作ってで使ってもらってでなんか前より使いにくいみたいな言われてみたいななんかすごいそのなんか無駄なって言ったら悪いけどやり取りが多くてしかもなんか社外の人だからちょっとそれがちゃんとフォーマルな感じになってないといけなくてみたいなのでそこですごい時間をなんか使ってたんでそれが確かに内部にあったら仕事のやりやすさとかはなんか効率はすごいいいのかなっていうのは思いますけどね。そうですね僕もそれは感じていてやっぱ北米の会社が内製してる理由の一つってスピード的なパフォーマンスの色も強いなって思っています僕が日本でSIRで働いてたときやっぱり量産と同じようなことを感じていて基本的にはお客さん対外の組織になってしまうんでそこのコミュニケーションコストがすごい高いんですよねでまぁそれをさらにまあ仕事でやっていくってなるとやっぱその契約のプロセスとか契約がどうかとか都度そういう話も絡んできてそういうところを考えるとやっぱ自分の中の組織にそういう内製できる舞台があるとそこのスピードは改善されるなと思いますただ当然その内政組織があってもその組織内での摩擦っていうのはある程度あると思うんですけど例えばうちで言ってもその部署間で近い部署と遠い部署あんまり普段から話さないようなところとかもあったりしてそういうところはやっぱりある程度コミュニケーションコストは上がるんですけどそれでもやっぱり契約面とかそういうところの重さっていうのは対外組織とはまた違う話。になると思うのあともう一つなんか一番、もう一つ別の視点から違うなって思うのは多分、あの、外注されてる先、仕事を受け負ってるところは必ずしもお客さんの幸せが自分らの幸せではないっていうことが結構、僕が見る範囲ではあって、っていうのはなんかそのプロジェクトがちょっと失敗して炎上したり伸びたりすると受けてる会社としてはちょっと儲かっちゃうんですよね伸びて契約期間が増えるわけじゃないですかだから必ずしも早くいいものをポンと作れればいいっていうわけではないのでお金の動きがお客さんから受注された会社にあるわけじゃないですかなんでなんかそこをちょっとそこのところからなんか必ずしもお客さんを幸せにしようとはしてないなぁみたいなのを結構感じる場面があってそれもないのがまあその内製された内製部隊のいる会社のいいところではあるのかなと思います確か。に。あとなんか一方でも、なんか日本って、そもそも、そもそもなんか内製されてるのがスタンダードなのか、あの、住宅みたいなのがスタンダードなのか、よくわかってないけど、あの、日本ってあれですよね、あの、オケ屋には、オケはオケ屋にみたいな言葉があって、なんか、その道のプロに任せようみたいなのがあるから、なんか、経営に対してはコンサルみたいなのを雇ってプログラミングっていうかシステム開発はそういうところを雇ってみたいななんか自分らのプロのことしかやらずに他はなんか外に外注しちゃおうみたいな文化があるのかなみたいなのは感じますけど。ねまあそうねオッケーはオッケーって言うとむしろ良い風に聞こえるなっていう気もするんだけどむしろねやっぱりその正直俺は重要度の問題なのかなって気がして重要性かそのやっぱりテック部隊を内部に持たないと何かしらのトラブルが起こるよねとかテック部隊まあ内製部隊を自分たちで持っておかないと後々のやっぱりコストに結局つながるよねっていう認識があるのであればまあ多分内製化するのが自然だと経営者層って思うのが普通だと思うんだけどそれを思わないっていうことは。別。によそにまかしたらよくね、みたいな。多分もう一つあって、日本ってあの、クビにできないんですよ。ああ、そうか。内政で自分の中で思ったら、そのシステムがいらなくなった時に、システムって基本的にはなんか、特にその、違う事業で稼いでる業態の会社にとっては、その投資になるわけじゃないですか。今、。そのシステムに使うお金をかけて、後でその、まあ効率化したことであの回収するっていうのが基本だと思うんですけどあのいらなくなった時にそのシステム部隊がいらなくなった時に首にすることはできないじゃないですか日本だとまあできないことはないかもしれないけどなんでそのこっちはやっぱ内政部隊がいてもまあ最悪全部もうシステム作るもんねーやって言ったら全員切っちゃえばまあそうだよねってなるけど日本は多分それができないっていうのもあってその内部に人間を持ちたくないみたいなのがあるのかなっていうのはお。だしょーまあ確かにねそこを逆に俺ケイさんに聞きたいんですけど例えばUBCって内製部隊以外で雇ったりすることって何ですか例えばデブショップの人にピンポイントにちょっとヘルプに来てもらうとかそういうのがあるんだったら日本であったとしても例えば内製部隊は本当にコアな部分だけ持っておいて本当にシステムをもう新しく作らなくちゃいけないっていうときに外部からちょっと人を呼び寄せたりとかフリーランスなのかコントラクトなのか分かんないけど結局その中でせっその自分たちが持っているサービスに責任を持つ人がいないっていうのが一番の僕は内政がないところの問題点だと思っているのでなんかもしubcでねそういうなんか本当に忙しい時は要素から人を雇うみたいなことがあるんだったらもうそれを真似すりゃいいんじゃないかなって単純に思っちゃうね。そうですね、うちの方だとやっぱり外部の人を雇ってやるっていうこともありますね。ただ、人を雇うっていうよりはSIとかSEっぽく、人を雇うっていう形よりはプロジェクトベースでお願いする、委託するっていう形。がメインで今瀬野さんがおっしゃられたようにやっぱコアの部分は自分たちで抱えることが多くて例えばキャンペーンとかイベントをやるときの新規的な部分は人手が足りなかったら外部にお願いするっていうケースが多かったりしますねあとはクリエイティブ的な自分のところのエンジニアたちがあんま得意でないような分野とかがあったりするとそこをカバーするためにも外注に頼るっていうケースはあったりしますうーんそうです。よねだから多分そこのバランス感覚みたいなところがもしかしたらね結構養われていないと言ったらかもしれませんがなんか日本の例えば普通の企業がなんか内製化を進めよっていう風になったときにどこがコアでどこがやっぱりねあの自分たちが書かれなくちゃいけない部分部分なのかっていう判断でわりかしエンジニア系のやっぱり知識だったりまあなんか見方みたいなのがないと判断つかないんだろうなーって思うのでなんかそこで何か今ケースあのイベントがさんが言ったようなもう一気にとりあえず内製化舞台をバッと広げてしまってもコストにしかならなくてもこんなことするくらいだったらもう外部に移宅したほうがいいやっていうのは意味は分かってなんかまあその辺のバランス感覚かなっていう気もちょっと。するんですよねあとはなんかそのエンジニアもそのそういう会社に行きたいかっていうとあー確かにそうねなんかその今だからその内製化じゃあしようってなった時にえっとそういうなんだろうトラディショナルな会社日本のまあなんかトラディショナルな会社が内製化したいってなった時にその欲しいのはSIRのような人たちではなく、どっちかというとSARSに関わってたとか、そういうのをできる人材が欲しいわけじゃないですか。そういった時に、それで考えると、やっぱり結構システムとかは大きくなる。会社が大きければ大きくなると思うんで、それができる人材になるわけだけど、その人材が必ずしもそういうトラディショナルな会社で内製化を進めたいかって思うと、うーん、自分がそのポジションにいたら別に行きたくはないなっていうのもありそう。おだしょーまあねでもその辺俺もそう思ってたんだけどこの間日本の会社さんで内製化成功したよって会社の話聞いたときには社長さん自身がすごい若い人に変わったらしくってそここの会社は本当に内製部隊にするためのモダンな開発環境とは何かエンジニアに一体いくら払えば来てくれるのかっていうことをゼロから考えてくれたらしくって言ってしまうと給料だったり働き方だったりリモートだったりみたいなないなところもちゃんと考慮しての結構ガツッと文化ごと変えたっていうのは印象に残っててそこのタイグの部分は僕もすごい気になっててやっぱりKさんを筆頭に僕らのやっぱり今知り合いの中でも銀行さんだったりあと僕の知り合いでBCハイドルで働いてらっしゃるこっちの電気会社ですね働いてらっしゃる方だったりあとはもちろんKさんみたいにUBCで働いてる方もいらっしゃって結構長く働いてる印象がやっぱあるんですよねでその裏にはまあ給与体だ対偶だったりとかまああとは本当に先ほどお話にあったまあなんでしょ安定安定点ですかあのやっぱり首になったaオフの頻度っていうのは正直サースに比べればあまり効かないのでやっぱりそういうなんか別の魅力があってやっぱり選ばれるのかなというふうに思うんですが計算の周りにいらっしゃる例えばubcみたいな大きい音大学で働かれている方のモチベーションというんですかねあのサースとかに移らずにそこで働き続けるモチベーションというのもやっぱりその辺に起因している感じですか。そうですね、周りを見ているとやっぱり結構ワークライフバランスを何らかの理由で重視している人が多いと思っていて、一番典型的なのはやっぱりお子さんがいる方、僕も子供がいるんですけど、その場合って結構柔軟な勤務形態が必要とされると思っていてそれがリモートワークができるであるとか会社への出社が必要でも出る時間がちょっと柔軟性が持たせられるとかそういった意味であと仕事がそんな忙しすぎないというところもありますねそういう意味で自分で自由に使える時間が多かったり自分でコントロールできる時間が割と多いそこに魅力を感じてる人は多いなっていう印象を受けますねその中で余分に出た時間をそれぞれ使いたいものに使う育児であれば育児ですしそれとは別に普通に自分のプロジェクトとか持ってそっちのほう伸ばしていきたくてそれをやってる人とかもいたりしますね。大偶面に関してはこれもぶっちゃけ話になっちゃうかもしれませんがやっぱりSaaS系のやっぱり企業で働かれてる方の方が多いは多いですよね多分。そうですねやっぱり給与水準で見るとSaaS系のところに比べると一段階下がるなっていう印象はありますし特にUSの企業に比べるとストックですか株ももらえたりはしないところが多いと思うのでやっぱお金の面ではやっぱ劣るなっていう印象ありますね。ことですよ。ねなんか僕前の会社がえっとサースの会社を買い取ったなんて言うんだろうえっとファイナンシャル系の会社だったんですよそれで感じたのはすごいなやっぱ圧倒的な安定があるなぁというかその別にそのサースじゃないかえっとまぁそこの会社で言うとそのサースの事業でぶっちゃけ儲けなくてもあのなんとかなっちゃってるんですよなっちゃうんですよねまあそのそのソフトウェア自体はあの多分黒字だったんだけど資金源というかまあすでに稼ぐ手段を持ってるんでそこのなんか安定はめちゃくちゃ強くてなんだろうそのレイオフの波みたいなのとかもあんまり影響を受けない印象だしそういうのはやっぱちょっと強さっていうか安定性っていうのは多分一番ありそう。ですよねまあそうよねとはいえこれもまあよそからまあ第三者目線から見ていいのであればですけどやっぱりその辺て安定するものなんですかubcさんでいうんだったらその生徒のたれば者管理とかおそらくねあの何そのカリキュラムを例えばウェブサイトにのデータを例えば管理するだったりとかまたやることっていろいろあると思うんですけど一般的なSaaS企業でレイオフするタイミングって業績が悪くなっただろう売上が下がっただろうもしくは景気が悪いだろうっていう部分によってのレイオフっていうのが多い中でやっぱりその辺は大学みたいな割と昔からの授業のところに関してはいきなり売上がガンと下がるとか景気の煽りみたいなのは受けにくいとかその辺の認識が働いてる側としてもあるってことです。かねそうですねやっぱりそれは僕も感じていて特にこの前コロナがあったときそれがすごく感じられましたねやっぱり大学ってああいったことが起こってすぐに学生がいなくなるってことはそうそうないのでやっぱりコロナが起きてる間もサーズ系企業とかたくさんレイオフとかもあったと思うんですけれどそういったレイオフの波があるときにも僕の周りでは全然レイオフされたっていう話は聞かなかったですね。コロナを乗り越えたら、多分何が来ても乗り越えられるんですよね、。きっと。やっぱりリョウさんが言われるように、安定しているところっていうのは、強いビジネスがすでにあるから、全体的には安定しているのかなっていうのは感じますね。なるほどね。ちょっと話変わるんですけどセナさん的には内政化進めたところがあって日本の会社がどんどんそういうふうになっていけばいいよねっていう考えなんですか。そうですね言ってしまうと俺はだから昔から内政化しない理由って何かなって考えた時にITだったりそのテクノロジーの分野が軽視されてるからと正直思ってた人なんですよその会社にとって内政部隊を要する今も抱えるくらい重要なことではないから別にさっきキャネーターのとかしたが行ったようにまあコストは別に要素に持てばいいしあのなんかトラブルあったらトラブルあった時にまあ対応してもらうくれる人がその場にいりゃいいしなんかねあの外部に委託すればもうことすでに足りるよねっていうのでまあ有名な話かもしれないけどねどこぞの例えば日本の銀行さんが自分たちのシステムのこと全くわかっていなくてブラックボックスしてしまってもう顧客に多大なる迷惑をかけたみたいなよくあるじゃないですかなんかああいうのがやっぱり起こりやすいのも結局その自分たちに作ってきたそのシステムだったりとか外部委託してきたものっていうのがそれを理解してる人たちが中にいないから起こる現象だろうなと俺は思ってはいるのでそういった面で見るんだったら日本のそういうテクノロジーだったりIT化みたいな部分が進む一つの要因としても内製化が一般的になるというのは重要なことなんじゃないかなっていうのが一つあとエンジニアの例えば待遇だったりとかエンジニアがどれだけ重要なポジションかっていうのを知らしめると言ったら言い方悪いけどたくさんの企業に知ってもらったほうが僕は日本のエンジニアが幸福度も上がるんじゃないかなと思ってる人なのでですると総合的に考えてやっぱり内製化が進んだ方がエンジニアにとってもいいし企業にとってもプラスなんじゃないかなっていう。ふうに思ってるんですねまあ今なんてないんだろうけども一応多分上資質部門みたいなのっているじゃないですかなんか規模感の問題なのかなーって思ってまあ確かになんかアプリ作るとか例えばなんか銀行のねあの色のある銀行がなんか大きい銀行があると思うんですけど例えばそこがじゃあもっとあのオンラインバンキング充実させようっていうのであのモバイルアプリ作ろうってなった時にえっと多分まあ住宅会社とか使うそのsirを使って多分開発すると思うんですけどでも上質はまあいるわけじゃないですかだからそのね規模感セナさんが言ってるのは規模感的な問題なんですかもっと内部にエンジニアを持ってメインはその人たちで進めていきましょう。みたいなまあそうですね少なくともなんかそういうなんだろう世間一般にニュースとかであるようなトラブルを聞いてるとねあのなんでこのトラブルが起こったのかっていうのを解説するyoutbeとかあるわけじゃないですかなんかそういうのを見てるともう中に誰もわかる人がいなくてみたいなことをよく聞くから上司数がそもそも機能してるのかなっていうのを一方でちょっと感じるところでありますよねそうなのでそこで言うんだったら言ってしまうと例えば本当にKさんみたいに優秀な例えばエンジニアさんを中で抱えるだけの魅力がないのかそれともシンプルに職率が高いのか中での情報統率が取れてないのかなんかしらやっぱり事情があってっていうとこがあるしそれが今内政化を進めようっていうふうになってるんだったら僕はいい兆候じゃないかなっていうふうに思ってるっていうイメージですね。結構僕、北米が内政が進んで、日本は逆にSEとかSIRに外注するっていうのがなんで進んだのかっていうのを考えたときにやっぱり経営層のITへの向き合い方のスタンスが結構初期で違ったせいっていうのがあるんじゃないかなと思っていて割と僕のとこも結局IT以下の主な業務は業務効率化って言ったんですけど日本って割とITに対する初期のスタンスって業務効率化すること既存の業務をいかに早く正確にやるかっていうところに主眼を置いたものが多かったと思うんですけど割と北米は業務効率化だけを主眼に置いてないと思っていて逆に経営層。がITを。なんだろう新しくビジネスを今のビジネスを再構築するツールとして見ている色が強かったなと思っていてだから結構日本ってさっきも言われてた情報システム部みたいなのがそういう事業系の会社にもたくさんあると思うんですけど今は変わってきてるかもしれないんですが昔の流れでいくと割とそういう部門って社内で固みが狭いところが多かったと思うんですよメインの事業から見られるとちょっとメインから揃えてるどうしてもコストセンター的に見られる直接利益を生み出さないでコストを抑える効率化していくところっていうだけの見方でそれ自体が価値を生み出すものではないっていう見方が強かったと思うんですね経営の方がそれが結果としてエンジニアに対する待遇とかにもつながってきてると思いますしまああとIQを使ってなんか新しいことをやっていくかみたいなスタンスの違いにもなってきてるのかなと思ってます。まあそうですシンプルに悔しいっていうのがやっぱりあってなんかやっぱりそういうテクノロジーによって自分たちの生活がどう変わるのかもしくはね自分たちの運営がどう変わるのかっていうところがまあ想像ができないとやっぱりそれは礼遇対象になるんだろうなと思うのでまあコストとしてねしか見られていないっていうの今の発言ももちろんそうかなと思うけれどもそれがね今最近になって変わってきてるんだったら何とか応援できないかなというふうに思うんですがやっぱりそのじゃあ計算的な目線から見てももし日本での内製化をスムーズに進める要因が仮にあるとすれば今の話からやっぱりトップ層のやっぱり意識改革というかあのそのテクノロジーの分野を自分たち内製部隊で持つことのやっぱり恩恵っていうのをちゃんと認識してくれたらまあだいぶ変わるのかなっていうイメージ。ですかねやっぱそうですね、。やっぱそれはすごいあると思っていて、さっきりょうさんが言われてたみたいに、そういった事業系、強い事業がある会社で、じゃあIT化を進めていこうって言ったときに、まあその優秀なエンジニアたちがその会社に入っていきたい、入りたいかっていう視点ってすごい大事だと思っていて、すでになんか大きいエンジニア部隊があるんだったらそれなりにちゃんとした技術スタックとかも使っていて、モダンな環境だったり待遇も良かったりすると思うんで人はちゃんと来てくれると思うんですけど本当に全然今IT化が進んでないようなところIT部門が育ってないようなところにいきなり優秀な人が来てくれるかっていうとあんまそうではないと思っていてそれをどうやって引き込むかっていうとやっぱり経営層がいかにITをどのように考えてるかデジタル化どうやって進めていくかっていうのが大事だと思っていて自分のビジネスのとこにそれをどう絡めていくそれがやっぱいい待遇とかそういったことにもつながってきて魅力的な人材引きつけるあの力にすごいつながってると。思いますねなんかあの聞けば聞くほど高齢化が問題のような気がしてき。たんですけど、。なんかさっきのセナさんの成功例って言ってたのってアイフルでしたっけ?アイフルってあの保険の会社じゃないですか、保険って基本的に若い人向けに行うビジネスじゃないです。かまあまあそうなのかな。っていうのがまあひとつあってで例えばじゃあ銀行を例にしてみていくと銀行のあのit化というかそのアプリとかを作ってやっていきたいかっていうと多分そんなに銀行としてはやっていきたくなくてなんでかというと銀行の持ってる資産のほとんどは多分高齢な人から来てるはずなんですよね今の社会でいうとでことはその人たちが欲しいのは多分その人たちはスマホとかパソコンとか使ってやり取りをしている人たちは少ないのでどっちかというとそのアプリとかっていうよりは窓口が必要になるんですよねそうすると窓口が必要ってことは基本的にはそのアプリは使われないでまあなおかつその大きい企業そういう会社で働いているあの経営人もやっぱり高齢方が多いわけじゃないですか今の日本の現状で言うとだからニーズとしてもやっぱそのアプリとかIT化はいらないで決める人たちもそれを使えないからその重要性にはわからないなんかそのiPhoneみたいなそのビジネス自体が若い人向けにしているものであればまあ納得って感じはするんですけど銀行とかっていうとかまぁ結構ほとんどのビジネスはやっぱりその日本の人口がやっぱり高齢化してるっていうところから見ると、IT化っていうのにはあんまそもそも向いてないというか。人口動態は100%確かありますよね。需要と供給の部分も含めて。だから、需要を考えるとやっぱり高齢化してる中っていうか、もうすでに社会全体が高齢なんで、日本の社会は。しょうがないのかなっていうのもありますよね。そうね、確かにな。なんかシンプルに俺らみたいなテクノ人間化するんだったら、便利なスマホアプリあったらええやんみたいな感じになりやすいけど、まあそうね、おじいちゃんおばあちゃんからするんだったらね、そんなの作られてもねえっていう感じだろうから。今だってたぶん、まだ60代、60代ぐらいかな。僕の親が今60代で、スマホ使ってるけど、使いこなしてるかって言ったら、そんな使いこなしてなくて、。で、。パソコンもたぶん使える人もいるし、あんま使えない人もいるみたいな、うちの親は全然あんまり使えないんですけど、。で、。50代。50代40代まあ40代になると多分もうスマホもパソコンも使えるよって人が多分ほとんどでその人たちがメインのターゲットになってくるというかぐらいになったらそこらへんは進むのかなっていう感じはし。ますまあそうですね後10年くらいですかワンちゃんです。かねまあとは別になんかあれですよねニーズとかあれは置いといてまあ僕たちなんか北米で働いている組からするとそのエンジニアがかっこ悪い、給料もらえないみたいなのは、なんか、現実問題、日本に帰ろうって思った時に、帰れない要因の一つであるし、なんか、まあ、瀬名さんが言うように、悔しいのはありますよね。それが、なんか、内政化が進んでくれて、まあ、こんな言い方していいのか悪いのか、いいのかわかんないけど、なんか、僕としても、なんか、あんま、SIRとかはなければ、あの、さす、ね、その、内政部隊が増えて、もうちょっと環境だったりだとか、給料の改善されていくのかなっていう、ちょっとあれはありますよね。すべての自宅会社が、そもそも悪いわけではないと思うし、その自宅会社で幸せにやって、給料も満足いくよって人たちも、たぶんいると思うんで、あれですけど、僕の経験的に言うと、やっぱり、稼げないし、つらいし、炎上プロジェクトとかあるし、で、なんか自分がこうやったらいいじゃんとかって提案したものは、あの、なんだろう、。ふわーっと消えていくし。なるほどね。まあ、提案が確かに通りにくいのは確かあるだろうな。やるせなさというか、みたいなのを持ってる人たちは多分いっぱいいて、でもなんか、だからといって、その技術力もあんまりプログラミングをしないからつかないみたいなのがあり、その違う環境に飛び込めないみたいなのがあるんで、そういうところはちょっと改善されてなんか内製化されることによって改善されていく会社が増えてその全体としてそれが変わってくるといいなーってのもありますけどねそう。だねまぁあとはいつも東橋さんが言うことやけどやっぱり日本でSIRで働いてた人たちのやっぱりそのレジュメ上のミスマッチって北米とやっぱり大きいじゃないですかあのやっぱりシンプルにアジャイルで回すことはほぼないだろうしやっぱりウォーターフォールにやっぱりなりやすいのはねどうしても愛さやの場合あると思うのでするとやっぱりチームでの目標の持ち方だったりとか成果の出し方っていうのも北米圏に来て日本でサイヤー的働き方してましたよレジュメに書いたとしたってなかなかねそれがこっちでの内政部隊を持っている企業からも受けが悪いしSaaS企業からしたらもっと受けが悪いしそうってなりやすいのでその辺のミスマッチもねまぁこれは北米挑戦する人にちょっとフォーカスを置いちゃってるけどまぁちょっと大きいよねっていうのがあるのでそういった面からも正直日本からのSIR文化とかS文化SIR文化かに関してはちょっと薄まっていただけると北米挑戦しやすい人も増えるだろうなぁとかって思ってますけどねでもその辺はKさんのAOBCもやっぱりそうですかアジャイルでやっぱり回していたりとか1個のプロジェクトで何かルーティンがあったりとかする。イメージですかそうですね基本的には大きなプロジェクトはアジャイルで回していく形になっ。てますねですよねスプリントもあってっていうのは割とその辺の働き方はSaaSにも近いのかな近いところがあるのかなと思ってるんですがお。だしょーそうですねやっぱりある程度をしっかり拡張してメンテしていかないといけないアプリとかに関してはその辺りの回し方はSaaSにすごい近いと思います。三宅さっき僕も冒頭気になっていたグロース絶対しなくちゃいけないっていう圧迫感みたいなやつは多分もちろんSaaSのほうが強いんだろうなって思うんですがそのグロースに対する意識以外に関しては割と僕は開発工程に似てんじゃないかなと思っていてそうなのでまあねこっちのやっぱりその日本での内製化っていうのが進んでくるとそのまあアジャイル的なサース的なやっぱりまあ働き方っていうのを一般化してくるだろうしでするとまあね北米行くぞっていう時のそのレジュメ上のミスマッチっていうのも相当減ると思うのでそういった意味でいい流れが来てくれると嬉しいなとは思ってねそれで言うとあれですよ。ねその受託会社も別にそのこっちのまあこっちだから世界のあの北米もヨーロッパも基本的にてか日本以外ほぼほぼみんなあの同じような働き方はされてるじゃないですかソフトエンジニアとか言うとIT業界のこの業界で言うとそれで言うと受託SIRだとしてもそれをやることは可能ですよねてかやってるところもありますよねなんでだからそのSESが少なくなって、その内製部隊が増えるっていうことよりも、その受託会社とか、。SIRも、。そういうなんか、世界のスタンダードの働き方になってくれるっていうのがまあ、一番幸せな道ではあるかなと思いつつ、でもなんか、結構、たぶん僕の世代とかってそうなんですけど、仕事するときに考えたくないっていう人多分多いと思うんですよね。なるほど。責任も持ちたくないし考えたくもないしその自分に決定権がない方がいいって人たちって多くて、今なんか話とかなんかよく聞くのだと、ジェネレーション、ジェンジーってなんて言うんでしたっけ、Z世代、Z世代とかはそうでもないみたいですけど、僕たちの世代って結構そういう人たちが多分いて、別に俺らは、そういう人たちは特に、受託会社で言われたことやって、あのお金もらって、それで十分ですっていう人たちがいっぱいいるのは結構納得なのかなっていうのも。ありますけどまぁなるほどね世代の違いねまぁありえるかもしれないよね働き方と逆にマッチしてる。みたいなそうだからそのそういう改革が怖いというかSARSの人たちがなんかSIRはみたいな構図って結構Twiterとかでもあると思うんですけどその人たちからしたら俺らの業界を脅かすんじゃねーよみたいなちょっとなんかそのディフェンシブになる気持ちもわからなくはないですよねそう、。そんな感じなのかな?割と俺はSIRの人たちも結構向上心あふれてる人たちも多かったの多いのかなと勝手に思って。たんだけどね僕は割とSIRの、元SIRだからっていうのは肯定的な意見を持ってて割とやっぱ同僚とかもすごい技術的に興味がある人とかも多かったし実際技術力めちゃめちゃ高い人とかもいましたねまあただただSaaS系と比べて何かちょっと問題なって思ったらSIって割と大規模のシステムを見てることが多いと思っていてそうなると文教化がやっぱり進んじゃうんですよねそういったときにアプリ何か作ったことありますって言ってもやってるのが本当そのアプリのすごい狭い位置部分だったりとかもしくはインフラの部分だったりとかCICD部分だけだったり極小的なものになっちゃって、そういう形になっちゃってやっぱり北米とかに行って、じゃあソフトウェアエンジニアになりますって言った時に通用する武器になるかって言うとやっぱり弱いなっていうのは感じ。ますねそれで言うとそれはこっちでもあるのかなって思ってて、大きい企業に行けばやっぱその小さくなるっていうのはしょうがないことなのかななんかその問題は、僕が思ってるんですけど、ちょっと間違ってたらごめんなさい。問題は多分、その会社の会社だけのものを、会社だけで起こることをやってるみたいなのが多いのかな、みたいな。その、CCDだったとしても、その、なんていうの。全体の共通で使われているものをちゃんとやっててその共通で使われているスプリントとかアジャイルみたいなのを使って仕事をしていればなんか基本的にその技術っていうのはスキルと言えて他の会社でもまあ役立つようにはなるのかなとは思うんですけどそんなことはないです。かねそうですね作ってるものの規模感っていうのが割とこの辺って大きいと思っていて国よりもただ単純に特性的にSIRは大きなものを見てるから分業化が起こりやすいっていう色が強いだけなのかなと思っていていわゆるSaaS系の会社ってまず最初は自社の一つのアプリだけじゃないですかでまぁそうなるとやっぱ一気通貫で上から下まで見るっていう形も大きくなってくるんでまぁただそれが成長するとやっぱりりょうさんの言う通りにあのやっぱ分業は進んでくるまあアメリカで言うならそのアマゾンとかも当然もうすごい業務が細分化してると思いますし。確かにKさんが言われてるように、細分化されててそれが問題だっていうのは僕もわかるんですよ。なんか多分それって細分化されてて、自分がやってるものはわかるけど他のことはわかんなくて、他の会社行った時にそれが活用できないみたいなことを多分問題意識されてると思うんですけど、アマゾンとか、うちの会社でもそうですけど、結構やってることは僕たちもすごい小さい、僕はアサナって会社で働いてますけど、アサナのすごい小さいというか、ほんと一部分しかやってなくて、だから細分化はされてて、他のところのことはそんなにはわからない。っていうのはあるんですけど、でも、この今ここでの会社の働き、まあ働きというかスキルっていうのは他の会社に持ち越すことができるわけじゃないですか。なんで、僕もこれ純粋に僕もわかんないんですけど、確かに日本でそれが起こると他の会社に持ち越すことができないんだけど、それは何でだと思います?僕はここの細分化運営に関しては別に日本と北米がそんなに違うとは思っていなくてその問題が起きる原因っていうのがやっぱり細分化が必要なシステムになってくると結構そのドメインの色が強いなと思っていてすごい技術的なスタックは当然他にも転用はできると思うんですけれどそのシステムで扱ってるケースっていうのが例えばEC系の極小的なところのシステム化であったりとかそういったときに同じような課題を抱えてて同じようなソリューションを提供しないといけない会社がどれだけあるかっていう話もあるし本当にそれと同じような規模感を持ててる会社がどれだけあるかっていうところもやっぱ出てくると思うんですよねあんま大規模すぎるとそれと同じものが必要な規模の会社っていうのがすごい少なくなってくると思うんででまぁそれに対してやっぱその一般的にただSaaSで一気通貫でトップからボトムまでかかってましたよっていうのはすごいカバーしてる範囲が広いと思っていてでまぁよりドメインの色も当然出ると思うんですけど技術的な分野で見られてる範囲っていうのがすごい広いからそういうのはやっぱり北米とか転職の市場の中で強い人材になりやすいのかなっていう印象ありますね。なるほどねまあそう内製化されたりやっぱり企業さんの場合のドメイン知識とかってやっぱりそこによるのかなっていうのはちょっと僕も思っていた部分ではあってなんかその辺はどうなんですかKさんのやっぱり周りとかで例えば大学のシステムを作ることのスペシャリストみたいな割とすごいあの狭いとは言いませんけどあのなんか特化したスペシャリストドメイン知識を持ったエンジニアさんとか部隊とかっているもんなんですかね。うーんそうですねまあどうしてもやっぱ自分の事業系に紐づいてるエンジニア部隊ってなって自分のとこにドメインに強くなるっていう色は当然あるので意識的にそれを集めてるっていうとそうではないと思うんですけどまあ結果としてそこに詳しい人が増えてくるっていう色が強いかなって。思いますねなるほどね想像もつかないんですけどねやっぱりその大学も例えばシステムを構築するにあたってのスケーラビリティだったりだからちゃんと意識できるなんかエンジニアさんはなんか重宝されるよみたいなそういうのも実はあったりするのかなって思ってたんですけどその辺は別に意図的に集めてるわけじゃないってことですねそうです。ね当然経験があるとプラスにはなると思うんですけど似たようなシチュエーションが多くなるのでただ募集要項的にそこを強く押してるかっていうとそうではなくてそこはもっと一般的に普通にソフトエンジニアの募集要項と似たような形。が多いですねなんかこれもよく話題になりますよね。なんか転職するときにそのドメイン知識っていうのは必要なのかどうなのかみたいな。こっちではなんかあんまそれはないですよね。そうだよね。あんま聞かないよね。募集横見ててもなんかそんな見ないしね。そうですね。まあ、それもあれなのかな。なんだろう。やっぱないその内製部隊で働いてるとそのうち強くなるってか強く強い人がいるしすでにいるし社内で聞けるし強いあのそのうち強くなるでしょみたいなのが多分割とあってっていうのもあんなんかそこらへんはすぐキャッチアップできるでしょみたいなのがあんのかなちなみにあのこれもちょっとまた戻るんですけど僕はSIRで働いてて僕の周りであんまりなんか勉強してる人はいなかったんですよあ、。そうなの?僕はあの某Fから始まる系列のところにいたんですけど僕の周りでなんかそのなんか技術のキャッチアップたまにしてるよっていう人は僕以外には一人しかその2、3年間何プロジェクトか行ったけどなかったですねなんでまあそうなんかそうだしあんまりなんか技術強いっていう人もあんまりなんかイメージとしてはなくあんまなくて2人かなもう1人いたかななんかモバイル系がやりたくてでその人は結局SaaS系に移っちゃったんですけどなんでだからなんか会社によっても違うのはあるかもしれないです。ねまあ間違いない確かにそうだな俺の言ってるSaaS系の人ってもはやフロックに相談来る人やから交渉心満々に決まってんじゃんっていうのは確かにあると思うので確かに日本の一般のSIRがどういうモチベでどういう意識で働かれてるのかちょっと俺も全然わかんないですケイさんの働きが変わられてた時もそう。ですかそうですね僕が見てた限りでは技術的な関心が高い人は同僚にもさっきとすごい多かったんですけどでもやっぱのはモダンな技術とかを取り入れにくいっていうのがあってそういうところでちょっとモチベーションが下がっちゃう人とかはありましたねあと新しいことをどうしてもシステム規模が大きいのでやりにくいっていうのが。まあそうねまあ既存システムの結局運用運用だったり報酬っていうのは当然ボリュームゾーンとしては大きいだろうからまあそうなるとね新しい技術云々よりもちゃんとやってよちゃんと報酬してよっていうところはね大きいと思うのでまあそういう技術のキャッチアップの必要性っていう部分だと確かに薄い業界にはなり得るの。かなとは思いますよ一方でなんかその住宅会社に勤めてる人ってやっぱり新卒から入る人って結構多いと思うんですよねその技術が全くありませんでしたよ入る時にはで入った入ってから技術身につけましたってでその人たちがまあ結果的になんか面白いじゃんってなってあの向上心もどんどん出てきてそのっていう人たちはいると思うんでそのなんだろう一括新卒採用があるのはその入りやすさとしてはすごい良いじゃないですかそういうまあ意見もあるのかなって僕もすごい始めた当時は新卒とかではなかったんですけどあのパソコンの電源の入れ方がちょっと怪しいぐらいの感じの人間だったんであの本当その会社に雇ってもらえなかったら多分自分はエンジニアにはそもそもなってなかったんでそういう意味で言うと入り口としてはすごい入りやすい業界にはなってますよねその全体を通してそのシャースではないです。けどびっくりするもんねやっぱりその研修期間とかで半年とかって割と普通にあるしこの辺やっぱり日本のなんかすごいこのなんか独自の文化というかなんか入りやすい文化には確かになってるなって思うのでそれに助けられた人も多分多いだろうから。ねやっぱこれ一丁一単ではあるけどって感じです。よねそうだねまあこれ難しいな結局本当に何かじゃあ住宅がね今後どんどん増えていっても内政部隊がどんどん増えていってっていうことでワンちゃんそういうなんか教育文化みたいなとこまで失われるのかってなるともしかしたらそれでいやっていう風な人もいるか。もしれないしねうーんまあでもその日本では何て言うんでしたっけ丈夫型雇用っていうのかなが増えてきてるっていうのはもう確かだしまあなんかその流れが来てるのは絶対日本でも来てると思うししょうがないのかなぁ感はありますよ。ねまあね確かにねだからまあそれが別に内製化がいっぱいならずともなったとしてもなってもならなくても多分ジョブ型が増えてくればもはや中途みたいな採用の仕方が増えるんだろうしこれは仕方ないか。もねそうそうするとやっぱりそのスキルとしてかけることを意識して働き始める人が多分多くなるんでそうするとなんだろうやっぱちょっとなんていうんだろう世界のスタンダードっていうとちょっと趣向が大きいんで嫌だけどまあそういうスタンダードに近づいてはきそうですよねそういう住宅会社でのその働き方みたい。なそうだね間違いない俺もともと新卒一括採用制度には割と懐疑的な人間だったのでそうなってくれるのは正直良いことだと思っちゃってる人だけど素晴らしいということですねそれととりあえずそろそろ1時間くらい経つのでコンクリーションというかまとめにも入るんですがとりあえず北米圏における内政化は昔からあって割とSARSと似たような業務形態でやっぱりやられていてやっぱりそういった内政部隊からSARSに移るっていう人も多いだろうし逆もまたしっかりだろうしやっぱり内製化されているUBCみたいなところで働かれていることによる恩恵、安定性だったりとか、自分たちの環境に応じた働き方だったりとかっていうところもわかったので、やっぱりいいことなんだなと正直思って。日本がそうなのかって話をすると正直俺はトカシさんの言ってた高齢化の有無の話に結局気にしまうのかなっていう気も正直してはいてそれ言われてしまうと確かになーとしか言いようがなくて内政化は今後進んでいくんだろうしそういう意識のところも確かに増えるんだろうけども確かに高齢化ビジネスっていう側面からするんだったらどうでもいいよねっていうのはおっしゃるとおりではあってなかなか難しいですね。確かにユーザー層に受けないと厳しいですよね、会社としては。利用者8割高齢者ってなったら多分やらないもんね、俺も。やっぱ根本としてビジネスってお金作るものなんで、お金作れなかったらしょうがないよねって言われたらもう、はいって感じですね。はい、。はいっていうしかない。っていうところかなまあとはいえまあ若い層をねやっぱりまああのターゲットにしているところあとは本当にここ10年とか経ったらやっぱりそのねまあ言うてるitネイティブではないあの世代っていうのもどんどん減ってくるのは正直しょうがないことだと思うので予定するのであればまあ必要性はどんどんどんどんと高まっていく分野であるな間違いないだろうからまあいずれのタイミングはそういう時期は来るだろうねという結論なのかな結果としてはどんなところでしょうかはいさあ何か。そうですね。僕としても日本がどんどん内政化の動きが進んできているの自体はいいことだなと思っていて、さっき言った転職、北米とか他に今までの経験を生かすっていう面でも当然強い機会は増えてくると思いますし、あと経営的な面で見てもやっぱり内製していると開発者たちが経営と同じ方向を向いて言ってしまうとさっきリオさんが言われたように今までのSI形式だと作っているプロダクトに愛着がないみたいな形があるところもあったと思うんですけどそういう形は減ってくるのが一新動態なんで経営と同じ方向を向いていける形になってくるんですそういった意味ではいい方向だなと思っています。ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "A",
      "text": "はい始めていきましょう今回も毎度ながら僕トガシーリョウとフロックの代表のセナさんあとはケイさんって言って今UBCっていうバンクーバーの大学の内製部隊みたいなところで働いていてちょっと今回のトピックに詳しいかなっていうのでちょっとゲストとして来ていただきましたケイさんよろしくお願いします簡単に自己紹介もお願いしていいですか。",
      "start": 28,
      "end": 23602,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "よろしくお願いします今ご紹介いただいたケイですご紹介いただいたとおりカナダのバンクバー大学UBCというところでWebアーキテクトとしてもう6年ぐらいになるのかなずっと働いていますタイトルはアーキテクトなんですけどやってるのはWebアプリケーションを作ったり大学で必要なウェブサイトを作ったりという形になりますね。",
      "start": 24757,
      "end": 45147,
      "timestamp": "00:24"
    },
    {
      "speaker": "A",
      "text": "なんかそのケイさんのインタビューもちょっと後々にお願いしていきたいんですけど今回ちょっとセナさんのなんて言うんだろう持ち込みというかあのトピックを持ち込んでいただいたのでちょっとトピックから聞いてみましょう。",
      "start": 48098,
      "end": 62166,
      "timestamp": "00:48"
    },
    {
      "speaker": "C",
      "text": "かねはいまあというわけでそう久しぶりにちょっとトピックを持ち込ませていただいたんですが最近なんかx界隈とかも含めてなんですがね日本がだいぶseの仕事なくなるんじゃねっていうのが実はちょっとバズっていてその文脈としてやっぱりまあ日本でやっぱり内製化を進めていらっしゃる会社さんが最近増えていると最近僕も海外就職周りのご相談とかで日本の明らかに今までSEに頼り切っていた会社が内政部隊に切り替えたっていう話を耳にする機会もあってそれもあってそういえば日本ってSEにずっと頼り切りだったけれども北米圏ってそういうSEみたいな会社ってほぼないよねって思って内政化はほぼ昔からもされている印象しかなかったんだけどそもそも北米における内政化って昔からあったのか今やられている方々ってどういうふうな仕事をしているのかそういった方々から見て日本のやっぱりSEに頼りきりの文化構造企業文化みたいなところってどうやったら変わると思うのかみたいなその辺の壁打ちもしくは情報交換みたいなのができればなというふうに思って今日K先生に来ていただいたということなんですがUBC6年もいらっしゃったんですね僕それ知らなかった3,4年くらいかなと。",
      "start": 62166,
      "end": 139463,
      "timestamp": "01:02"
    },
    {
      "speaker": "A",
      "text": "思ったんですよおだしょー。",
      "start": 139463,
      "end": 140123,
      "timestamp": "02:19"
    },
    {
      "speaker": "B",
      "text": "そうですねこれもキャリアで言えばよかったんですけど僕日本でもカナダに来る前働いていてそのときはまさにSIRのほうで働いていてそこもキャリアちょうど6年ぐらいなんですねちょうど今カナダでのこのUBCのキャリアが6年同じぐらいになったっていうところです。",
      "start": 140123,
      "end": 158710,
      "timestamp": "02:20"
    },
    {
      "speaker": "C",
      "text": "ねどうしようね、だからレアなキャラクターといったらちょっと言い方悪いかもしれませんが、大体北米来るなんかフロックメンバーって頑張ってSARS入るぞー!みたいなね、あの人たちがやっぱり多い中で、そうするとKさんのキャリア的にはSIRからのUBCっていう、逆にSARSは経由したことがないってことですか?",
      "start": 158710,
      "end": 177997,
      "timestamp": "02:38"
    },
    {
      "speaker": "B",
      "text": "そうですね個人的にはSaaSアプリケーションを主軸に置いた会社っていうのも働いてみたいなとは思っていたんですけれどこっちのカナダのほうに来て僕BCITで学んでたんですけどそこを卒業した後就職先探したときにUBCが一番最初に合格内定もらって入れたという形なんですねUBCを選んだ理由としてやっぱり強かった結構当時はビザのサポートかどうかとかあとは企業として安定してるかどうかっていう観点が強かったのでUBCがいいなって思ってそこに行った形ですね結果としてはそれでSaaS系の会社を経由してないっていう形になりますねちなみに。",
      "start": 178007,
      "end": 224654,
      "timestamp": "02:58"
    },
    {
      "speaker": "A",
      "text": "なんかちょっとあんまり理解できてないんですけどやられてること自体はwebアプリケーションの開発をされてるわけじゃないですかそれっていうのはSaaSなわけですよね。",
      "start": 224654,
      "end": 239832,
      "timestamp": "03:44"
    },
    {
      "speaker": "B",
      "text": "深井そうですねただいわゆるみんなの認識のあるSaaSとはちょっと違うやっぱり内部に向けたシステムの色が強いってことかなグローバルに他の企業とかに使ってもらうサービスを作ってるとかではなくて単純にどちらかというと自分のとこのお客さんに必要なサービスとかも逆に自分の内部の組織に必要なサービスを作るとかそういう色が強い。",
      "start": 244865,
      "end": 271303,
      "timestamp": "04:04"
    },
    {
      "speaker": "A",
      "text": "ですねそっかじゃあB2CにしろB2Bにしろそのサービスが外に向いてるかうちに向いてるかの違いなのかなそう。",
      "start": 271303,
      "end": 281603,
      "timestamp": "04:31"
    },
    {
      "speaker": "B",
      "text": "ですね一般的にやっぱSaaSの会社っていうと他の会社とかまあランダムなユーザーに使ってもらうのが前提になってると思うんですけどうちはやっぱうちの組織にすごい紐づいたところっていう色が強いおだしょーグロース。",
      "start": 281603,
      "end": 298134,
      "timestamp": "04:41"
    },
    {
      "speaker": "C",
      "text": "しようっていう意識は正直そんなないですよねおそらく自分たちの内部サービスとして運用するわけだから成長させなくっちゃみたいな一般的なサービス企業とのマインドとはさすがにちょっと変わるんじゃないかなと思いますけどね。",
      "start": 298134,
      "end": 310723,
      "timestamp": "04:58"
    },
    {
      "speaker": "B",
      "text": "三宅そうですねあんまりグローバルにどんどん展開していこうみたいなのはサービス地帯の中ではないっていう形ですかね自分の組織のビジネスをもっとグローバルに広げていってそれをサポートするITが必要だったらそのITも当然グローバルを目指したものになっていくっていうそういった色はちょっとあるんですけどただITだけのグローバルなサービスをいきなり作ろうみたいな流れはない。",
      "start": 310723,
      "end": 338563,
      "timestamp": "05:10"
    },
    {
      "speaker": "A",
      "text": "って感じですね基本的には自社製品を作るっていうのは人件費削減になるってことですよねすごい簡単に言うと基本的には外に向けてそれ自体で稼ぐっていうよりは今まで人間がやってたものをシステムを入れることで簡略化簡単にしようだったり人件費削減しようみたいな動きが基本的にはなのかなそうです。",
      "start": 338563,
      "end": 363984,
      "timestamp": "05:38"
    },
    {
      "speaker": "B",
      "text": "ね一番やっぱ色が強いのは業務の効率化っていうところがあると思います。",
      "start": 363984,
      "end": 369268,
      "timestamp": "06:03"
    },
    {
      "speaker": "C",
      "text": "そうよね、それも実は僕もちょっと気にはなっていて、やっぱり逆に北米圏のこの企業さん、大学だったりとかインフラだったりとか、銀行さんだったりとか、僕の知り合いでもBCITからRBCっていうこっちの銀行さんに内政部隊として入られた方もいらっしゃったので、やっぱりこっちの企業さんってそういう内製化されるソフトウェアエンジニア部隊とかエンジニア部隊っていうのをやっぱり持ってらっしゃるんだなっていうのはすごいなと思いつつなんで雇うんやろうなっていうのも持ってて一方でやっぱデブショップとか一応外部に何かお願いする能力を持った会社さんもないわけじゃないからもう別に外注してしまっても別にいいんじゃないかなっていうふうに思いながらやっぱり内製化する理由としてはさっきのファンシーにあった経費削減だったりとか、経費じゃないかコスト削減だったりとかパフォーマンスの向上だったりとかやっぱり内製化した方が都合がいいことの方が多いんだろうなというふうには思っていてそこら辺も先ほどKさんに答えていただいたような効率化だったりとかの側面が企業の内製化するモチベーションとしては高いってことですよね。",
      "start": 371318,
      "end": 436537,
      "timestamp": "06:11"
    },
    {
      "speaker": "A",
      "text": "僕が日本で、僕ももともとSIRに入ってて、2、3年は仕事してて思ったのは、結構その、住宅開発というか、SIRどっかに行って開発するみたいな感じになると思うんですけど、結構その、仕様の聞き取りみたいなのをすごいしないといけなくて、それってなんか自分のそれが自分の社内にあった方がやりやすいのはやりやすいのかなって思うんですよね結構なんかよくその客先に行ってビーティングしてでなんか仕様を聞き取りに行ってで作ってで使ってもらってでなんか前より使いにくいみたいな言われてみたいななんかすごいそのなんか無駄なって言ったら悪いけどやり取りが多くてしかもなんか社外の人だからちょっとそれがちゃんとフォーマルな感じになってないといけなくてみたいなのでそこですごい時間をなんか使ってたんでそれが確かに内部にあったら仕事のやりやすさとかはなんか効率はすごいいいのかなっていうのは思いますけどね。",
      "start": 438575,
      "end": 505827,
      "timestamp": "07:18"
    },
    {
      "speaker": "B",
      "text": "そうですね僕もそれは感じていてやっぱ北米の会社が内製してる理由の一つってスピード的なパフォーマンスの色も強いなって思っています僕が日本でSIRで働いてたときやっぱり量産と同じようなことを感じていて基本的にはお客さん対外の組織になってしまうんでそこのコミュニケーションコストがすごい高いんですよねでまぁそれをさらにまあ仕事でやっていくってなるとやっぱその契約のプロセスとか契約がどうかとか都度そういう話も絡んできてそういうところを考えるとやっぱ自分の中の組織にそういう内製できる舞台があるとそこのスピードは改善されるなと思いますただ当然その内政組織があってもその組織内での摩擦っていうのはある程度あると思うんですけど例えばうちで言ってもその部署間で近い部署と遠い部署あんまり普段から話さないようなところとかもあったりしてそういうところはやっぱりある程度コミュニケーションコストは上がるんですけどそれでもやっぱり契約面とかそういうところの重さっていうのは対外組織とはまた違う話。",
      "start": 507911,
      "end": 575169,
      "timestamp": "08:27"
    },
    {
      "speaker": "A",
      "text": "になると思うのあともう一つなんか一番、もう一つ別の視点から違うなって思うのは多分、あの、外注されてる先、仕事を受け負ってるところは必ずしもお客さんの幸せが自分らの幸せではないっていうことが結構、僕が見る範囲ではあって、っていうのはなんかそのプロジェクトがちょっと失敗して炎上したり伸びたりすると受けてる会社としてはちょっと儲かっちゃうんですよね伸びて契約期間が増えるわけじゃないですかだから必ずしも早くいいものをポンと作れればいいっていうわけではないのでお金の動きがお客さんから受注された会社にあるわけじゃないですかなんでなんかそこをちょっとそこのところからなんか必ずしもお客さんを幸せにしようとはしてないなぁみたいなのを結構感じる場面があってそれもないのがまあその内製された内製部隊のいる会社のいいところではあるのかなと思います確か。",
      "start": 575169,
      "end": 649131,
      "timestamp": "09:35"
    },
    {
      "speaker": "B",
      "text": "に。",
      "start": 649131,
      "end": 649151,
      "timestamp": "10:49"
    },
    {
      "speaker": "A",
      "text": "あとなんか一方でも、なんか日本って、そもそも、そもそもなんか内製されてるのがスタンダードなのか、あの、住宅みたいなのがスタンダードなのか、よくわかってないけど、あの、日本ってあれですよね、あの、オケ屋には、オケはオケ屋にみたいな言葉があって、なんか、その道のプロに任せようみたいなのがあるから、なんか、経営に対してはコンサルみたいなのを雇ってプログラミングっていうかシステム開発はそういうところを雇ってみたいななんか自分らのプロのことしかやらずに他はなんか外に外注しちゃおうみたいな文化があるのかなみたいなのは感じますけど。",
      "start": 651703,
      "end": 693181,
      "timestamp": "10:51"
    },
    {
      "speaker": "C",
      "text": "ねまあそうねオッケーはオッケーって言うとむしろ良い風に聞こえるなっていう気もするんだけどむしろねやっぱりその正直俺は重要度の問題なのかなって気がして重要性かそのやっぱりテック部隊を内部に持たないと何かしらのトラブルが起こるよねとかテック部隊まあ内製部隊を自分たちで持っておかないと後々のやっぱりコストに結局つながるよねっていう認識があるのであればまあ多分内製化するのが自然だと経営者層って思うのが普通だと思うんだけどそれを思わないっていうことは。",
      "start": 693181,
      "end": 722985,
      "timestamp": "11:33"
    },
    {
      "speaker": "A",
      "text": "別。",
      "start": 724784,
      "end": 725044,
      "timestamp": "12:04"
    },
    {
      "speaker": "C",
      "text": "によそにまかしたらよくね、みたいな。",
      "start": 725044,
      "end": 728215,
      "timestamp": "12:05"
    },
    {
      "speaker": "A",
      "text": "多分もう一つあって、日本ってあの、クビにできないんですよ。ああ、そうか。内政で自分の中で思ったら、そのシステムがいらなくなった時に、システムって基本的にはなんか、特にその、違う事業で稼いでる業態の会社にとっては、その投資になるわけじゃないですか。",
      "start": 728215,
      "end": 748291,
      "timestamp": "12:08"
    },
    {
      "speaker": "C",
      "text": "今、。",
      "start": 748291,
      "end": 748551,
      "timestamp": "12:28"
    },
    {
      "speaker": "A",
      "text": "そのシステムに使うお金をかけて、後でその、まあ効率化したことであの回収するっていうのが基本だと思うんですけどあのいらなくなった時にそのシステム部隊がいらなくなった時に首にすることはできないじゃないですか日本だとまあできないことはないかもしれないけどなんでそのこっちはやっぱ内政部隊がいてもまあ最悪全部もうシステム作るもんねーやって言ったら全員切っちゃえばまあそうだよねってなるけど日本は多分それができないっていうのもあってその内部に人間を持ちたくないみたいなのがあるのかなっていうのはお。",
      "start": 748551,
      "end": 787405,
      "timestamp": "12:28"
    },
    {
      "speaker": "C",
      "text": "だしょーまあ確かにねそこを逆に俺ケイさんに聞きたいんですけど例えばUBCって内製部隊以外で雇ったりすることって何ですか例えばデブショップの人にピンポイントにちょっとヘルプに来てもらうとかそういうのがあるんだったら日本であったとしても例えば内製部隊は本当にコアな部分だけ持っておいて本当にシステムをもう新しく作らなくちゃいけないっていうときに外部からちょっと人を呼び寄せたりとかフリーランスなのかコントラクトなのか分かんないけど結局その中でせっその自分たちが持っているサービスに責任を持つ人がいないっていうのが一番の僕は内政がないところの問題点だと思っているのでなんかもしubcでねそういうなんか本当に忙しい時は要素から人を雇うみたいなことがあるんだったらもうそれを真似すりゃいいんじゃないかなって単純に思っちゃうね。",
      "start": 787405,
      "end": 830843,
      "timestamp": "13:07"
    },
    {
      "speaker": "B",
      "text": "そうですね、うちの方だとやっぱり外部の人を雇ってやるっていうこともありますね。ただ、人を雇うっていうよりはSIとかSEっぽく、人を雇うっていう形よりはプロジェクトベースでお願いする、委託するっていう形。がメインで今瀬野さんがおっしゃられたようにやっぱコアの部分は自分たちで抱えることが多くて例えばキャンペーンとかイベントをやるときの新規的な部分は人手が足りなかったら外部にお願いするっていうケースが多かったりしますねあとはクリエイティブ的な自分のところのエンジニアたちがあんま得意でないような分野とかがあったりするとそこをカバーするためにも外注に頼るっていうケースはあったりしますうーんそうです。",
      "start": 833165,
      "end": 880725,
      "timestamp": "13:53"
    },
    {
      "speaker": "C",
      "text": "よねだから多分そこのバランス感覚みたいなところがもしかしたらね結構養われていないと言ったらかもしれませんがなんか日本の例えば普通の企業がなんか内製化を進めよっていう風になったときにどこがコアでどこがやっぱりねあの自分たちが書かれなくちゃいけない部分部分なのかっていう判断でわりかしエンジニア系のやっぱり知識だったりまあなんか見方みたいなのがないと判断つかないんだろうなーって思うのでなんかそこで何か今ケースあのイベントがさんが言ったようなもう一気にとりあえず内製化舞台をバッと広げてしまってもコストにしかならなくてもこんなことするくらいだったらもう外部に移宅したほうがいいやっていうのは意味は分かってなんかまあその辺のバランス感覚かなっていう気もちょっと。",
      "start": 880725,
      "end": 918772,
      "timestamp": "14:40"
    },
    {
      "speaker": "A",
      "text": "するんですよねあとはなんかそのエンジニアもそのそういう会社に行きたいかっていうとあー確かにそうねなんかその今だからその内製化じゃあしようってなった時にえっとそういうなんだろうトラディショナルな会社日本のまあなんかトラディショナルな会社が内製化したいってなった時にその欲しいのはSIRのような人たちではなく、どっちかというとSARSに関わってたとか、そういうのをできる人材が欲しいわけじゃないですか。そういった時に、それで考えると、やっぱり結構システムとかは大きくなる。会社が大きければ大きくなると思うんで、それができる人材になるわけだけど、その人材が必ずしもそういうトラディショナルな会社で内製化を進めたいかって思うと、うーん、自分がそのポジションにいたら別に行きたくはないなっていうのもありそう。",
      "start": 918772,
      "end": 983659,
      "timestamp": "15:18"
    },
    {
      "speaker": "C",
      "text": "おだしょーまあねでもその辺俺もそう思ってたんだけどこの間日本の会社さんで内製化成功したよって会社の話聞いたときには社長さん自身がすごい若い人に変わったらしくってそここの会社は本当に内製部隊にするためのモダンな開発環境とは何かエンジニアに一体いくら払えば来てくれるのかっていうことをゼロから考えてくれたらしくって言ってしまうと給料だったり働き方だったりリモートだったりみたいなないなところもちゃんと考慮しての結構ガツッと文化ごと変えたっていうのは印象に残っててそこのタイグの部分は僕もすごい気になっててやっぱりKさんを筆頭に僕らのやっぱり今知り合いの中でも銀行さんだったりあと僕の知り合いでBCハイドルで働いてらっしゃるこっちの電気会社ですね働いてらっしゃる方だったりあとはもちろんKさんみたいにUBCで働いてる方もいらっしゃって結構長く働いてる印象がやっぱあるんですよねでその裏にはまあ給与体だ対偶だったりとかまああとは本当に先ほどお話にあったまあなんでしょ安定安定点ですかあのやっぱり首になったaオフの頻度っていうのは正直サースに比べればあまり効かないのでやっぱりそういうなんか別の魅力があってやっぱり選ばれるのかなというふうに思うんですが計算の周りにいらっしゃる例えばubcみたいな大きい音大学で働かれている方のモチベーションというんですかねあのサースとかに移らずにそこで働き続けるモチベーションというのもやっぱりその辺に起因している感じですか。",
      "start": 983669,
      "end": 1063010,
      "timestamp": "16:23"
    },
    {
      "speaker": "B",
      "text": "そうですね、周りを見ているとやっぱり結構ワークライフバランスを何らかの理由で重視している人が多いと思っていて、一番典型的なのはやっぱりお子さんがいる方、僕も子供がいるんですけど、その場合って結構柔軟な勤務形態が必要とされると思っていてそれがリモートワークができるであるとか会社への出社が必要でも出る時間がちょっと柔軟性が持たせられるとかそういった意味であと仕事がそんな忙しすぎないというところもありますねそういう意味で自分で自由に使える時間が多かったり自分でコントロールできる時間が割と多いそこに魅力を感じてる人は多いなっていう印象を受けますねその中で余分に出た時間をそれぞれ使いたいものに使う育児であれば育児ですしそれとは別に普通に自分のプロジェクトとか持ってそっちのほう伸ばしていきたくてそれをやってる人とかもいたりしますね。",
      "start": 1064854,
      "end": 1125815,
      "timestamp": "17:44"
    },
    {
      "speaker": "C",
      "text": "大偶面に関してはこれもぶっちゃけ話になっちゃうかもしれませんがやっぱりSaaS系のやっぱり企業で働かれてる方の方が多いは多いですよね多分。",
      "start": 1127979,
      "end": 1137585,
      "timestamp": "18:47"
    },
    {
      "speaker": "B",
      "text": "そうですねやっぱり給与水準で見るとSaaS系のところに比べると一段階下がるなっていう印象はありますし特にUSの企業に比べるとストックですか株ももらえたりはしないところが多いと思うのでやっぱお金の面ではやっぱ劣るなっていう印象ありますね。",
      "start": 1137585,
      "end": 1156538,
      "timestamp": "18:57"
    },
    {
      "speaker": "C",
      "text": "ことですよ。",
      "start": 1158246,
      "end": 1158767,
      "timestamp": "19:18"
    },
    {
      "speaker": "A",
      "text": "ねなんか僕前の会社がえっとサースの会社を買い取ったなんて言うんだろうえっとファイナンシャル系の会社だったんですよそれで感じたのはすごいなやっぱ圧倒的な安定があるなぁというかその別にそのサースじゃないかえっとまぁそこの会社で言うとそのサースの事業でぶっちゃけ儲けなくてもあのなんとかなっちゃってるんですよなっちゃうんですよねまあそのそのソフトウェア自体はあの多分黒字だったんだけど資金源というかまあすでに稼ぐ手段を持ってるんでそこのなんか安定はめちゃくちゃ強くてなんだろうそのレイオフの波みたいなのとかもあんまり影響を受けない印象だしそういうのはやっぱちょっと強さっていうか安定性っていうのは多分一番ありそう。",
      "start": 1158767,
      "end": 1208710,
      "timestamp": "19:18"
    },
    {
      "speaker": "C",
      "text": "ですよねまあそうよねとはいえこれもまあよそからまあ第三者目線から見ていいのであればですけどやっぱりその辺て安定するものなんですかubcさんでいうんだったらその生徒のたれば者管理とかおそらくねあの何そのカリキュラムを例えばウェブサイトにのデータを例えば管理するだったりとかまたやることっていろいろあると思うんですけど一般的なSaaS企業でレイオフするタイミングって業績が悪くなっただろう売上が下がっただろうもしくは景気が悪いだろうっていう部分によってのレイオフっていうのが多い中でやっぱりその辺は大学みたいな割と昔からの授業のところに関してはいきなり売上がガンと下がるとか景気の煽りみたいなのは受けにくいとかその辺の認識が働いてる側としてもあるってことです。",
      "start": 1208710,
      "end": 1251628,
      "timestamp": "20:08"
    },
    {
      "speaker": "B",
      "text": "かねそうですねやっぱりそれは僕も感じていて特にこの前コロナがあったときそれがすごく感じられましたねやっぱり大学ってああいったことが起こってすぐに学生がいなくなるってことはそうそうないのでやっぱりコロナが起きてる間もサーズ系企業とかたくさんレイオフとかもあったと思うんですけれどそういったレイオフの波があるときにも僕の周りでは全然レイオフされたっていう話は聞かなかったですね。",
      "start": 1251628,
      "end": 1281996,
      "timestamp": "20:51"
    },
    {
      "speaker": "C",
      "text": "コロナを乗り越えたら、多分何が来ても乗り越えられるんですよね、。",
      "start": 1284095,
      "end": 1288156,
      "timestamp": "21:24"
    },
    {
      "speaker": "B",
      "text": "きっと。やっぱりリョウさんが言われるように、安定しているところっていうのは、強いビジネスがすでにあるから、全体的には安定しているのかなっていうのは感じますね。",
      "start": 1288156,
      "end": 1303810,
      "timestamp": "21:28"
    },
    {
      "speaker": "C",
      "text": "なるほどね。",
      "start": 1303810,
      "end": 1306191,
      "timestamp": "21:43"
    },
    {
      "speaker": "A",
      "text": "ちょっと話変わるんですけどセナさん的には内政化進めたところがあって日本の会社がどんどんそういうふうになっていけばいいよねっていう考えなんですか。",
      "start": 1306201,
      "end": 1317264,
      "timestamp": "21:46"
    },
    {
      "speaker": "C",
      "text": "そうですね言ってしまうと俺はだから昔から内政化しない理由って何かなって考えた時にITだったりそのテクノロジーの分野が軽視されてるからと正直思ってた人なんですよその会社にとって内政部隊を要する今も抱えるくらい重要なことではないから別にさっきキャネーターのとかしたが行ったようにまあコストは別に要素に持てばいいしあのなんかトラブルあったらトラブルあった時にまあ対応してもらうくれる人がその場にいりゃいいしなんかねあの外部に委託すればもうことすでに足りるよねっていうのでまあ有名な話かもしれないけどねどこぞの例えば日本の銀行さんが自分たちのシステムのこと全くわかっていなくてブラックボックスしてしまってもう顧客に多大なる迷惑をかけたみたいなよくあるじゃないですかなんかああいうのがやっぱり起こりやすいのも結局その自分たちに作ってきたそのシステムだったりとか外部委託してきたものっていうのがそれを理解してる人たちが中にいないから起こる現象だろうなと俺は思ってはいるのでそういった面で見るんだったら日本のそういうテクノロジーだったりIT化みたいな部分が進む一つの要因としても内製化が一般的になるというのは重要なことなんじゃないかなっていうのが一つあとエンジニアの例えば待遇だったりとかエンジニアがどれだけ重要なポジションかっていうのを知らしめると言ったら言い方悪いけどたくさんの企業に知ってもらったほうが僕は日本のエンジニアが幸福度も上がるんじゃないかなと思ってる人なのでですると総合的に考えてやっぱり内製化が進んだ方がエンジニアにとってもいいし企業にとってもプラスなんじゃないかなっていう。",
      "start": 1317264,
      "end": 1403454,
      "timestamp": "21:57"
    },
    {
      "speaker": "A",
      "text": "ふうに思ってるんですねまあ今なんてないんだろうけども一応多分上資質部門みたいなのっているじゃないですかなんか規模感の問題なのかなーって思ってまあ確かになんかアプリ作るとか例えばなんか銀行のねあの色のある銀行がなんか大きい銀行があると思うんですけど例えばそこがじゃあもっとあのオンラインバンキング充実させようっていうのであのモバイルアプリ作ろうってなった時にえっと多分まあ住宅会社とか使うそのsirを使って多分開発すると思うんですけどでも上質はまあいるわけじゃないですかだからそのね規模感セナさんが言ってるのは規模感的な問題なんですかもっと内部にエンジニアを持ってメインはその人たちで進めていきましょう。",
      "start": 1403454,
      "end": 1453406,
      "timestamp": "23:23"
    },
    {
      "speaker": "C",
      "text": "みたいなまあそうですね少なくともなんかそういうなんだろう世間一般にニュースとかであるようなトラブルを聞いてるとねあのなんでこのトラブルが起こったのかっていうのを解説するyoutbeとかあるわけじゃないですかなんかそういうのを見てるともう中に誰もわかる人がいなくてみたいなことをよく聞くから上司数がそもそも機能してるのかなっていうのを一方でちょっと感じるところでありますよねそうなのでそこで言うんだったら言ってしまうと例えば本当にKさんみたいに優秀な例えばエンジニアさんを中で抱えるだけの魅力がないのかそれともシンプルに職率が高いのか中での情報統率が取れてないのかなんかしらやっぱり事情があってっていうとこがあるしそれが今内政化を進めようっていうふうになってるんだったら僕はいい兆候じゃないかなっていうふうに思ってるっていうイメージですね。",
      "start": 1453406,
      "end": 1500571,
      "timestamp": "24:13"
    },
    {
      "speaker": "B",
      "text": "結構僕、北米が内政が進んで、日本は逆にSEとかSIRに外注するっていうのがなんで進んだのかっていうのを考えたときにやっぱり経営層のITへの向き合い方のスタンスが結構初期で違ったせいっていうのがあるんじゃないかなと思っていて割と僕のとこも結局IT以下の主な業務は業務効率化って言ったんですけど日本って割とITに対する初期のスタンスって業務効率化すること既存の業務をいかに早く正確にやるかっていうところに主眼を置いたものが多かったと思うんですけど割と北米は業務効率化だけを主眼に置いてないと思っていて逆に経営層。",
      "start": 1506272,
      "end": 1553955,
      "timestamp": "25:06"
    },
    {
      "speaker": "A",
      "text": "がITを。",
      "start": 1553955,
      "end": 1554175,
      "timestamp": "25:53"
    },
    {
      "speaker": "B",
      "text": "なんだろう新しくビジネスを今のビジネスを再構築するツールとして見ている色が強かったなと思っていてだから結構日本ってさっきも言われてた情報システム部みたいなのがそういう事業系の会社にもたくさんあると思うんですけど今は変わってきてるかもしれないんですが昔の流れでいくと割とそういう部門って社内で固みが狭いところが多かったと思うんですよメインの事業から見られるとちょっとメインから揃えてるどうしてもコストセンター的に見られる直接利益を生み出さないでコストを抑える効率化していくところっていうだけの見方でそれ自体が価値を生み出すものではないっていう見方が強かったと思うんですね経営の方がそれが結果としてエンジニアに対する待遇とかにもつながってきてると思いますしまああとIQを使ってなんか新しいことをやっていくかみたいなスタンスの違いにもなってきてるのかなと思ってます。",
      "start": 1556368,
      "end": 1617005,
      "timestamp": "25:56"
    },
    {
      "speaker": "C",
      "text": "まあそうですシンプルに悔しいっていうのがやっぱりあってなんかやっぱりそういうテクノロジーによって自分たちの生活がどう変わるのかもしくはね自分たちの運営がどう変わるのかっていうところがまあ想像ができないとやっぱりそれは礼遇対象になるんだろうなと思うのでまあコストとしてねしか見られていないっていうの今の発言ももちろんそうかなと思うけれどもそれがね今最近になって変わってきてるんだったら何とか応援できないかなというふうに思うんですがやっぱりそのじゃあ計算的な目線から見てももし日本での内製化をスムーズに進める要因が仮にあるとすれば今の話からやっぱりトップ層のやっぱり意識改革というかあのそのテクノロジーの分野を自分たち内製部隊で持つことのやっぱり恩恵っていうのをちゃんと認識してくれたらまあだいぶ変わるのかなっていうイメージ。",
      "start": 1617005,
      "end": 1660115,
      "timestamp": "26:57"
    },
    {
      "speaker": "A",
      "text": "ですかねやっぱそうですね、。",
      "start": 1660115,
      "end": 1662718,
      "timestamp": "27:40"
    },
    {
      "speaker": "B",
      "text": "やっぱそれはすごいあると思っていて、さっきりょうさんが言われてたみたいに、そういった事業系、強い事業がある会社で、じゃあIT化を進めていこうって言ったときに、まあその優秀なエンジニアたちがその会社に入っていきたい、入りたいかっていう視点ってすごい大事だと思っていて、すでになんか大きいエンジニア部隊があるんだったらそれなりにちゃんとした技術スタックとかも使っていて、モダンな環境だったり待遇も良かったりすると思うんで人はちゃんと来てくれると思うんですけど本当に全然今IT化が進んでないようなところIT部門が育ってないようなところにいきなり優秀な人が来てくれるかっていうとあんまそうではないと思っていてそれをどうやって引き込むかっていうとやっぱり経営層がいかにITをどのように考えてるかデジタル化どうやって進めていくかっていうのが大事だと思っていて自分のビジネスのとこにそれをどう絡めていくそれがやっぱいい待遇とかそういったことにもつながってきて魅力的な人材引きつけるあの力にすごいつながってると。",
      "start": 1662718,
      "end": 1728067,
      "timestamp": "27:42"
    },
    {
      "speaker": "A",
      "text": "思いますねなんかあの聞けば聞くほど高齢化が問題のような気がしてき。",
      "start": 1728067,
      "end": 1734143,
      "timestamp": "28:48"
    },
    {
      "speaker": "B",
      "text": "たんですけど、。",
      "start": 1734143,
      "end": 1735255,
      "timestamp": "28:54"
    },
    {
      "speaker": "A",
      "text": "なんかさっきのセナさんの成功例って言ってたのってアイフルでしたっけ?アイフルってあの保険の会社じゃないですか、保険って基本的に若い人向けに行うビジネスじゃないです。",
      "start": 1735255,
      "end": 1747403,
      "timestamp": "28:55"
    },
    {
      "speaker": "C",
      "text": "かまあまあそうなのかな。",
      "start": 1747403,
      "end": 1749144,
      "timestamp": "29:07"
    },
    {
      "speaker": "A",
      "text": "っていうのがまあひとつあってで例えばじゃあ銀行を例にしてみていくと銀行のあのit化というかそのアプリとかを作ってやっていきたいかっていうと多分そんなに銀行としてはやっていきたくなくてなんでかというと銀行の持ってる資産のほとんどは多分高齢な人から来てるはずなんですよね今の社会でいうとでことはその人たちが欲しいのは多分その人たちはスマホとかパソコンとか使ってやり取りをしている人たちは少ないのでどっちかというとそのアプリとかっていうよりは窓口が必要になるんですよねそうすると窓口が必要ってことは基本的にはそのアプリは使われないでまあなおかつその大きい企業そういう会社で働いているあの経営人もやっぱり高齢方が多いわけじゃないですか今の日本の現状で言うとだからニーズとしてもやっぱそのアプリとかIT化はいらないで決める人たちもそれを使えないからその重要性にはわからないなんかそのiPhoneみたいなそのビジネス自体が若い人向けにしているものであればまあ納得って感じはするんですけど銀行とかっていうとかまぁ結構ほとんどのビジネスはやっぱりその日本の人口がやっぱり高齢化してるっていうところから見ると、IT化っていうのにはあんまそもそも向いてないというか。",
      "start": 1749144,
      "end": 1833783,
      "timestamp": "29:09"
    },
    {
      "speaker": "C",
      "text": "人口動態は100%確かありますよね。需要と供給の部分も含めて。",
      "start": 1833783,
      "end": 1838607,
      "timestamp": "30:33"
    },
    {
      "speaker": "A",
      "text": "だから、需要を考えるとやっぱり高齢化してる中っていうか、もうすでに社会全体が高齢なんで、日本の社会は。しょうがないのかなっていうのもありますよね。",
      "start": 1838607,
      "end": 1852493,
      "timestamp": "30:38"
    },
    {
      "speaker": "C",
      "text": "そうね、確かにな。なんかシンプルに俺らみたいなテクノ人間化するんだったら、便利なスマホアプリあったらええやんみたいな感じになりやすいけど、まあそうね、おじいちゃんおばあちゃんからするんだったらね、そんなの作られてもねえっていう感じだろうから。",
      "start": 1852493,
      "end": 1866800,
      "timestamp": "30:52"
    },
    {
      "speaker": "A",
      "text": "今だってたぶん、まだ60代、60代ぐらいかな。僕の親が今60代で、スマホ使ってるけど、使いこなしてるかって言ったら、そんな使いこなしてなくて、。",
      "start": 1866810,
      "end": 1877406,
      "timestamp": "31:06"
    },
    {
      "speaker": "C",
      "text": "で、。",
      "start": 1877406,
      "end": 1877516,
      "timestamp": "31:17"
    },
    {
      "speaker": "A",
      "text": "パソコンもたぶん使える人もいるし、あんま使えない人もいるみたいな、うちの親は全然あんまり使えないんですけど、。",
      "start": 1877516,
      "end": 1884480,
      "timestamp": "31:17"
    },
    {
      "speaker": "B",
      "text": "で、。",
      "start": 1884480,
      "end": 1884950,
      "timestamp": "31:24"
    },
    {
      "speaker": "A",
      "text": "50代。50代40代まあ40代になると多分もうスマホもパソコンも使えるよって人が多分ほとんどでその人たちがメインのターゲットになってくるというかぐらいになったらそこらへんは進むのかなっていう感じはし。",
      "start": 1884950,
      "end": 1900187,
      "timestamp": "31:24"
    },
    {
      "speaker": "C",
      "text": "ますまあそうですね後10年くらいですかワンちゃんです。",
      "start": 1900187,
      "end": 1905770,
      "timestamp": "31:40"
    },
    {
      "speaker": "A",
      "text": "かねまあとは別になんかあれですよねニーズとかあれは置いといてまあ僕たちなんか北米で働いている組からするとそのエンジニアがかっこ悪い、給料もらえないみたいなのは、なんか、現実問題、日本に帰ろうって思った時に、帰れない要因の一つであるし、なんか、まあ、瀬名さんが言うように、悔しいのはありますよね。それが、なんか、内政化が進んでくれて、まあ、こんな言い方していいのか悪いのか、いいのかわかんないけど、なんか、僕としても、なんか、あんま、SIRとかはなければ、あの、さす、ね、その、内政部隊が増えて、もうちょっと環境だったりだとか、給料の改善されていくのかなっていう、ちょっとあれはありますよね。すべての自宅会社が、そもそも悪いわけではないと思うし、その自宅会社で幸せにやって、給料も満足いくよって人たちも、たぶんいると思うんで、あれですけど、僕の経験的に言うと、やっぱり、稼げないし、つらいし、炎上プロジェクトとかあるし、で、なんか自分がこうやったらいいじゃんとかって提案したものは、あの、なんだろう、。",
      "start": 1905770,
      "end": 1979157,
      "timestamp": "31:45"
    },
    {
      "speaker": "C",
      "text": "ふわーっと消えていくし。なるほどね。まあ、提案が確かに通りにくいのは確かあるだろうな。",
      "start": 1979157,
      "end": 1986119,
      "timestamp": "32:59"
    },
    {
      "speaker": "A",
      "text": "やるせなさというか、みたいなのを持ってる人たちは多分いっぱいいて、でもなんか、だからといって、その技術力もあんまりプログラミングをしないからつかないみたいなのがあり、その違う環境に飛び込めないみたいなのがあるんで、そういうところはちょっと改善されてなんか内製化されることによって改善されていく会社が増えてその全体としてそれが変わってくるといいなーってのもありますけどねそう。",
      "start": 1986119,
      "end": 2015250,
      "timestamp": "33:06"
    },
    {
      "speaker": "C",
      "text": "だねまぁあとはいつも東橋さんが言うことやけどやっぱり日本でSIRで働いてた人たちのやっぱりそのレジュメ上のミスマッチって北米とやっぱり大きいじゃないですかあのやっぱりシンプルにアジャイルで回すことはほぼないだろうしやっぱりウォーターフォールにやっぱりなりやすいのはねどうしても愛さやの場合あると思うのでするとやっぱりチームでの目標の持ち方だったりとか成果の出し方っていうのも北米圏に来て日本でサイヤー的働き方してましたよレジュメに書いたとしたってなかなかねそれがこっちでの内政部隊を持っている企業からも受けが悪いしSaaS企業からしたらもっと受けが悪いしそうってなりやすいのでその辺のミスマッチもねまぁこれは北米挑戦する人にちょっとフォーカスを置いちゃってるけどまぁちょっと大きいよねっていうのがあるのでそういった面からも正直日本からのSIR文化とかS文化SIR文化かに関してはちょっと薄まっていただけると北米挑戦しやすい人も増えるだろうなぁとかって思ってますけどねでもその辺はKさんのAOBCもやっぱりそうですかアジャイルでやっぱり回していたりとか1個のプロジェクトで何かルーティンがあったりとかする。",
      "start": 2015250,
      "end": 2075855,
      "timestamp": "33:35"
    },
    {
      "speaker": "B",
      "text": "イメージですかそうですね基本的には大きなプロジェクトはアジャイルで回していく形になっ。",
      "start": 2075855,
      "end": 2082621,
      "timestamp": "34:35"
    },
    {
      "speaker": "C",
      "text": "てますねですよねスプリントもあってっていうのは割とその辺の働き方はSaaSにも近いのかな近いところがあるのかなと思ってるんですがお。",
      "start": 2082621,
      "end": 2091719,
      "timestamp": "34:42"
    },
    {
      "speaker": "B",
      "text": "だしょーそうですねやっぱりある程度をしっかり拡張してメンテしていかないといけないアプリとかに関してはその辺りの回し方はSaaSにすごい近いと思います。",
      "start": 2091719,
      "end": 2103806,
      "timestamp": "34:51"
    },
    {
      "speaker": "C",
      "text": "三宅さっき僕も冒頭気になっていたグロース絶対しなくちゃいけないっていう圧迫感みたいなやつは多分もちろんSaaSのほうが強いんだろうなって思うんですがそのグロースに対する意識以外に関しては割と僕は開発工程に似てんじゃないかなと思っていてそうなのでまあねこっちのやっぱりその日本での内製化っていうのが進んでくるとそのまあアジャイル的なサース的なやっぱりまあ働き方っていうのを一般化してくるだろうしでするとまあね北米行くぞっていう時のそのレジュメ上のミスマッチっていうのも相当減ると思うのでそういった意味でいい流れが来てくれると嬉しいなとは思ってねそれで言うとあれですよ。",
      "start": 2103806,
      "end": 2141558,
      "timestamp": "35:03"
    },
    {
      "speaker": "A",
      "text": "ねその受託会社も別にそのこっちのまあこっちだから世界のあの北米もヨーロッパも基本的にてか日本以外ほぼほぼみんなあの同じような働き方はされてるじゃないですかソフトエンジニアとか言うとIT業界のこの業界で言うとそれで言うと受託SIRだとしてもそれをやることは可能ですよねてかやってるところもありますよねなんでだからそのSESが少なくなって、その内製部隊が増えるっていうことよりも、その受託会社とか、。",
      "start": 2141558,
      "end": 2175406,
      "timestamp": "35:41"
    },
    {
      "speaker": "C",
      "text": "SIRも、。",
      "start": 2175406,
      "end": 2175881,
      "timestamp": "36:15"
    },
    {
      "speaker": "A",
      "text": "そういうなんか、世界のスタンダードの働き方になってくれるっていうのがまあ、一番幸せな道ではあるかなと思いつつ、でもなんか、結構、たぶん僕の世代とかってそうなんですけど、仕事するときに考えたくないっていう人多分多いと思うんですよね。",
      "start": 2175881,
      "end": 2195077,
      "timestamp": "36:15"
    },
    {
      "speaker": "C",
      "text": "なるほど。",
      "start": 2195077,
      "end": 2196663,
      "timestamp": "36:35"
    },
    {
      "speaker": "A",
      "text": "責任も持ちたくないし考えたくもないしその自分に決定権がない方がいいって人たちって多くて、今なんか話とかなんかよく聞くのだと、ジェネレーション、ジェンジーってなんて言うんでしたっけ、Z世代、Z世代とかはそうでもないみたいですけど、僕たちの世代って結構そういう人たちが多分いて、別に俺らは、そういう人たちは特に、受託会社で言われたことやって、あのお金もらって、それで十分ですっていう人たちがいっぱいいるのは結構納得なのかなっていうのも。",
      "start": 2196673,
      "end": 2230697,
      "timestamp": "36:36"
    },
    {
      "speaker": "C",
      "text": "ありますけどまぁなるほどね世代の違いねまぁありえるかもしれないよね働き方と逆にマッチしてる。",
      "start": 2230707,
      "end": 2235408,
      "timestamp": "37:10"
    },
    {
      "speaker": "A",
      "text": "みたいなそうだからそのそういう改革が怖いというかSARSの人たちがなんかSIRはみたいな構図って結構Twiterとかでもあると思うんですけどその人たちからしたら俺らの業界を脅かすんじゃねーよみたいなちょっとなんかそのディフェンシブになる気持ちもわからなくはないですよねそう、。",
      "start": 2235408,
      "end": 2258997,
      "timestamp": "37:15"
    },
    {
      "speaker": "C",
      "text": "そんな感じなのかな?割と俺はSIRの人たちも結構向上心あふれてる人たちも多かったの多いのかなと勝手に思って。",
      "start": 2258997,
      "end": 2264380,
      "timestamp": "37:38"
    },
    {
      "speaker": "B",
      "text": "たんだけどね僕は割とSIRの、元SIRだからっていうのは肯定的な意見を持ってて割とやっぱ同僚とかもすごい技術的に興味がある人とかも多かったし実際技術力めちゃめちゃ高い人とかもいましたねまあただただSaaS系と比べて何かちょっと問題なって思ったらSIって割と大規模のシステムを見てることが多いと思っていてそうなると文教化がやっぱり進んじゃうんですよねそういったときにアプリ何か作ったことありますって言ってもやってるのが本当そのアプリのすごい狭い位置部分だったりとかもしくはインフラの部分だったりとかCICD部分だけだったり極小的なものになっちゃって、そういう形になっちゃってやっぱり北米とかに行って、じゃあソフトウェアエンジニアになりますって言った時に通用する武器になるかって言うとやっぱり弱いなっていうのは感じ。",
      "start": 2264380,
      "end": 2322131,
      "timestamp": "37:44"
    },
    {
      "speaker": "A",
      "text": "ますねそれで言うとそれはこっちでもあるのかなって思ってて、大きい企業に行けばやっぱその小さくなるっていうのはしょうがないことなのかななんかその問題は、僕が思ってるんですけど、ちょっと間違ってたらごめんなさい。問題は多分、その会社の会社だけのものを、会社だけで起こることをやってるみたいなのが多いのかな、みたいな。その、CCDだったとしても、その、なんていうの。全体の共通で使われているものをちゃんとやっててその共通で使われているスプリントとかアジャイルみたいなのを使って仕事をしていればなんか基本的にその技術っていうのはスキルと言えて他の会社でもまあ役立つようにはなるのかなとは思うんですけどそんなことはないです。",
      "start": 2322131,
      "end": 2369190,
      "timestamp": "38:42"
    },
    {
      "speaker": "B",
      "text": "かねそうですね作ってるものの規模感っていうのが割とこの辺って大きいと思っていて国よりもただ単純に特性的にSIRは大きなものを見てるから分業化が起こりやすいっていう色が強いだけなのかなと思っていていわゆるSaaS系の会社ってまず最初は自社の一つのアプリだけじゃないですかでまぁそうなるとやっぱ一気通貫で上から下まで見るっていう形も大きくなってくるんでまぁただそれが成長するとやっぱりりょうさんの言う通りにあのやっぱ分業は進んでくるまあアメリカで言うならそのアマゾンとかも当然もうすごい業務が細分化してると思いますし。",
      "start": 2369190,
      "end": 2415356,
      "timestamp": "39:29"
    },
    {
      "speaker": "A",
      "text": "確かにKさんが言われてるように、細分化されててそれが問題だっていうのは僕もわかるんですよ。なんか多分それって細分化されてて、自分がやってるものはわかるけど他のことはわかんなくて、他の会社行った時にそれが活用できないみたいなことを多分問題意識されてると思うんですけど、アマゾンとか、うちの会社でもそうですけど、結構やってることは僕たちもすごい小さい、僕はアサナって会社で働いてますけど、アサナのすごい小さいというか、ほんと一部分しかやってなくて、だから細分化はされてて、他のところのことはそんなにはわからない。っていうのはあるんですけど、でも、この今ここでの会社の働き、まあ働きというかスキルっていうのは他の会社に持ち越すことができるわけじゃないですか。なんで、僕もこれ純粋に僕もわかんないんですけど、確かに日本でそれが起こると他の会社に持ち越すことができないんだけど、それは何でだと思います?",
      "start": 2418458,
      "end": 2485085,
      "timestamp": "40:18"
    },
    {
      "speaker": "B",
      "text": "僕はここの細分化運営に関しては別に日本と北米がそんなに違うとは思っていなくてその問題が起きる原因っていうのがやっぱり細分化が必要なシステムになってくると結構そのドメインの色が強いなと思っていてすごい技術的なスタックは当然他にも転用はできると思うんですけれどそのシステムで扱ってるケースっていうのが例えばEC系の極小的なところのシステム化であったりとかそういったときに同じような課題を抱えてて同じようなソリューションを提供しないといけない会社がどれだけあるかっていう話もあるし本当にそれと同じような規模感を持ててる会社がどれだけあるかっていうところもやっぱ出てくると思うんですよねあんま大規模すぎるとそれと同じものが必要な規模の会社っていうのがすごい少なくなってくると思うんででまぁそれに対してやっぱその一般的にただSaaSで一気通貫でトップからボトムまでかかってましたよっていうのはすごいカバーしてる範囲が広いと思っていてでまぁよりドメインの色も当然出ると思うんですけど技術的な分野で見られてる範囲っていうのがすごい広いからそういうのはやっぱり北米とか転職の市場の中で強い人材になりやすいのかなっていう印象ありますね。",
      "start": 2485318,
      "end": 2575003,
      "timestamp": "41:25"
    },
    {
      "speaker": "C",
      "text": "なるほどねまあそう内製化されたりやっぱり企業さんの場合のドメイン知識とかってやっぱりそこによるのかなっていうのはちょっと僕も思っていた部分ではあってなんかその辺はどうなんですかKさんのやっぱり周りとかで例えば大学のシステムを作ることのスペシャリストみたいな割とすごいあの狭いとは言いませんけどあのなんか特化したスペシャリストドメイン知識を持ったエンジニアさんとか部隊とかっているもんなんですかね。",
      "start": 2576578,
      "end": 2601862,
      "timestamp": "42:56"
    },
    {
      "speaker": "B",
      "text": "うーんそうですねまあどうしてもやっぱ自分の事業系に紐づいてるエンジニア部隊ってなって自分のとこにドメインに強くなるっていう色は当然あるので意識的にそれを集めてるっていうとそうではないと思うんですけどまあ結果としてそこに詳しい人が増えてくるっていう色が強いかなって。",
      "start": 2604767,
      "end": 2625260,
      "timestamp": "43:24"
    },
    {
      "speaker": "C",
      "text": "思いますねなるほどね想像もつかないんですけどねやっぱりその大学も例えばシステムを構築するにあたってのスケーラビリティだったりだからちゃんと意識できるなんかエンジニアさんはなんか重宝されるよみたいなそういうのも実はあったりするのかなって思ってたんですけどその辺は別に意図的に集めてるわけじゃないってことですねそうです。",
      "start": 2625260,
      "end": 2642519,
      "timestamp": "43:45"
    },
    {
      "speaker": "B",
      "text": "ね当然経験があるとプラスにはなると思うんですけど似たようなシチュエーションが多くなるのでただ募集要項的にそこを強く押してるかっていうとそうではなくてそこはもっと一般的に普通にソフトエンジニアの募集要項と似たような形。",
      "start": 2642519,
      "end": 2656711,
      "timestamp": "44:02"
    },
    {
      "speaker": "A",
      "text": "が多いですねなんかこれもよく話題になりますよね。なんか転職するときにそのドメイン知識っていうのは必要なのかどうなのかみたいな。こっちではなんかあんまそれはないですよね。",
      "start": 2656711,
      "end": 2670177,
      "timestamp": "44:16"
    },
    {
      "speaker": "C",
      "text": "そうだよね。あんま聞かないよね。募集横見ててもなんかそんな見ないしね。",
      "start": 2670177,
      "end": 2674700,
      "timestamp": "44:30"
    },
    {
      "speaker": "A",
      "text": "そうですね。まあ、それもあれなのかな。なんだろう。やっぱないその内製部隊で働いてるとそのうち強くなるってか強く強い人がいるしすでにいるし社内で聞けるし強いあのそのうち強くなるでしょみたいなのが多分割とあってっていうのもあんなんかそこらへんはすぐキャッチアップできるでしょみたいなのがあんのかなちなみにあのこれもちょっとまた戻るんですけど僕はSIRで働いてて僕の周りであんまりなんか勉強してる人はいなかったんですよあ、。",
      "start": 2674700,
      "end": 2708921,
      "timestamp": "44:34"
    },
    {
      "speaker": "C",
      "text": "そうなの?",
      "start": 2708921,
      "end": 2709962,
      "timestamp": "45:08"
    },
    {
      "speaker": "A",
      "text": "僕はあの某Fから始まる系列のところにいたんですけど僕の周りでなんかそのなんか技術のキャッチアップたまにしてるよっていう人は僕以外には一人しかその2、3年間何プロジェクトか行ったけどなかったですねなんでまあそうなんかそうだしあんまりなんか技術強いっていう人もあんまりなんかイメージとしてはなくあんまなくて2人かなもう1人いたかななんかモバイル系がやりたくてでその人は結局SaaS系に移っちゃったんですけどなんでだからなんか会社によっても違うのはあるかもしれないです。",
      "start": 2709962,
      "end": 2752022,
      "timestamp": "45:09"
    },
    {
      "speaker": "C",
      "text": "ねまあ間違いない確かにそうだな俺の言ってるSaaS系の人ってもはやフロックに相談来る人やから交渉心満々に決まってんじゃんっていうのは確かにあると思うので確かに日本の一般のSIRがどういうモチベでどういう意識で働かれてるのかちょっと俺も全然わかんないですケイさんの働きが変わられてた時もそう。",
      "start": 2752022,
      "end": 2772942,
      "timestamp": "45:52"
    },
    {
      "speaker": "B",
      "text": "ですかそうですね僕が見てた限りでは技術的な関心が高い人は同僚にもさっきとすごい多かったんですけどでもやっぱのはモダンな技術とかを取り入れにくいっていうのがあってそういうところでちょっとモチベーションが下がっちゃう人とかはありましたねあと新しいことをどうしてもシステム規模が大きいのでやりにくいっていうのが。",
      "start": 2772942,
      "end": 2802626,
      "timestamp": "46:12"
    },
    {
      "speaker": "C",
      "text": "まあそうねまあ既存システムの結局運用運用だったり報酬っていうのは当然ボリュームゾーンとしては大きいだろうからまあそうなるとね新しい技術云々よりもちゃんとやってよちゃんと報酬してよっていうところはね大きいと思うのでまあそういう技術のキャッチアップの必要性っていう部分だと確かに薄い業界にはなり得るの。",
      "start": 2804562,
      "end": 2820414,
      "timestamp": "46:44"
    },
    {
      "speaker": "A",
      "text": "かなとは思いますよ一方でなんかその住宅会社に勤めてる人ってやっぱり新卒から入る人って結構多いと思うんですよねその技術が全くありませんでしたよ入る時にはで入った入ってから技術身につけましたってでその人たちがまあ結果的になんか面白いじゃんってなってあの向上心もどんどん出てきてそのっていう人たちはいると思うんでそのなんだろう一括新卒採用があるのはその入りやすさとしてはすごい良いじゃないですかそういうまあ意見もあるのかなって僕もすごい始めた当時は新卒とかではなかったんですけどあのパソコンの電源の入れ方がちょっと怪しいぐらいの感じの人間だったんであの本当その会社に雇ってもらえなかったら多分自分はエンジニアにはそもそもなってなかったんでそういう意味で言うと入り口としてはすごい入りやすい業界にはなってますよねその全体を通してそのシャースではないです。",
      "start": 2820414,
      "end": 2883450,
      "timestamp": "47:00"
    },
    {
      "speaker": "C",
      "text": "けどびっくりするもんねやっぱりその研修期間とかで半年とかって割と普通にあるしこの辺やっぱり日本のなんかすごいこのなんか独自の文化というかなんか入りやすい文化には確かになってるなって思うのでそれに助けられた人も多分多いだろうから。",
      "start": 2883450,
      "end": 2900237,
      "timestamp": "48:03"
    },
    {
      "speaker": "A",
      "text": "ねやっぱこれ一丁一単ではあるけどって感じです。",
      "start": 2900237,
      "end": 2905599,
      "timestamp": "48:20"
    },
    {
      "speaker": "C",
      "text": "よねそうだねまあこれ難しいな結局本当に何かじゃあ住宅がね今後どんどん増えていっても内政部隊がどんどん増えていってっていうことでワンちゃんそういうなんか教育文化みたいなとこまで失われるのかってなるともしかしたらそれでいやっていう風な人もいるか。",
      "start": 2905599,
      "end": 2921060,
      "timestamp": "48:25"
    },
    {
      "speaker": "A",
      "text": "もしれないしねうーんまあでもその日本では何て言うんでしたっけ丈夫型雇用っていうのかなが増えてきてるっていうのはもう確かだしまあなんかその流れが来てるのは絶対日本でも来てると思うししょうがないのかなぁ感はありますよ。",
      "start": 2921060,
      "end": 2939348,
      "timestamp": "48:41"
    },
    {
      "speaker": "C",
      "text": "ねまあね確かにねだからまあそれが別に内製化がいっぱいならずともなったとしてもなってもならなくても多分ジョブ型が増えてくればもはや中途みたいな採用の仕方が増えるんだろうしこれは仕方ないか。",
      "start": 2939348,
      "end": 2950912,
      "timestamp": "48:59"
    },
    {
      "speaker": "A",
      "text": "もねそうそうするとやっぱりそのスキルとしてかけることを意識して働き始める人が多分多くなるんでそうするとなんだろうやっぱちょっとなんていうんだろう世界のスタンダードっていうとちょっと趣向が大きいんで嫌だけどまあそういうスタンダードに近づいてはきそうですよねそういう住宅会社でのその働き方みたい。",
      "start": 2950912,
      "end": 2969948,
      "timestamp": "49:10"
    },
    {
      "speaker": "C",
      "text": "なそうだね間違いない俺もともと新卒一括採用制度には割と懐疑的な人間だったのでそうなってくれるのは正直良いことだと思っちゃってる人だけど素晴らしいということですねそれととりあえずそろそろ1時間くらい経つのでコンクリーションというかまとめにも入るんですがとりあえず北米圏における内政化は昔からあって割とSARSと似たような業務形態でやっぱりやられていてやっぱりそういった内政部隊からSARSに移るっていう人も多いだろうし逆もまたしっかりだろうしやっぱり内製化されているUBCみたいなところで働かれていることによる恩恵、安定性だったりとか、自分たちの環境に応じた働き方だったりとかっていうところもわかったので、やっぱりいいことなんだなと正直思って。日本がそうなのかって話をすると正直俺はトカシさんの言ってた高齢化の有無の話に結局気にしまうのかなっていう気も正直してはいてそれ言われてしまうと確かになーとしか言いようがなくて内政化は今後進んでいくんだろうしそういう意識のところも確かに増えるんだろうけども確かに高齢化ビジネスっていう側面からするんだったらどうでもいいよねっていうのはおっしゃるとおりではあってなかなか難しいですね。",
      "start": 2969948,
      "end": 3041622,
      "timestamp": "49:29"
    },
    {
      "speaker": "B",
      "text": "確かにユーザー層に受けないと厳しいですよね、会社としては。",
      "start": 3041622,
      "end": 3045376,
      "timestamp": "50:41"
    },
    {
      "speaker": "C",
      "text": "利用者8割高齢者ってなったら多分やらないもんね、俺も。",
      "start": 3045376,
      "end": 3049851,
      "timestamp": "50:45"
    },
    {
      "speaker": "A",
      "text": "やっぱ根本としてビジネスってお金作るものなんで、お金作れなかったらしょうがないよねって言われたらもう、はいって感じですね。はい、。",
      "start": 3049851,
      "end": 3058110,
      "timestamp": "50:49"
    },
    {
      "speaker": "C",
      "text": "はいっていうしかない。っていうところかなまあとはいえまあ若い層をねやっぱりまああのターゲットにしているところあとは本当にここ10年とか経ったらやっぱりそのねまあ言うてるitネイティブではないあの世代っていうのもどんどん減ってくるのは正直しょうがないことだと思うので予定するのであればまあ必要性はどんどんどんどんと高まっていく分野であるな間違いないだろうからまあいずれのタイミングはそういう時期は来るだろうねという結論なのかな結果としてはどんなところでしょうかはいさあ何か。",
      "start": 3058110,
      "end": 3087864,
      "timestamp": "50:58"
    },
    {
      "speaker": "B",
      "text": "そうですね。僕としても日本がどんどん内政化の動きが進んできているの自体はいいことだなと思っていて、さっき言った転職、北米とか他に今までの経験を生かすっていう面でも当然強い機会は増えてくると思いますし、あと経営的な面で見てもやっぱり内製していると開発者たちが経営と同じ方向を向いて言ってしまうとさっきリオさんが言われたように今までのSI形式だと作っているプロダクトに愛着がないみたいな形があるところもあったと思うんですけどそういう形は減ってくるのが一新動態なんで経営と同じ方向を向いていける形になってくるんですそういった意味ではいい方向だなと思っています。",
      "start": 3091816,
      "end": 3147206,
      "timestamp": "51:31"
    },
    {
      "speaker": "A",
      "text": "ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 3148268,
      "end": 3166363,
      "timestamp": "52:28"
    }
  ],
  "highlight1": "ケイさんはカナダのUBCで6年間Webアーキテクトとして働いており、日本ではSIRでの6年間のキャリアと比較している。",
  "highlight2": "なんか日本の会社が内製化を進める理由としては、業務の効率化やコスト削減が大きいと思っているが、ケイさんは北米の会社ではスピードやパフォーマンスの向上が重要視されている。",
  "highlight3": "セナさんは日本の内製化が進むと、エンジニアの待遇や企業の安定性が向上し、日本の企業がより魅力的な職場になる可能性があると考えており、特に経営層のITへの向き合い方が重要だと語っている。"
}