{
  "episodeGuid": "791bc8bd-01ce-408c-9583-2f1447ac9c6b",
  "episodeTitle": "【特別回】海外就職ってどうするの？何が必要なの？！国選びから英語力までカナダの現役エンジニアが徹底討論（前半）",
  "transcribedAt": "2025-10-17T02:11:19.968Z",
  "duration": 2974,
  "fullText": "はいそしたら今回はYugo君に来てもらっていつもおなじみのセナさんと僕とYugo君でこれからエンジニアとして海外就職を一からするならみたいなちょっとテーマで喋っていきたいなと思いますYugo君なんか簡単に自己紹介をお願いしてもいいです。かはいカナダで働いてます小倉君という名前でITトリオというポッドキャストもやってますこと優吾ですよろしく。お願いしますよろしくお願いします。今回、簡単に今、紹介したんですけど、Yugoくんって、割と来たてじゃないですか、カナダに、バンクーバーには。そうですね、今、来たてと言っても1年10ヶ月ぐらい。その中で3回就職してるわけじゃないですか。福岡、福岡、そういう機会があり、で僕は今、カナダ自体は8年目に突入して、で僕も3社目なんですね。で、まあなんか瀬名さんはいろんな人に、まあなんか今なんかツイッターで日本一日本人を海外就職させた人みたいな感じになってるけど、まあでも嘘じゃないと思うんで、そういうなんだろうね、資産の高いところからなんか話せるかなと思ってて、まあなんかざっくりどんなエンジニアが海外で就職できるの?してるの?っていうのを喋っていきたいなと思います。素晴らしい。僕もねさっきちょっと喋ってたんですけどやっぱり情報をどんどんどんどんアップデートしていかなくちゃいけないし、優吾さんもね今1年と10ヶ月も経ったんだね。そうですね。割と時間も早いでもまあ1年10ヶ月で3社経由っていうのは割とねレアなやっぱりキャラクターでもあるしまああの幸いながらあの優吾さんと富樫さんには以前フロックのあのレジュメイベントの方ね大きさあの開催いただいてすげーあれも一方表だったからちょっと最近のまあなんだろう就活事情みたいなところアップデート一緒にしながら株できればなと思っていたのでちょうどいい機会ありがとう。そうですねなんかそのレジュメイベントっていうのを多分ワードを何回かこのポッドキャストで出してるんですけどそれの簡単バージョンみたいなでプラスそのレジュメ以外のところもカバーできればいいかなみたいなのを思っててっていう感じですねそしたらまずなんか準備段階みたいなところからまず日本から就職できちゃうのそれともやっぱ現地に行かないと無理なのみたいなところからちょっといやー行きますかで。もそうだねこれでも多分フロックの中でも割とトップ5に入るくらい多い質問だと思うわ日本から就活できへんの?いやマジで多い言うてもだってトガシさんも優吾さんも多分1回くらいは俺らに聞いてんじゃないかなって思うけどね。僕してないなして。ないっけあなたは何も聞かれてないそれで言ったら。もう聞いてないんでは。いクロンクに相談する時に僕もそういう話は多分したと思いますねメンター相手が伏瀬奈さんではなかったと思うんですけどこっち見てやってみての裸感ほぼほぼ無理ではと思ってしまいますけども例外はいると思うんですけどその例外を目指すにはちょっと数が少なすぎて特殊すぎてまあなんかめちゃくちゃ有名な人とかかなり一つの技術にすごいトップでズバ抜けていたりする人じゃない限りはなんかあんまり再現してないんじゃないかなという気があったりし。てますけども僕も大体ほぼほぼ同じような回答なんですけどこの頃なんだろう気になってたことがあって僕アサナで働いてるんですけどアサナと同じチームの人でアフリカからかな、来た人がいて、その人は新卒でアサナに入ってるんですね。で、その人は、UKのアマゾンとカナダのアサナと、あと何社か受かったうち、全部ビザをサポートしてもらえるよっていうので、アサナに結局来てるんですね。だから、大きい企業であれば、ないことはなくて、その人に聞いたところ、今でもやってるよっていうので、まあなんかその彼の国からはやっぱUKが近いからUKに行く人が多いけどカナダでもまあある程度の規模の会社であの選べばできなくはないという回答はもらったのでまあ僕たちの知ってる中でも今井さんだったかなっていう人がなんかカナダにもうアマゾン受かった状態で来てたりするじゃないですかなんでそういう会社をまあ選べばあるのかなあと同じような例なんですけど僕が日本にいた時にインディードでカナダ人の友達を働いてたんですけどその人はその後UKのメタかなに内定をもらってビザも出してもらって移動してたんでまあまあ企業を選べばありうるのかなっていうこれ俺。も割と言いたいこといくつかあるけど正直直じゃねっていう気がしててタイミングあの例えばまあフロックの長い歴史の中で言うんだったら日本から就活むっちゃ決まった時期ってやっぱりあってあのその時やっぱ2022年だったんですよねあの時はもうコロナバブルバンバンで今井さんもその組じゃないですかあの相の人もあの日本に対日本であのカナダアマゾンのリクルーティングのブースかなんか確か空いてっていうもうめちゃくちゃレアな時期にぶち当たってそこからあの実際にまあアメリカカナダのフォーアマゾンに来れたっていうやっぱ時期の人だったし2022年のタイミングが本当にレールズエンジニアの例えば女性2人とか3人とか一気にこっちで就職決まって、あの辺に関してはもう本当に日本から就職決まった国が一気に荒れた年ではあってでもやっぱり景気が良くてまあカウントも多くてでなおかつやっぱりそういうビッグテックみたいなところにねまああの入り込めるような人たちっていうフィルターだったらあの時期はすごく多かったなーって思うけど正直あの時期以降なるほどにも聞いてないもんねだから優吾さんの言うようにあの割ともむちゃくちゃレベル高くてもうなんかねほなんかオライリーの本でも書いてるんちゃうかみたいなあのそんなレベルの人だとするんだったら多分リファレンスも強いだろうし周りとねあのどの時期でもどの企業でも行けるのかなっていうのは正直あるんですけどなんか俺のイメージとしてはやっぱりその本当にタイミングによっていける年もあればもうほぼゼロの年もあるよねっていうのが肌感ではあってちなみに東橋さんのお話にあった朝菜の方とかって今年の一つか?いや3年前ぐらいかなその人はでもいや多分今年でも行けなくはないと思うんですよねビザ出してもらってる人とかいるんであとはあのもう一つ言うとしたら僕たち今カナダっていう中で話してるけどさっき言ったようにUKだとかアイルランドとか結構なんかそういう企業があるところを狙っていけば別に本当に無理な国とかはもちろんあるんですけどアメリカとかもね厳しいですねでも割となんかヨーロッパの国とかカナダとかそういうのを入れていけば海外就職って観点においてはどっかしら引っかかることはできそうっていうのが僕の思っていることまあでももちろんこれからあの後で話していきたいんですけどそのレジュメの書き方だったりとかあの面接対策っていうのは日本とちょっと変わってくるからまあそれも含めてその海外にいる人と同じような感度を持ってないといけないみたいなのはあるかもしれないけどまああの無理ではないただしあのすでにそのなんていうの、海外の有名企業に入れる技術力とかスキルがあるっていうのは前提みたいなのかなっていう僕は思い。ましたね確かに海外と一口に言っても日本にいる人からしたら海外ってもういろんな国があるからそれを一括りにして語るとまあ無理がちょっとある気もするけど確かに国とか時期を選べばいけるタイミングとかもあるのかもしれないと聞いて思いましたねそれで今はどういう時期なんですか、瀬名さん的にはいやもう。普通じゃね普通の時期他も何かしかもなくっていう時期や気がしますが本当に就職な年件数だったりとかレイオフの数なんかも最近要聞くようになっちゃったけどでも本当にそうですね結局実力が伴っていて日本でもビッグテック全然いけますよっていう人たちだったらもはや対策さえちゃんとすれば確かにいけるっていうのは間違いなく。あってその対策が一番難しい感じもありますね対策と。いうところと果たしてじゃあ日本に一体何百人くらい日本でビッグテックいける実力のある人たちがいるのかアカウントがどれだけ空いてるのかっていうその辺の話に多分なっ。ちゃってそうっすね窓口は狭いよねあとはなんかさっきの人の例で言うとあの2人あのメタに行った人とアサナに来た人って話だったんですけどどっちもあの英語の国出身なんですよそれからけど大学とかも全部英語とかって話だったんでだからもうそこらへんはなくっていう話にはやっぱなってくるん。で。それを抜くと多分日本人でも結構出てくる人はいると思うんですよね、あのアットコーダーとかやりまくってるつよつよの人たちとかってそういうこの辺強いし、あとまあシステムデザインとかちょっと対策すればいいのかなみたいな感じにはなっ。ているのでで、。カナダ、まあ僕たちみんなカナダにいてその再現性あるみたいな会話で行くとやっぱカナダがいいよねってなると思うんですけどまあそもそも、これ特にセナさんに聞いていきたいんですけどそもそもなんかどういうふうになんていうの国を選んでいけばいいのかみたいなところがあると思うんですけどなんでカナダがいいですか国選び。ですか国選びかまあ結局的なところでもやっぱりビザのカテゴリーの多さとかやっぱり豊富さになってくるんじゃないかなって気がしますけどねやっぱりカナダっていう国自体がその外国人っていう人たちがいないと回らない国まあ人口の4分の1がすでに移民出しっていうところだからまあ支店の通りワーキングホイールでもあればまあcppの亀服同士っていうことで就労ビザの出しやすさもやっぱり豊富やしなので就労、実際日本人がカナダで就労するっていう分においては窓口が非常に広いよねっていうところがカナダの良いところではありますよ逆にやっぱり他の国っていうのが同じじゃないかっていうところも実はあるんですけど例えばオーストラリアとかって多分ワーキングホイールで半年までしか同じ会社じゃないと働けないしとかイギリスの部分とかになってくるとやっぱりワーキングホイールの枠自体がそもそもめちゃくちゃ少ないと倍率がむちゃくちゃ高いというところもあったりするので全体的にバランスを考えた時にカナダって非常にビザ的観点からは働きやすい国だよねっていうのはいろんな人が選んでる理由にはなってると。思うんですよねこの間なんだろうドイツの人と話してベルリンでエンジニアやってる人と話したんですけどあそこらへんもなんかドイツって結構あれドイツだったっけ。移民多いの多いのドイツとベルリンドイツは多いですねドイツ。多いですよね確かドイツとかスペインとかもまあヨーロッパの国は結構多くなってきてるのかなと思うんですけどそこらへんもまあなんか選べないことはないじゃないですかまあもちろん英語以外の現地語を話さないといけないっていうのはある技術ITソフトウェアエンジニアで働いている中だと英語では行けたりするのかなっていう感じだと思うんですけどそこら辺についてはどうですかなんかいやもうカナダの方がいい。みたいなやっぱり俺もこの間ベルリンにあの住まれているところさんって人と喋らせてもらってあのショッピファーいいじゃなかったえっとまあ有名な会社さんでちょっと働かれている方なんですけどその方なんかもやっぱりベルリンすごく押されていたなーっていうふうに思いますね実際ベルリンの県内だと英語で喋れる英語で仕事見つかるしっていうところはまあいいんじゃないかなっていうところはもちろんあるとあとは多分選ぶ側の問題で、やっぱりお隣アメリカっていう部分もあって、カナダの場合、やっぱりアメリカを視野に入れたチームで働いたり、企業で働いたりっていうところになると、どうしてもアカウントの数としてカナダの方が多くなっちゃうよねっていうのが一つと、あとやっぱりドイツですよね。正直、ベルリン以外の部分になってくると、やっぱりドイツ語喋れないとなかなか苦労するっていうのがあるので、ベルリンの県内だけで全ての生活を終えるということであれば特に問題ないかもしれないけどやっぱりベルリンの方からカナダの方に移られてきたSREの方とかもいらっしゃったりしますけど彼らの話を聞いているとやっぱりベルリンとはいえどもやっぱりドイツ語を喋れた方がいいのこの雰囲気だったりやっぱり英語圏の方がいいよねっていう声は結構大きいのでなんだかんだと言ってカナダの方に来る人たちもやっぱり多いのかなと。は思います確かにアメリカの大きい企業と、まあ大きい企業じゃなくてもそうかもしれないけど、スタートアップとかが最初に海外のチーム展開って考えた時に、アメリカ人よりも安いカナダで、時差が同じ、ニューヨークのチームであればトロントにおけるし、サンフランシスコシアトルの会社であれば、バンクーバーに置けるみたいなのは、やっぱ上等というか、結構まあ法律も似てるというか、結構なんかそこら辺が整備されてるみたいなの多分あると思うし、簡単ってのはあれかもしれないですね。Yugoくんは、なんかカナダ選んだ理由とかってあるんですか?来る時に。フロックに相談する前に考えてた、調べて思ってたのは、カナダかオーストラリアか、それこそベルリンだったんですよね。日本人の海外就職の記事を調べてみると、フロックのおかげでカナダとかはよく出てくるし、あと実はなんかベルリンで働いてる方のブルー記事とかも何かちょくちょくヒットしてたんですよね。オーストラリアはそれこそワーキングホリデー使えるし、なんか日本から行ってる人が多そうなイメージだったので、なんとなく思っていたっていう感じだったんですけど、なんかフロックの説明会とかに参加していろいろ聞いてみたり、自分で調べたりしてみると、なんかカナダの方が僕が行きたいって思った時の状況としては、ビザが取りやすかったりするので、なんか安倍かなという感じで、カナダを選んだっていうところはありますね。あと、自分はそんなに英語以外の言語を勉強する気とかもそんなになかったので、ドイツに行くと、それこそさっき言った、ベルリンだと英語で働ける会社もあるけど、ドイツ語が必要な会社もありますみたいなことを言っている方もいて、まあだったら英語で全部で済ませれそうなカナダの方が良さそうだなぁと思ったのはありますね。そうだよね。多分商業法的にはなってくるんだろうなと思いますけどね。あともともと僕が海外に行きたいと思ったのは、英語をメインで使えるところに住んでみたいっていうのもあったので、それを考えると英語ネイティブなカナダとかアメリカとか北米の方に目を向ける方がそもそも目的にかなっていたみたいなのもありますね。確かに日本人それ多そうですよね、なんか多分カナダであの和掘りとか選ばれやすい理由もカナダって英語きれいだからみたいなのがあったりするからやっぱその英語ドリフトなのは割とあるかもしれない。ですねいやめちゃくちゃあると思う、僕こっちに来てから気づいたんですけど海外で働いてみたいって思って、海外で働いてみたいとざっくり思っていたんですけどこっち見てから改めて振り返ると多分それは海外で働いてみたいっていうだけじゃなくて英語を使って先進国で快適に働いてみたいっていう感じだったのかなと思って海外だったら何でも良かったのかっていうと多分そうではないもしかしたらアジアの他のもうちょっと日本よりもまだ給料が安い会社とかを探せばそれこそまあそっちで働ける道もあったかもしれないけどもしそこで内定がゲットできたとしてそっちに本当に行っていたかというと多分なんか行ってないだろうなという生活の質を下げたくないしなんか英語じゃないとあんまり憧れ湧かないしっていうところもあり深井。特にあの後全職絵売れ家さんでしょ割とねやっぱいい会社さんだったっていうのもあるからそれ以上っていうふうに考えるとそれこそ先進国っていうことになるのかなとも思いまして。ヤンヤンそれはありますねまあ給与の面でもそうだしデベロッパーとしての開発体験というか働く上での快適さみたいなことを考えてもアジアではないかなみたいな、アジアの人に失礼なのかもしれないですけど。間違いない、誰かに怒られた。やっぱり相対すると、カナダが安廃っていうのがあるから、間違いないですね。会社が多い、移民が多いっていうので、ビザとかが取りやすい、取った後も続けやすい、あとはお金とかの面でも日本よりちょっと高いか、同じか高いぐらい、英語もあるし、あとは、。今、。僕たちも出してなかったですけど、治安も悪くないみたいな、ここらへんは大きいのかな、みたいな。あとはなんか来てからしか多分わからないけどあのやっぱアジア料理とかアジア人が多いのは結構でかいじゃない。ですかいやーめちゃくちゃでかいですよねめちゃくちゃでかいそれアジア料理もそうだし日本のお米が買えるのって素晴らしいですよ。ねもうなんだよねしかも割と結構新しいお米が。買えるっていう感動した僕こっち来てからまあどうせカナダに行くんだったらカナダらしい食生活を送ればいいんじゃないかパスタたくさん食べればいいんじゃないかそっちの方が節約になるんじゃないかとか思ってたけどいざ海外見て過ごしてみるとなんかお米って、もう魂に刻まれてるんだなみたいな感じ。いや、ほんとそうだね。1ヶ月とかだったらええよ、たぶん。でも1年も2年も3年もっていう風になると、さすがにきつくない?って俺は思いますけどね。1年、海外キラキラ生活で1年はいけるんですよ。で、。2年目とかから長くいようって思って、なんか結構いたなって思ってくると、どんどんもう日本食とかが。食べたくなってくるんですよね。あるのかね、やっぱり。バンクーバーしか結局長期滞在したことがないから、その感覚わかんないんだよな。納豆ない国には俺住めない。結構な国に住めなさそうだね。そうかな、。海外来てる人みたいな。ドイツで住んでる人が、納豆を自分で作るみたいなVlog上げてたりするから。ちょっと怖いな、俺作る自信ないわ。意外と簡単に作れるんですよ納豆から納豆を培養するみたいな感じなんでそこら辺はあれなんですけどちょっと次に行かせてもらうとこれ特にYugoくんに聞きたいんですけどスキルセット日本でソフトエンジニアしてた人がそのスキルセットを何がこっちでそのまま活用できてこれはできないこれはできるみたいなのってあれば教えてもらいたいなって。めっちゃむずいですねその質問でも技術力みたいなところで言うとそれはそのまま通じるとは思いますし経歴も本当は仕事の中でやってきた経験自体も本当はそのまま使えるとは思うんですけど多分問題はそれをレジュメに落とすときにこっちの人の魅力的に感じる書き方で書けるかどうかみたいなところな気がしてて単純になんかJavaScriptを使いますTypeScriptを使いますReactを使いますとか何だろう、仕事の経歴で言うとビューからリアクトに置き換えました、みたいなのは書くようによっては本当はすごい魅力的に書ける気はするんですけど、多分それをそのまま書いちゃうとなんかもうあんまり意味がないなという気がしている感じですね。そうですね。レジュメのところもちょっと後でもっと詳しく行きたいんですけど、コンテキスト的にはあれですよね。Yugoくんは、さっきも言ってたように、SaaSの会社から来てるから、SaaSの日本の会社にいて、こっちのSaaSの会社に入るのであれば、確かに今までやってきたことが日本語でやってきたのだけども、ある程度は使い回せるというかそのスキルセットはそのまま受け継がれるよっていう感じですね。そうですねスキルセットもそうでしたも開発体験みたいなところも普通にアジャイル使うのが普通だよねみたいな感じで働いていたのでそういう働いていた僕の感覚からするとこっちの会社の働き方がめちゃくちゃこう新しいとかめちゃくちゃ新鮮かというとまあそうではない多少違いはいろいろあるけれども割と自分のこれまで日本でやってきた経験に近いところだなと思うの。でツールとかはどうですかそれこそジラとかアサナとかみたいなチケットを作るシステムとかスラックみたいなコミュニケーションツールスラックはねどこでも使われてるかなと思う。んですけどツールもそんなに変わんないかなっていう気がしてますねチケットの管理はジラとかgithubプロジェクトとかノーションとかでやっててまぁそれはそのまんまだなぁと思いますしよくある振り返り会とかも僕が日本に行ったときはフィグジャムとかフィグマの一つの機能フィグジャムとかミジカルっていうソフトウェアを使ってたけどなんかこっちではそれをそのまま同じように使っているのを見かけるしなんかcicdのところでもサークルciとかギットファーアクションズとか日本で使ってましたけどやっぱりこっちでもそれそのまま使ってるしそんなにこう日本の特に僕がいたようなSaaS界隈、ベンチャー界隈みたいなところの開発体験とこちらの開発体験とか比べてみると、日本がそこまで遅れているとか、こっちと比べて劣っているとかは、なんか方法感じないかなっていう感じが、印象があります。そうすると、えっと、日本でじゃあ、ま、Yugoくんみたいな会、Yugoくんが働いてたみたいな会社に働いてて、なおかつ、英語がしゃべれ、しゃべれれば、入ってしまえば、もうほぼほぼ何もなんだろう、難しいことはないかなって感じですか?難しいところ。そうですね。難しいところは確かに、英語が一番難しいので、僕がクリアできてれば、めちゃくちゃ難しいっていうことはないと思いますね。日本にいるときに比べると、やっぱりより結果主義であったりとか、っていうところは感じたりはしますけど、それ以外のところでめちゃくちゃ難しいところがあったかと言われると、あんまり思い当たらないですね。じゃあ、ほぼほぼ英語っていう感じかな。そうですね、英語が難しい。英語を助けてって感じですね。それはなんか、聞くと、じゃあ日本の人たちは、なんかよく言うのは技術力高いって言うし、じゃあ英語さえなんとかすれば、もうほぼほぼ、就職さえもちろんしてしまえば、なんだろう、そんなに大変なことはないだろうって感じね。それなんかいいですねそうですねだから英語が大変だから大変なの変わりはないんですけど大変じゃないかと言われると大変ですという感じではありますがそれはなんか多分メイン英語から来るものでそれ以外の開発の仕方が違うから大変っていうのではない感じ。ですねまあでもそこはね多分フロックも全く同じことを皆さんにお伝えさせてもらってて技術力とか開発経験っていう分で多分日本とめちゃくちゃ違うって確かに印象持ってる方結構多いと思うけどほぼ一緒だと思ってもらっていいと思うもんね俺もなんだけどちょっと聞いててやっぱ思った部分としてそのコミュニケーションやっぱ取り方っていう部分もしかしたらちょっとネックに思う人いるのかなと思っててその日本語ベースでやっぱりプロジェクトにも参加してスプリントも回してアジャイル経験もちゃんとあるよっていう人たちであったとしても発言力だったりとかミーティング出てずっとだんまりみたいなやっぱりないといったら多分嘘になってうーんそういうのってよりこっちだとやっぱりディスアドバンテージというかなんのためこいつおんねんのオーラってやっぱこっちの方が強いじゃないですかなので、なんかその辺のね、コミュニケーションにおけるところの訓練っていうのは、もしかしたら別に日本語だろうが英語だろうが、なんかできるところはやってほしいなって思うことは、ちょっと正直多いなと思います。確かに、コミュニケーション。なんかその、発言しない人が、なんでおるねんみたいなのは、僕はないと思ってて、ただ、あの、ただ、プロモーションもない。まあそうよね、間違いない。ただ、その、特にカナダって、めちゃくちゃ人が、いい人たちが多いんで、悪いこととかに対して、つっこまないんですよね、そもそも。もちろん、マネージャーだったら、プロモーションのためにそのチームのために発言してこうねとかチームのためのなんかファシリテートとかなんかこういうイベントのことだったりとかやろうねみたいなのは言ってくれるかもしれないけどまあなんかそれってプロモーションのためにっていう多分コンテキストでは言うかもしれないけどそれ以外は多分あんまなくてあのなんかあんまりないかなってなんで怨念みたいなまではならない気がするなんか何で。4年まで行かなくてもさなんか面接の時にだんまり言ってもワコンじゃないです。かでもそれはそれはそうですねあのもちろんその必要な時に喋るあのインタビューとかレジュメについてはもっとちょっと突っ込んでいきたいんだけどまあ入ってしまえばっていうまあちょっといやまあそう。ね間違いないでもさミーティングで喋れない奴って多分面接でも喋れない人が多い。と思うそれはそうそれは。そうだから俺たぶん結果同じだと思うとこあんだよね正直成果をさあ自分はこういうことやりましたとかこういう経験をしましたっていうのは面接で喋れる奴って多分ミーティングでもおそらくこういうことが今回偉大だと思いますとかこういうことやりましたって多分言える人でねえお菓子さんにしろあの優吾さんにしろやっぱりその面接の時とかにやっぱりそういうアピールも当然してるんだろうしなんかそういうなんかところでまた頭の回路としてはもしかしたペースのとこにあんのかなって思うところが結構あってその技術とかとはまた別。にねそれは技術力みたいなところとは別な気がしてますね、。確かに。そこの課題の方がやっぱり俺は圧倒的に大きいと思うけどね。それはもう同意ですね。自分で意識してそうやって話すようにしていかなきゃいけないと思うし、やっぱ僕がこっち来て思うのは英語を使うっていうだけで自分の脳のリソースが言語それ自体に裂かれるから相手何言ってるんだこれっていうのを考えながら聞いたり聞き取れないことがあったらその場でちょっと前後の文脈から予測したり自分で単語調べたりして意味を理解するっていうのを同時にやるのでそうなるとどうしても普通に日本語で話して日本語で仕事するよりは自分の発言のハードルが自分の中で一つ上がって一つ二つで済むかわかんないけど結構上がってしまうのでそこはもう結構ずっと努力が必要だなっていう感じが僕。はしてますなんかあのちょっとその違いみたいな部分での話にはなるんだけどあの強いエンジニアっていう定義がいろいろあるなこっちにはいろいろあるなっていうのもちょっと違いなのかなと思ってて日本の強いエンジニアってなんかその技術に強いみたいなのがなんかほとんどなんかすごい80%ぐらい占めてるなみたいなイメージがあってこっちでもその技術に強くてなんかすごい良いシステムをアーキテクチャーであのデザインできる人とかももちろんいるんだけどそうじゃない強いエンジニアがいろいろいてなんかその人たちもちゃんと強いとされてるなぁみたいなのがあるなぁってちょっとこの頃感じててどう。いうのがありますかその技術一芸に秀てるとかいうのじゃない場合ってなんかあの。プロジェクト、技術力っていう観点で言うと、普通かなみたいな、ちゃんとやれることはやれるし、シニアだよねっていう人だけど、プロジェクトマネジメントが上手い人みたいな人が強いってなってたり、それで評価されたりもするし、とにかく早いみたいなすごい早くあのプロジェクト回してどんどんフィーチャー作っていくみたいなでその人の技術力が高いかっていうと別にそうでも決してそうではないみたいななんかいろんな種類の人たちがあの別のなんだろうなベクトルで評価をされてるって強いエンジニアっていう風になんか考えられてるなっていうのが結構あるなって思うんですけどどうですかどう。なのかな僕が働いている会社はスタートアップの会社なので割とみんな実装早くというかテキパキと動いて仕事を早く終わらせるみたいな人が多い印象ではあるけどりょうさんの話を聞いてみると確かに日本の場合でもプロジェクトマネジメントがよくできるとか実装が早いとかって評価はされると思うんですけどエンジニアとして評価されるだけでなんかサブスキルとして評価されているような気は。確かにするかなそうそう。そう仕事はできる人ですねその人は確実にで会社の中で評価も入れるけどそれがなんか強いエンジニアと直接結びつくかというとこっちの感覚よりはなんですかね直接的にはなんか結びついてない感覚があるか。もそうなんか僕もその感覚があってなんかずっと僕あの自分なんか強くないエンジニアだっていうのを僕はずっと今まで思ってきたんですねでっていうのをなんかまあそれでそういうふうに強い技術に強いエンジニアになりたいなみたいなのを思ってそれをなんかマネージャーとのワンオンみたいなのでよく出してたんですけどそのたんびに結構でもりょうめちゃくちゃ実装早いしプロジェクトのマネジメント上手いから別にそっちがあるからいいじゃんみたいなそっちで評価されていけばいいじゃんみたいなのをなんかこの間言われてでなんかあのYugoくんとの前の会話でなんかちょっと出たんだけど後でリンクとかも貼っておこうかなと思うんですけどなんだっけあの風鈴火山。のエンジニア風鈴火山っていうそうそう。そうなんかそういうのでもあるようになんかいろんなまあエンジニアがいてでなんかこっちではそれが主流なんかちゃんとそのサブスキルみたいなスキルじゃなくてその総体として評価されてるなみたいな感じがこれでも。ねフロックの中でもこれは結構やっぱり問われることもあるんだけどさなんでこの人は就職できたのに僕はできなかったんですかね割と結構多いのやっぱり言ってしまうとで本当に同じ会社を同じタイミングで例えば受けた人で明らかにエンジニア経験もそうあの落ちた人の方が上で明らかに実装力も早いに決まってるのになぜかあのまあジュニアとは言えないけどインターミネート上がりくらいの子がやっぱり受かっちゃってっていうとこがあってで正直その時見た時に俺いやそれに決まってんじゃんって思うのは処理小魅力で単純にチームとして一緒に働くところを想像しやすいのってコミュニケーション能力が得意な人じゃないですかぶったけ高い人実装力がどれだけあったとしたってこの人と一緒に実装してるイメージ湧かないなとか一緒に開発工程進めてるイメージ湧かないなって人も正直いるっちゃいいそんなところっていう部分で見るんだったらまあすごい単純にまとめてしまって申し訳ないけど、わりと魅力高かったらどういう場でもやっていけるのかなっていうまあもちろん最低限のね技術力が当然あっての前提でっていう風にはやっぱりいろんな人見てって正直思うとこではあるので魅力は人を救うみたいなとこはあんのかなとは思うそこら。へんってまあこっちで言うとなんかビヘイビラルインタビューで割とカバーするところじゃないですかそうね間違いない日本ってどうなん。すか確かに小魅力?小魅力というか、一緒にやっていけるかなっていうのをざっくり見るのが一応基本的には、ビヘイビラルインタビューじゃないですか。そこらへんってなんか日本ではちゃんとビヘイビラルインタビューっていうような、時間が設定されてインタビューするんですか?それともなんか、そこらへんってなんかざっくりインタビューの中で見るみたいな感じなんですか?なんか分けてやってるイメージあんまりないですけどね、そういう質問とかはよくして、カルチャーフィットが大事っていうのは結構いろんな会社が言ってるし、僕がいた会社でも言っていましたけど、なんかそれと同時に技術力も見てるみたいなのはあるかもしれない。行動、日本語だとbehavioraluestionqって行動面接って言いますけど、。そうだね、。行動面接行動面接っていう単語は自分が前いた会社とかでも出てきてたんで、それをして相手がどういう人柄かを確認するっていうのは確実にやってはいましたけどそんなにこっちほど、behavioralquestionだけで時間をかけるみたいなのは会社にいるのかな、会社にいると思いますけど僕がいたところではもうなんかやってはいるけど、めちゃくちゃ時間かけてるっていう印象ではなかったかなって感じですね。なんか日本のさ、就活事業最近いろいろ調べだしてて思うのがさ、やっぱ言うて売り手市場じゃないですか、やっぱり日本って。あのエンジニアカーズにしたってできるエンジニアってやっぱりどうしても少ないし正直いろんな面接のなんか工程とか話聞いててなんかビヘイベロルだったりとかな行動面接みたいなところで人フルいうかけるってよりは過去の経歴とあの実際にいた環境とプロジェクトだけでもして雇ってますみたいな空間の方が俺はめっちゃ感じたけどね。確かにそれは売り手だからこそもうあのそこら辺で奮いにかけることができてないっていう現状なのかもしれないね確かにもちろん。やってるはいるだろうしあのむずい会社はむずいからまあねオーバー多いからやってるとこもあるんだろうけどこっちほどで絶対ないな。っていうのはそこで確か。にそれはそう、確かにポジションをオープンしても、欲しい経歴持った人がそもそも集まらないみたいなのはいろんなところで、オープンするためにどこの会社でもよく聞いてたので、それはあると思いますね。それが答えだ。よし、。じゃあ次に進みます。で、ここ結構みんな気になるところだと思うんですけど、ぶっちゃけミニマムの英語ってどのぐらいなのっていう、どのぐらい英語力があれば、面接、仕事に支障ない。支障ないって言うと、結構レベル高くても支障は出てくるじゃないですか。なんであれなんだけど、耐えられるというか、働けるの?っていう、だっくりな質問になるんですけど。難しい。でも、なんかこれ、トーイックとかの点数とかじゃないですよね。それこそやっぱり、。英語でコミュニケーション取れる自信ありますか?Yes!だったらいけるんじゃないですか?そうなるんだよね。なんか、これ結構たぶん、マネージャーとかにもよるかなっていうのはあって、僕、一番最初の自分のマネージャーがスペイン人で、英語が下手くそではなかったんだけど、めちゃくちゃなんていうの、アクセントのある人だったんですよね。後から聞いたら、実はその人IL2Qあるぐらいめちゃくちゃ高かったんで、9って一番最高の点数なんですけど、めちゃくちゃ英語力の高い人ではあったんだけど、僕はその人のアクセントのおかげで、わりと何だろう、躊躇なくしゃべれることができたっていうのと、あとは、その人が英語を勉強した経験があるから、いろんなところで気を使ってくれていたなっていうのは、めちゃくちゃ感じます。移民国家ならではの話。それはでも、一社目で、その後からはほぼほぼみんな、あんまりそういうことを感じなかった。で、だからなんかその会社の働く環境とかにはよりますよね。そうだね、。確かに。みごうさんのとこは?みごうさんのとこもいる?そういうなんか外国人のあんまりバリバリで、もうこいつ言ってることなんもわからへんみたいな。うん、。今の会社はいないかも。今の会社、なんか多分カナダネイティブの人がなんか多くて、その速さについていくので、頑張ってますという感じではあるんですけど、1社目とかだと、それこそインド系の方が多かったので、胃のなまりがすごくて。確かにないやどうなん。だろう2人にシンプルに聞きたいはあの今日も俺その話ちょっと相談なんか来てたもんねやっぱりあの一社目働き出しましたやったー言ってたインターンの子があの自分の上司がイスラエルどうだったかなどっか向こうの人の方で鉛がひどすぎで全然何言ってるかわからないんですけどみんなどうやって乗り越えてるんですかみたいなで割と英語に自信あった子だったのは多分トイック満点はいかないけど多分800点オーバーくらいのことで教科書英語でずっと勉強していた人たちがそこを乗り越えるボーダーハードルの乗り越え方みたいなのって2人はどう乗り越えたのかな?慣れ?慣れだとは思いますし教科書とか何かのテストで高得点取れてもジェネラルな英語力というだけで得点の鉛を持った人の英語に対応するにはそれ用のある程度最適化が必要なのかなとか思ったりして僕はその一社目のこともあってインドの方と働くことが多かったんですけど彼らの英語は聞いていても結構なまりが強いのでなかなか聞き取りにくかったりするっていうのもありますしなんかちょっと後に気づいたのはたとえそのオンラインのチャット上でもわかりにくいことがあるなという気がしてたまになんか英語を読んで何言ってるかわかんないなっていうことがちょくちょく発生するんですけど、その最初の会社でもそれ以降でも。それでちょっとなんか調べてみると、その人インド出身で、なるほどと思うことがあったりして、だから発音以外にもなんか使う単語の、使われやすい単語の種類とか、就職してどこに置くかとかが、なんか結構、育った国とか勉強した国によって違うのかなとか使われやすいのが違うのかなとか思ったりしてまあ日本人もそうだと思うんですけどそれに頭が慣れないとどうしても処理に時間がかかってしまって英語を使えないなーっていうのはあると思いました。バックグラウンドによってなんか言葉の強さも全然違うしね。本当に僕はえっとYugoくんのあれなんだろう補足ぐらいしか思い浮かばないんだけどなんかやっぱりネイティブの人でも難しいアクセントのアクセントが強い人の国の言葉は聞き取れないんですよただYugoくんが今言ってたように英語を聞くのに使ってる処理のメモリをほぼ使ってないんでアメリカ人ネイティブの人たちはだからそのなんていうの行間を読むこともできるしそのいろんなことができるじゃないですかそのこう言ってるけどまあこういうことなんだろうなみたいなのを考えたりだとかで僕たちの場合はその英語を喋るってだけであのメモリの何十パーセントが持ってかれてるんでまあ慣れればどんどんそれをミニマイズできるとは思うんですけどだからそういう人たちのそのアクセントに対応できないとかってなると思うんですけどただあのネイティブの人とか、英語すごい上手な人でも、やっぱり聞き返してるんですよね。よく見ると。聞き返すの、。確かに。だから、もう聞き返して、聞き返しまくる。しょうがない。で、自分の処理速度が、自分の英語の処理速度が速くなるのを待つ。いや、間違いないね。それしかないかなっていう。いや、その多分、Twiterゲインが、言えない人がやっぱり日本人多いと思うよね、おそらく。もう一回言ってって言ったら負けみたいなそれは確かにもうハートの持ち方としてもはや絶対に乗り越えなくちゃいけないと思うからそれ英語上手い下手くそ関係ないもんね。多分あとはあのあなたが英語をあの下手くそなのを隠せてると思ってるかもしれないけど隠せてないんですよ英語うまい人たちはちゃんとアクセントちゃんと日本人のアクセント悪いの分かっちゃってるし全部分かられちゃってるんでそのつもりで分かんないことは分かりませんって言っちゃってもあなたの評価が下がることはないですよっていうのは言いたい僕は特に自分に言いたいそれさ、。ちなみに前聞かれてあるんだよ、それちなみに。カナダだと確かにそうかもしれないけど、アメリカだとどうなんですか?って聞かれて。確かに印象としてさ、アメリカはなんか、その英語ができないということに対するプレッシャーがちょっと強いという印象あるじゃないですか。ないかっていうのはちょっと。俺はあるんだけど、なんかその辺ってね、お二人ともアメリカのチームの方々ともやり取りすることもあったりするのかな、あなたないのか。僕はないですね。優子さんとか小林さんとかはあってるのかなと思うけど、なんかその英語っていう部分に対する当たりの強さみたいなのって、なんか違ってとか感じたりする?確かにその、さっきも言ったように、英語を勉強、第二言語として勉強した人たちはやっぱりその自分たちもその道を通ってるんで、っていうのはあると思います。なんでまあそういうのを通ってない第一言語でしか生きてない人たちはなんか聞き返したとしても僕たちが理解できなかったとか分からなかったじゃなくて聞こえなかったんだと思って同じことを繰り返してくる人たちはいるんですけどまあでもそういう時は俺は第二言語だぞって思ってやっぱ聞くしかないんですよで、中国とか韓国の人たちは違うんですけど、ポルトガル語とかラテン系の人たちってめちゃくちゃ同じ単語をシェアしてるんですよ。同じ単語とかすげー似てるみたいなのが多くて、なんでその人たちの勉強量と日本人が英語を勉強する勉強量って全然違うんで、そこはもう自信満々に、俺らの方が難しいところから来てんだからっていうあれで聞き直す。で、あの、メンタリティだけですよ、本当に。だから、アメリカ人の人たちに、そんななんか、当たり強くても、「いや、でも俺は第二言語で喋ってるけどね。」みたいなのが、いけると思います。あとは、あの、理解でき、あの、聞いたり読んだりして理解できるっていうのが、僕は一番大切だと思ってて、その後に、喋る発音は、ほんと全然必要ないなと思ってるんですよね。僕も、僕は発音よく喋りたいし、あの、なんていうの、ネイティブみたいに喋りたい気持ちはあるけども、あの、理解できて喋る気が、あの、下手くそな発音で喋る気概があるのであれば、なんでも大丈夫かなって思ってて、あの、めちゃく、英語は、僕よりも全然長いあの人でまあさっき言ったようにインドナマリだったり中国ナマリだったりっていろいろあるんですけどあの人たちちゃんと完璧に聞き取ってものすごいなんていうのまあ文法もペッタクレもない感じでアクセントもすっげーくっつけたまま喋り喋ってそれを別に直そうともしない人たちが結構多いんですよでもその人たち理解はできてるしでアメリカ人たちはまあアメリカ人というかネイティブの人たちはちゃんとそので、メモリが少ないことからその人たちが言うことを聞き取ってるんで仕事には何の影響もないんですよっていう人が結構いっぱいいるん。で発音は一番後って感じは確かにしますねなんかこっちに来る前は今日綺麗な英語喋んなきゃいけないのかなとかてか英語の学習とかをYouTbeでなんか動画を漁って見てみてもなんか綺麗な発音の仕方みたいなのがなんかよく出てきがちな気がするんですけどこっち来て働いてみて思うのは発音は一番後でいいなっていうのは確かに思うかも。ちゃんと聞けて、ちゃんと理解できて、発音はどうでもいいから自分を伝えたいことを伝えられるっていうのがメインであって、発音がきれいかどうかはもうそんな必要ないし、だから発音きれいにできたほうがかっこいいとは思うけど、日本人ががんがっばったところで、まあきれいな日本なまりの英語みたいな感じな気がするんで、まあ時間があったら、こう完璧な発音を目指してみてもいいのかもしれないけどそれのために時間を使うのは結構後になるなっていうのが僕も働いてて思って。たところですたくさんの英語学習あのサイトとかあのブックとかを見解あの多分的に回す発言がたくさん出てき。てる気がするけどそれは確かにちょっと見ててイライラ。するところがある発音なんていらないんだけど僕は今シャドーテン頑張ってます素晴らしいシャドーテンシャドーミング。は僕もめちゃくちゃいいと思っ。てた。流れてきた動画の真似をすることによって、その音が聞けるようにするための発音練習というか、みたいな面もあると思うので。でも、それを考えると、じゃあアクセントめちゃくちゃあるけど、ちゃんと言ったことを理解してる日本人以外の国の人たちはどうなんだろうって話になりますよね。だから僕はあそこはある程度本当ではないんじゃないかなとは思ってます自分がその発音できないイコールリスニングで聞けないってのは嘘だと思ってます。確実にこれいろんな多分教材移動的に回してる気がする。確かにマーケティング的にシャドーウィングメインでするサービスは絶対そういうふうに言うと思うので確かに100%確実に正解ではないのかも。しれないですねまあ間違いないまあ正直。その方が聞きやすいってのがあると思いますよあのその方が多分あの早近道なのかもしれないけどそれが正しいではないみたいな感じですね。シンプルにやっぱり日本からあの相談来られる方々ってやっぱりその英語が下手くそっていうことがやっぱり評価に直結するんじゃないかっていう心配事は絶対にあると思っていてまあそれがねお二人の口からねそこが正直評価ポイントになってるわけじゃないよっていうのが聞けるのであればだいぶなんか勇気づけられる人多い気がし。ますけどね英語が下手くそかもしれないって自分で思って、ちょっと自信がなくなってしまって、オドドしてしまうってなると、それは結構マイナス要因だと思うんですけど、そこはもう気にせずに。結構ポジティブなタイトル望む方が全然いいなっていう気がしますね。面接においても仕事上で英語使うにしても。たしかに。その聞いてる人たちもずっとアクセントすごいなーなんて思ってないですからね。それはほんとそう。りょうの喋り方だーぐらいしか多分思ってないんで、最初はアクセントつこうってなるかもしれないけど、その後はまあなんか慣れたら普通に喋ってくれるんで、まああんま気にしてもしょうがないかなってところですからね。ここだけ聞い取りされて、発音なんてクソだっていうミームが広まらないかだけ心配ですね。言っとこ、。言っとこ。発音なんてクソだ。まあ楽しいな。でもまあ働いてる二人がそれ言うんだからね。それ以上なんてあるわけないんだし。クソではないですが。日本ってやっぱその英語の勉強にかけるお金がめちゃくちゃ、多分世界一とかなんですよね。いや、すごいよね。そうだよね、だってすごいお金で動いてるよ、。あれ。そう、ある程度だからやっぱ、その広告から来てるところってあると思うんですよね。だからもうそこはしょうがないです。だから、まあなんか、これを聞いた日本から出たエンジニアの皆さんは、ぜひ発音など気にせず、リスニングと、あの下手くそな英語を喋る気概だけ持って海外に出てきてくれればいいのかなと。一応補足だけしとくわそんな先英中研とかもし狙うんだったら頑張ってねって全部英語のテスト今必要や。から発音関係なくないですかそれもやっぱりあるよそれは。発音というかまぁごめん発音というかIL2評価としてのまぁそれでそれ。も発音関係ないんですよ。IL2発音は関係ないと。思うIL2監視さんでもないけどなんか何そのスピーディングとリーディングとリスニングだけできればいいよっていうところを突き詰めるとそうなんのかなっていう気がちょっとしてて。でもなんかスピーキングまあそうですねスピーキングもあのでもアクセントもとか発音もスピーキングには考慮はされなくて文法喋る中での文法とかナチュラルに喋れてるかみたいなのは評価されるんだけどアクセントは大丈夫。かなうんそうだねまあだからスピーキングもちょっとは勉強しようねっていうのはそこ。にちょっと。確かに英語の勉強がいらないっていう話ではないですよね。ではない、うん、もちろん、もちろん、そうですね。こういうふうに言ってましたけど、別に日本に来る前で、TOEICで言うと、大学生の時に800何点とか取ってるし、でもりょうさんも結構、そもそも彼が来る前にフィリピン留学とか行って、英語力とかって身につけてたと思うんで。そうだね、。ないわけじゃない。別になんか、発音は置いておいて、英語の勉強はちゃんとしてきた上で、こっちに来て、こう思って待つっていう発言なんで、英語力がいらないと言いたいわけではないという。そうだね、間違いない。すげー、なんかいきなり守りに入りましたね、二人とも。いやー、ちょっと怖いんで。いやいや、でもね、これ今から英語ちゃんと頑張るよっていう人たちに届いたら、それはそれでめんどくせえなっていう意志を持ったから。なんか僕はどれだけ言っても日本人、まあ僕も含めて、やっぱり英語勉強頑張るんで、もうそこはいいかなみたいなのはちょっと。そうだね、それはわかってるぜって。素晴らしいと思う。で、えっと、で、まあなんか今回前半に、後半で話したいなと思ってて、前半はまあなんか準備段階からまあなんか準備だね主に後半はどうやって探したかとかさっき言ってたレジュメどうやって書けばいいのとかあとは具体的に面接のプロセスってこんなのがあるよねみたいなのをちょっとしゃべれたらいいかなと思いますでは前半はこのぐらいにしようと思いますありがとうございましたはいありがとうございましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "はいそしたら今回はYugo君に来てもらっていつもおなじみのセナさんと僕とYugo君でこれからエンジニアとして海外就職を一からするならみたいなちょっとテーマで喋っていきたいなと思いますYugo君なんか簡単に自己紹介をお願いしてもいいです。",
      "start": 8,
      "end": 16459,
      "timestamp": "00:00"
    },
    {
      "speaker": "Yugo",
      "text": "かはいカナダで働いてます小倉君という名前でITトリオというポッドキャストもやってますこと優吾ですよろしく。",
      "start": 16459,
      "end": 24084,
      "timestamp": "00:16"
    },
    {
      "speaker": "Senna",
      "text": "お願いしますよろしくお願いします。",
      "start": 24084,
      "end": 27831,
      "timestamp": "00:24"
    },
    {
      "speaker": "Ryo",
      "text": "今回、簡単に今、紹介したんですけど、Yugoくんって、割と来たてじゃないですか、カナダに、バンクーバーには。",
      "start": 27831,
      "end": 37193,
      "timestamp": "00:27"
    },
    {
      "speaker": "Yugo",
      "text": "そうですね、今、来たてと言っても1年10ヶ月ぐらい。",
      "start": 37193,
      "end": 42148,
      "timestamp": "00:37"
    },
    {
      "speaker": "Ryo",
      "text": "その中で3回就職してるわけじゃないですか。福岡、福岡、そういう機会があり、で僕は今、カナダ自体は8年目に突入して、で僕も3社目なんですね。で、まあなんか瀬名さんはいろんな人に、まあなんか今なんかツイッターで日本一日本人を海外就職させた人みたいな感じになってるけど、まあでも嘘じゃないと思うんで、そういうなんだろうね、資産の高いところからなんか話せるかなと思ってて、まあなんかざっくりどんなエンジニアが海外で就職できるの?してるの?っていうのを喋っていきたいなと思います。",
      "start": 42158,
      "end": 82110,
      "timestamp": "00:42"
    },
    {
      "speaker": "Senna",
      "text": "素晴らしい。僕もねさっきちょっと喋ってたんですけどやっぱり情報をどんどんどんどんアップデートしていかなくちゃいけないし、優吾さんもね今1年と10ヶ月も経ったんだね。",
      "start": 82110,
      "end": 90814,
      "timestamp": "01:22"
    },
    {
      "speaker": "Yugo",
      "text": "そうですね。",
      "start": 90814,
      "end": 93302,
      "timestamp": "01:30"
    },
    {
      "speaker": "Senna",
      "text": "割と時間も早いでもまあ1年10ヶ月で3社経由っていうのは割とねレアなやっぱりキャラクターでもあるしまああの幸いながらあの優吾さんと富樫さんには以前フロックのあのレジュメイベントの方ね大きさあの開催いただいてすげーあれも一方表だったからちょっと最近のまあなんだろう就活事情みたいなところアップデート一緒にしながら株できればなと思っていたのでちょうどいい機会ありがとう。",
      "start": 93312,
      "end": 114143,
      "timestamp": "01:33"
    },
    {
      "speaker": "Ryo",
      "text": "そうですねなんかそのレジュメイベントっていうのを多分ワードを何回かこのポッドキャストで出してるんですけどそれの簡単バージョンみたいなでプラスそのレジュメ以外のところもカバーできればいいかなみたいなのを思っててっていう感じですねそしたらまずなんか準備段階みたいなところからまず日本から就職できちゃうのそれともやっぱ現地に行かないと無理なのみたいなところからちょっといやー行きますかで。",
      "start": 115739,
      "end": 146972,
      "timestamp": "01:55"
    },
    {
      "speaker": "Senna",
      "text": "もそうだねこれでも多分フロックの中でも割とトップ5に入るくらい多い質問だと思うわ日本から就活できへんの?いやマジで多い言うてもだってトガシさんも優吾さんも多分1回くらいは俺らに聞いてんじゃないかなって思うけどね。",
      "start": 146972,
      "end": 159700,
      "timestamp": "02:26"
    },
    {
      "speaker": "Ryo",
      "text": "僕してないなして。",
      "start": 160809,
      "end": 162370,
      "timestamp": "02:40"
    },
    {
      "speaker": "Senna",
      "text": "ないっけあなたは何も聞かれてないそれで言ったら。",
      "start": 162370,
      "end": 164731,
      "timestamp": "02:42"
    },
    {
      "speaker": "Ryo",
      "text": "もう聞いてないんでは。",
      "start": 164731,
      "end": 165832,
      "timestamp": "02:44"
    },
    {
      "speaker": "Yugo",
      "text": "いクロンクに相談する時に僕もそういう話は多分したと思いますねメンター相手が伏瀬奈さんではなかったと思うんですけどこっち見てやってみての裸感ほぼほぼ無理ではと思ってしまいますけども例外はいると思うんですけどその例外を目指すにはちょっと数が少なすぎて特殊すぎてまあなんかめちゃくちゃ有名な人とかかなり一つの技術にすごいトップでズバ抜けていたりする人じゃない限りはなんかあんまり再現してないんじゃないかなという気があったりし。",
      "start": 165832,
      "end": 200072,
      "timestamp": "02:45"
    },
    {
      "speaker": "Ryo",
      "text": "てますけども僕も大体ほぼほぼ同じような回答なんですけどこの頃なんだろう気になってたことがあって僕アサナで働いてるんですけどアサナと同じチームの人でアフリカからかな、来た人がいて、その人は新卒でアサナに入ってるんですね。で、その人は、UKのアマゾンとカナダのアサナと、あと何社か受かったうち、全部ビザをサポートしてもらえるよっていうので、アサナに結局来てるんですね。だから、大きい企業であれば、ないことはなくて、その人に聞いたところ、今でもやってるよっていうので、まあなんかその彼の国からはやっぱUKが近いからUKに行く人が多いけどカナダでもまあある程度の規模の会社であの選べばできなくはないという回答はもらったのでまあ僕たちの知ってる中でも今井さんだったかなっていう人がなんかカナダにもうアマゾン受かった状態で来てたりするじゃないですかなんでそういう会社をまあ選べばあるのかなあと同じような例なんですけど僕が日本にいた時にインディードでカナダ人の友達を働いてたんですけどその人はその後UKのメタかなに内定をもらってビザも出してもらって移動してたんでまあまあ企業を選べばありうるのかなっていうこれ俺。",
      "start": 200072,
      "end": 301379,
      "timestamp": "03:20"
    },
    {
      "speaker": "Senna",
      "text": "も割と言いたいこといくつかあるけど正直直じゃねっていう気がしててタイミングあの例えばまあフロックの長い歴史の中で言うんだったら日本から就活むっちゃ決まった時期ってやっぱりあってあのその時やっぱ2022年だったんですよねあの時はもうコロナバブルバンバンで今井さんもその組じゃないですかあの相の人もあの日本に対日本であのカナダアマゾンのリクルーティングのブースかなんか確か空いてっていうもうめちゃくちゃレアな時期にぶち当たってそこからあの実際にまあアメリカカナダのフォーアマゾンに来れたっていうやっぱ時期の人だったし2022年のタイミングが本当にレールズエンジニアの例えば女性2人とか3人とか一気にこっちで就職決まって、あの辺に関してはもう本当に日本から就職決まった国が一気に荒れた年ではあってでもやっぱり景気が良くてまあカウントも多くてでなおかつやっぱりそういうビッグテックみたいなところにねまああの入り込めるような人たちっていうフィルターだったらあの時期はすごく多かったなーって思うけど正直あの時期以降なるほどにも聞いてないもんねだから優吾さんの言うようにあの割ともむちゃくちゃレベル高くてもうなんかねほなんかオライリーの本でも書いてるんちゃうかみたいなあのそんなレベルの人だとするんだったら多分リファレンスも強いだろうし周りとねあのどの時期でもどの企業でも行けるのかなっていうのは正直あるんですけどなんか俺のイメージとしてはやっぱりその本当にタイミングによっていける年もあればもうほぼゼロの年もあるよねっていうのが肌感ではあってちなみに東橋さんのお話にあった朝菜の方とかって今年の一つか?",
      "start": 301379,
      "end": 386697,
      "timestamp": "05:01"
    },
    {
      "speaker": "Ryo",
      "text": "いや3年前ぐらいかなその人はでもいや多分今年でも行けなくはないと思うんですよねビザ出してもらってる人とかいるんであとはあのもう一つ言うとしたら僕たち今カナダっていう中で話してるけどさっき言ったようにUKだとかアイルランドとか結構なんかそういう企業があるところを狙っていけば別に本当に無理な国とかはもちろんあるんですけどアメリカとかもね厳しいですねでも割となんかヨーロッパの国とかカナダとかそういうのを入れていけば海外就職って観点においてはどっかしら引っかかることはできそうっていうのが僕の思っていることまあでももちろんこれからあの後で話していきたいんですけどそのレジュメの書き方だったりとかあの面接対策っていうのは日本とちょっと変わってくるからまあそれも含めてその海外にいる人と同じような感度を持ってないといけないみたいなのはあるかもしれないけどまああの無理ではないただしあのすでにそのなんていうの、海外の有名企業に入れる技術力とかスキルがあるっていうのは前提みたいなのかなっていう僕は思い。",
      "start": 386697,
      "end": 460977,
      "timestamp": "06:26"
    },
    {
      "speaker": "Yugo",
      "text": "ましたね確かに海外と一口に言っても日本にいる人からしたら海外ってもういろんな国があるからそれを一括りにして語るとまあ無理がちょっとある気もするけど確かに国とか時期を選べばいけるタイミングとかもあるのかもしれないと聞いて思いましたねそれで今はどういう時期なんですか、瀬名さん的にはいやもう。",
      "start": 460977,
      "end": 483014,
      "timestamp": "07:40"
    },
    {
      "speaker": "Senna",
      "text": "普通じゃね普通の時期他も何かしかもなくっていう時期や気がしますが本当に就職な年件数だったりとかレイオフの数なんかも最近要聞くようになっちゃったけどでも本当にそうですね結局実力が伴っていて日本でもビッグテック全然いけますよっていう人たちだったらもはや対策さえちゃんとすれば確かにいけるっていうのは間違いなく。",
      "start": 483014,
      "end": 503404,
      "timestamp": "08:03"
    },
    {
      "speaker": "Yugo",
      "text": "あってその対策が一番難しい感じもありますね対策と。",
      "start": 503404,
      "end": 506785,
      "timestamp": "08:23"
    },
    {
      "speaker": "Senna",
      "text": "いうところと果たしてじゃあ日本に一体何百人くらい日本でビッグテックいける実力のある人たちがいるのかアカウントがどれだけ空いてるのかっていうその辺の話に多分なっ。",
      "start": 506785,
      "end": 517008,
      "timestamp": "08:26"
    },
    {
      "speaker": "Ryo",
      "text": "ちゃってそうっすね窓口は狭いよねあとはなんかさっきの人の例で言うとあの2人あのメタに行った人とアサナに来た人って話だったんですけどどっちもあの英語の国出身なんですよそれからけど大学とかも全部英語とかって話だったんでだからもうそこらへんはなくっていう話にはやっぱなってくるん。",
      "start": 517008,
      "end": 537539,
      "timestamp": "08:37"
    },
    {
      "speaker": "Senna",
      "text": "で。",
      "start": 537539,
      "end": 537559,
      "timestamp": "08:57"
    },
    {
      "speaker": "Ryo",
      "text": "それを抜くと多分日本人でも結構出てくる人はいると思うんですよね、あのアットコーダーとかやりまくってるつよつよの人たちとかってそういうこの辺強いし、あとまあシステムデザインとかちょっと対策すればいいのかなみたいな感じにはなっ。",
      "start": 539406,
      "end": 550733,
      "timestamp": "08:59"
    },
    {
      "speaker": "Yugo",
      "text": "ているのでで、。",
      "start": 550733,
      "end": 553535,
      "timestamp": "09:10"
    },
    {
      "speaker": "Ryo",
      "text": "カナダ、まあ僕たちみんなカナダにいてその再現性あるみたいな会話で行くとやっぱカナダがいいよねってなると思うんですけどまあそもそも、これ特にセナさんに聞いていきたいんですけどそもそもなんかどういうふうになんていうの国を選んでいけばいいのかみたいなところがあると思うんですけどなんでカナダがいいですか国選び。",
      "start": 553535,
      "end": 573935,
      "timestamp": "09:13"
    },
    {
      "speaker": "Senna",
      "text": "ですか国選びかまあ結局的なところでもやっぱりビザのカテゴリーの多さとかやっぱり豊富さになってくるんじゃないかなって気がしますけどねやっぱりカナダっていう国自体がその外国人っていう人たちがいないと回らない国まあ人口の4分の1がすでに移民出しっていうところだからまあ支店の通りワーキングホイールでもあればまあcppの亀服同士っていうことで就労ビザの出しやすさもやっぱり豊富やしなので就労、実際日本人がカナダで就労するっていう分においては窓口が非常に広いよねっていうところがカナダの良いところではありますよ逆にやっぱり他の国っていうのが同じじゃないかっていうところも実はあるんですけど例えばオーストラリアとかって多分ワーキングホイールで半年までしか同じ会社じゃないと働けないしとかイギリスの部分とかになってくるとやっぱりワーキングホイールの枠自体がそもそもめちゃくちゃ少ないと倍率がむちゃくちゃ高いというところもあったりするので全体的にバランスを考えた時にカナダって非常にビザ的観点からは働きやすい国だよねっていうのはいろんな人が選んでる理由にはなってると。",
      "start": 573935,
      "end": 630623,
      "timestamp": "09:33"
    },
    {
      "speaker": "Ryo",
      "text": "思うんですよねこの間なんだろうドイツの人と話してベルリンでエンジニアやってる人と話したんですけどあそこらへんもなんかドイツって結構あれドイツだったっけ。",
      "start": 630623,
      "end": 641650,
      "timestamp": "10:30"
    },
    {
      "speaker": "Senna",
      "text": "移民多いの多いのドイツとベルリンドイツは多いですねドイツ。",
      "start": 641650,
      "end": 645071,
      "timestamp": "10:41"
    },
    {
      "speaker": "Ryo",
      "text": "多いですよね確かドイツとかスペインとかもまあヨーロッパの国は結構多くなってきてるのかなと思うんですけどそこらへんもまあなんか選べないことはないじゃないですかまあもちろん英語以外の現地語を話さないといけないっていうのはある技術ITソフトウェアエンジニアで働いている中だと英語では行けたりするのかなっていう感じだと思うんですけどそこら辺についてはどうですかなんかいやもうカナダの方がいい。",
      "start": 645071,
      "end": 672694,
      "timestamp": "10:45"
    },
    {
      "speaker": "Senna",
      "text": "みたいなやっぱり俺もこの間ベルリンにあの住まれているところさんって人と喋らせてもらってあのショッピファーいいじゃなかったえっとまあ有名な会社さんでちょっと働かれている方なんですけどその方なんかもやっぱりベルリンすごく押されていたなーっていうふうに思いますね実際ベルリンの県内だと英語で喋れる英語で仕事見つかるしっていうところはまあいいんじゃないかなっていうところはもちろんあるとあとは多分選ぶ側の問題で、やっぱりお隣アメリカっていう部分もあって、カナダの場合、やっぱりアメリカを視野に入れたチームで働いたり、企業で働いたりっていうところになると、どうしてもアカウントの数としてカナダの方が多くなっちゃうよねっていうのが一つと、あとやっぱりドイツですよね。正直、ベルリン以外の部分になってくると、やっぱりドイツ語喋れないとなかなか苦労するっていうのがあるので、ベルリンの県内だけで全ての生活を終えるということであれば特に問題ないかもしれないけどやっぱりベルリンの方からカナダの方に移られてきたSREの方とかもいらっしゃったりしますけど彼らの話を聞いているとやっぱりベルリンとはいえどもやっぱりドイツ語を喋れた方がいいのこの雰囲気だったりやっぱり英語圏の方がいいよねっていう声は結構大きいのでなんだかんだと言ってカナダの方に来る人たちもやっぱり多いのかなと。",
      "start": 672694,
      "end": 738980,
      "timestamp": "11:12"
    },
    {
      "speaker": "Ryo",
      "text": "は思います確かにアメリカの大きい企業と、まあ大きい企業じゃなくてもそうかもしれないけど、スタートアップとかが最初に海外のチーム展開って考えた時に、アメリカ人よりも安いカナダで、時差が同じ、ニューヨークのチームであればトロントにおけるし、サンフランシスコシアトルの会社であれば、バンクーバーに置けるみたいなのは、やっぱ上等というか、結構まあ法律も似てるというか、結構なんかそこら辺が整備されてるみたいなの多分あると思うし、簡単ってのはあれかもしれないですね。Yugoくんは、なんかカナダ選んだ理由とかってあるんですか?来る時に。",
      "start": 738980,
      "end": 777714,
      "timestamp": "12:18"
    },
    {
      "speaker": "Yugo",
      "text": "フロックに相談する前に考えてた、調べて思ってたのは、カナダかオーストラリアか、それこそベルリンだったんですよね。日本人の海外就職の記事を調べてみると、フロックのおかげでカナダとかはよく出てくるし、あと実はなんかベルリンで働いてる方のブルー記事とかも何かちょくちょくヒットしてたんですよね。オーストラリアはそれこそワーキングホリデー使えるし、なんか日本から行ってる人が多そうなイメージだったので、なんとなく思っていたっていう感じだったんですけど、なんかフロックの説明会とかに参加していろいろ聞いてみたり、自分で調べたりしてみると、なんかカナダの方が僕が行きたいって思った時の状況としては、ビザが取りやすかったりするので、なんか安倍かなという感じで、カナダを選んだっていうところはありますね。あと、自分はそんなに英語以外の言語を勉強する気とかもそんなになかったので、ドイツに行くと、それこそさっき言った、ベルリンだと英語で働ける会社もあるけど、ドイツ語が必要な会社もありますみたいなことを言っている方もいて、まあだったら英語で全部で済ませれそうなカナダの方が良さそうだなぁと思ったのはありますね。",
      "start": 777714,
      "end": 848258,
      "timestamp": "12:57"
    },
    {
      "speaker": "Senna",
      "text": "そうだよね。多分商業法的にはなってくるんだろうなと思いますけどね。",
      "start": 848258,
      "end": 852920,
      "timestamp": "14:08"
    },
    {
      "speaker": "Yugo",
      "text": "あともともと僕が海外に行きたいと思ったのは、英語をメインで使えるところに住んでみたいっていうのもあったので、それを考えると英語ネイティブなカナダとかアメリカとか北米の方に目を向ける方がそもそも目的にかなっていたみたいなのもありますね。",
      "start": 852920,
      "end": 870858,
      "timestamp": "14:12"
    },
    {
      "speaker": "Ryo",
      "text": "確かに日本人それ多そうですよね、なんか多分カナダであの和掘りとか選ばれやすい理由もカナダって英語きれいだからみたいなのがあったりするからやっぱその英語ドリフトなのは割とあるかもしれない。",
      "start": 870868,
      "end": 883757,
      "timestamp": "14:30"
    },
    {
      "speaker": "Yugo",
      "text": "ですねいやめちゃくちゃあると思う、僕こっちに来てから気づいたんですけど海外で働いてみたいって思って、海外で働いてみたいとざっくり思っていたんですけどこっち見てから改めて振り返ると多分それは海外で働いてみたいっていうだけじゃなくて英語を使って先進国で快適に働いてみたいっていう感じだったのかなと思って海外だったら何でも良かったのかっていうと多分そうではないもしかしたらアジアの他のもうちょっと日本よりもまだ給料が安い会社とかを探せばそれこそまあそっちで働ける道もあったかもしれないけどもしそこで内定がゲットできたとしてそっちに本当に行っていたかというと多分なんか行ってないだろうなという生活の質を下げたくないしなんか英語じゃないとあんまり憧れ湧かないしっていうところもあり深井。",
      "start": 883757,
      "end": 933118,
      "timestamp": "14:43"
    },
    {
      "speaker": "Senna",
      "text": "特にあの後全職絵売れ家さんでしょ割とねやっぱいい会社さんだったっていうのもあるからそれ以上っていうふうに考えるとそれこそ先進国っていうことになるのかなとも思いまして。",
      "start": 933118,
      "end": 942705,
      "timestamp": "15:33"
    },
    {
      "speaker": "Yugo",
      "text": "ヤンヤンそれはありますねまあ給与の面でもそうだしデベロッパーとしての開発体験というか働く上での快適さみたいなことを考えてもアジアではないかなみたいな、アジアの人に失礼なのかもしれないですけど。",
      "start": 942705,
      "end": 963754,
      "timestamp": "15:42"
    },
    {
      "speaker": "Ryo",
      "text": "間違いない、誰かに怒られた。やっぱり相対すると、カナダが安廃っていうのがあるから、間違いないですね。会社が多い、移民が多いっていうので、ビザとかが取りやすい、取った後も続けやすい、あとはお金とかの面でも日本よりちょっと高いか、同じか高いぐらい、英語もあるし、あとは、。",
      "start": 963754,
      "end": 989838,
      "timestamp": "16:03"
    },
    {
      "speaker": "Senna",
      "text": "今、。",
      "start": 989838,
      "end": 989988,
      "timestamp": "16:29"
    },
    {
      "speaker": "Ryo",
      "text": "僕たちも出してなかったですけど、治安も悪くないみたいな、ここらへんは大きいのかな、みたいな。あとはなんか来てからしか多分わからないけどあのやっぱアジア料理とかアジア人が多いのは結構でかいじゃない。",
      "start": 989988,
      "end": 1004466,
      "timestamp": "16:29"
    },
    {
      "speaker": "Yugo",
      "text": "ですかいやーめちゃくちゃでかいですよねめちゃくちゃでかいそれアジア料理もそうだし日本のお米が買えるのって素晴らしいですよ。",
      "start": 1004466,
      "end": 1010971,
      "timestamp": "16:44"
    },
    {
      "speaker": "Senna",
      "text": "ねもうなんだよねしかも割と結構新しいお米が。",
      "start": 1010971,
      "end": 1014213,
      "timestamp": "16:50"
    },
    {
      "speaker": "Yugo",
      "text": "買えるっていう感動した僕こっち来てからまあどうせカナダに行くんだったらカナダらしい食生活を送ればいいんじゃないかパスタたくさん食べればいいんじゃないかそっちの方が節約になるんじゃないかとか思ってたけどいざ海外見て過ごしてみるとなんかお米って、もう魂に刻まれてるんだなみたいな感じ。",
      "start": 1014213,
      "end": 1031941,
      "timestamp": "16:54"
    },
    {
      "speaker": "Ryo",
      "text": "いや、ほんとそうだね。",
      "start": 1031941,
      "end": 1034091,
      "timestamp": "17:11"
    },
    {
      "speaker": "Senna",
      "text": "1ヶ月とかだったらええよ、たぶん。でも1年も2年も3年もっていう風になると、さすがにきつくない?って俺は思いますけどね。",
      "start": 1034091,
      "end": 1041924,
      "timestamp": "17:14"
    },
    {
      "speaker": "Ryo",
      "text": "1年、海外キラキラ生活で1年はいけるんですよ。",
      "start": 1041924,
      "end": 1045095,
      "timestamp": "17:21"
    },
    {
      "speaker": "Senna",
      "text": "で、。",
      "start": 1045095,
      "end": 1045265,
      "timestamp": "17:25"
    },
    {
      "speaker": "Ryo",
      "text": "2年目とかから長くいようって思って、なんか結構いたなって思ってくると、どんどんもう日本食とかが。",
      "start": 1045265,
      "end": 1053636,
      "timestamp": "17:25"
    },
    {
      "speaker": "Senna",
      "text": "食べたくなってくるんですよね。あるのかね、やっぱり。バンクーバーしか結局長期滞在したことがないから、その感覚わかんないんだよな。納豆ない国には俺住めない。",
      "start": 1053636,
      "end": 1064899,
      "timestamp": "17:33"
    },
    {
      "speaker": "Yugo",
      "text": "結構な国に住めなさそうだね。",
      "start": 1064899,
      "end": 1067600,
      "timestamp": "17:44"
    },
    {
      "speaker": "Senna",
      "text": "そうかな、。",
      "start": 1067600,
      "end": 1068130,
      "timestamp": "17:47"
    },
    {
      "speaker": "Ryo",
      "text": "海外来てる人みたいな。",
      "start": 1068130,
      "end": 1069930,
      "timestamp": "17:48"
    },
    {
      "speaker": "Yugo",
      "text": "ドイツで住んでる人が、納豆を自分で作るみたいなVlog上げてたりするから。",
      "start": 1069930,
      "end": 1074981,
      "timestamp": "17:49"
    },
    {
      "speaker": "Senna",
      "text": "ちょっと怖いな、俺作る自信ないわ。",
      "start": 1074981,
      "end": 1077484,
      "timestamp": "17:54"
    },
    {
      "speaker": "Ryo",
      "text": "意外と簡単に作れるんですよ納豆から納豆を培養するみたいな感じなんでそこら辺はあれなんですけどちょっと次に行かせてもらうとこれ特にYugoくんに聞きたいんですけどスキルセット日本でソフトエンジニアしてた人がそのスキルセットを何がこっちでそのまま活用できてこれはできないこれはできるみたいなのってあれば教えてもらいたいなって。",
      "start": 1077494,
      "end": 1103794,
      "timestamp": "17:57"
    },
    {
      "speaker": "Yugo",
      "text": "めっちゃむずいですねその質問でも技術力みたいなところで言うとそれはそのまま通じるとは思いますし経歴も本当は仕事の中でやってきた経験自体も本当はそのまま使えるとは思うんですけど多分問題はそれをレジュメに落とすときにこっちの人の魅力的に感じる書き方で書けるかどうかみたいなところな気がしてて単純になんかJavaScriptを使いますTypeScriptを使いますReactを使いますとか何だろう、仕事の経歴で言うとビューからリアクトに置き換えました、みたいなのは書くようによっては本当はすごい魅力的に書ける気はするんですけど、多分それをそのまま書いちゃうとなんかもうあんまり意味がないなという気がしている感じですね。",
      "start": 1103794,
      "end": 1153540,
      "timestamp": "18:23"
    },
    {
      "speaker": "Ryo",
      "text": "そうですね。レジュメのところもちょっと後でもっと詳しく行きたいんですけど、コンテキスト的にはあれですよね。Yugoくんは、さっきも言ってたように、SaaSの会社から来てるから、SaaSの日本の会社にいて、こっちのSaaSの会社に入るのであれば、確かに今までやってきたことが日本語でやってきたのだけども、ある程度は使い回せるというかそのスキルセットはそのまま受け継がれるよっていう感じですね。",
      "start": 1153550,
      "end": 1183165,
      "timestamp": "19:13"
    },
    {
      "speaker": "Yugo",
      "text": "そうですねスキルセットもそうでしたも開発体験みたいなところも普通にアジャイル使うのが普通だよねみたいな感じで働いていたのでそういう働いていた僕の感覚からするとこっちの会社の働き方がめちゃくちゃこう新しいとかめちゃくちゃ新鮮かというとまあそうではない多少違いはいろいろあるけれども割と自分のこれまで日本でやってきた経験に近いところだなと思うの。",
      "start": 1183165,
      "end": 1209626,
      "timestamp": "19:43"
    },
    {
      "speaker": "Ryo",
      "text": "でツールとかはどうですかそれこそジラとかアサナとかみたいなチケットを作るシステムとかスラックみたいなコミュニケーションツールスラックはねどこでも使われてるかなと思う。",
      "start": 1209626,
      "end": 1222511,
      "timestamp": "20:09"
    },
    {
      "speaker": "Yugo",
      "text": "んですけどツールもそんなに変わんないかなっていう気がしてますねチケットの管理はジラとかgithubプロジェクトとかノーションとかでやっててまぁそれはそのまんまだなぁと思いますしよくある振り返り会とかも僕が日本に行ったときはフィグジャムとかフィグマの一つの機能フィグジャムとかミジカルっていうソフトウェアを使ってたけどなんかこっちではそれをそのまま同じように使っているのを見かけるしなんかcicdのところでもサークルciとかギットファーアクションズとか日本で使ってましたけどやっぱりこっちでもそれそのまま使ってるしそんなにこう日本の特に僕がいたようなSaaS界隈、ベンチャー界隈みたいなところの開発体験とこちらの開発体験とか比べてみると、日本がそこまで遅れているとか、こっちと比べて劣っているとかは、なんか方法感じないかなっていう感じが、印象があります。",
      "start": 1222511,
      "end": 1275352,
      "timestamp": "20:22"
    },
    {
      "speaker": "Ryo",
      "text": "そうすると、えっと、日本でじゃあ、ま、Yugoくんみたいな会、Yugoくんが働いてたみたいな会社に働いてて、なおかつ、英語がしゃべれ、しゃべれれば、入ってしまえば、もうほぼほぼ何もなんだろう、難しいことはないかなって感じですか?",
      "start": 1275352,
      "end": 1291438,
      "timestamp": "21:15"
    },
    {
      "speaker": "Yugo",
      "text": "難しいところ。そうですね。難しいところは確かに、英語が一番難しいので、僕がクリアできてれば、めちゃくちゃ難しいっていうことはないと思いますね。日本にいるときに比べると、やっぱりより結果主義であったりとか、っていうところは感じたりはしますけど、それ以外のところでめちゃくちゃ難しいところがあったかと言われると、あんまり思い当たらないですね。",
      "start": 1291448,
      "end": 1320555,
      "timestamp": "21:31"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあ、ほぼほぼ英語っていう感じかな。",
      "start": 1320565,
      "end": 1323246,
      "timestamp": "22:00"
    },
    {
      "speaker": "Yugo",
      "text": "そうですね、英語が難しい。英語を助けてって感じですね。",
      "start": 1323246,
      "end": 1330270,
      "timestamp": "22:03"
    },
    {
      "speaker": "Ryo",
      "text": "それはなんか、聞くと、じゃあ日本の人たちは、なんかよく言うのは技術力高いって言うし、じゃあ英語さえなんとかすれば、もうほぼほぼ、就職さえもちろんしてしまえば、なんだろう、そんなに大変なことはないだろうって感じね。",
      "start": 1330270,
      "end": 1346765,
      "timestamp": "22:10"
    },
    {
      "speaker": "Yugo",
      "text": "それなんかいいですねそうですねだから英語が大変だから大変なの変わりはないんですけど大変じゃないかと言われると大変ですという感じではありますがそれはなんか多分メイン英語から来るものでそれ以外の開発の仕方が違うから大変っていうのではない感じ。",
      "start": 1346775,
      "end": 1365179,
      "timestamp": "22:26"
    },
    {
      "speaker": "Senna",
      "text": "ですねまあでもそこはね多分フロックも全く同じことを皆さんにお伝えさせてもらってて技術力とか開発経験っていう分で多分日本とめちゃくちゃ違うって確かに印象持ってる方結構多いと思うけどほぼ一緒だと思ってもらっていいと思うもんね俺もなんだけどちょっと聞いててやっぱ思った部分としてそのコミュニケーションやっぱ取り方っていう部分もしかしたらちょっとネックに思う人いるのかなと思っててその日本語ベースでやっぱりプロジェクトにも参加してスプリントも回してアジャイル経験もちゃんとあるよっていう人たちであったとしても発言力だったりとかミーティング出てずっとだんまりみたいなやっぱりないといったら多分嘘になってうーんそういうのってよりこっちだとやっぱりディスアドバンテージというかなんのためこいつおんねんのオーラってやっぱこっちの方が強いじゃないですかなので、なんかその辺のね、コミュニケーションにおけるところの訓練っていうのは、もしかしたら別に日本語だろうが英語だろうが、なんかできるところはやってほしいなって思うことは、ちょっと正直多いなと思います。",
      "start": 1365179,
      "end": 1417665,
      "timestamp": "22:45"
    },
    {
      "speaker": "Yugo",
      "text": "確かに、コミュニケーション。",
      "start": 1417665,
      "end": 1419466,
      "timestamp": "23:37"
    },
    {
      "speaker": "Ryo",
      "text": "なんかその、発言しない人が、なんでおるねんみたいなのは、僕はないと思ってて、ただ、あの、ただ、プロモーションもない。",
      "start": 1419466,
      "end": 1431564,
      "timestamp": "23:39"
    },
    {
      "speaker": "Senna",
      "text": "まあそうよね、間違いない。",
      "start": 1431564,
      "end": 1433715,
      "timestamp": "23:51"
    },
    {
      "speaker": "Ryo",
      "text": "ただ、その、特にカナダって、めちゃくちゃ人が、いい人たちが多いんで、悪いこととかに対して、つっこまないんですよね、そもそも。もちろん、マネージャーだったら、プロモーションのためにそのチームのために発言してこうねとかチームのためのなんかファシリテートとかなんかこういうイベントのことだったりとかやろうねみたいなのは言ってくれるかもしれないけどまあなんかそれってプロモーションのためにっていう多分コンテキストでは言うかもしれないけどそれ以外は多分あんまなくてあのなんかあんまりないかなってなんで怨念みたいなまではならない気がするなんか何で。",
      "start": 1433715,
      "end": 1479065,
      "timestamp": "23:53"
    },
    {
      "speaker": "Senna",
      "text": "4年まで行かなくてもさなんか面接の時にだんまり言ってもワコンじゃないです。",
      "start": 1479065,
      "end": 1482626,
      "timestamp": "24:39"
    },
    {
      "speaker": "Ryo",
      "text": "かでもそれはそれはそうですねあのもちろんその必要な時に喋るあのインタビューとかレジュメについてはもっとちょっと突っ込んでいきたいんだけどまあ入ってしまえばっていうまあちょっといやまあそう。",
      "start": 1482626,
      "end": 1495571,
      "timestamp": "24:42"
    },
    {
      "speaker": "Senna",
      "text": "ね間違いないでもさミーティングで喋れない奴って多分面接でも喋れない人が多い。",
      "start": 1495571,
      "end": 1499772,
      "timestamp": "24:55"
    },
    {
      "speaker": "Ryo",
      "text": "と思うそれはそうそれは。",
      "start": 1499772,
      "end": 1501013,
      "timestamp": "24:59"
    },
    {
      "speaker": "Senna",
      "text": "そうだから俺たぶん結果同じだと思うとこあんだよね正直成果をさあ自分はこういうことやりましたとかこういう経験をしましたっていうのは面接で喋れる奴って多分ミーティングでもおそらくこういうことが今回偉大だと思いますとかこういうことやりましたって多分言える人でねえお菓子さんにしろあの優吾さんにしろやっぱりその面接の時とかにやっぱりそういうアピールも当然してるんだろうしなんかそういうなんかところでまた頭の回路としてはもしかしたペースのとこにあんのかなって思うところが結構あってその技術とかとはまた別。",
      "start": 1501013,
      "end": 1530550,
      "timestamp": "25:01"
    },
    {
      "speaker": "Yugo",
      "text": "にねそれは技術力みたいなところとは別な気がしてますね、。",
      "start": 1530550,
      "end": 1536366,
      "timestamp": "25:30"
    },
    {
      "speaker": "Senna",
      "text": "確かに。そこの課題の方がやっぱり俺は圧倒的に大きいと思うけどね。",
      "start": 1536366,
      "end": 1541120,
      "timestamp": "25:36"
    },
    {
      "speaker": "Yugo",
      "text": "それはもう同意ですね。自分で意識してそうやって話すようにしていかなきゃいけないと思うし、やっぱ僕がこっち来て思うのは英語を使うっていうだけで自分の脳のリソースが言語それ自体に裂かれるから相手何言ってるんだこれっていうのを考えながら聞いたり聞き取れないことがあったらその場でちょっと前後の文脈から予測したり自分で単語調べたりして意味を理解するっていうのを同時にやるのでそうなるとどうしても普通に日本語で話して日本語で仕事するよりは自分の発言のハードルが自分の中で一つ上がって一つ二つで済むかわかんないけど結構上がってしまうのでそこはもう結構ずっと努力が必要だなっていう感じが僕。",
      "start": 1541120,
      "end": 1581014,
      "timestamp": "25:41"
    },
    {
      "speaker": "Ryo",
      "text": "はしてますなんかあのちょっとその違いみたいな部分での話にはなるんだけどあの強いエンジニアっていう定義がいろいろあるなこっちにはいろいろあるなっていうのもちょっと違いなのかなと思ってて日本の強いエンジニアってなんかその技術に強いみたいなのがなんかほとんどなんかすごい80%ぐらい占めてるなみたいなイメージがあってこっちでもその技術に強くてなんかすごい良いシステムをアーキテクチャーであのデザインできる人とかももちろんいるんだけどそうじゃない強いエンジニアがいろいろいてなんかその人たちもちゃんと強いとされてるなぁみたいなのがあるなぁってちょっとこの頃感じててどう。",
      "start": 1581014,
      "end": 1625984,
      "timestamp": "26:21"
    },
    {
      "speaker": "Yugo",
      "text": "いうのがありますかその技術一芸に秀てるとかいうのじゃない場合ってなんかあの。",
      "start": 1625984,
      "end": 1631507,
      "timestamp": "27:05"
    },
    {
      "speaker": "Ryo",
      "text": "プロジェクト、技術力っていう観点で言うと、普通かなみたいな、ちゃんとやれることはやれるし、シニアだよねっていう人だけど、プロジェクトマネジメントが上手い人みたいな人が強いってなってたり、それで評価されたりもするし、とにかく早いみたいなすごい早くあのプロジェクト回してどんどんフィーチャー作っていくみたいなでその人の技術力が高いかっていうと別にそうでも決してそうではないみたいななんかいろんな種類の人たちがあの別のなんだろうなベクトルで評価をされてるって強いエンジニアっていう風になんか考えられてるなっていうのが結構あるなって思うんですけどどうですかどう。",
      "start": 1634548,
      "end": 1678914,
      "timestamp": "27:14"
    },
    {
      "speaker": "Yugo",
      "text": "なのかな僕が働いている会社はスタートアップの会社なので割とみんな実装早くというかテキパキと動いて仕事を早く終わらせるみたいな人が多い印象ではあるけどりょうさんの話を聞いてみると確かに日本の場合でもプロジェクトマネジメントがよくできるとか実装が早いとかって評価はされると思うんですけどエンジニアとして評価されるだけでなんかサブスキルとして評価されているような気は。",
      "start": 1678914,
      "end": 1708350,
      "timestamp": "27:58"
    },
    {
      "speaker": "Ryo",
      "text": "確かにするかなそうそう。",
      "start": 1708350,
      "end": 1709991,
      "timestamp": "28:28"
    },
    {
      "speaker": "Yugo",
      "text": "そう仕事はできる人ですねその人は確実にで会社の中で評価も入れるけどそれがなんか強いエンジニアと直接結びつくかというとこっちの感覚よりはなんですかね直接的にはなんか結びついてない感覚があるか。",
      "start": 1709991,
      "end": 1726384,
      "timestamp": "28:29"
    },
    {
      "speaker": "Ryo",
      "text": "もそうなんか僕もその感覚があってなんかずっと僕あの自分なんか強くないエンジニアだっていうのを僕はずっと今まで思ってきたんですねでっていうのをなんかまあそれでそういうふうに強い技術に強いエンジニアになりたいなみたいなのを思ってそれをなんかマネージャーとのワンオンみたいなのでよく出してたんですけどそのたんびに結構でもりょうめちゃくちゃ実装早いしプロジェクトのマネジメント上手いから別にそっちがあるからいいじゃんみたいなそっちで評価されていけばいいじゃんみたいなのをなんかこの間言われてでなんかあのYugoくんとの前の会話でなんかちょっと出たんだけど後でリンクとかも貼っておこうかなと思うんですけどなんだっけあの風鈴火山。",
      "start": 1726384,
      "end": 1767975,
      "timestamp": "28:46"
    },
    {
      "speaker": "Yugo",
      "text": "のエンジニア風鈴火山っていうそうそう。",
      "start": 1767975,
      "end": 1770598,
      "timestamp": "29:27"
    },
    {
      "speaker": "Ryo",
      "text": "そうなんかそういうのでもあるようになんかいろんなまあエンジニアがいてでなんかこっちではそれが主流なんかちゃんとそのサブスキルみたいなスキルじゃなくてその総体として評価されてるなみたいな感じがこれでも。",
      "start": 1770598,
      "end": 1786983,
      "timestamp": "29:30"
    },
    {
      "speaker": "Senna",
      "text": "ねフロックの中でもこれは結構やっぱり問われることもあるんだけどさなんでこの人は就職できたのに僕はできなかったんですかね割と結構多いのやっぱり言ってしまうとで本当に同じ会社を同じタイミングで例えば受けた人で明らかにエンジニア経験もそうあの落ちた人の方が上で明らかに実装力も早いに決まってるのになぜかあのまあジュニアとは言えないけどインターミネート上がりくらいの子がやっぱり受かっちゃってっていうとこがあってで正直その時見た時に俺いやそれに決まってんじゃんって思うのは処理小魅力で単純にチームとして一緒に働くところを想像しやすいのってコミュニケーション能力が得意な人じゃないですかぶったけ高い人実装力がどれだけあったとしたってこの人と一緒に実装してるイメージ湧かないなとか一緒に開発工程進めてるイメージ湧かないなって人も正直いるっちゃいいそんなところっていう部分で見るんだったらまあすごい単純にまとめてしまって申し訳ないけど、わりと魅力高かったらどういう場でもやっていけるのかなっていうまあもちろん最低限のね技術力が当然あっての前提でっていう風にはやっぱりいろんな人見てって正直思うとこではあるので魅力は人を救うみたいなとこはあんのかなとは思うそこら。",
      "start": 1786983,
      "end": 1855740,
      "timestamp": "29:46"
    },
    {
      "speaker": "Ryo",
      "text": "へんってまあこっちで言うとなんかビヘイビラルインタビューで割とカバーするところじゃないですかそうね間違いない日本ってどうなん。",
      "start": 1855740,
      "end": 1864265,
      "timestamp": "30:55"
    },
    {
      "speaker": "Yugo",
      "text": "すか確かに小魅力?",
      "start": 1864265,
      "end": 1868353,
      "timestamp": "31:04"
    },
    {
      "speaker": "Ryo",
      "text": "小魅力というか、一緒にやっていけるかなっていうのをざっくり見るのが一応基本的には、ビヘイビラルインタビューじゃないですか。そこらへんってなんか日本ではちゃんとビヘイビラルインタビューっていうような、時間が設定されてインタビューするんですか?それともなんか、そこらへんってなんかざっくりインタビューの中で見るみたいな感じなんですか?",
      "start": 1868353,
      "end": 1891034,
      "timestamp": "31:08"
    },
    {
      "speaker": "Yugo",
      "text": "なんか分けてやってるイメージあんまりないですけどね、そういう質問とかはよくして、カルチャーフィットが大事っていうのは結構いろんな会社が言ってるし、僕がいた会社でも言っていましたけど、なんかそれと同時に技術力も見てるみたいなのはあるかもしれない。行動、日本語だとbehavioraluestionqって行動面接って言いますけど、。",
      "start": 1891044,
      "end": 1909985,
      "timestamp": "31:31"
    },
    {
      "speaker": "Senna",
      "text": "そうだね、。",
      "start": 1909995,
      "end": 1910555,
      "timestamp": "31:49"
    },
    {
      "speaker": "Yugo",
      "text": "行動面接行動面接っていう単語は自分が前いた会社とかでも出てきてたんで、それをして相手がどういう人柄かを確認するっていうのは確実にやってはいましたけどそんなにこっちほど、behavioralquestionだけで時間をかけるみたいなのは会社にいるのかな、会社にいると思いますけど僕がいたところではもうなんかやってはいるけど、めちゃくちゃ時間かけてるっていう印象ではなかったかなって感じですね。",
      "start": 1910555,
      "end": 1940033,
      "timestamp": "31:50"
    },
    {
      "speaker": "Senna",
      "text": "なんか日本のさ、就活事業最近いろいろ調べだしてて思うのがさ、やっぱ言うて売り手市場じゃないですか、やっぱり日本って。あのエンジニアカーズにしたってできるエンジニアってやっぱりどうしても少ないし正直いろんな面接のなんか工程とか話聞いててなんかビヘイベロルだったりとかな行動面接みたいなところで人フルいうかけるってよりは過去の経歴とあの実際にいた環境とプロジェクトだけでもして雇ってますみたいな空間の方が俺はめっちゃ感じたけどね。",
      "start": 1940033,
      "end": 1967342,
      "timestamp": "32:20"
    },
    {
      "speaker": "Ryo",
      "text": "確かにそれは売り手だからこそもうあのそこら辺で奮いにかけることができてないっていう現状なのかもしれないね確かにもちろん。",
      "start": 1967942,
      "end": 1981268,
      "timestamp": "32:47"
    },
    {
      "speaker": "Senna",
      "text": "やってるはいるだろうしあのむずい会社はむずいからまあねオーバー多いからやってるとこもあるんだろうけどこっちほどで絶対ないな。",
      "start": 1981268,
      "end": 1988091,
      "timestamp": "33:01"
    },
    {
      "speaker": "Ryo",
      "text": "っていうのはそこで確か。",
      "start": 1988091,
      "end": 1989652,
      "timestamp": "33:08"
    },
    {
      "speaker": "Yugo",
      "text": "にそれはそう、確かにポジションをオープンしても、欲しい経歴持った人がそもそも集まらないみたいなのはいろんなところで、オープンするためにどこの会社でもよく聞いてたので、それはあると思いますね。",
      "start": 1989652,
      "end": 2002737,
      "timestamp": "33:09"
    },
    {
      "speaker": "Ryo",
      "text": "それが答えだ。",
      "start": 2002737,
      "end": 2003878,
      "timestamp": "33:22"
    },
    {
      "speaker": "Yugo",
      "text": "よし、。",
      "start": 2003878,
      "end": 2005639,
      "timestamp": "33:23"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあ次に進みます。で、ここ結構みんな気になるところだと思うんですけど、ぶっちゃけミニマムの英語ってどのぐらいなのっていう、どのぐらい英語力があれば、面接、仕事に支障ない。支障ないって言うと、結構レベル高くても支障は出てくるじゃないですか。なんであれなんだけど、耐えられるというか、働けるの?っていう、だっくりな質問になるんですけど。",
      "start": 2005639,
      "end": 2036230,
      "timestamp": "33:25"
    },
    {
      "speaker": "Yugo",
      "text": "難しい。でも、なんかこれ、トーイックとかの点数とかじゃないですよね。",
      "start": 2036240,
      "end": 2040803,
      "timestamp": "33:56"
    },
    {
      "speaker": "Ryo",
      "text": "それこそやっぱり、。",
      "start": 2040803,
      "end": 2042354,
      "timestamp": "34:00"
    },
    {
      "speaker": "Yugo",
      "text": "英語でコミュニケーション取れる自信ありますか?Yes!だったらいけるんじゃないですか?",
      "start": 2042354,
      "end": 2048407,
      "timestamp": "34:02"
    },
    {
      "speaker": "Senna",
      "text": "そうなるんだよね。",
      "start": 2048407,
      "end": 2049907,
      "timestamp": "34:08"
    },
    {
      "speaker": "Ryo",
      "text": "なんか、これ結構たぶん、マネージャーとかにもよるかなっていうのはあって、僕、一番最初の自分のマネージャーがスペイン人で、英語が下手くそではなかったんだけど、めちゃくちゃなんていうの、アクセントのある人だったんですよね。後から聞いたら、実はその人IL2Qあるぐらいめちゃくちゃ高かったんで、9って一番最高の点数なんですけど、めちゃくちゃ英語力の高い人ではあったんだけど、僕はその人のアクセントのおかげで、わりと何だろう、躊躇なくしゃべれることができたっていうのと、あとは、その人が英語を勉強した経験があるから、いろんなところで気を使ってくれていたなっていうのは、めちゃくちゃ感じます。",
      "start": 2049907,
      "end": 2102258,
      "timestamp": "34:09"
    },
    {
      "speaker": "Senna",
      "text": "移民国家ならではの話。",
      "start": 2102258,
      "end": 2104679,
      "timestamp": "35:02"
    },
    {
      "speaker": "Ryo",
      "text": "それはでも、一社目で、その後からはほぼほぼみんな、あんまりそういうことを感じなかった。で、だからなんかその会社の働く環境とかにはよりますよね。",
      "start": 2104679,
      "end": 2119748,
      "timestamp": "35:04"
    },
    {
      "speaker": "Yugo",
      "text": "そうだね、。",
      "start": 2119748,
      "end": 2121388,
      "timestamp": "35:19"
    },
    {
      "speaker": "Senna",
      "text": "確かに。みごうさんのとこは?みごうさんのとこもいる?そういうなんか外国人のあんまりバリバリで、もうこいつ言ってることなんもわからへんみたいな。うん、。",
      "start": 2121388,
      "end": 2130961,
      "timestamp": "35:21"
    },
    {
      "speaker": "Yugo",
      "text": "今の会社はいないかも。今の会社、なんか多分カナダネイティブの人がなんか多くて、その速さについていくので、頑張ってますという感じではあるんですけど、1社目とかだと、それこそインド系の方が多かったので、胃のなまりがすごくて。確かにないやどうなん。",
      "start": 2130961,
      "end": 2153127,
      "timestamp": "35:30"
    },
    {
      "speaker": "Senna",
      "text": "だろう2人にシンプルに聞きたいはあの今日も俺その話ちょっと相談なんか来てたもんねやっぱりあの一社目働き出しましたやったー言ってたインターンの子があの自分の上司がイスラエルどうだったかなどっか向こうの人の方で鉛がひどすぎで全然何言ってるかわからないんですけどみんなどうやって乗り越えてるんですかみたいなで割と英語に自信あった子だったのは多分トイック満点はいかないけど多分800点オーバーくらいのことで教科書英語でずっと勉強していた人たちがそこを乗り越えるボーダーハードルの乗り越え方みたいなのって2人はどう乗り越えたのかな?",
      "start": 2153127,
      "end": 2191477,
      "timestamp": "35:53"
    },
    {
      "speaker": "Yugo",
      "text": "慣れ?慣れだとは思いますし教科書とか何かのテストで高得点取れてもジェネラルな英語力というだけで得点の鉛を持った人の英語に対応するにはそれ用のある程度最適化が必要なのかなとか思ったりして僕はその一社目のこともあってインドの方と働くことが多かったんですけど彼らの英語は聞いていても結構なまりが強いのでなかなか聞き取りにくかったりするっていうのもありますしなんかちょっと後に気づいたのはたとえそのオンラインのチャット上でもわかりにくいことがあるなという気がしてたまになんか英語を読んで何言ってるかわかんないなっていうことがちょくちょく発生するんですけど、その最初の会社でもそれ以降でも。それでちょっとなんか調べてみると、その人インド出身で、なるほどと思うことがあったりして、だから発音以外にもなんか使う単語の、使われやすい単語の種類とか、就職してどこに置くかとかが、なんか結構、育った国とか勉強した国によって違うのかなとか使われやすいのが違うのかなとか思ったりしてまあ日本人もそうだと思うんですけどそれに頭が慣れないとどうしても処理に時間がかかってしまって英語を使えないなーっていうのはあると思いました。",
      "start": 2191477,
      "end": 2274315,
      "timestamp": "36:31"
    },
    {
      "speaker": "Senna",
      "text": "バックグラウンドによってなんか言葉の強さも全然違うしね。",
      "start": 2274315,
      "end": 2278571,
      "timestamp": "37:54"
    },
    {
      "speaker": "Ryo",
      "text": "本当に僕はえっとYugoくんのあれなんだろう補足ぐらいしか思い浮かばないんだけどなんかやっぱりネイティブの人でも難しいアクセントのアクセントが強い人の国の言葉は聞き取れないんですよただYugoくんが今言ってたように英語を聞くのに使ってる処理のメモリをほぼ使ってないんでアメリカ人ネイティブの人たちはだからそのなんていうの行間を読むこともできるしそのいろんなことができるじゃないですかそのこう言ってるけどまあこういうことなんだろうなみたいなのを考えたりだとかで僕たちの場合はその英語を喋るってだけであのメモリの何十パーセントが持ってかれてるんでまあ慣れればどんどんそれをミニマイズできるとは思うんですけどだからそういう人たちのそのアクセントに対応できないとかってなると思うんですけどただあのネイティブの人とか、英語すごい上手な人でも、やっぱり聞き返してるんですよね。よく見ると。",
      "start": 2278581,
      "end": 2341162,
      "timestamp": "37:58"
    },
    {
      "speaker": "Yugo",
      "text": "聞き返すの、。",
      "start": 2341162,
      "end": 2341912,
      "timestamp": "39:01"
    },
    {
      "speaker": "Ryo",
      "text": "確かに。だから、もう聞き返して、聞き返しまくる。しょうがない。で、自分の処理速度が、自分の英語の処理速度が速くなるのを待つ。",
      "start": 2341912,
      "end": 2355946,
      "timestamp": "39:01"
    },
    {
      "speaker": "Senna",
      "text": "いや、間違いないね。",
      "start": 2355946,
      "end": 2357276,
      "timestamp": "39:15"
    },
    {
      "speaker": "Ryo",
      "text": "それしかないかなっていう。",
      "start": 2357276,
      "end": 2358827,
      "timestamp": "39:17"
    },
    {
      "speaker": "Senna",
      "text": "いや、その多分、Twiterゲインが、言えない人がやっぱり日本人多いと思うよね、おそらく。もう一回言ってって言ったら負けみたいなそれは確かにもうハートの持ち方としてもはや絶対に乗り越えなくちゃいけないと思うからそれ英語上手い下手くそ関係ないもんね。",
      "start": 2358827,
      "end": 2375823,
      "timestamp": "39:18"
    },
    {
      "speaker": "Ryo",
      "text": "多分あとはあのあなたが英語をあの下手くそなのを隠せてると思ってるかもしれないけど隠せてないんですよ英語うまい人たちはちゃんとアクセントちゃんと日本人のアクセント悪いの分かっちゃってるし全部分かられちゃってるんでそのつもりで分かんないことは分かりませんって言っちゃってもあなたの評価が下がることはないですよっていうのは言いたい僕は特に自分に言いたいそれさ、。",
      "start": 2375823,
      "end": 2405775,
      "timestamp": "39:35"
    },
    {
      "speaker": "Senna",
      "text": "ちなみに前聞かれてあるんだよ、それちなみに。カナダだと確かにそうかもしれないけど、アメリカだとどうなんですか?って聞かれて。確かに印象としてさ、アメリカはなんか、その英語ができないということに対するプレッシャーがちょっと強いという印象あるじゃないですか。",
      "start": 2405775,
      "end": 2419323,
      "timestamp": "40:05"
    },
    {
      "speaker": "Yugo",
      "text": "ないかっていうのはちょっと。",
      "start": 2419323,
      "end": 2420523,
      "timestamp": "40:19"
    },
    {
      "speaker": "Senna",
      "text": "俺はあるんだけど、なんかその辺ってね、お二人ともアメリカのチームの方々ともやり取りすることもあったりするのかな、あなたないのか。",
      "start": 2420523,
      "end": 2428598,
      "timestamp": "40:20"
    },
    {
      "speaker": "Yugo",
      "text": "僕はないですね。",
      "start": 2428608,
      "end": 2429448,
      "timestamp": "40:28"
    },
    {
      "speaker": "Senna",
      "text": "優子さんとか小林さんとかはあってるのかなと思うけど、なんかその英語っていう部分に対する当たりの強さみたいなのって、なんか違ってとか感じたりする?",
      "start": 2429448,
      "end": 2438444,
      "timestamp": "40:29"
    },
    {
      "speaker": "Ryo",
      "text": "確かにその、さっきも言ったように、英語を勉強、第二言語として勉強した人たちはやっぱりその自分たちもその道を通ってるんで、っていうのはあると思います。なんでまあそういうのを通ってない第一言語でしか生きてない人たちはなんか聞き返したとしても僕たちが理解できなかったとか分からなかったじゃなくて聞こえなかったんだと思って同じことを繰り返してくる人たちはいるんですけどまあでもそういう時は俺は第二言語だぞって思ってやっぱ聞くしかないんですよで、中国とか韓国の人たちは違うんですけど、ポルトガル語とかラテン系の人たちってめちゃくちゃ同じ単語をシェアしてるんですよ。同じ単語とかすげー似てるみたいなのが多くて、なんでその人たちの勉強量と日本人が英語を勉強する勉強量って全然違うんで、そこはもう自信満々に、俺らの方が難しいところから来てんだからっていうあれで聞き直す。で、あの、メンタリティだけですよ、本当に。だから、アメリカ人の人たちに、そんななんか、当たり強くても、「いや、でも俺は第二言語で喋ってるけどね。」みたいなのが、いけると思います。あとは、あの、理解でき、あの、聞いたり読んだりして理解できるっていうのが、僕は一番大切だと思ってて、その後に、喋る発音は、ほんと全然必要ないなと思ってるんですよね。僕も、僕は発音よく喋りたいし、あの、なんていうの、ネイティブみたいに喋りたい気持ちはあるけども、あの、理解できて喋る気が、あの、下手くそな発音で喋る気概があるのであれば、なんでも大丈夫かなって思ってて、あの、めちゃく、英語は、僕よりも全然長いあの人でまあさっき言ったようにインドナマリだったり中国ナマリだったりっていろいろあるんですけどあの人たちちゃんと完璧に聞き取ってものすごいなんていうのまあ文法もペッタクレもない感じでアクセントもすっげーくっつけたまま喋り喋ってそれを別に直そうともしない人たちが結構多いんですよでもその人たち理解はできてるしでアメリカ人たちはまあアメリカ人というかネイティブの人たちはちゃんとそので、メモリが少ないことからその人たちが言うことを聞き取ってるんで仕事には何の影響もないんですよっていう人が結構いっぱいいるん。",
      "start": 2438444,
      "end": 2585140,
      "timestamp": "40:38"
    },
    {
      "speaker": "Yugo",
      "text": "で発音は一番後って感じは確かにしますねなんかこっちに来る前は今日綺麗な英語喋んなきゃいけないのかなとかてか英語の学習とかをYouTbeでなんか動画を漁って見てみてもなんか綺麗な発音の仕方みたいなのがなんかよく出てきがちな気がするんですけどこっち来て働いてみて思うのは発音は一番後でいいなっていうのは確かに思うかも。ちゃんと聞けて、ちゃんと理解できて、発音はどうでもいいから自分を伝えたいことを伝えられるっていうのがメインであって、発音がきれいかどうかはもうそんな必要ないし、だから発音きれいにできたほうがかっこいいとは思うけど、日本人ががんがっばったところで、まあきれいな日本なまりの英語みたいな感じな気がするんで、まあ時間があったら、こう完璧な発音を目指してみてもいいのかもしれないけどそれのために時間を使うのは結構後になるなっていうのが僕も働いてて思って。",
      "start": 2585140,
      "end": 2635282,
      "timestamp": "43:05"
    },
    {
      "speaker": "Senna",
      "text": "たところですたくさんの英語学習あのサイトとかあのブックとかを見解あの多分的に回す発言がたくさん出てき。",
      "start": 2635282,
      "end": 2643426,
      "timestamp": "43:55"
    },
    {
      "speaker": "Yugo",
      "text": "てる気がするけどそれは確かにちょっと見ててイライラ。",
      "start": 2643426,
      "end": 2646967,
      "timestamp": "44:03"
    },
    {
      "speaker": "Ryo",
      "text": "するところがある発音なんていらないんだけど僕は今シャドーテン頑張ってます素晴らしいシャドーテンシャドーミング。",
      "start": 2646967,
      "end": 2654731,
      "timestamp": "44:06"
    },
    {
      "speaker": "Yugo",
      "text": "は僕もめちゃくちゃいいと思っ。",
      "start": 2654731,
      "end": 2655891,
      "timestamp": "44:14"
    },
    {
      "speaker": "Ryo",
      "text": "てた。",
      "start": 2655891,
      "end": 2655991,
      "timestamp": "44:15"
    },
    {
      "speaker": "Yugo",
      "text": "流れてきた動画の真似をすることによって、その音が聞けるようにするための発音練習というか、みたいな面もあると思うので。",
      "start": 2658765,
      "end": 2665730,
      "timestamp": "44:18"
    },
    {
      "speaker": "Ryo",
      "text": "でも、それを考えると、じゃあアクセントめちゃくちゃあるけど、ちゃんと言ったことを理解してる日本人以外の国の人たちはどうなんだろうって話になりますよね。だから僕はあそこはある程度本当ではないんじゃないかなとは思ってます自分がその発音できないイコールリスニングで聞けないってのは嘘だと思ってます。",
      "start": 2665730,
      "end": 2688462,
      "timestamp": "44:25"
    },
    {
      "speaker": "Senna",
      "text": "確実にこれいろんな多分教材移動的に回してる気がする。",
      "start": 2688462,
      "end": 2692023,
      "timestamp": "44:48"
    },
    {
      "speaker": "Yugo",
      "text": "確かにマーケティング的にシャドーウィングメインでするサービスは絶対そういうふうに言うと思うので確かに100%確実に正解ではないのかも。",
      "start": 2692023,
      "end": 2700386,
      "timestamp": "44:52"
    },
    {
      "speaker": "Senna",
      "text": "しれないですねまあ間違いないまあ正直。",
      "start": 2700386,
      "end": 2701907,
      "timestamp": "45:00"
    },
    {
      "speaker": "Ryo",
      "text": "その方が聞きやすいってのがあると思いますよあのその方が多分あの早近道なのかもしれないけどそれが正しいではないみたいな感じですね。",
      "start": 2703919,
      "end": 2712904,
      "timestamp": "45:03"
    },
    {
      "speaker": "Senna",
      "text": "シンプルにやっぱり日本からあの相談来られる方々ってやっぱりその英語が下手くそっていうことがやっぱり評価に直結するんじゃないかっていう心配事は絶対にあると思っていてまあそれがねお二人の口からねそこが正直評価ポイントになってるわけじゃないよっていうのが聞けるのであればだいぶなんか勇気づけられる人多い気がし。",
      "start": 2712904,
      "end": 2728452,
      "timestamp": "45:12"
    },
    {
      "speaker": "Yugo",
      "text": "ますけどね英語が下手くそかもしれないって自分で思って、ちょっと自信がなくなってしまって、オドドしてしまうってなると、それは結構マイナス要因だと思うんですけど、そこはもう気にせずに。結構ポジティブなタイトル望む方が全然いいなっていう気がしますね。面接においても仕事上で英語使うにしても。",
      "start": 2728452,
      "end": 2747871,
      "timestamp": "45:28"
    },
    {
      "speaker": "Ryo",
      "text": "たしかに。その聞いてる人たちもずっとアクセントすごいなーなんて思ってないですからね。",
      "start": 2747871,
      "end": 2753896,
      "timestamp": "45:47"
    },
    {
      "speaker": "Senna",
      "text": "それはほんとそう。",
      "start": 2753896,
      "end": 2755738,
      "timestamp": "45:53"
    },
    {
      "speaker": "Ryo",
      "text": "りょうの喋り方だーぐらいしか多分思ってないんで、最初はアクセントつこうってなるかもしれないけど、その後はまあなんか慣れたら普通に喋ってくれるんで、まああんま気にしてもしょうがないかなってところですからね。",
      "start": 2755738,
      "end": 2766805,
      "timestamp": "45:55"
    },
    {
      "speaker": "Senna",
      "text": "ここだけ聞い取りされて、発音なんてクソだっていうミームが広まらないかだけ心配ですね。",
      "start": 2766815,
      "end": 2772089,
      "timestamp": "46:06"
    },
    {
      "speaker": "Ryo",
      "text": "言っとこ、。",
      "start": 2772089,
      "end": 2772400,
      "timestamp": "46:12"
    },
    {
      "speaker": "Yugo",
      "text": "言っとこ。発音なんてクソだ。",
      "start": 2772400,
      "end": 2776653,
      "timestamp": "46:12"
    },
    {
      "speaker": "Senna",
      "text": "まあ楽しいな。でもまあ働いてる二人がそれ言うんだからね。それ以上なんてあるわけないんだし。",
      "start": 2776653,
      "end": 2783498,
      "timestamp": "46:16"
    },
    {
      "speaker": "Yugo",
      "text": "クソではないですが。",
      "start": 2783498,
      "end": 2785900,
      "timestamp": "46:23"
    },
    {
      "speaker": "Ryo",
      "text": "日本ってやっぱその英語の勉強にかけるお金がめちゃくちゃ、多分世界一とかなんですよね。いや、すごいよね。",
      "start": 2785900,
      "end": 2793253,
      "timestamp": "46:25"
    },
    {
      "speaker": "Senna",
      "text": "そうだよね、だってすごいお金で動いてるよ、。",
      "start": 2793253,
      "end": 2795855,
      "timestamp": "46:33"
    },
    {
      "speaker": "Ryo",
      "text": "あれ。そう、ある程度だからやっぱ、その広告から来てるところってあると思うんですよね。だからもうそこはしょうがないです。だから、まあなんか、これを聞いた日本から出たエンジニアの皆さんは、ぜひ発音など気にせず、リスニングと、あの下手くそな英語を喋る気概だけ持って海外に出てきてくれればいいのかなと。",
      "start": 2795855,
      "end": 2816863,
      "timestamp": "46:35"
    },
    {
      "speaker": "Senna",
      "text": "一応補足だけしとくわそんな先英中研とかもし狙うんだったら頑張ってねって全部英語のテスト今必要や。",
      "start": 2816873,
      "end": 2823336,
      "timestamp": "46:56"
    },
    {
      "speaker": "Yugo",
      "text": "から発音関係なくないですかそれもやっぱりあるよそれは。",
      "start": 2823336,
      "end": 2826158,
      "timestamp": "47:03"
    },
    {
      "speaker": "Senna",
      "text": "発音というかまぁごめん発音というかIL2評価としてのまぁそれでそれ。",
      "start": 2826158,
      "end": 2831100,
      "timestamp": "47:06"
    },
    {
      "speaker": "Ryo",
      "text": "も発音関係ないんですよ。",
      "start": 2831100,
      "end": 2832301,
      "timestamp": "47:11"
    },
    {
      "speaker": "Yugo",
      "text": "IL2発音は関係ないと。",
      "start": 2832301,
      "end": 2833321,
      "timestamp": "47:12"
    },
    {
      "speaker": "Senna",
      "text": "思うIL2監視さんでもないけどなんか何そのスピーディングとリーディングとリスニングだけできればいいよっていうところを突き詰めるとそうなんのかなっていう気がちょっとしてて。",
      "start": 2833321,
      "end": 2844987,
      "timestamp": "47:13"
    },
    {
      "speaker": "Ryo",
      "text": "でもなんかスピーキングまあそうですねスピーキングもあのでもアクセントもとか発音もスピーキングには考慮はされなくて文法喋る中での文法とかナチュラルに喋れてるかみたいなのは評価されるんだけどアクセントは大丈夫。",
      "start": 2845527,
      "end": 2860499,
      "timestamp": "47:25"
    },
    {
      "speaker": "Senna",
      "text": "かなうんそうだねまあだからスピーキングもちょっとは勉強しようねっていうのはそこ。",
      "start": 2860499,
      "end": 2864742,
      "timestamp": "47:40"
    },
    {
      "speaker": "Ryo",
      "text": "にちょっと。",
      "start": 2864742,
      "end": 2865002,
      "timestamp": "47:44"
    },
    {
      "speaker": "Yugo",
      "text": "確かに英語の勉強がいらないっていう話ではないですよね。",
      "start": 2866732,
      "end": 2869044,
      "timestamp": "47:46"
    },
    {
      "speaker": "Ryo",
      "text": "ではない、うん、もちろん、もちろん、そうですね。",
      "start": 2869044,
      "end": 2870525,
      "timestamp": "47:49"
    },
    {
      "speaker": "Yugo",
      "text": "こういうふうに言ってましたけど、別に日本に来る前で、TOEICで言うと、大学生の時に800何点とか取ってるし、でもりょうさんも結構、そもそも彼が来る前にフィリピン留学とか行って、英語力とかって身につけてたと思うんで。",
      "start": 2870525,
      "end": 2881593,
      "timestamp": "47:50"
    },
    {
      "speaker": "Ryo",
      "text": "そうだね、。",
      "start": 2881593,
      "end": 2882234,
      "timestamp": "48:01"
    },
    {
      "speaker": "Yugo",
      "text": "ないわけじゃない。別になんか、発音は置いておいて、英語の勉強はちゃんとしてきた上で、こっちに来て、こう思って待つっていう発言なんで、英語力がいらないと言いたいわけではないという。",
      "start": 2882234,
      "end": 2893886,
      "timestamp": "48:02"
    },
    {
      "speaker": "Senna",
      "text": "そうだね、間違いない。",
      "start": 2893886,
      "end": 2894896,
      "timestamp": "48:13"
    },
    {
      "speaker": "Ryo",
      "text": "すげー、なんかいきなり守りに入りましたね、二人とも。",
      "start": 2894896,
      "end": 2900078,
      "timestamp": "48:14"
    },
    {
      "speaker": "Yugo",
      "text": "いやー、ちょっと怖いんで。",
      "start": 2900078,
      "end": 2903329,
      "timestamp": "48:20"
    },
    {
      "speaker": "Senna",
      "text": "いやいや、でもね、これ今から英語ちゃんと頑張るよっていう人たちに届いたら、それはそれでめんどくせえなっていう意志を持ったから。",
      "start": 2903329,
      "end": 2911818,
      "timestamp": "48:23"
    },
    {
      "speaker": "Ryo",
      "text": "なんか僕はどれだけ言っても日本人、まあ僕も含めて、やっぱり英語勉強頑張るんで、もうそこはいいかなみたいなのはちょっと。",
      "start": 2911828,
      "end": 2918402,
      "timestamp": "48:31"
    },
    {
      "speaker": "Senna",
      "text": "そうだね、それはわかってるぜって。",
      "start": 2918402,
      "end": 2920784,
      "timestamp": "48:38"
    },
    {
      "speaker": "Ryo",
      "text": "素晴らしいと思う。で、えっと、で、まあなんか今回前半に、後半で話したいなと思ってて、前半はまあなんか準備段階からまあなんか準備だね主に後半はどうやって探したかとかさっき言ってたレジュメどうやって書けばいいのとかあとは具体的に面接のプロセスってこんなのがあるよねみたいなのをちょっとしゃべれたらいいかなと思いますでは前半はこのぐらいにしようと思いますありがとうございましたはいありがとうございましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2920784,
      "end": 2970334,
      "timestamp": "48:40"
    }
  ],
  "highlight1": "カナダで働く日本人エンジニアは、英語能力が高ければ就職に大きな障害はないと言えるのかもしれない。",
  "highlight2": "優吾さんは、日本人エンジニアがカナダで就職する際に、英語力が重要だが、技術力と経験も重要であると語っている。",
  "highlight3": "カナダでは、技術力だけでなく、コミュニケーション能力も重要視されており、日本人エンジニアが成功するためには、これら両方のスキルを身につけることが必要である。"
}