{
  "episodeGuid": "854448ac-a293-438f-aea2-410c4b1ed820",
  "episodeTitle": "日本での経験を武器にカナダ就職！フルリモートSaaS企業で働くエンジニアのリアル（後半）#22",
  "transcribedAt": "2025-11-09T23:50:14.025Z",
  "duration": 2122,
  "fullText": "今回も前回に引き続きSugrさんに来ていただきました。よろしくお願いします。よろしくお願いします。前回はカナダに来るまで、渡航までとか英語だったり技術のことだったりどういうふうに勉強したのかみたいな話してたんですけど後半は何だろう今働いて9ヶ月目ってことだったんですけど実際働いてみてこんなだよみたいなのをシェアしていただければいいかなと思うんですけど実際働いてみてどう。ですかどうですかって結構あれですね幸せですかいやはいあの働かせていただいてありがとうございますっていうところなんですけどなんでしょうねあの高度の面で言うと結構まあぐちゃぐちゃではあるんですよねもう多分これあのスタートアップってそのなんですかね小さなプロダクトをどんどん成長させてきた企業っていうのもあって結構いろんなあの試行錯誤の跡が残ってるって言うといいですかねなん。であのはい会社ってどんなことやられてるんですか。一言で言うと、Eコマース企業向けの成長支援みたいなことをやってまして例えばそのショピファイだったり、日本で言うと楽天とかそういうEコマースのプラットフォームに出展している企業向けにあなたの企業をもうちょっとこうしたら売上げ伸ばせますよとかですね広告費はちょっと払いすぎなんでもうちょっと抑えましょうとかそういう分析をしている会社ですね僕はその分析ツールを開発している部隊に所属し。ています前回、2前回というか日本で働いた時はJavaとAngularがメインだったようなことだったんですけど今はどういう技術スタックで働かれ。ているんですか今のバックエンドはNde。\njsoでフロントがAngularですねたまたまAngularでしたじゃあなんだろ。全部javascriptタイプスクリプトタイプスクリプトでやってますなんだろうチームとしてはどういうチームになるんですかそのツールだけの開発なんですかなんかどのぐらいの他にも他にもチームあったりする。んですかそうですね一応プロダクトごとにチームが分かれてましてあの僕のチームはその一つのプロダクトを開発運用保守しているようなチームになりますチームには。どのくらいどういう人たちがいるんですか何人くらいいてどういうテイクホルダーみたいなのがいるんですか。僕のチームは今僕含めて3人でして一人はCTOですねその人がリーダーというかリーダーかマネージャーをやってましてその下に僕がいて、あともう一人、日本人で、僕がリファラルを出した子が働いてます。すごいリファラルのチェーンが。リファラルをもらった人ではなくて、リファラルを出した人。僕がリファラルを出した人です。もらってからの出してるから、少なくとも3人はいるんですよね。そうです。今、。練習してます。で、日本人は3人一応会社にいるって感じなんですか?もっといます?それとも。えっと、僕含めて2人ですね。最初に僕に出してくれた人がちょっと退職しちゃったんで、。はい。でも同じチームに日本人がいるとちょっと安心しますね。すごく働きやすいですねですけどどうだろう僕はすごくいいと思うんですけどなんかなんだろうなオフィスに出社してそのネイティブたちとこうバンバンやり合うみたいな環境に憧れてる人はちょっとギャップがあるか。もしれないですねなんかどうだろう、僕3社、今カナダに来て3社目なんですけど、いまだに1回もまだ日本人と働いたことがなくて、いつももう会社に1人とかのレベル。今の会社は日本に4社があって、ソフトエンジニアじゃないセールスとかだったらいるんですけど、日本人2人とかだと比べられてちょっと嫌だなって感じがするけど、そんなことないですか?この日本人めちゃくちゃ勤勉だけど、リモはそうでもねえなみたいになったらちょっとなんか悲しいじゃん。いやでもどうでしょうね僕はあんまりそれを考えたことなくてただでもあの思うのはやっぱ結構やっぱ日本人は真面目ですねあのなんだろうそれこそのなんだろうなコードのプロリクエストとかあとコミットとか見てもやっぱなんて言うんですかねたまにその他の人してる?ちゃんとしてます他の人は結構あの動かないやつをコミットしてなんかバグったりとかしてるんですけどそういうのはまずないんであのなんだろうな信頼してもらってると思います。よそういう意味でなんかやっぱそれってでもその日本人と働いたことない人でもやっぱそんなイメージが多分日本人にあると思うんでで、僕と働いた人がああまあなんかりょうやっぱり信頼できるなって思ってもらってるかもしれないけど次の新しい日本人来て全然違うレベルでもうこいつすげーなみたいな感じだったらあ、りょうは別にそうでもなかったのかみたいな日本人だからそうでもねえ。んだなみたいな感じで。思われそうで嫌じゃないですかちょっとわかんないけどいつも思っちゃう相対的にってことですかそうそう相対的に。そう確かに確かに日本人。1人でいるアドバンテージみたいなのは確かに受け付けるかもしれない。1人しか例がないから。日本人代表みたいな。確かにそうですね。よく考えたらそうかもしれないですね。でも確かにそういう意味で言うとあれですもんね。日本人からもうレファラルで入ってって感じだから、それだったら確かにあんまないのかもしれない。はい、あとはそのまあ、戸足情報なんですけど、そのマネージャーが今日本に住んでて、まあ日本人の人と結婚してるみたいなんですよね。CTO?CTOです。えー、。あ、。そうなんだ。日本人に対するイメージ多分いいと思うんですよ。そういうのもあると思います。どんな感じの時間帯とかで働かれてるんですか?なんかさっきあの結構前半の方に結構自由に働いているよってことだったんですけど自分の中で決めてたりとかえっとそうです。ねもう全然決まってはないんですけど僕の中でなんとなく9時ぐらいから始めてまぁだいたい6時ぐらいまでに一旦終わってまあなんかあのやることがあればその後まあ夜にやるとかそういう感じですねなんか割。とはい自由結構でも働かれてるんですね9時6時で仕事こっちって9時5時じゃないんですか聞いてた話と違う。みたいないや全然なんかなんだろう普通こうだろみたいなあんまりよくわかんなくてですね他の企業で働いてないんでこっちではいただなんか他のなんていうんですかねあの同僚を見てると結構自由な時間に働いてますねなんかこの人この人スラックのローカルタイム11時とかになってるけどなんか返信が来たみたい。な結構自由ですねはいいろんなタイムゾーンで働いてる人が同じチームにいるって言ってたからミーティングのセッティングとか難しくないですかそうですね。ミーティングだけはちょっとはい難しいですねでもあんまり何だろう突発的なミーティングってあんまりなくて一応定期的なミーティングがあってそれはタイムゾーン考慮されて設定されてます。ねじゃあこんな時間にすんなよって思うようなことは。あんまりないあんまりないですねなんかそういうことを話されてたポッドキャストがあったような気がするなんか聞きまし。たけど前に撮った人で日本に帰った人に2人くらい撮ったんですねその人たちがやっぱなんか9時6時で働くのは辛いみたいな言っててそれにまあ確かにこっちで9時6時ってあんま聞いたことないなぁと思ってなんか他の人の感じ見てもそんぐらい働いてる感じですかそれともあのすぐるさんだけもう俺は9時6時だみたいな感じ。なんですかうーんでもなんかコアタイム的な感じは多分あると思うんですよねなんとなくこうみんな多分10時から4時ぐらいまでいるんじゃないかなって感じなんですけどなんかうんでも結構なんか遅くにメッセージ返ってくる人とかもいるんであのなんでしょうね多分やることをやろうみたいな雰囲気だと思いますねなんか5時になったらもう強制終了みたいなそういう感じではないです。ねスタートアップ集がちょっと節々からしますよね、そういうところから。あとアメリカの会社ってのもあるのかな?なんかアメリカの会社やっぱ聞いて、よく聞くけど、カナダに比べると忙しいみたいな、忙しいっていうかなんか、ちょっとプレッシャーはあるみたいな、日本での。なんか残業しろみたいなプレッシャーのすっごい少なくした番のやつがあるみたいなイメージがあるんですけどそんな感じなの?そうですね結構そのお客さんと直接やり取りする舞台はなんかお客さんから色々急かされて今すぐこれやってくれみたいな依頼をこっちにしてくることがあるんでそういうなんでしょうねプレッシャーは多分あるんだと思います。ちなみになんかデザイナーとかなんかPMみたいな人はあんまりいないんですか?PMはいないですね。あープロダクトマネージャーみたいな人が最近入ってあのいろいろなんでしょういろいろなことを円滑に回そうとしてますねただなんでしょうねそういうのも含めて今いろいろあの組織を改善中みたいな段階だと思いますデザイナーも最近多分これからかななんか入れるみたいな話をしてました。じゃあなんか時期によっていた時もあってでもまあ今はもうデザイナーいらないからまあさよならみたいな感じ。だったのかな多分ちょっと経緯はわからないですけどはいそんな感じだと思いますね。まあでも僕の最初の会社もスタートアップであのデザイナー最初デザイナーいたけどなんか途中からいなくなってみたいなのあったりしたんでまあなんかそういう感じなの。かもしれないですねうんかもしれないですねはい。なんかさっきあの決まったミーティングがあるってことだったんですけどなんかどういうミーティングが週に何回みたいな感じ。であるんですかはいえっとまずチームのミーティングがえっと週に1回ありましてあのまあその今週やるタスクはこれでみたいななんでしょうねあのまあ優先順位をつけるというかそういう整理をするミーティングになりますねであとはそのチーム横断的なミーティングがそれも週に1回あってえっとまあ今お客さんから言われているこういう課題があってそれをじゃああのなんでしょうねどう解決していこうかみたいなそういうミーティングがあります多分決まったミーティングはその2つですねはいそうだと思います。なんか英語とかはどうですか?なんかさっきの話だとCTOが日本人と結婚してるってことだから割と寛容なのかなみたいなちょっと想像してたんですけど。いや寛容ですねはい寛容だと思いますでまぁ当然全部英語ですけどあのチームのミーティングは僕ともう一人日本人なんで結構その優しい結構なんていうかレベルを落としてくれてる感じがすごくするんですけどもう一個チームの横断のミーティングはもうほんとみんなネイティブで本気出してると。いうか。まあなんですかね結構専門用語が飛び交ってるんでついていくのは結構大変ですね専門用語は。技術的な…アメリカ人か。ごめんなさいどうぞ専門用語は技術的な専門用語なんですかそれともなんかエコマースとかのそのプロダクトの。なんですかプロダクトの方ですねエコマース関連のあの指標のことだったりとかそういうのが多いですねはい、そういうところを追いつきながらっていう感じなんで、。はい。うん、なんかアコーニウムスみたいな、3文字で、アルファベットを3文字で表す手法みたいなんて、いつまで経っても覚えられないですよね。あれ、これ私だけなのかな?めっちゃでもめっちゃあるんだけどこの頃ねあの自分の会社の宣伝するみたいで悪いんだけどあの朝のねあのそれこそ僕は作ってないんだけど僕の今1ヶ月前ぐらいに移動してきたんだけどそこのチームがなんていうのチームのページになんかカードみたいなのを作れてその名刺に対するとかなんかその文言に対する説明を入れられるのねでそのそれがそのチームにいる人たちはそれがそのアプリでその朝に出てきた時にカーソルを当てるとわかるっていうのが出てくれて文章だと劇的にそれが改善されて僕だけ知るかもしれないけどあんまり知らないのは。アクロノミスとかなんかQ-tipみたいな感じで出てくるんですか?ほぼ思ったらそうそうそう青い。線がそれって朝の話ですか?朝の話です他のアプリがどうなってるのかわかんないけど今まですごい嫌で。えーだからそれちょうどアサナ使ってるんですよ実は今の会社でえーそうああそれいいなあとで送っておきますねあー助かりますありがとうございますなるほどなんかチームの共通用語とかもそういう。ので登録してそうチームの共通用語だったりとか会社の共通用語とかをなんか登録してできるみたいな感じなのかすごいめちゃくちゃ余談だったんですけど聞き。たかったのが、アメリカ人の方が多いんですか?チームは。いろんなタイムゾーンで働いてる人は、いろんな国の人だったりとかじゃなくて、やっぱりアメリカ人が多いんですか?えっとですねお客さんと直接やり取りしている人たちはやっぱりアメリカ人が多いですねでえっと開発部隊デベロッパーはあんまりその多分その言語の問題とかもあると思うんですけどそんなにあのアメリカ人じゃなさそうな人がいますねあのちょっと名前からしかわかんなかったりするんであのその人がアメリカ人じゃないかどうかちょっとわかんないん。ですけどなんかミーティングの前とかにどう思う?みたいな感じで話したりはしないんですか?そういう人たちと話そうと思えば話せるんですけどあんまりやってないですねやった方がいいですよね確か。にどうなんだろう今のチームのアイディアはやった方がいい気がするけどそうじゃなかったらいらないのかな。とも思いつつ結構そうですねチーム横断的なミーティングは人数も多いんで意外と難しいですね10人とかいたりするんで結構大変ですね。そしたら今はツールの開発をされてると思うんですけど仕事内容的にこれからやってみたいこととか関わってみたい仕事とかはありますか?そうですね結構やっぱり今のCTOがAIをどんどん使おうっていうのでAIに情熱を注いでる感じなんですねそれこそ企業の売上予測にAIを使って今後どういう売上の推移でいくかみたいな予測を立てるところにそういう機能を結構拡充していきたいみたいなのがあるみたいなのでそれは結構関わってみたら面白いんじゃないかなと思ってるんですけどそんな感じですかね。AIの流れで言うと仕事で使う機械とかはありますか?AI用ですか?そうですね、なんか普通にプロンプトンみたいなのとかカーソルみたいなツールとかもあると思うそう。ですね一応会社としてはチャットGPTとクロードを提供しててチームプランで使えるのでそれは結構使ってますねあとはAIに対して何か制限があるような感じでもないのでそこは自由に使ってます。ね先に本当は聞いておけばよかったんですけどなんか日本に日本で働いてた時とこっちで働いてみてギャップみたいなのってありますかそうですね。なんかあの早いですよねあの物事が進むスピードというか多分あれなんて言うんですかね決めるべき人がちゃんと決断をするみたいなのがすごいこっちの文化としてあるのかなと思っててあの割とまあこれはその僕のいた会社だけかもしれないですけど日本の会社だとあのどんどんその課長がいてそのじゃあ部長に話を通しに行ってじゃあその関係者全員にちょっと合意をとってみたいなそういうまあいろいろフローがあると思うんですけど結構今の会社あのすぐ決断をしてくれますねボスがはいあとはその各チームのリーダーとかもいるんですけどそのリーダーがやっぱりある程度責任を持って権限も持ってこうしようみたいなのをすぐ方向性を示しているなっていうので物事が進むスピードが速いなっていうのは思い。ます逆にネガティブなものとかありますかなんかこれは日本の方がいいなみたいないや、。これすごく考えてたんですけど、アメリカ人はって言ったらあれだな、文章長いと読まないですね、あの人たち。でも、僕も読まないかもしんない。何でしょう、結構そのいろんなメッセージにその情報量結構詰めてたんですね、僕もそうですけど同僚の日本人もそうなんですけど結構あのこれもあれもみたいに詰めて全部伝えてあげる方がいいだろうみたいなのがやっぱあって日本だと多分そっちの方がいいんですよ、いいんですよって言った。んですけどそれがスタンダードですよねはい、。でもそれやると多分最初2行ぐらいしか読まないから全然話がなんか噛み合わなくなってみたいな確かに過剰書きで2個までですねなんか最近意識してるのは。でも人にもよるのかなとかも思いますよね私の周りは本当にコードレビューでもなんかパラグラフみたいにすっごいなんか解説してくれる人とかもいるしなんかやっぱりレコードとして残るからちゃんと書こうと思っている人はいると思うけどかといなんかとはいえすごいなかなか打ってたらもういいからちょっとズームに発砲して出てくる人もいるしなんかせっかち度はやっぱり人によって違うのかなとか思うけどせっかちな人が多い印象確かに私もあるかもしれない。です僕なんか結構この頃は間をとってちゃんと書くんだけど最初にtlngreoadでそのポイントだけを絶対やるみたいなあとはなんかその文章をレファレンスとして使うみたいな一応まず書いてtlngreoadも書いてでなんかzomとかに行った時にここでも書いたけどみたいなのでちょっとどっちも残しつつみたいなのはよくやります。でも確かにそうですね、日本人はちゃんと読んでくれてしっかり読んでみたいなのはあるかもしれないです。いやそうですね、だからなんか僕も最近その文化というかにあの飲まれてるのかもしれないですけど、なんか長いの見ると長ぇなみたいな思っちゃってあんま読まないみたいな。いや、僕も読まないです全然。あのなんかその読まなくても問題なさそうだなって思うともう読めなくなっちゃいますね。確かに。そうですね。めちゃくちゃ飲まれてる僕は。でもやっぱその人によりますねあの綾香さんおっしゃった通りなんかすごく長い文章で送ってくる人もいるし長い文章を読んでくれる人もいるんですけど傾向としてはやっぱりちょっとあの短い短的なのがなんか好まれてる気がしますね。そうですねメールとかもすごい短くていいから、楽なのは楽ですよね。いきなり担当直入に本題に入れるから、日本みたいにご挨拶とかないし。確かにそうですね。でもなんかそう、個人的にはもうちょっと情報入れたいなっていうのはあるんですよね。これも言っとかないとまずいよなみたいなのもあるんですけど、なんかそこをグッと絞って返信が返ってきてから返すみたいな、その情報を言うみたいな。必要になった時にだけ使うみたいなね。はい、なんかその方がいいのかなって思いながら働いてます。確かに人によってなんか違うし読んでくれる人読んでくれない人いるからそこら辺は難しいはいで。も書いててお前それ長すぎるよって言ってくる人はいないと思うからなんか自分にとって効率が落ちないのであれば何だろう書く分にはいいのかなって思うけど書いてる時間がすっごい長くって無駄になってるならちょっと考えるかもしれないけど。そうですねなんかでもそう最近はなんかこう書いてるうちになんかこんな書かなくていいんじゃねえかなみたいな気持ちも出てきたりするんで難しいですよねなんかこれはまあ自分の中で変化なんですけどいい変化なのか悪い変化なのかよく。わからないです確かにまあでも基本的にはなんかやっぱその製品でもちょっとちょっとぐらい微妙でもいいから早く出そうみたいなまさっき言われてた通りあの決めることも早く決めて早く進もうみたいなのが本体にあるからまぁあんまりなんだろカッチリして遅いものよりはあのちゃんとできてないけど早く出してくれる方がありがたがれるがられるというか評価されている印象みたいなのはちょっとありますよねそこは何か確かに日本と違う。ところも知れないはいまさにその通りでスタートアップっぽいっていうのもあってですねとにかく動くものを早く出すみたいなのがやっぱりあってそういうのもあって結構コードは割とぐちゃぐちゃだったりするんですけどそれでその結局ビジネスが成功してるんである意味一つの正解というかお題なのかなと思い。ますねさっきもちょっとだけ話したんですけど英語とかは今はどうですか苦しんでますそれとも結構さっきの感じだと、チーム内では全然大丈夫だと思うんですけど、こういうミーティングでは、さっき言われたのだとチーム横断したミーティングは結構困るよみたいなのがあると思うんですけど、他ではどうですか?えっとそうですねちょっとそのポジションがあの正式雇用になって変わったのもあってたまにそのクライアントとのミーティングに出ないといけなかったりするんですよねそれは結構なんでしょうね失礼があっても当然いけないですし当然その内容も正確に伝えないといけないんですごくプレッシャーを感じてますねエンジニアと。したらどういう立場で出られるんですかどういうことを話さないといけないとか聞かないといけないみたい。なのあるんですかうーんとまぁ一応技術のなんて言うんですかねリードエンジニアみたいな感じであの紹介されるんであのうちの製品のあの仕様というかあのうちの製品の内部処理でこういうことしてますよみたいのを向こうのデベロッパーとあのすり合わせるみたいな感じがあったりしてですねそういうのは結構あの英語ではそういう意味だと苦労はしてますね。それ結構頻繁にあるんですか?いやそんなに頻繁にはないですね本当たまにですね月に1回あるかないかみたいな感じなんでまあその何か喫緊の課題とかがあるとポンポンと連続で入ったりするんです。けどそしたら短期的な目標みたいなこういうAIみたいなのを使ってもうちょっと。AIを。仕事に取り入れていくじゃない間違った話だとえっとなんだろうaiを使った仕事というかそのそこらへんを関わってみたいってことだったんですけど長期的にはどういうふうなんだろうキャリアを考えて。いるこれ難しいんですよね結局僕もあんまりそのこっちに骨を埋めようみたいな気持ちはそんなになくて日本に帰国したいなっていう気持ちは将来的には帰国したいなって気持ちはあるのでじゃあ日本に帰って何しようかなみたいなのがあんまりなんかイメージ湧かないんですよねそういう意味だと結構そのむしろアドバイスが欲しいぐらいな。んですけどなんかありますえ、エンジニアじゃなくてもいいみたいな感じなんですか?それともエンジニアの中でみたいな感じですか?エンジニアがいい…難しいですね。なんかエンジニア…そうですね、エンジニアがいいですね。はい。いや、僕もわかんないですね。僕は5年から10年ぐらいはまだいることを考えてはいるんですけど、日本に帰ってなんかどうしたらいいんですかねわかんないですなんかないし言ったら楽しい仕事ができそうかなとは思うけど給料はめちゃくちゃ落とすことになりそう返しに行くとお金はもらえそうだけどなんかローカライゼーションの仕事とかが多そうだしなんかうんなんか大変そう、日本人と仕事を基本的に日本人のチームとか外資とは言えど、やっぱり日本のカルチャーは結構残ってるとは思うんで、そういう大変なところとかもありそうだなぁと思うし、まぁでもそうですね、僕の中ではまぁ将来的にまぁ10年、5年とか10年とか後には帰ろうかな、まぁでももちろんなんかそのキャリアだけじゃなくて、なんかね、今僕は結婚してるんですけど、子供とか考えたら相手の事情みたいなのもあるんで、ちょっとなんとかも言えないけど、基本的にはそうですね、こっちでいっぱい働いて、なんかその経験を持って日本に帰って有効活用できればいいなみたいな思ってるんですけど、なんか5年とか、どのぐらいの単位でカナダとか北米で働こうかなって思われてるんですか?ああ難しいですねでもなんかあと1年とか2年でもういいんじゃないかなっていう気持ちはすごくあるんですけどでもさっきあのおっしゃったようにですねなんかなんて言うんでしょう結構ふわっとした感じでその国米での経験をもとになんか日本で活躍できればいいかなみたいなすごく具体性のない感じの気持ちしか今なくてなんかどうしようかなみたいなその働きたい企業とかあるかなみたいなそういうの調べないとなっていう感じですよね。どんな働き方をしたいかによってくるんじゃないですかえっとこっちだったらまああの9時6時で働いてると言ってたからあの必ずしも当てはまるかわかんないけどすっごい緩いですよねやっぱ日本に比べてあの朝もゆっくりで残業もなくてで人も結構治療だからそんなストレスななんだろう上司からの圧力もなくあの社会人としては、すごくゆるく働けると思うんです。そこを重視するポイントなんだったら、もしかしたら、こっちに長く行ったほうがいいのかもしれないし。でも、日本のストレスフルな社会でも、別にいいし、お給料もらえて、あの安定は絶対日本の方があるから医療もあるしご飯も美味しいしっていうのを重視だったらもしかしたら早く帰った方が幸せなのかもしれないしあと私思ったのがこの間ポッドキャストでお話ししたあの方もおっしゃってたんですけど転職日本に帰る時に転職エージェントを使って自分のキャリア説明してあのこういう経験をしてきたってお話ししたらすごいなんかいろんな角度から提案してくれたみたいで今まで思ってもなかったキャリアをそこで提案してもらってそっちに移行できたみたいなお話も聞いたので私もそれ聞いた時に人に意見聞くのも面白いのかもなぁと思って自分では思ってなかった角度とかでキャリアを考えてくれたりすると思うのでそれは思いましたそうです。ね確かにこの海外来たっていうのもたまたまフロックの記事を見たからっていうのもあるんでそういう知らなかったことを知ると意外とこういう道もあるんだっていうので変わるかもしれないですねすいません相談会みたいになっちゃいました全然全然でも。私もいつまでやるかわかんないしみんな同じ悩みなんだなと思って確かに。そうですねなんかその海外に行きたいって思ってまあ目指してきたわけじゃないですかそこの時のなんていうの目標というかやりたかったことみたいなのは達成できたかなって感じ。ですかはい達成できたと思いますあの本当に来る時もやっぱり結構ふわっとした感じで来ちゃったんであのなんて言うんでしょうその北米でエンジニアとして働くみたいなそういうすごく具体的なところまではあまり落とし込まずにあのとりあえず結構勢いみたいな感じで来ちゃったのもあってまあ達成したの。かなとは思いますなんか今までのポッドキャスターのあのインタビューしてると結構そこらへんめちゃくちゃ明確な人が多いですよねでも僕も同じでちょっと海外で働いちゃおうかなみたいな感じで来てたんでそういう人の話聞くとおーってなるけど私もそうですよ。働いてみちゃおうかなって来て働いてみちゃえたから次何しようかなってなるのは普通だと思うし私も同じだし別にエンジニアにこだわらなくてもきっといろんな働き方があるんじゃないかなと思いますいや、。よかったです。確かに。みんな結構なんか、具体的な計画を立てて来られてるじゃないですか。すごいなって、本当にすごいなとしか言えないんですけど、逆にこんな勢いで来ちゃって、申し訳ないなぐらいの感じだった。そしたら最後に、自分のような、ちょっと経験が日本であるよっていう人、得を考えている人にアドバイスをいただけたらお願いし。ますはいそうですねあのまずこれを聞いている時点でまず結構興味があるっていうことだと思うんで結構考えてたんですけどなんか来ることにそんなに意外とリスクってないのかなって僕思ってましてお金はかかりますあとまあ時間もかかりますでまあその就職はできませんでしたで帰ってもまあ何でしょう何年いるかにもよりますけどちょっと1年じゃあその就職活動してただけでお金だけを失った時期があるってだけでなんかじゃあそれがなんか今後の人生に決定的なダメージを与えるかというとなんかそういうわけでもないなっていうのを思っててなんかもし本当にはい今雇用みたいなそのゴブゴブぐらいで揺れてるんだったらもう来ちゃった方が多分いいと思いますなんかたぶんこれで来なかった場合あの時行っときゃよかったって絶対僕だったら思うんですよねある意味、行く、行かないを決めたほうがいいかもしれないですね。行かないなら行かないで、行かないほうが自分にとっていい選択だっていう決定をしてしまえば、多分後悔はないと思うので。確かにあと僕、一つカナダで言うとなんですけど、さっきもう前半に言われてたのかな、結構周りでレジュメめちゃくちゃ頑張ってる人たちがいたみたいな、話だったんですけど結構その来てる日本人って意識めちゃくちゃ高いじゃないですかだからなんかその人たちと生活するだけで結構なんか自分もなんか勉強できるというかまぁなんか周りにそういう人たちが多いからってのもあるかもしれないんですけど結構その1年で就職ができなかったとしても結構その成長の機会みたいなのがあるのかなって感じるのでなんかそれでなんか僕が来た時に一緒に来た、一緒に来たんじゃないけどその同じ時期にいた人たちでまあ僕今も8年もいるんで結構帰っている人は多いんですけどでもその就職しなかったとしても結構なんていうんだろう日本で活躍しているメンバーは多いのかなって思うのでなんかそういうのもありますよねただまああの就職っていうあれだけではまあ失敗はしてしまったのまあ就職はこっちではできなかったかもしれないけどなんかその1年はすごい役に立ってるのかなみたいなの見えるのでいやはい。あのおっしゃる通りだと思っててなんか僕こっち来るまで全然その他のなんて言うんでしょあの別のあのなんて言うんですかね業界にいるエンジニアとかそういうエンジニアのコミュニティみたいなところに入ってなかったんでこっちに来て初めてそのこんなみんなこういうことをやってきたんだみたいなそういうある意味勉強ですよねそのあのそういう知る機会になったっていうのもあってそこから刺激を受けたりとかもっと頑張らないとなみたいな気持ちになったりしたんであの来ること自体はすごくポジティブな影響があるんじゃないかなと思いますと。いうことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "今回も前回に引き続きSugrさんに来ていただきました。よろしくお願いします。",
      "start": 748,
      "end": 5110,
      "timestamp": "00:00"
    },
    {
      "speaker": "Suguru",
      "text": "よろしくお願いします。",
      "start": 5110,
      "end": 7262,
      "timestamp": "00:05"
    },
    {
      "speaker": "Ryo",
      "text": "前回はカナダに来るまで、渡航までとか英語だったり技術のことだったりどういうふうに勉強したのかみたいな話してたんですけど後半は何だろう今働いて9ヶ月目ってことだったんですけど実際働いてみてこんなだよみたいなのをシェアしていただければいいかなと思うんですけど実際働いてみてどう。",
      "start": 7262,
      "end": 30435,
      "timestamp": "00:07"
    },
    {
      "speaker": "Suguru",
      "text": "ですかどうですかって結構あれですね幸せですかいやはいあの働かせていただいてありがとうございますっていうところなんですけどなんでしょうねあの高度の面で言うと結構まあぐちゃぐちゃではあるんですよねもう多分これあのスタートアップってそのなんですかね小さなプロダクトをどんどん成長させてきた企業っていうのもあって結構いろんなあの試行錯誤の跡が残ってるって言うといいですかねなん。",
      "start": 30435,
      "end": 62526,
      "timestamp": "00:30"
    },
    {
      "speaker": "Ryo",
      "text": "であのはい会社ってどんなことやられてるんですか。",
      "start": 62526,
      "end": 65668,
      "timestamp": "01:02"
    },
    {
      "speaker": "Suguru",
      "text": "一言で言うと、Eコマース企業向けの成長支援みたいなことをやってまして例えばそのショピファイだったり、日本で言うと楽天とかそういうEコマースのプラットフォームに出展している企業向けにあなたの企業をもうちょっとこうしたら売上げ伸ばせますよとかですね広告費はちょっと払いすぎなんでもうちょっと抑えましょうとかそういう分析をしている会社ですね僕はその分析ツールを開発している部隊に所属し。",
      "start": 67472,
      "end": 100462,
      "timestamp": "01:07"
    },
    {
      "speaker": "Ryo",
      "text": "ています前回、2前回というか日本で働いた時はJavaとAngularがメインだったようなことだったんですけど今はどういう技術スタックで働かれ。",
      "start": 100462,
      "end": 111651,
      "timestamp": "01:40"
    },
    {
      "speaker": "Suguru",
      "text": "ているんですか今のバックエンドはNde。\njsoでフロントがAngularですねたまたまAngularでしたじゃあなんだろ。",
      "start": 111651,
      "end": 120916,
      "timestamp": "01:51"
    },
    {
      "speaker": "Ryo",
      "text": "全部javascriptタイプスクリプトタイプスクリプトでやってますなんだろうチームとしてはどういうチームになるんですかそのツールだけの開発なんですかなんかどのぐらいの他にも他にもチームあったりする。",
      "start": 120916,
      "end": 134182,
      "timestamp": "02:00"
    },
    {
      "speaker": "Suguru",
      "text": "んですかそうですね一応プロダクトごとにチームが分かれてましてあの僕のチームはその一つのプロダクトを開発運用保守しているようなチームになりますチームには。",
      "start": 134182,
      "end": 152598,
      "timestamp": "02:14"
    },
    {
      "speaker": "Ryo",
      "text": "どのくらいどういう人たちがいるんですか何人くらいいてどういうテイクホルダーみたいなのがいるんですか。",
      "start": 152598,
      "end": 159320,
      "timestamp": "02:32"
    },
    {
      "speaker": "Suguru",
      "text": "僕のチームは今僕含めて3人でして一人はCTOですねその人がリーダーというかリーダーかマネージャーをやってましてその下に僕がいて、あともう一人、日本人で、僕がリファラルを出した子が働いてます。",
      "start": 159320,
      "end": 182122,
      "timestamp": "02:39"
    },
    {
      "speaker": "Senna",
      "text": "すごいリファラルのチェーンが。",
      "start": 182122,
      "end": 184233,
      "timestamp": "03:02"
    },
    {
      "speaker": "Ryo",
      "text": "リファラルをもらった人ではなくて、リファラルを出した人。",
      "start": 184233,
      "end": 189545,
      "timestamp": "03:04"
    },
    {
      "speaker": "Suguru",
      "text": "僕がリファラルを出した人です。",
      "start": 189545,
      "end": 191756,
      "timestamp": "03:09"
    },
    {
      "speaker": "Senna",
      "text": "もらってからの出してるから、少なくとも3人はいるんですよね。",
      "start": 191756,
      "end": 195707,
      "timestamp": "03:11"
    },
    {
      "speaker": "Suguru",
      "text": "そうです。",
      "start": 195707,
      "end": 196118,
      "timestamp": "03:15"
    },
    {
      "speaker": "Ryo",
      "text": "今、。",
      "start": 196118,
      "end": 196248,
      "timestamp": "03:16"
    },
    {
      "speaker": "Suguru",
      "text": "練習してます。",
      "start": 196248,
      "end": 198225,
      "timestamp": "03:16"
    },
    {
      "speaker": "Ryo",
      "text": "で、日本人は3人一応会社にいるって感じなんですか?",
      "start": 198235,
      "end": 201500,
      "timestamp": "03:18"
    },
    {
      "speaker": "Suguru",
      "text": "もっといます?",
      "start": 201500,
      "end": 201950,
      "timestamp": "03:21"
    },
    {
      "speaker": "Ryo",
      "text": "それとも。",
      "start": 201950,
      "end": 202651,
      "timestamp": "03:21"
    },
    {
      "speaker": "Suguru",
      "text": "えっと、僕含めて2人ですね。最初に僕に出してくれた人がちょっと退職しちゃったんで、。",
      "start": 202651,
      "end": 207858,
      "timestamp": "03:22"
    },
    {
      "speaker": "Senna",
      "text": "はい。でも同じチームに日本人がいるとちょっと安心しますね。",
      "start": 207858,
      "end": 215827,
      "timestamp": "03:27"
    },
    {
      "speaker": "Suguru",
      "text": "すごく働きやすいですねですけどどうだろう僕はすごくいいと思うんですけどなんかなんだろうなオフィスに出社してそのネイティブたちとこうバンバンやり合うみたいな環境に憧れてる人はちょっとギャップがあるか。",
      "start": 215837,
      "end": 229834,
      "timestamp": "03:35"
    },
    {
      "speaker": "Ryo",
      "text": "もしれないですねなんかどうだろう、僕3社、今カナダに来て3社目なんですけど、いまだに1回もまだ日本人と働いたことがなくて、いつももう会社に1人とかのレベル。今の会社は日本に4社があって、ソフトエンジニアじゃないセールスとかだったらいるんですけど、日本人2人とかだと比べられてちょっと嫌だなって感じがするけど、そんなことないですか?この日本人めちゃくちゃ勤勉だけど、リモはそうでもねえなみたいになったらちょっとなんか悲しいじゃん。",
      "start": 229834,
      "end": 267043,
      "timestamp": "03:49"
    },
    {
      "speaker": "Suguru",
      "text": "いやでもどうでしょうね僕はあんまりそれを考えたことなくてただでもあの思うのはやっぱ結構やっぱ日本人は真面目ですねあのなんだろうそれこそのなんだろうなコードのプロリクエストとかあとコミットとか見てもやっぱなんて言うんですかねたまにその他の人してる?ちゃんとしてます他の人は結構あの動かないやつをコミットしてなんかバグったりとかしてるんですけどそういうのはまずないんであのなんだろうな信頼してもらってると思います。",
      "start": 267053,
      "end": 300842,
      "timestamp": "04:27"
    },
    {
      "speaker": "Ryo",
      "text": "よそういう意味でなんかやっぱそれってでもその日本人と働いたことない人でもやっぱそんなイメージが多分日本人にあると思うんでで、僕と働いた人がああまあなんかりょうやっぱり信頼できるなって思ってもらってるかもしれないけど次の新しい日本人来て全然違うレベルでもうこいつすげーなみたいな感じだったらあ、りょうは別にそうでもなかったのかみたいな日本人だからそうでもねえ。",
      "start": 300842,
      "end": 328657,
      "timestamp": "05:00"
    },
    {
      "speaker": "Senna",
      "text": "んだなみたいな感じで。",
      "start": 328657,
      "end": 329278,
      "timestamp": "05:28"
    },
    {
      "speaker": "Ryo",
      "text": "思われそうで嫌じゃないですかちょっとわかんないけどいつも思っちゃう相対的にってことですかそうそう相対的に。",
      "start": 329278,
      "end": 335341,
      "timestamp": "05:29"
    },
    {
      "speaker": "Suguru",
      "text": "そう確かに確かに日本人。",
      "start": 335341,
      "end": 338398,
      "timestamp": "05:35"
    },
    {
      "speaker": "Senna",
      "text": "1人でいるアドバンテージみたいなのは確かに受け付けるかもしれない。1人しか例がないから。日本人代表みたいな。",
      "start": 338398,
      "end": 352599,
      "timestamp": "05:38"
    },
    {
      "speaker": "Suguru",
      "text": "確かにそうですね。よく考えたらそうかもしれないですね。",
      "start": 352599,
      "end": 357593,
      "timestamp": "05:52"
    },
    {
      "speaker": "Ryo",
      "text": "でも確かにそういう意味で言うとあれですもんね。日本人からもうレファラルで入ってって感じだから、それだったら確かにあんまないのかもしれない。",
      "start": 357593,
      "end": 367363,
      "timestamp": "05:57"
    },
    {
      "speaker": "Suguru",
      "text": "はい、あとはそのまあ、戸足情報なんですけど、そのマネージャーが今日本に住んでて、まあ日本人の人と結婚してるみたいなんですよね。CTO?CTOです。",
      "start": 367373,
      "end": 377345,
      "timestamp": "06:07"
    },
    {
      "speaker": "Ryo",
      "text": "えー、。",
      "start": 377345,
      "end": 377855,
      "timestamp": "06:17"
    },
    {
      "speaker": "Senna",
      "text": "あ、。",
      "start": 377855,
      "end": 377985,
      "timestamp": "06:17"
    },
    {
      "speaker": "Suguru",
      "text": "そうなんだ。日本人に対するイメージ多分いいと思うんですよ。そういうのもあると思います。",
      "start": 377985,
      "end": 386737,
      "timestamp": "06:17"
    },
    {
      "speaker": "Ryo",
      "text": "どんな感じの時間帯とかで働かれてるんですか?なんかさっきあの結構前半の方に結構自由に働いているよってことだったんですけど自分の中で決めてたりとかえっとそうです。",
      "start": 386737,
      "end": 399255,
      "timestamp": "06:26"
    },
    {
      "speaker": "Suguru",
      "text": "ねもう全然決まってはないんですけど僕の中でなんとなく9時ぐらいから始めてまぁだいたい6時ぐらいまでに一旦終わってまあなんかあのやることがあればその後まあ夜にやるとかそういう感じですねなんか割。",
      "start": 399255,
      "end": 415277,
      "timestamp": "06:39"
    },
    {
      "speaker": "Ryo",
      "text": "とはい自由結構でも働かれてるんですね9時6時で仕事こっちって9時5時じゃないんですか聞いてた話と違う。",
      "start": 415277,
      "end": 425525,
      "timestamp": "06:55"
    },
    {
      "speaker": "Suguru",
      "text": "みたいないや全然なんかなんだろう普通こうだろみたいなあんまりよくわかんなくてですね他の企業で働いてないんでこっちではいただなんか他のなんていうんですかねあの同僚を見てると結構自由な時間に働いてますねなんかこの人この人スラックのローカルタイム11時とかになってるけどなんか返信が来たみたい。",
      "start": 425525,
      "end": 447217,
      "timestamp": "07:05"
    },
    {
      "speaker": "Senna",
      "text": "な結構自由ですねはいいろんなタイムゾーンで働いてる人が同じチームにいるって言ってたからミーティングのセッティングとか難しくないですかそうですね。",
      "start": 447217,
      "end": 460280,
      "timestamp": "07:27"
    },
    {
      "speaker": "Suguru",
      "text": "ミーティングだけはちょっとはい難しいですねでもあんまり何だろう突発的なミーティングってあんまりなくて一応定期的なミーティングがあってそれはタイムゾーン考慮されて設定されてます。",
      "start": 460280,
      "end": 471648,
      "timestamp": "07:40"
    },
    {
      "speaker": "Senna",
      "text": "ねじゃあこんな時間にすんなよって思うようなことは。",
      "start": 471648,
      "end": 477011,
      "timestamp": "07:51"
    },
    {
      "speaker": "Suguru",
      "text": "あんまりないあんまりないですねなんかそういうことを話されてたポッドキャストがあったような気がするなんか聞きまし。",
      "start": 477011,
      "end": 484075,
      "timestamp": "07:57"
    },
    {
      "speaker": "Ryo",
      "text": "たけど前に撮った人で日本に帰った人に2人くらい撮ったんですねその人たちがやっぱなんか9時6時で働くのは辛いみたいな言っててそれにまあ確かにこっちで9時6時ってあんま聞いたことないなぁと思ってなんか他の人の感じ見てもそんぐらい働いてる感じですかそれともあのすぐるさんだけもう俺は9時6時だみたいな感じ。",
      "start": 484075,
      "end": 509818,
      "timestamp": "08:04"
    },
    {
      "speaker": "Suguru",
      "text": "なんですかうーんでもなんかコアタイム的な感じは多分あると思うんですよねなんとなくこうみんな多分10時から4時ぐらいまでいるんじゃないかなって感じなんですけどなんかうんでも結構なんか遅くにメッセージ返ってくる人とかもいるんであのなんでしょうね多分やることをやろうみたいな雰囲気だと思いますねなんか5時になったらもう強制終了みたいなそういう感じではないです。",
      "start": 509818,
      "end": 539665,
      "timestamp": "08:29"
    },
    {
      "speaker": "Senna",
      "text": "ねスタートアップ集がちょっと節々からしますよね、そういうところから。",
      "start": 539665,
      "end": 547514,
      "timestamp": "08:59"
    },
    {
      "speaker": "Ryo",
      "text": "あとアメリカの会社ってのもあるのかな?なんかアメリカの会社やっぱ聞いて、よく聞くけど、カナダに比べると忙しいみたいな、忙しいっていうかなんか、ちょっとプレッシャーはあるみたいな、日本での。なんか残業しろみたいなプレッシャーのすっごい少なくした番のやつがあるみたいなイメージがあるんですけどそんな感じなの?",
      "start": 547514,
      "end": 567232,
      "timestamp": "09:07"
    },
    {
      "speaker": "Suguru",
      "text": "そうですね結構そのお客さんと直接やり取りする舞台はなんかお客さんから色々急かされて今すぐこれやってくれみたいな依頼をこっちにしてくることがあるんでそういうなんでしょうねプレッシャーは多分あるんだと思います。",
      "start": 567232,
      "end": 581437,
      "timestamp": "09:27"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみになんかデザイナーとかなんかPMみたいな人はあんまりいないんですか?",
      "start": 585226,
      "end": 591087,
      "timestamp": "09:45"
    },
    {
      "speaker": "Suguru",
      "text": "PMはいないですね。あープロダクトマネージャーみたいな人が最近入ってあのいろいろなんでしょういろいろなことを円滑に回そうとしてますねただなんでしょうねそういうのも含めて今いろいろあの組織を改善中みたいな段階だと思いますデザイナーも最近多分これからかななんか入れるみたいな話をしてました。",
      "start": 591087,
      "end": 619737,
      "timestamp": "09:51"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあなんか時期によっていた時もあってでもまあ今はもうデザイナーいらないからまあさよならみたいな感じ。",
      "start": 621317,
      "end": 629740,
      "timestamp": "10:21"
    },
    {
      "speaker": "Suguru",
      "text": "だったのかな多分ちょっと経緯はわからないですけどはいそんな感じだと思いますね。",
      "start": 629740,
      "end": 636562,
      "timestamp": "10:29"
    },
    {
      "speaker": "Ryo",
      "text": "まあでも僕の最初の会社もスタートアップであのデザイナー最初デザイナーいたけどなんか途中からいなくなってみたいなのあったりしたんでまあなんかそういう感じなの。",
      "start": 636562,
      "end": 648086,
      "timestamp": "10:36"
    },
    {
      "speaker": "Suguru",
      "text": "かもしれないですねうんかもしれないですねはい。",
      "start": 648086,
      "end": 650467,
      "timestamp": "10:48"
    },
    {
      "speaker": "Ryo",
      "text": "なんかさっきあの決まったミーティングがあるってことだったんですけどなんかどういうミーティングが週に何回みたいな感じ。",
      "start": 651103,
      "end": 659506,
      "timestamp": "10:51"
    },
    {
      "speaker": "Suguru",
      "text": "であるんですかはいえっとまずチームのミーティングがえっと週に1回ありましてあのまあその今週やるタスクはこれでみたいななんでしょうねあのまあ優先順位をつけるというかそういう整理をするミーティングになりますねであとはそのチーム横断的なミーティングがそれも週に1回あってえっとまあ今お客さんから言われているこういう課題があってそれをじゃああのなんでしょうねどう解決していこうかみたいなそういうミーティングがあります多分決まったミーティングはその2つですねはいそうだと思います。",
      "start": 659506,
      "end": 699902,
      "timestamp": "10:59"
    },
    {
      "speaker": "Ryo",
      "text": "なんか英語とかはどうですか?なんかさっきの話だとCTOが日本人と結婚してるってことだから割と寛容なのかなみたいなちょっと想像してたんですけど。",
      "start": 702004,
      "end": 712192,
      "timestamp": "11:42"
    },
    {
      "speaker": "Suguru",
      "text": "いや寛容ですねはい寛容だと思いますでまぁ当然全部英語ですけどあのチームのミーティングは僕ともう一人日本人なんで結構その優しい結構なんていうかレベルを落としてくれてる感じがすごくするんですけどもう一個チームの横断のミーティングはもうほんとみんなネイティブで本気出してると。",
      "start": 712888,
      "end": 737141,
      "timestamp": "11:52"
    },
    {
      "speaker": "Ryo",
      "text": "いうか。",
      "start": 737141,
      "end": 737262,
      "timestamp": "12:17"
    },
    {
      "speaker": "Suguru",
      "text": "まあなんですかね結構専門用語が飛び交ってるんでついていくのは結構大変ですね専門用語は。",
      "start": 740583,
      "end": 746867,
      "timestamp": "12:20"
    },
    {
      "speaker": "Senna",
      "text": "技術的な…アメリカ人か。",
      "start": 746867,
      "end": 748567,
      "timestamp": "12:26"
    },
    {
      "speaker": "Ryo",
      "text": "ごめんなさいどうぞ専門用語は技術的な専門用語なんですかそれともなんかエコマースとかのそのプロダクトの。",
      "start": 748567,
      "end": 759973,
      "timestamp": "12:28"
    },
    {
      "speaker": "Suguru",
      "text": "なんですかプロダクトの方ですねエコマース関連のあの指標のことだったりとかそういうのが多いですねはい、そういうところを追いつきながらっていう感じなんで、。",
      "start": 759973,
      "end": 775118,
      "timestamp": "12:39"
    },
    {
      "speaker": "Senna",
      "text": "はい。うん、なんかアコーニウムスみたいな、3文字で、アルファベットを3文字で表す手法みたいなんて、いつまで経っても覚えられないですよね。あれ、これ私だけなのかな?",
      "start": 775118,
      "end": 790213,
      "timestamp": "12:55"
    },
    {
      "speaker": "Ryo",
      "text": "めっちゃでもめっちゃあるんだけどこの頃ねあの自分の会社の宣伝するみたいで悪いんだけどあの朝のねあのそれこそ僕は作ってないんだけど僕の今1ヶ月前ぐらいに移動してきたんだけどそこのチームがなんていうのチームのページになんかカードみたいなのを作れてその名刺に対するとかなんかその文言に対する説明を入れられるのねでそのそれがそのチームにいる人たちはそれがそのアプリでその朝に出てきた時にカーソルを当てるとわかるっていうのが出てくれて文章だと劇的にそれが改善されて僕だけ知るかもしれないけどあんまり知らないのは。",
      "start": 790223,
      "end": 830494,
      "timestamp": "13:10"
    },
    {
      "speaker": "Senna",
      "text": "アクロノミスとかなんかQ-tipみたいな感じで出てくるんですか?",
      "start": 830494,
      "end": 835277,
      "timestamp": "13:50"
    },
    {
      "speaker": "Ryo",
      "text": "ほぼ思ったらそうそうそう青い。",
      "start": 835277,
      "end": 839039,
      "timestamp": "13:55"
    },
    {
      "speaker": "Suguru",
      "text": "線がそれって朝の話ですか?",
      "start": 839039,
      "end": 841060,
      "timestamp": "13:59"
    },
    {
      "speaker": "Ryo",
      "text": "朝の話です他のアプリがどうなってるのかわかんないけど今まですごい嫌で。",
      "start": 841060,
      "end": 846704,
      "timestamp": "14:01"
    },
    {
      "speaker": "Suguru",
      "text": "えーだからそれちょうどアサナ使ってるんですよ実は今の会社でえーそうああそれいいなあとで送っておきますねあー助かりますありがとうございますなるほどなんかチームの共通用語とかもそういう。",
      "start": 847582,
      "end": 863230,
      "timestamp": "14:07"
    },
    {
      "speaker": "Ryo",
      "text": "ので登録してそうチームの共通用語だったりとか会社の共通用語とかをなんか登録してできるみたいな感じなのかすごいめちゃくちゃ余談だったんですけど聞き。",
      "start": 863230,
      "end": 875886,
      "timestamp": "14:23"
    },
    {
      "speaker": "Senna",
      "text": "たかったのが、アメリカ人の方が多いんですか?チームは。いろんなタイムゾーンで働いてる人は、いろんな国の人だったりとかじゃなくて、やっぱりアメリカ人が多いんですか?",
      "start": 875886,
      "end": 888159,
      "timestamp": "14:35"
    },
    {
      "speaker": "Suguru",
      "text": "えっとですねお客さんと直接やり取りしている人たちはやっぱりアメリカ人が多いですねでえっと開発部隊デベロッパーはあんまりその多分その言語の問題とかもあると思うんですけどそんなにあのアメリカ人じゃなさそうな人がいますねあのちょっと名前からしかわかんなかったりするんであのその人がアメリカ人じゃないかどうかちょっとわかんないん。",
      "start": 888169,
      "end": 910204,
      "timestamp": "14:48"
    },
    {
      "speaker": "Ryo",
      "text": "ですけどなんかミーティングの前とかにどう思う?みたいな感じで話したりはしないんですか?",
      "start": 910204,
      "end": 917951,
      "timestamp": "15:10"
    },
    {
      "speaker": "Suguru",
      "text": "そういう人たちと話そうと思えば話せるんですけどあんまりやってないですねやった方がいいですよね確か。",
      "start": 917951,
      "end": 925807,
      "timestamp": "15:17"
    },
    {
      "speaker": "Ryo",
      "text": "にどうなんだろう今のチームのアイディアはやった方がいい気がするけどそうじゃなかったらいらないのかな。",
      "start": 925807,
      "end": 933593,
      "timestamp": "15:25"
    },
    {
      "speaker": "Suguru",
      "text": "とも思いつつ結構そうですねチーム横断的なミーティングは人数も多いんで意外と難しいですね10人とかいたりするんで結構大変ですね。",
      "start": 933593,
      "end": 944301,
      "timestamp": "15:33"
    },
    {
      "speaker": "Ryo",
      "text": "そしたら今はツールの開発をされてると思うんですけど仕事内容的にこれからやってみたいこととか関わってみたい仕事とかはありますか?",
      "start": 947293,
      "end": 959343,
      "timestamp": "15:47"
    },
    {
      "speaker": "Suguru",
      "text": "そうですね結構やっぱり今のCTOがAIをどんどん使おうっていうのでAIに情熱を注いでる感じなんですねそれこそ企業の売上予測にAIを使って今後どういう売上の推移でいくかみたいな予測を立てるところにそういう機能を結構拡充していきたいみたいなのがあるみたいなのでそれは結構関わってみたら面白いんじゃないかなと思ってるんですけどそんな感じですかね。",
      "start": 959343,
      "end": 999001,
      "timestamp": "15:59"
    },
    {
      "speaker": "Ryo",
      "text": "AIの流れで言うと仕事で使う機械とかはありますか?",
      "start": 999001,
      "end": 1005327,
      "timestamp": "16:39"
    },
    {
      "speaker": "Suguru",
      "text": "AI用ですか?",
      "start": 1005327,
      "end": 1006639,
      "timestamp": "16:45"
    },
    {
      "speaker": "Ryo",
      "text": "そうですね、なんか普通にプロンプトンみたいなのとかカーソルみたいなツールとかもあると思うそう。",
      "start": 1006639,
      "end": 1014495,
      "timestamp": "16:46"
    },
    {
      "speaker": "Suguru",
      "text": "ですね一応会社としてはチャットGPTとクロードを提供しててチームプランで使えるのでそれは結構使ってますねあとはAIに対して何か制限があるような感じでもないのでそこは自由に使ってます。",
      "start": 1014495,
      "end": 1034823,
      "timestamp": "16:54"
    },
    {
      "speaker": "Ryo",
      "text": "ね先に本当は聞いておけばよかったんですけどなんか日本に日本で働いてた時とこっちで働いてみてギャップみたいなのってありますかそうですね。",
      "start": 1034823,
      "end": 1046478,
      "timestamp": "17:14"
    },
    {
      "speaker": "Suguru",
      "text": "なんかあの早いですよねあの物事が進むスピードというか多分あれなんて言うんですかね決めるべき人がちゃんと決断をするみたいなのがすごいこっちの文化としてあるのかなと思っててあの割とまあこれはその僕のいた会社だけかもしれないですけど日本の会社だとあのどんどんその課長がいてそのじゃあ部長に話を通しに行ってじゃあその関係者全員にちょっと合意をとってみたいなそういうまあいろいろフローがあると思うんですけど結構今の会社あのすぐ決断をしてくれますねボスがはいあとはその各チームのリーダーとかもいるんですけどそのリーダーがやっぱりある程度責任を持って権限も持ってこうしようみたいなのをすぐ方向性を示しているなっていうので物事が進むスピードが速いなっていうのは思い。",
      "start": 1046478,
      "end": 1098112,
      "timestamp": "17:26"
    },
    {
      "speaker": "Ryo",
      "text": "ます逆にネガティブなものとかありますかなんかこれは日本の方がいいなみたいないや、。",
      "start": 1098112,
      "end": 1108732,
      "timestamp": "18:18"
    },
    {
      "speaker": "Suguru",
      "text": "これすごく考えてたんですけど、アメリカ人はって言ったらあれだな、文章長いと読まないですね、あの人たち。",
      "start": 1108732,
      "end": 1121056,
      "timestamp": "18:28"
    },
    {
      "speaker": "Ryo",
      "text": "でも、僕も読まないかもしんない。",
      "start": 1121056,
      "end": 1126783,
      "timestamp": "18:41"
    },
    {
      "speaker": "Suguru",
      "text": "何でしょう、結構そのいろんなメッセージにその情報量結構詰めてたんですね、僕もそうですけど同僚の日本人もそうなんですけど結構あのこれもあれもみたいに詰めて全部伝えてあげる方がいいだろうみたいなのがやっぱあって日本だと多分そっちの方がいいんですよ、いいんですよって言った。",
      "start": 1126793,
      "end": 1147353,
      "timestamp": "18:46"
    },
    {
      "speaker": "Ryo",
      "text": "んですけどそれがスタンダードですよねはい、。",
      "start": 1147353,
      "end": 1150467,
      "timestamp": "19:07"
    },
    {
      "speaker": "Suguru",
      "text": "でもそれやると多分最初2行ぐらいしか読まないから全然話がなんか噛み合わなくなってみたいな確かに過剰書きで2個までですねなんか最近意識してるのは。",
      "start": 1150467,
      "end": 1163863,
      "timestamp": "19:10"
    },
    {
      "speaker": "Senna",
      "text": "でも人にもよるのかなとかも思いますよね私の周りは本当にコードレビューでもなんかパラグラフみたいにすっごいなんか解説してくれる人とかもいるしなんかやっぱりレコードとして残るからちゃんと書こうと思っている人はいると思うけどかといなんかとはいえすごいなかなか打ってたらもういいからちょっとズームに発砲して出てくる人もいるしなんかせっかち度はやっぱり人によって違うのかなとか思うけどせっかちな人が多い印象確かに私もあるかもしれない。",
      "start": 1163863,
      "end": 1201622,
      "timestamp": "19:23"
    },
    {
      "speaker": "Ryo",
      "text": "です僕なんか結構この頃は間をとってちゃんと書くんだけど最初にtlngreoadでそのポイントだけを絶対やるみたいなあとはなんかその文章をレファレンスとして使うみたいな一応まず書いてtlngreoadも書いてでなんかzomとかに行った時にここでも書いたけどみたいなのでちょっとどっちも残しつつみたいなのはよくやります。でも確かにそうですね、日本人はちゃんと読んでくれてしっかり読んでみたいなのはあるかもしれないです。",
      "start": 1201622,
      "end": 1235448,
      "timestamp": "20:01"
    },
    {
      "speaker": "Suguru",
      "text": "いやそうですね、だからなんか僕も最近その文化というかにあの飲まれてるのかもしれないですけど、なんか長いの見ると長ぇなみたいな思っちゃってあんま読まないみたいな。",
      "start": 1235448,
      "end": 1245672,
      "timestamp": "20:35"
    },
    {
      "speaker": "Ryo",
      "text": "いや、僕も読まないです全然。あのなんかその読まなくても問題なさそうだなって思うともう読めなくなっちゃいますね。",
      "start": 1245672,
      "end": 1253685,
      "timestamp": "20:45"
    },
    {
      "speaker": "Suguru",
      "text": "確かに。そうですね。",
      "start": 1253685,
      "end": 1254626,
      "timestamp": "20:53"
    },
    {
      "speaker": "Ryo",
      "text": "めちゃくちゃ飲まれてる僕は。",
      "start": 1254626,
      "end": 1256925,
      "timestamp": "20:54"
    },
    {
      "speaker": "Suguru",
      "text": "でもやっぱその人によりますねあの綾香さんおっしゃった通りなんかすごく長い文章で送ってくる人もいるし長い文章を読んでくれる人もいるんですけど傾向としてはやっぱりちょっとあの短い短的なのがなんか好まれてる気がしますね。",
      "start": 1256935,
      "end": 1270750,
      "timestamp": "20:56"
    },
    {
      "speaker": "Senna",
      "text": "そうですねメールとかもすごい短くていいから、楽なのは楽ですよね。いきなり担当直入に本題に入れるから、日本みたいにご挨拶とかないし。",
      "start": 1270750,
      "end": 1285196,
      "timestamp": "21:10"
    },
    {
      "speaker": "Suguru",
      "text": "確かにそうですね。でもなんかそう、個人的にはもうちょっと情報入れたいなっていうのはあるんですよね。これも言っとかないとまずいよなみたいなのもあるんですけど、なんかそこをグッと絞って返信が返ってきてから返すみたいな、その情報を言うみたいな。",
      "start": 1285196,
      "end": 1303370,
      "timestamp": "21:25"
    },
    {
      "speaker": "Senna",
      "text": "必要になった時にだけ使うみたいなね。",
      "start": 1303370,
      "end": 1306533,
      "timestamp": "21:43"
    },
    {
      "speaker": "Suguru",
      "text": "はい、なんかその方がいいのかなって思いながら働いてます。",
      "start": 1306533,
      "end": 1313085,
      "timestamp": "21:46"
    },
    {
      "speaker": "Ryo",
      "text": "確かに人によってなんか違うし読んでくれる人読んでくれない人いるからそこら辺は難しいはいで。",
      "start": 1313095,
      "end": 1321681,
      "timestamp": "21:53"
    },
    {
      "speaker": "Senna",
      "text": "も書いててお前それ長すぎるよって言ってくる人はいないと思うからなんか自分にとって効率が落ちないのであれば何だろう書く分にはいいのかなって思うけど書いてる時間がすっごい長くって無駄になってるならちょっと考えるかもしれないけど。",
      "start": 1321681,
      "end": 1341075,
      "timestamp": "22:01"
    },
    {
      "speaker": "Suguru",
      "text": "そうですねなんかでもそう最近はなんかこう書いてるうちになんかこんな書かなくていいんじゃねえかなみたいな気持ちも出てきたりするんで難しいですよねなんかこれはまあ自分の中で変化なんですけどいい変化なのか悪い変化なのかよく。",
      "start": 1344277,
      "end": 1361785,
      "timestamp": "22:24"
    },
    {
      "speaker": "Ryo",
      "text": "わからないです確かにまあでも基本的にはなんかやっぱその製品でもちょっとちょっとぐらい微妙でもいいから早く出そうみたいなまさっき言われてた通りあの決めることも早く決めて早く進もうみたいなのが本体にあるからまぁあんまりなんだろカッチリして遅いものよりはあのちゃんとできてないけど早く出してくれる方がありがたがれるがられるというか評価されている印象みたいなのはちょっとありますよねそこは何か確かに日本と違う。",
      "start": 1361785,
      "end": 1391280,
      "timestamp": "22:41"
    },
    {
      "speaker": "Suguru",
      "text": "ところも知れないはいまさにその通りでスタートアップっぽいっていうのもあってですねとにかく動くものを早く出すみたいなのがやっぱりあってそういうのもあって結構コードは割とぐちゃぐちゃだったりするんですけどそれでその結局ビジネスが成功してるんである意味一つの正解というかお題なのかなと思い。",
      "start": 1391280,
      "end": 1410568,
      "timestamp": "23:11"
    },
    {
      "speaker": "Ryo",
      "text": "ますねさっきもちょっとだけ話したんですけど英語とかは今はどうですか苦しんでますそれとも結構さっきの感じだと、チーム内では全然大丈夫だと思うんですけど、こういうミーティングでは、さっき言われたのだとチーム横断したミーティングは結構困るよみたいなのがあると思うんですけど、他ではどうですか?",
      "start": 1410568,
      "end": 1435719,
      "timestamp": "23:30"
    },
    {
      "speaker": "Suguru",
      "text": "えっとそうですねちょっとそのポジションがあの正式雇用になって変わったのもあってたまにそのクライアントとのミーティングに出ないといけなかったりするんですよねそれは結構なんでしょうね失礼があっても当然いけないですし当然その内容も正確に伝えないといけないんですごくプレッシャーを感じてますねエンジニアと。",
      "start": 1435729,
      "end": 1465973,
      "timestamp": "23:55"
    },
    {
      "speaker": "Ryo",
      "text": "したらどういう立場で出られるんですかどういうことを話さないといけないとか聞かないといけないみたい。",
      "start": 1465973,
      "end": 1470719,
      "timestamp": "24:25"
    },
    {
      "speaker": "Suguru",
      "text": "なのあるんですかうーんとまぁ一応技術のなんて言うんですかねリードエンジニアみたいな感じであの紹介されるんであのうちの製品のあの仕様というかあのうちの製品の内部処理でこういうことしてますよみたいのを向こうのデベロッパーとあのすり合わせるみたいな感じがあったりしてですねそういうのは結構あの英語ではそういう意味だと苦労はしてますね。",
      "start": 1470719,
      "end": 1500342,
      "timestamp": "24:30"
    },
    {
      "speaker": "Ryo",
      "text": "それ結構頻繁にあるんですか?",
      "start": 1503209,
      "end": 1505160,
      "timestamp": "25:03"
    },
    {
      "speaker": "Suguru",
      "text": "いやそんなに頻繁にはないですね本当たまにですね月に1回あるかないかみたいな感じなんでまあその何か喫緊の課題とかがあるとポンポンと連続で入ったりするんです。",
      "start": 1505160,
      "end": 1518336,
      "timestamp": "25:05"
    },
    {
      "speaker": "Ryo",
      "text": "けどそしたら短期的な目標みたいなこういうAIみたいなのを使ってもうちょっと。",
      "start": 1518336,
      "end": 1526659,
      "timestamp": "25:18"
    },
    {
      "speaker": "Senna",
      "text": "AIを。",
      "start": 1526659,
      "end": 1526839,
      "timestamp": "25:26"
    },
    {
      "speaker": "Ryo",
      "text": "仕事に取り入れていくじゃない間違った話だとえっとなんだろうaiを使った仕事というかそのそこらへんを関わってみたいってことだったんですけど長期的にはどういうふうなんだろうキャリアを考えて。",
      "start": 1529071,
      "end": 1542593,
      "timestamp": "25:29"
    },
    {
      "speaker": "Suguru",
      "text": "いるこれ難しいんですよね結局僕もあんまりそのこっちに骨を埋めようみたいな気持ちはそんなになくて日本に帰国したいなっていう気持ちは将来的には帰国したいなって気持ちはあるのでじゃあ日本に帰って何しようかなみたいなのがあんまりなんかイメージ湧かないんですよねそういう意味だと結構そのむしろアドバイスが欲しいぐらいな。",
      "start": 1542593,
      "end": 1570045,
      "timestamp": "25:42"
    },
    {
      "speaker": "Ryo",
      "text": "んですけどなんかありますえ、エンジニアじゃなくてもいいみたいな感じなんですか?それともエンジニアの中でみたいな感じですか?",
      "start": 1570045,
      "end": 1578323,
      "timestamp": "26:10"
    },
    {
      "speaker": "Suguru",
      "text": "エンジニアがいい…難しいですね。なんかエンジニア…そうですね、エンジニアがいいですね。",
      "start": 1578323,
      "end": 1586487,
      "timestamp": "26:18"
    },
    {
      "speaker": "Ryo",
      "text": "はい。いや、僕もわかんないですね。僕は5年から10年ぐらいはまだいることを考えてはいるんですけど、日本に帰ってなんかどうしたらいいんですかねわかんないですなんかないし言ったら楽しい仕事ができそうかなとは思うけど給料はめちゃくちゃ落とすことになりそう返しに行くとお金はもらえそうだけどなんかローカライゼーションの仕事とかが多そうだしなんかうんなんか大変そう、日本人と仕事を基本的に日本人のチームとか外資とは言えど、やっぱり日本のカルチャーは結構残ってるとは思うんで、そういう大変なところとかもありそうだなぁと思うし、まぁでもそうですね、僕の中ではまぁ将来的にまぁ10年、5年とか10年とか後には帰ろうかな、まぁでももちろんなんかそのキャリアだけじゃなくて、なんかね、今僕は結婚してるんですけど、子供とか考えたら相手の事情みたいなのもあるんで、ちょっとなんとかも言えないけど、基本的にはそうですね、こっちでいっぱい働いて、なんかその経験を持って日本に帰って有効活用できればいいなみたいな思ってるんですけど、なんか5年とか、どのぐらいの単位でカナダとか北米で働こうかなって思われてるんですか?",
      "start": 1586487,
      "end": 1676050,
      "timestamp": "26:26"
    },
    {
      "speaker": "Suguru",
      "text": "ああ難しいですねでもなんかあと1年とか2年でもういいんじゃないかなっていう気持ちはすごくあるんですけどでもさっきあのおっしゃったようにですねなんかなんて言うんでしょう結構ふわっとした感じでその国米での経験をもとになんか日本で活躍できればいいかなみたいなすごく具体性のない感じの気持ちしか今なくてなんかどうしようかなみたいなその働きたい企業とかあるかなみたいなそういうの調べないとなっていう感じですよね。",
      "start": 1676060,
      "end": 1705833,
      "timestamp": "27:56"
    },
    {
      "speaker": "Senna",
      "text": "どんな働き方をしたいかによってくるんじゃないですかえっとこっちだったらまああの9時6時で働いてると言ってたからあの必ずしも当てはまるかわかんないけどすっごい緩いですよねやっぱ日本に比べてあの朝もゆっくりで残業もなくてで人も結構治療だからそんなストレスななんだろう上司からの圧力もなくあの社会人としては、すごくゆるく働けると思うんです。そこを重視するポイントなんだったら、もしかしたら、こっちに長く行ったほうがいいのかもしれないし。でも、日本のストレスフルな社会でも、別にいいし、お給料もらえて、あの安定は絶対日本の方があるから医療もあるしご飯も美味しいしっていうのを重視だったらもしかしたら早く帰った方が幸せなのかもしれないしあと私思ったのがこの間ポッドキャストでお話ししたあの方もおっしゃってたんですけど転職日本に帰る時に転職エージェントを使って自分のキャリア説明してあのこういう経験をしてきたってお話ししたらすごいなんかいろんな角度から提案してくれたみたいで今まで思ってもなかったキャリアをそこで提案してもらってそっちに移行できたみたいなお話も聞いたので私もそれ聞いた時に人に意見聞くのも面白いのかもなぁと思って自分では思ってなかった角度とかでキャリアを考えてくれたりすると思うのでそれは思いましたそうです。",
      "start": 1707115,
      "end": 1802203,
      "timestamp": "28:27"
    },
    {
      "speaker": "Suguru",
      "text": "ね確かにこの海外来たっていうのもたまたまフロックの記事を見たからっていうのもあるんでそういう知らなかったことを知ると意外とこういう道もあるんだっていうので変わるかもしれないですねすいません相談会みたいになっちゃいました全然全然でも。",
      "start": 1802203,
      "end": 1818457,
      "timestamp": "30:02"
    },
    {
      "speaker": "Senna",
      "text": "私もいつまでやるかわかんないしみんな同じ悩みなんだなと思って確かに。",
      "start": 1818457,
      "end": 1824222,
      "timestamp": "30:18"
    },
    {
      "speaker": "Ryo",
      "text": "そうですねなんかその海外に行きたいって思ってまあ目指してきたわけじゃないですかそこの時のなんていうの目標というかやりたかったことみたいなのは達成できたかなって感じ。",
      "start": 1824222,
      "end": 1835486,
      "timestamp": "30:24"
    },
    {
      "speaker": "Suguru",
      "text": "ですかはい達成できたと思いますあの本当に来る時もやっぱり結構ふわっとした感じで来ちゃったんであのなんて言うんでしょうその北米でエンジニアとして働くみたいなそういうすごく具体的なところまではあまり落とし込まずにあのとりあえず結構勢いみたいな感じで来ちゃったのもあってまあ達成したの。",
      "start": 1835486,
      "end": 1855898,
      "timestamp": "30:35"
    },
    {
      "speaker": "Ryo",
      "text": "かなとは思いますなんか今までのポッドキャスターのあのインタビューしてると結構そこらへんめちゃくちゃ明確な人が多いですよねでも僕も同じでちょっと海外で働いちゃおうかなみたいな感じで来てたんでそういう人の話聞くとおーってなるけど私もそうですよ。",
      "start": 1855898,
      "end": 1876625,
      "timestamp": "30:55"
    },
    {
      "speaker": "Senna",
      "text": "働いてみちゃおうかなって来て働いてみちゃえたから次何しようかなってなるのは普通だと思うし私も同じだし別にエンジニアにこだわらなくてもきっといろんな働き方があるんじゃないかなと思いますいや、。",
      "start": 1876625,
      "end": 1894102,
      "timestamp": "31:16"
    },
    {
      "speaker": "Suguru",
      "text": "よかったです。確かに。みんな結構なんか、具体的な計画を立てて来られてるじゃないですか。すごいなって、本当にすごいなとしか言えないんですけど、逆にこんな勢いで来ちゃって、申し訳ないなぐらいの感じだった。",
      "start": 1894102,
      "end": 1915016,
      "timestamp": "31:34"
    },
    {
      "speaker": "Ryo",
      "text": "そしたら最後に、自分のような、ちょっと経験が日本であるよっていう人、得を考えている人にアドバイスをいただけたらお願いし。",
      "start": 1915016,
      "end": 1926108,
      "timestamp": "31:55"
    },
    {
      "speaker": "Suguru",
      "text": "ますはいそうですねあのまずこれを聞いている時点でまず結構興味があるっていうことだと思うんで結構考えてたんですけどなんか来ることにそんなに意外とリスクってないのかなって僕思ってましてお金はかかりますあとまあ時間もかかりますでまあその就職はできませんでしたで帰ってもまあ何でしょう何年いるかにもよりますけどちょっと1年じゃあその就職活動してただけでお金だけを失った時期があるってだけでなんかじゃあそれがなんか今後の人生に決定的なダメージを与えるかというとなんかそういうわけでもないなっていうのを思っててなんかもし本当にはい今雇用みたいなそのゴブゴブぐらいで揺れてるんだったらもう来ちゃった方が多分いいと思いますなんかたぶんこれで来なかった場合あの時行っときゃよかったって絶対僕だったら思うんですよねある意味、行く、行かないを決めたほうがいいかもしれないですね。行かないなら行かないで、行かないほうが自分にとっていい選択だっていう決定をしてしまえば、多分後悔はないと思うので。",
      "start": 1926108,
      "end": 2003839,
      "timestamp": "32:06"
    },
    {
      "speaker": "Ryo",
      "text": "確かにあと僕、一つカナダで言うとなんですけど、さっきもう前半に言われてたのかな、結構周りでレジュメめちゃくちゃ頑張ってる人たちがいたみたいな、話だったんですけど結構その来てる日本人って意識めちゃくちゃ高いじゃないですかだからなんかその人たちと生活するだけで結構なんか自分もなんか勉強できるというかまぁなんか周りにそういう人たちが多いからってのもあるかもしれないんですけど結構その1年で就職ができなかったとしても結構その成長の機会みたいなのがあるのかなって感じるのでなんかそれでなんか僕が来た時に一緒に来た、一緒に来たんじゃないけどその同じ時期にいた人たちでまあ僕今も8年もいるんで結構帰っている人は多いんですけどでもその就職しなかったとしても結構なんていうんだろう日本で活躍しているメンバーは多いのかなって思うのでなんかそういうのもありますよねただまああの就職っていうあれだけではまあ失敗はしてしまったのまあ就職はこっちではできなかったかもしれないけどなんかその1年はすごい役に立ってるのかなみたいなの見えるのでいやはい。",
      "start": 2003839,
      "end": 2063684,
      "timestamp": "33:23"
    },
    {
      "speaker": "Suguru",
      "text": "あのおっしゃる通りだと思っててなんか僕こっち来るまで全然その他のなんて言うんでしょあの別のあのなんて言うんですかね業界にいるエンジニアとかそういうエンジニアのコミュニティみたいなところに入ってなかったんでこっちに来て初めてそのこんなみんなこういうことをやってきたんだみたいなそういうある意味勉強ですよねそのあのそういう知る機会になったっていうのもあってそこから刺激を受けたりとかもっと頑張らないとなみたいな気持ちになったりしたんであの来ること自体はすごくポジティブな影響があるんじゃないかなと思いますと。",
      "start": 2063684,
      "end": 2096833,
      "timestamp": "34:23"
    },
    {
      "speaker": "Ryo",
      "text": "いうことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2096833,
      "end": 2114848,
      "timestamp": "34:56"
    }
  ],
  "highlight1": "カナダで働く日本人の大きなメリットは、1人だけでいることのアドバンテージがあると感じます、例えば日本人だけのチームではありません。",
  "highlight2": "どうしたらいいか悩む人にもおすすめしたいのが、このポッドキャストで聞くことで、異なる考え方に触れられる機会があるんです。",
  "highlight3": "日本で働いていた時と比較して、早い段階で決断が下されることと、英語を使ったコミュニケーションでのプレッシャーはありますが、将来的に日本に戻ることを 考えているので、経験を積む目的でカナダで働くことは有意義です。"
}