{
  "episodeGuid": "94b3f1cb-b4ac-4b3c-b81a-249460b83178",
  "episodeTitle": "文系SEから有名SaaSのiOSエンジニアへ！コロナ禍の就活を乗り越えたキャリア戦略（前半）#34",
  "transcribedAt": "2026-02-23T07:45:58.338Z",
  "duration": 2482,
  "fullText": "そしたら始めていきましょう今回はトロントで就職されたしょうこさんに来ていただきましたよろしくお願いしますはいよろしくお願いしますトロントしょうこさんも久しぶりですよねというかいつトロント行かれたんですかちなみにえっとトラントは2020年とか6年前とかですねそうだったのか今回の就職がきっかけとかじゃなかったんですねいや全然1回目の就職でトラントになったのでそこからですね今のじゃあ今回あの就職決まったよっていうのって1社目じゃないんですかそうですねえっと今今回は3社目ですねおーすげー僕と同じだ僕も3社目で、そう。そうなんですね、全然覚えてなかった。そしたらとりあえず最初に経歴から簡単に聞いてもいいですか?最初、何だろう、カナダに来る前ぐらいから、大学卒業からとかでも何でもいいんですけど。はい、じゃあ経歴は、大学は一応文系、の国際文化学部の大学に行ってましてその後に就職でシステムエンジニアになりましたいわゆる文系からシステムエンジニアっていうパターンですねそこで日本で4年弱ぐらい働いてカナダに来て今はiOSエンジニアとして働いてるって形ですねなんかいろいろ聞きたいことがあるけどとりあえずシステムエンジニアっていうのはなんかいわゆるSIRのなんだろう住宅開発のみたいな感じなんですかそうですねはいそうですそうですそこで開発をすごいマイナーな言語を使って開発をするのとあとはセキュリティのチームに所属したりもしてました7言語ってなんすか、こぼるすか?いや、こぼるやったらよかったんですけどこぼるはまだ知られてるほうで知られてますねVizっていうVizブラウザーっていうなんかVizブラウザー?聞いたことあるけどなんだかわかんないよねなんか独自の多分その会社がその業務用のアプリを簡単に作れますよみたいな感じで走ってる環境があってそこで使われてる多分Vizっていう言語になると思うんですけどそれをやってましたなるほどなるほどめちゃめちゃマイナーでちなみに僕ももともとSIRでSEやってたんですけど、ブラックでした?ブラックどうでしょうね、なんかバワハラとかはなかったですけど、まあでも長時間労働やったなぁとは思いますねまあそうですよね、やっぱりそうですよね7、8年前とかそんなレベルになってくるとね、もうそうですね、そういう時代もあったかなっていうことで、あんまりちょっとツッコむといろんなことが起こられそうだから、確かに。僕とカナダだったら全然いいんですけど、まあいいや。じゃあそしたら、3、4年経験して、もうその2社目とかは行かずにカナダ?そうですね。なんか大学が国際なんとか学部っていうふうに言われてたと思うんですけど、それはなんか英語とかを勉強する学部なんですか?そうですね、英語も込みで、でもどっちかって言うとなんか、文化的な、歴史を学びましょうとか、政治どうなってますとか、なんかいろん、結構幅広く、なんでもあの興味のあることを、なんか学ぶって形ですね。もともと英語になんか興味あったんですか?英語っていうよりは、なんか海外のなんか国の文化とか、どういう歴史なんだろうとか、どういう人が暮らしてるんだろうみたいなところに興味があったって感じ。じゃあ、SEになろうっていう決める前から、大学に入る時点で、そのうち海外に行きたいみたいなのとか、行きたいまではわかんないけど、興味はあって、その学部を選んで、今、カナダにいるみたいな感じなんですね。そうですね。なるほどですね。国際学科。多いっすよね、日本は文系からいったエンジニアっていう方々。やっぱフロックメンバー相当多いですよね。はい。それもいいところでもある気がしますけどね。確かに、なれるのはめちゃくちゃいいですよね。こっちってでも、なんか、UBCとか、僕UBCの何の略でしたっけ、ユニバーシティオブブリティッシュコロンビアかそこら辺いってもやっぱでもIT系じゃないとやっぱ就職結構難しいみたいなのは結構言うからなんか状況的にはそのまあ同じなのかなと思いつつこっちの人何やるんですかね全然わかんないけど何って言うと?その、文系へ行った人たちみたいなのはどういうことをやるのかなみたいな確かに、なんでしょうねー総合職的な?誰もわからないことを投げかけてしまう確かに、いや、僕予想しかできないからやめよう確かに、それはまあそのうちなんか詳しい人に聞いてみましょう多分、大体何人かそしたらごめんなさい、どうぞいいじゃああのそうてがまあseっていう分でねまあそのちょっとすごくマイナーなじゃあ言語をちょっと扱えれてっていう分で4年間くらいでしたけど5年間くらいそうですね4年弱くらい4年弱くらいか経験積んでっていう部分であのまあその後多分カナダっていうね話もしくもちろんなるのかなというふうに思うんですけどまぁ海外やっぱり行こうと思ったのってエンジニアっていう職業にやっぱついていて海外が近いからなのかって思ったのが一つとやっぱり言うてもやっぱりそのwebとかねなんか割り返す言語を今までやっていたわけではないっていう部分でまあなどやっぱりあの海外就職をするっていうのにあたってかなスキル的な部分の不安とかはなかったのか海外に行くっていうふうにおいてスキル的な不安はなかったのかなーっていうもの2点ちょっと気にはなったのがあるんですけど最初のそのやっぱり海外行こうと思った部分に関してやっぱりエンジニア職っていうのは結構影響したイメージですかねそうですね、エンジニア職はかなり影響しましたね。働いて、そもそも海外行こうって思ったのが、働いて、日本で働いていて、長期間、結構、長時間労働が多かったんで、このまま、将来、これで続けていくイメージが湧かないなっていう。のがきっかけで、そのときに、そういえば、大学のとき、海外で働いてみたいなと思ってたなと思って、エンジニアで海外で調べてみたら、結構、待遇も結構安定していて、働きやすいってことだったんで、じゃあ行ってみようかなって感じで行きました。なるほどですね実際そのまあやっぱりねフロックずっとやってるとまあいろんなやっぱり日本からクレンジネンさんの話聞きますがやっぱりね日本でのちょっと長時間労働がっていう一個のねあのバズワードみたいなやつ多いですよね東海オンエアさんも若干その気あったそんなことはなかったかあんたはいや僕は確かに僕は僕も長時間労働ではあったけどなんだろう若かったんですかねあんま気にならなくってまあそれが当たり前だったんだよねで、なんだろう、残業代出るし、やへへとかって思ってたんですけど、僕の場合はなんか、ちょっとフィリピン留学に行って英語喋れるようになった、海外だ、みたいなすごいノリみたいな感じできたんで、僕はあんまりなくて、逆にちょっとだから知りたいんですけど、これから長いこと日本で働くイメージがつかなかったっていうのはそれはなんか長時間労働をなんか10年とか続けていくのは厳しいなっていうふうに思ったんですかそれともなんか10年後の先輩みたいな人たちが会社にいてうわあいつらにはなりたくねーなうわすごいなんかちょっと答えにくい質問しちゃった当たり前だよそれ答えにくいもうちょっとぼんやり言うと具体的にはどういうところがイメージできなくて海外で働こうかなと思ったんですかそうですねどっちかっていうと10年後とかのキャリアを先輩とか上司の人とかを見て例えば日本だったらシステムエンジニアになってそこからプロジェクトマネージャーになってみたいなパスがあると思うんですけどそこを見たときに結局40代になっても50代になっても同じかむしろそれ以上の長時間労働で働いているっていうそのパスをずっと見てた時にこれが40代、今は20代の時は良かったんですけど40代とかになって続けられるのかっていうのと、あとは女性の人のキャリアを見ていると、やっぱ結婚して、なんか出産して、で、結局退職しちゃう人とかが結構多かったので、そこでちょっと考える。ことはありましたね確かにですよねスキルなんかあの僕なんか全てのSEとかそうSEの企業がそうではないとは思うんですけど僕の働いてたところだとちょっとなんかスキルがぼんやりしてるなぁみたいなイメージもあってそれがちょっとなんか不安だったっていうのは僕思ってたんですけどそういうのってありますかなんか結局僕何やってんだろうみたいなのをずっと思っててああそれはそれは確かにありますねあのさっきちょっと言ったように、すごいマイナーな言語をやっていて、そのときもほとんど、結局、プロジェクトの合言葉は、既存に習えなんですよね。なるほどね、分かりやすいわ。あのドキュメントも本当になんか、Gogleで検索して、1個ちゃんとしたドキュメントがあって、それ以外は特に何も出てこないので、なんかわからなかったことがあったら、既存に習えみたいな感じで、結局、まあ割とパズル感覚でボーディングやってたんですね。で、それを見た時に結局基礎もないし、ここからどこ行こうみたいな不安は少しありましたねなるほどですねじゃあその不安の解消先としてといったあれかもしれませんがちょっと次のキャリアを目指す先っていう部分が海外っていうねお話に多分なるのかなというふうに思うんですがいきなりでも海外というのもまあまあレアですよねやっぱり1回ちょっと日本で転職してとかそれこそマイナーではないといったメジャーな言語で仕事1回してから海外いいみたいなのもあんまり考えはしなかったんですかそういやそれも考えたんですけど、なんかその頃にはもうなんか海外楽しそうっていう。テンションの方が高かったので、日本の選択肢はその時はもう考えず、とりあえずやってみようみたいな感じで。それ決めてからカナダに来てコーナーストーンっていう学校に行ったと思うんですけどその時点でウェブ系の技術は自分で学習されてたんですかウェブ系はごめんなさいiOSなんだろうそのごめんなさいモダンな技術というかそのビズっていう言語をずっとやって4年間とかやってきたと思うんですけど、その後、そこからのなんか技術のキャッチアップみたいなのは、なんかどういう風にされたのかなと思って。そうですねウェブ系に関してはビズ以外にちょこっとだけJavaでバックエンドをする機会もあったのでそこでちょっと基礎を学んだっていうのとiOSに関してはもう完全に一からやったのでそれこそUDEMYとかオンラインコースの授業を見て学んだって感じですねじゃあそれはもう本当にカナダに来てからってことになりますよねあそうですね、カナダに来る、なんか来ようと思って準備を始めたあたりからですね。なるほどね。まあちょっと視聴者の方にね、先にちょっと伝えちゃおうかなと思うんですけど、まあしょうこさんが今回むちゃくちゃいいとこにね就職されてっていう部分で、いろいろ今日ちょっとネコリハホイ聞きたいんですけど、前提としてね、割と僕はしょうこさんはとがし用タイプで、気がついたらなんかめっちゃいろんなとこ働いてて、気がついたら転職しててみたいな。あんまり前提を知らないっていうのがまずあるんですよね。なので僕もちょっといろいろとねほりほほり聞きたいなと思うんですが、学校期間中って、2019年に特交されたんでしたっけ?2019年、春?そうですね、2019年の3月くらいに。3月とか、じゃあコロナ前ですね、そうすると。そうですね。よかったよかったでも蓋を開けてみればっていう話いきなりするのもあれですがiOSの勉強をしたりとかプログラミングの勉強をしたりとかモダンな技術もちょっとキャッチアップしなくちゃいけないしっていう部分で就職活動これはお二人もそうかなと思いますが進む年っていうのはコロナなわけじゃないですか割と就活も大変やなっていう時期によく見つかったっていうのもそうだし学生期間中よく技術のキャッチアップできたなっていう部分もそうだし就職活動も含めてちょっと全般聞きたいんですがまず技術的なところからいこうか割と学校の授業ってためになりました?率直にいや授業はそうですね正直あんまりあんまりあの聞いてなかったあんまり聞いてなかったそうですねあそこも飛ばし量タイプなわけですねまあでも結構うまくいってる人たちはだいたいそうなんじゃないですかあんまり期待してないというかそれで言うとあと僕は就職した時点ではコロナにまだなって本当にコロナになったと同時に僕は就職したんですよそうだったっけそうなんで多分そのちょっとあのコンテキストを言うと僕も同じ学校にいて行ってて多分半年違いか3ヶ月違いで多分入っているのかなクラス的にはだから僕の台までは一応そのあのコロナ前に就職を終えてしまった人たちもいてまあ僕も含めて多分そのコーナーストーンの台で言うとそのしょうこさんたちの台からえっとまあ完全にコロナの後というかコロナの中就職するっていう感じになると思うんですけどまあでもそうですよねあのコーナーストーンはすごい何がいいかというとビザをくれる学校なんでそんなに高い金額ではなくビザワークビザを1年くれるっていう良さがあるんでそうですね、あとはあれか、当時はまだワーホリ2年じゃなかったから、しょうこさんの時もワーホリ1年の時ですもんね、だからコープが学校1年、コープ1年、ワーホリ1年っていう王道ルートをたどろうと思った方ですよね、しょうこさんははいそうですねそうですよねなるほどなるほどじゃあ1年間の学校生活っていう部分がとりあえずビザも出るしっていうことだと思いますがそういう勉強に全集中ではなかったみたいな題っていうのは一体しょうこさん何をされていたのかなって学校期間中就活ですかはい学校期間中はひたすら自分でとりあえずiOSを始め始めたのが、カナダに来るって決まってからなので、とりあえずは、基礎をひたすら、授業中もゆうでみとか見ながら、学ぶっていうのと、それをした後に、一応ボランティアを探しまして、たまたま、現地のスタートアップみたいな、すごい小さい会社、スタートアップでもないぐらいの、一人の女の人がやってるんですけど、そこの会社で、その会社っていうのがバンクーバーに来た観光客の人用にクイズを解きながらバンクーバーの街を回れるっていうアプリを作りたいみたいなっていうのがあったのでそこで一応ボランティアとしてiOSアプリを作るっていうふうなことはしてましたなるほどですね素晴らしいそれがじゃあ最初のカナダでおける最初の職歴というかねあのレジュメにかける内容だったってことですもんねそうですね素晴らしいじゃあもう学校期間中に職歴かけることもできたしまああのねコープの期間に打って出るっていうタイミングで割とレジュメ的な準備もできてただろうしっていうまあなんだろうかじゃああの学生期間中はもうねあのiOSデベロッパーとしての仕事とボランティアとっていうんで結構充実したじゃあ1年間だったってイメージだったんですかねそうですね、いやめちゃめちゃ忙しかったってイメージですね、なんかそれ以外もあとなんかハカソンとかをとりあえず何か見れば参加したりとかあとは、あ、あのもともと大志、あのクラスメイトの加藤大志がよくなんかハッカーランクみたいなああやってましたねはい、あの自分で作ってでなんかポストしてみたいなのをやっててあっなんかちょっと面白そうやなっていうので私も違うボランティアとは別のアプリを作ってそこに投稿してみたりとかもしてましたそうなんですねめっちゃインフルエンスされてるね素晴らしいたいしさんはいい印象すごい与えてるよねその後のマリエさんとかもそうだしたいしさんもそうだし個人で自分で作ったやつをうまくプレゼンテーションするみたいなのも文化としてちょっと古くいねづかせてくれたのでありがたい限りですね私それもそうだしやっぱその同じ代に多分結構強めのエンジニアがいるのはいいことですよねそれでいうと僕もあのコウヘイ君っていう今もまあ多分バンクーバーにいると思うんですけど彼がクラスメイトで僕はまあwebなんか同じような多分しょうかさんと割と同じようなキャリアを進んでからえっとこっちでweb系を勉強したんですけど彼もまあすごい何でも詳しくて辞書みたいな何でも答えてくれる人だったんであのすごいなんていうんだろうな活用させてもらったっていうか、色々教えてもらいながらやれたっていうのがあって、そういう人がやっぱクラスとかに1人いるとやっぱりちょっと、なんだろうな、すごい勉強とかもはかどるのかなっていうふうに思いましたね。なんかもう3回も就職したっていう風に聞いて結構僕的にはなんかあんまり日本の人でこっちに来て転職をする人がいなくて結構嬉しいので色々聞いていきたいと思いつつちょっとその前に英語について聞いていきたいなと思うんですけど大学はその英語っていうわけではなくてどっちかというとカルチャー的なものだったっていう風に言ったと思うんですけどそれは英語で勉強されるんですかそれとも全然日本語でやられるやられたんですか全部日本語ですね。英語は英語のクラスがありまして、英語とあと中国語をそれを週に何回かクラスでやるという形ですね。どうだったんですか?ちょっと難しいね、質問。どうなんでしょう?英語、得意…一応、大学期間中に4ヶ月ぐらいかな、トロントに語学留学っていう形で行ってたりもするので、得意というかは、英語はわりと好きだったって感じですね。ちなみになんか、検定とか受けました?検定っていうんだっけある?テストなの?トーイックとかIELTSみたいな。えっと、その当時はあんまり受けたんですけど、ちょっと点数的にはあんまり覚えてないです。でも、そうなる履歴書に書けるような点数じゃなかったです。しかも2019年前後やったら、あれはですね、コーナーストーン、お二人の行かれたカレッジの英語のリクアイメントも結構低かったですよね、多分。あ、そうですね、コーナーストーンは低いしザル、ザルだからねそうですね、あのギリ、ギリ突破したって感じですあ、そうですね、コーナーストーンの時は確か620点ぐらいとかそう、620点でね、今となっては今もうなんか850点とか60点とかないとダメみたいなそんな話とかそんなことになってるんですかそう、てかそもそも今多分トイックダメですねおそらくIL26。\n5かリオリン5120にないと取れなくなったんでもう今と昔はだいぶ違うっていうのはね、実はあるんですがまあ前はほらあのコーナーストーンやっぱりいっぱい来てほしいフェーズで今はね溢れてるっていうか溢れてるとしかっていうとだって僕の時なんてあのトイックの僕紙なくしてて出せないって言ったらじゃあテスト受けてって言われてテストの日風邪引いていかなかったらなんかパスされててなんか受けなくてよかったみたいな今では考えられないですよねなるほどねいや素晴らしいじゃあ英語の部分俺もちょっと気にはなってたんですけどねじゃあ割と留学に行くにあたっての英語の自信みたいなのでじゃあ徒効してから全部身につけてたみたいな感じですか?あ、そうですねまあその大学卒業後も英語は好きやったので徒効するまでになんかまあ例えばネットフリックスとかで英語でなんかドラマとか映画見たりとかあとなんかポッドキャストでなんかバイリンガルニュースっていう英語と日本語を、2人のキャストの出てくる人がいて、1人は英語で、1人は日本語で喋ってるっていうのなんですけど、それとかをわりとずっと聞いてましたね。素晴らしい。だいたいバイリンガルニュースか、あとはNHKの物語のラジオみたいなやつの英語のやつですね。あ、それ僕やったことありますあるっしょ、あの2つだ!なんかさ、NHKのサッシが売ってるやつだよね2週に1回か週に1回か忘れたけどすっごい簡単な英語で物語をさ、ちょっとなんか言ってくれるやつあるじゃないですかなんかあの2つがすごい人気だよな、フロックの中でもまあ確かにバイリンガルニュースは割と面白い、トピック面白いのとあとなんか、まあ一応日本語と英語でなんか午後にやるんで、英語わからなくてもなんとなく意味はわかるみたいなわかるっすよね、素晴らしい。ほかになんか学習され、なんか勉強というかされました?こっち来てでも、来る前でもいいんですけど。えっと、来る前はほんとそれぐらいですね。なんか、えっと、まあ、いわゆる単語帳とか文法帳とかをやろうとは思ってたんですけど、それもなんか最初、まあ、結局3日坊主で続かないっていう感じだったので、はい、続いたのはほんとその2つですね。結構そしたらなんか聞いた感じ僕と同じぐらいのレベルなのかなちょっと僕と一緒にされたらかわいそうかもしれないですけど思うんですけど苦労しませんでした就職したりしてそうですねめちゃめちゃ苦労しました最初ですねハッカソンに行ってなんか源氏の大学生と一緒に一緒にものを作ろうってなった時にまず何を言ってるのかわからない今のところから始まりで就職したら奇跡的に就職はできたんですけどその後なんかチームで最初のオリエンテーションみたいなのはもうほぼほぼ何言ってるのか分からないっていう状況が続いてましたねみんな多分そこは通る道なんだろうなと思いつつそろそろ就職の方に話ちょっと進めましょうかそしたらはいそうですねはい就活じゃないやっぱりすごい気になるのがやっぱり2019年とか20年とかっていうねコロナがそろそろみたいな年のやっぱり就活事情ってだいぶ気になる人も多いと思うんですがショウさんが就活自体をボランティアの後なのかな始められたのっていうのはいつ頃からですかちなみにえっと就活始めたのはコロナが始まってやばいってなってた時期ですねじゃあもう全部クローズしてるじゃないですかはい、もう全部閉まって、人と会うこともできないしっていうところで、みんなもう手探りで、ニュースとかもどんどんみんな首切られてみたいなっていう時期に始めました。僕フロックやってから12年、カナダ住んでから18年になりますが、もうあれ以上にアンコッキーは経験したことがなくて、仕事なんてあるわけないじゃん、みたいなね。そうです、そうです。だったと思いますが、割とその頃でも生活はできてたんですか?日本の仕事とか受けてらっしゃったりとかした?そんなことない?貯金?そうですね、貯金を崩してやっていたのと、あと、思ってたより早く決まったんですよね。結局決まったんですか?はい。就活始めて2、3ヶ月で決まったんですよ。えーすごいじゃあ何2020年の本当にコロナ始まってから3月4月とかだとそうなったら5、6月とかそのくらいだったみたいなえーどういうからくり?いやどうなんでしょうねなんかそうですよもうとりあえずひたすら応募してみてそうですよね、なんか、いや、私もあんまりよくわかってないんですけど。パニックにはなってたけどそのなんかまだなんかそんな何も起こってなかったんじゃないですかわかんないけどえーどうかな僕が決まったのも3月で3月はまだちょっと分かるんだけどでもまぁ2ヶ月かそうでもその2ヶ月はすごかったよだってあのリクルティングの数字とか追いかけるのも俺らの仕事やからそれは追いかけてたけど前半1,2,3月まではむしろむちゃくちゃ景気良かったんですよ今までのねなんか2019年の名残があったから4月5月でニュースです国境閉めます入れられません女性金出すから人よこすなってなってからかがもう求人数は8分の1とか10分の1とかみたいな感じになってたんであれはもうみんな無理だろうなって思ってたんですがはい、まさしくその時期に、なぜか決まったんですよね。しかもあれですよね、なんかあのその時期ってあんまりなんかフロックの中でも、そのSaaSとか、その何だろう、就職した人たちもあんまりいなくて、なんかあんまりなんか知識がたまってなかったのかなみたいなふうに思うんですけど、なんだろう結構みんなマスアプライしてたみたいな。確かに。そうですね。やっぱり結構送られました、その時期とはいえ。そうそれもそうなんですけどあのマスアプライの時期なんですけど結局トータルで40件ぐらいうおーすげーすげーのアプライでしたねなんなんですかラッキーなんですかラッキーなんじゃないかなと私は思ってるんですけどあれかなスキルセットがドハマリしたとかそうですね、一応IOSなので、スキルセットは確かにはまっていたっていうのがあるのと、あと多分この会社に関しては、決め手はよくブロックで言われている、面接でコーディングでうまくできなかった時に、あとでもう1回メールを送って、こういうのでやりましたみたいな感じ。でやったのが一番効果的やったかなとは思います素晴らしい一応業種もそのきっかけかもしれないなって思ったんですけど何の会社だったんですかね最初の一社目って一番最初は一応IoT関係の会社で会社自体はハードウェアを作ってるセンサーとかのハードウェアを作ってる会社でそこで比較的新しくソフトウェア部門ができてでそこで就職っていう形ですね素晴らしいこのポッドキャストに出てくれた人やとヤンマーさんとかもそうよねあの人最初確かiOSかなんかで入ってやっぱIoTの会社やったからやっぱIoTセンシアの最初の入り口ってIoTが多いんですねハードウェア作ってるようなそうですね結構相性がいいですよねIoTって言ったらまあiOSかモバイルが必要だしっていうのもあるし間違いないもうじゃあ一社目からトロントに移ったんですかはい、そうですねそれはバンクーバーから就活をしてトロントに移れますよみたいな感じでしたのかそれとももうトロントに移っちゃってあっちで探してたんですかえっと就活してた時はバンクーバーにいてでも応募はもうどこでも行けますみたいな感じでトロントもバンクーバーもどこでも応募してましたねちなみにちょっとなんか話から外れちゃうんですけど、トロントの方がいいんですか?なんかその留学もトロントだったっていうのも言ってたと思うんですけど、トロントってなんか寒いって言うじゃないですか。僕いまだに行ったことないんだけど、トロント。そうですね、いや正直あのトロント、まあ留学行ってどんな感じか知ってたっていうのもあって、あんまりあの行きたくはなかったんですよね。どちらかというとバンクーバーに行きたくて。珍しいなとね。ってなってたんですけど、そんな状況、選べる状況でもなかったんで、トロントに行きました。今後多分出てくるんじゃないかなと勝手に思っているあのね別の優吾さん松田優吾さんっていう方がフロックのメンバーにいらっしゃってその方もiOSエンジニアでトロント行かれたのでやっぱiOSはねなんだかんだといってトロントしかないとはもちろん言わないけどやっぱトロントの方が多いですよね間違いなくまあiOSというかバンクーバーがweb系しかないっていうそうだね間違いないweb以外の文脈が難しいよねそうですねラウドの求人数はねやっぱトロントの方が多いですちなみに、日本の人とか多いんですか?日本の人とか、日本食とか、なんか結構バンクーバーってやっぱりそこらへんのアクセスはいいじゃないですか。僕もちょっとだけ、ちょっとだけ次の会社でトロントもありかなーって考えてて、なんかどうなんだろうってちょっと個人的に気になったりするんですけど。そうですね、日本人も結構いると思います。でも、バンクーバーと比べたらやっぱり少ないですね。日本食は最近いろいろとできてきてるので、それもバンクーバーに比べたらちょっと少ないかなっていう感じなんですけど、特に困ることはないですね。ラーメンとかお寿司とか、うどんとか、結構アクセスできます。ちなみに、もうじゃあ3社目っていうと、1社目はどのぐらい働かれたんですか?1社目が2020年から2023年の夏ぐらいですね。3年ちょっとぐらい働きました。ということはコープは終わっているし、就労ビザになってるか永住権になってるかみたいな、ちょっといきなりビザステータスから入っちゃって申し訳ないんですが、どのようなステータスだったんですか?えっと、その時はレイオフされたんですよね。ああ、そうだったんだ。レイオフ。大変や。はい。で、その時はちょうど愛住県に申請してるところで。えー。はい。で、そうですよ。なので、なんかやばいビザが切れるっていうすごい狭間の時期でしたね。確かに。でも1社目決まってるし、パッケージはレイオフってことは出てただろうし、はいまあ次の転職活動も一応生き残るみたいなもう2社目にちょっと話を移っちゃって大丈夫なんだろうかこれちょっとパッケージが気になるそうだね、パッケージ気になるなえ、パッケージ、いや、パッケージあんまり覚えてない生活はできるあれですよねそうですね、生活はできるまず会社からのやつがあるのとところはあるのと、ないところでも、IEでしたっけ?名前忘れちゃったな。EIだ、そうだ。エンプロイメントインシャランスか。があると思うんですけど、会社からのパッケージはなんかあったんですか?あ、そうですね。会社のパッケージはあって、たしか3ヶ月分ぐらい。じゃあ結構いい会社だ、すごい。そうですね、間違いない。もらえましたね。そうですね、EIがそのビザのステータスがものすごく微妙なところもあってなんかアプライしたんですけど結局なんかもらえなかったですねえ、そんなことあるんですか?そっかはい、そのビザの本当に切り替え中やったんですよなんかPRのOKですってきてで、なんか申請が出るまでブリッジのオープンワークパーミットとかも申請してた時なのでその微妙なステータスを言ってしまってもらえなかったですねじゃあ会社のパッケージからは出てきたけどEIはもらえずっていうのでなんとか食いつなぎの収穫しのっていうことかそうですねなるほどねやってた内容はIoT周りでハードウェアとつなぐiOSのアプリを作るっていうのは分かりやすいなって思うんですがやっぱりレイオフのきっかけになったのはコロナなのかなっていうレイオフのきっかけ、いやそうですね、コロナはもう終わっていて、もう本当レイオフのきっかけは多分本当に会社がその時重くいってなくて、まあ人員数削減しないといけないというのと、あと多分なんかサフトフォーカスしてないよみたいなことがあってたので全体何人くらいの?同じこと言おうと聞こうとした希望的にはどんな感じの会社だったんですか?えっと希望的には大体でいいですよ大体全然結構大きめの会社ではあったと思いますあのハードウェアの会社としては一応私がいた期間に他の会社買収したりとかもしてちょっと大きくなってっていう形でしたねそういうことですね素晴らしいじゃあそちらの会社でポジションはちなみにIOSデベロッパーシニアとかインターミディットとか分かれてるんですか?ジュニア?いや何も分かれてなくて本当にIOSデベロッパーだけでしたねちなみに、全然、なんだろう、ぼやっとでいいんですけど、日本の、なんだろう、最後の会社と比べて、なんか給料的には上がったんですか、下がったんですか?結構なんか、1社目だとさ、結構下がる、1回目は下がるよって人も結構多いじゃないですか。確かに。そうですね、日本の会社と比べたら上がったイメージですね。素晴らしい、1社目からか、素晴らしいですね。すごいじゃあなんかなんていうか効率がいいですね1年間学校に海外行ってでもうその次からはなんていうんだろう金額的な意味ではキャリアアップになるわけだからそうですねおだしょー素晴らしいじゃあそういった形で日本のようなIOSエンジニアとしてIoTの会社で3年働きレイオフの時期にちょっと当たってしまって一応EIはもらえないけどパッケージは出ててとりあえず食いつなぎはしながらっていう形で転職活動ただやっぱりビザのステータス的にはいくら3年働いていたキャリアがあったとしてもPR申請中のブリッジステータスってことですよねアクパミットとしてはそうですね。転職はできるのか、そのステータスって。そう、そうなんですよね。そこが私も結構心配ではあったんですけど、レイオフをされた後に、とりあえず休憩しようっていうことで、1ヶ月、2ヶ月ぐらいバカンス勝手にしてたんですね。何したんですか?えっと、ピーアイに行ったりしてました。ちょっと待って、ピーアイって何ですか?プリンセドワードアイランドって、赤毛のアンド。カナダなの、あれは?カナダよ、カナダ。そうです、カナダ。そうなんだ、行ってみるといいよ、すごいいいよ。めちゃめちゃよかったです、おすすめ。素晴らしい。じゃあそちらのピアノね、プリンセイドワールドアイランド行ってとかって1ヶ月をね、バカンスバカンスの期間は何?ブリッジステータスのままでってことですよね?あ、そうですそうです、もう結局なんか就活もね、今のステータスが結構割と難しいかなと思ってたので確かにそのままバカンスをしていてで、まあバカンスを終えたぐらいに、たまたまの知り合いの人まあコネクションですね、コネクションの関係でスタートアップの会社に来ないかっていう話があったので、そこにそのまま就職したという形です。やっぱり3年の彼方でのちゃんと職域もあったしこの人やら問題ないやろうみたいなそういうなんかいくらねリファレンスとかリファラルとはいえどもさこうね外国人でちょっとビザの生活も安定せずにってなるとまあまあ雇う側もハードルはあるんじゃないかなと思いますがその辺はやっぱりその3年のキャリアっていう部分が生きたイメージですかねそうですね。もともと業界もIoTの業界の会社だったので、そこは今までの経験をすぐに活かせるっていうところもあって、取ってもらえたっていう形です。樋口そういうことですね深井結構あれですよね心強めですよねレイオフされて1ヶ月バカンスに行けるのは結構頑丈なのかな樋口言えないからね僕はあんまりメンタルっていう言葉のない世界で生きてきたんで、僕も頑丈なんですけど、でもなんかこの頃結構そう、なんかね聞くじゃないですか、メンタルが大変みたいなの結構聞くんで、なんかそうなのかっていうのでこの頃ちょっと学んできたんですけど、それを考えるとレイオフされて1ヶ月、よし休憩っていけんのはなかなか3年働いたからちょっとお金貯めれたとかもいろいろあるとは思いつつそうですね、メンタル強いっていうかあんまり楽観的な感じはあると思いますめっちゃいいと思いますなんとかなるやろうっていう感じであと長い、一定の1ヶ月か2ヶ月のこの際やから楽しもうっていう感じでそうですよねやっぱ会社と会社の間はね1ヶ月ぐらい空けて休んだほうがいいですよねせっかくなんでそうなんかギャップイヤー的なねギャップタイミングみたいなねそうそうそう大人の夏休みですいやてするとあれですねちょっと第3社目の話に行くとすごいちょっと興味津々で俺らもすごい聞いちゃいそうだからあの一旦ちょっと2社目のねあの何ちょっとバカンスに行ったっていうわかりやすいところで一旦してみますかはいそうですねありがとうございます続きは次回ということでということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございまし",
  "utterances": [
    {
      "speaker": "A",
      "text": "そしたら始めていきましょう今回はトロントで就職されたしょうこさんに来ていただきましたよろしくお願いします",
      "start": 48,
      "end": 6977,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "はいよろしくお願いしますトロントしょうこさんも久しぶりですよねというかいつトロント行かれたんですかちなみに",
      "start": 6977,
      "end": 15808,
      "timestamp": "00:06"
    },
    {
      "speaker": "C",
      "text": "えっとトラントは2020年とか6年前とかです",
      "start": 16403,
      "end": 22046,
      "timestamp": "00:16"
    },
    {
      "speaker": "B",
      "text": "ねそうだったのか今回の就職がきっかけとかじゃ",
      "start": 22046,
      "end": 24847,
      "timestamp": "00:22"
    },
    {
      "speaker": "C",
      "text": "なかったんですねいや全然1回目の就職でトラントになったのでそこ",
      "start": 24847,
      "end": 30530,
      "timestamp": "00:24"
    },
    {
      "speaker": "A",
      "text": "からですね今のじゃあ今回あの就職決まったよっていうのって1社目じゃない",
      "start": 30530,
      "end": 36532,
      "timestamp": "00:30"
    },
    {
      "speaker": "C",
      "text": "んですかそうですねえっと今今回は3社目です",
      "start": 36532,
      "end": 41475,
      "timestamp": "00:36"
    },
    {
      "speaker": "A",
      "text": "ねおーすげー僕と同じだ僕も3社目で、そう。そうなんですね、全然覚えてなかった。そしたらとりあえず最初に経歴から簡単に聞いてもいいですか?最初、何だろう、カナダに来る前ぐらいから、大学卒業からとかでも",
      "start": 41475,
      "end": 61233,
      "timestamp": "00:41"
    },
    {
      "speaker": "C",
      "text": "何でもいいんですけど。はい、じゃあ経歴は、大学は一応文系、の国際文化学部の大学に行ってましてその後に就職でシステムエンジニアになりましたいわゆる文系からシステムエンジニアっていうパターンですねそこで日本で4年弱ぐらい働いてカナダに来て今はiOSエンジニアとして働いてるって形ですね",
      "start": 61233,
      "end": 95097,
      "timestamp": "01:01"
    },
    {
      "speaker": "A",
      "text": "なんかいろいろ聞きたいことがあるけどとりあえずシステムエンジニアっていうのはなんかいわゆるSIRのなんだろう住宅開発のみたいな感じなん",
      "start": 96914,
      "end": 105998,
      "timestamp": "01:36"
    },
    {
      "speaker": "C",
      "text": "ですかそうですねはいそうですそうですそこで開発をすごいマイナーな言語を使って開発をするのとあとはセキュリティのチームに所属したりもしてました",
      "start": 105998,
      "end": 122565,
      "timestamp": "01:45"
    },
    {
      "speaker": "B",
      "text": "7言語ってなんすか、",
      "start": 124620,
      "end": 126754,
      "timestamp": "02:04"
    },
    {
      "speaker": "A",
      "text": "こぼるすか?",
      "start": 126754,
      "end": 129238,
      "timestamp": "02:06"
    },
    {
      "speaker": "C",
      "text": "いや、こぼるやったらよかったんですけどこぼるはまだ知られてるほうで知られてますねVizっていうVizブラウザーっていうなんかVizブラウザー?聞いたことあるけどなんだかわかんないよねなんか独自の多分その会社がその業務用のアプリを簡単に作れますよみたいな感じで走ってる環境があってそこで使われてる多分Vizっていう言語になると思うんですけどそれをやってましたなるほどなるほどめちゃめちゃマイナーでちなみに",
      "start": 129238,
      "end": 165426,
      "timestamp": "02:09"
    },
    {
      "speaker": "A",
      "text": "僕ももともとSIRでSEやってたんですけど、ブラックでした?",
      "start": 166662,
      "end": 172756,
      "timestamp": "02:46"
    },
    {
      "speaker": "C",
      "text": "ブラックどうでしょうね、なんかバワハラとかはなかったですけど、まあでも長時間労働やったなぁとは思いますね",
      "start": 172756,
      "end": 181372,
      "timestamp": "02:52"
    },
    {
      "speaker": "A",
      "text": "まあそうですよね、やっぱりそうですよね7、",
      "start": 181372,
      "end": 184084,
      "timestamp": "03:01"
    },
    {
      "speaker": "B",
      "text": "8年前とかそんなレベルになってくるとね、もうそうですね、そういう時代もあったかなっていうことで、あんまりちょっとツッコむといろんなことが起こられそうだから、",
      "start": 184084,
      "end": 194109,
      "timestamp": "03:04"
    },
    {
      "speaker": "A",
      "text": "確かに。僕とカナダだったら全然いいんですけど、まあいいや。じゃあそしたら、3、4年経験して、もうその2社目とかは行かずにカナダ?",
      "start": 194109,
      "end": 204084,
      "timestamp": "03:14"
    },
    {
      "speaker": "C",
      "text": "そうですね。",
      "start": 204084,
      "end": 204974,
      "timestamp": "03:24"
    },
    {
      "speaker": "A",
      "text": "なんか大学が国際なんとか学部っていうふうに言われてたと思うんですけど、それはなんか英語とかを勉強する学部なんですか?",
      "start": 204974,
      "end": 214744,
      "timestamp": "03:24"
    },
    {
      "speaker": "C",
      "text": "そうですね、英語も込みで、でもどっちかって言うとなんか、文化的な、歴史を学びましょうとか、政治どうなってますとか、なんかいろん、結構幅広く、なんでもあの興味のあることを、なんか学ぶって形ですね。",
      "start": 214754,
      "end": 234599,
      "timestamp": "03:34"
    },
    {
      "speaker": "A",
      "text": "もともと英語になんか興味あっ",
      "start": 234599,
      "end": 236419,
      "timestamp": "03:54"
    },
    {
      "speaker": "C",
      "text": "たんですか?英語っていうよりは、なんか海外のなんか国の文化とか、どういう歴史なんだろうとか、どういう人が暮らしてるんだろうみたいなところに興味があったって感じ。",
      "start": 236419,
      "end": 251715,
      "timestamp": "03:56"
    },
    {
      "speaker": "A",
      "text": "じゃあ、SEになろうっていう決める前から、大学に入る時点で、そのうち海外に行きたいみたいなのとか、行きたいまではわかんないけど、興味はあって、その学部を選んで、今、カナダにいるみたいな感じなんですね。",
      "start": 251715,
      "end": 265697,
      "timestamp": "04:11"
    },
    {
      "speaker": "C",
      "text": "そうですね。",
      "start": 265697,
      "end": 267242,
      "timestamp": "04:25"
    },
    {
      "speaker": "B",
      "text": "なるほどですね。国際学科。多いっすよね、日本は文系からいったエンジニアっていう方々。",
      "start": 267252,
      "end": 273140,
      "timestamp": "04:27"
    },
    {
      "speaker": "C",
      "text": "やっぱフロックメンバー相当多いですよね。はい。それもいいところでもある気がしますけどね。",
      "start": 273140,
      "end": 279599,
      "timestamp": "04:33"
    },
    {
      "speaker": "A",
      "text": "確かに、なれるのはめちゃくちゃいいですよね。こっちってでも、なんか、UBCとか、僕UBCの何の略でしたっけ、ユニバーシティオブブリティッシュコロンビアかそこら辺いってもやっぱでもIT系じゃないとやっぱ就職結構難しいみたいなのは結構言うからなんか状況的にはそのまあ同じなのかなと思いつつこっちの人何やるんですかね全然わかんないけど",
      "start": 279599,
      "end": 303047,
      "timestamp": "04:39"
    },
    {
      "speaker": "B",
      "text": "何って言うと?",
      "start": 304145,
      "end": 305726,
      "timestamp": "05:04"
    },
    {
      "speaker": "A",
      "text": "その、文系へ行った人たちみたいなのはどういうことをやるのかなみたいな確かに、",
      "start": 305726,
      "end": 311360,
      "timestamp": "05:05"
    },
    {
      "speaker": "B",
      "text": "なんでしょうねー総合職的な?",
      "start": 311360,
      "end": 316754,
      "timestamp": "05:11"
    },
    {
      "speaker": "A",
      "text": "誰もわからないことを投げかけてしまう確かに、",
      "start": 316754,
      "end": 319766,
      "timestamp": "05:16"
    },
    {
      "speaker": "B",
      "text": "いや、",
      "start": 319766,
      "end": 320426,
      "timestamp": "05:19"
    },
    {
      "speaker": "A",
      "text": "僕予想しかできないからやめよう確かに、それはまあそのうちなんか詳しい人に聞いてみましょう多分、大体何人かそしたらごめんなさい、",
      "start": 320426,
      "end": 331515,
      "timestamp": "05:20"
    },
    {
      "speaker": "B",
      "text": "どうぞいいじゃああのそうてがまあseっていう分でねまあそのちょっとすごくマイナーなじゃあ言語をちょっと扱えれてっていう分で4年間くらいでしたけど5年間くらいそうですね",
      "start": 331515,
      "end": 341867,
      "timestamp": "05:31"
    },
    {
      "speaker": "C",
      "text": "4年弱くらい4年弱くらいか",
      "start": 341867,
      "end": 344108,
      "timestamp": "05:41"
    },
    {
      "speaker": "B",
      "text": "経験積んでっていう部分であのまあその後多分カナダっていうね話もしくもちろんなるのかなというふうに思うんですけどまぁ海外やっぱり行こうと思ったのってエンジニアっていう職業にやっぱついていて海外が近いからなのかって思ったの",
      "start": 344108,
      "end": 357537,
      "timestamp": "05:44"
    },
    {
      "speaker": "A",
      "text": "が一つとやっぱり言うて",
      "start": 357537,
      "end": 359259,
      "timestamp": "05:57"
    },
    {
      "speaker": "B",
      "text": "もやっぱりそのwebとかねなんか割り返す言語を今までやっていたわけではないっていう部分でまあなどやっぱりあの海外就職をするっていうのにあたってかなスキル的な部分の不安とかはなかったのか海外に行くっていうふうにおいてスキル的な不安はなかったのかなーっていうもの2点ちょっと気にはなったのがあるんですけど最初のそのやっぱり海外行こうと思った部分に関してやっぱりエンジニア職っていうのは結構",
      "start": 359259,
      "end": 379436,
      "timestamp": "05:59"
    },
    {
      "speaker": "C",
      "text": "影響したイメージですかねそうですね、エンジニア職はかなり影響しましたね。働いて、そもそも海外行こうって思ったのが、働いて、日本で働いていて、長期間、結構、長時間労働が多かったんで、このまま、将来、これで続けていくイメージが湧かないなっていう。のがきっかけで、そのときに、そういえば、大学のとき、海外で働いてみたいなと思ってたなと思って、エンジニアで海外で調べてみたら、結構、待遇も結構安定していて、働きやすいってことだったんで、じゃあ行ってみようかなって感じで行きました。",
      "start": 379436,
      "end": 424875,
      "timestamp": "06:19"
    },
    {
      "speaker": "B",
      "text": "なるほどですね実際そのまあやっぱりねフロックずっとやってるとまあいろんなやっぱり日本からクレンジネンさんの話聞きますがやっぱりね日本でのちょっと長時間労働がっていう一個のねあのバズワードみたいなやつ多いですよね東海オンエアさんも若干その気あったそんなことはなかったかあんたは",
      "start": 424885,
      "end": 442669,
      "timestamp": "07:04"
    },
    {
      "speaker": "A",
      "text": "いや僕は確かに僕は僕も長時間労働ではあったけどなんだろう若かったんですかねあんま気にならなくってまあそれが当たり前だったんだよねで、なんだろう、残業代出るし、やへへとかって思ってたんですけど、僕の場合はなんか、ちょっとフィリピン留学に行って英語喋れるようになった、海外だ、みたいなすごいノリみたいな感じできたんで、僕はあんまりなくて、逆にちょっとだから知りたいんですけど、これから長いこと日本で働くイメージがつかなかったっていうのはそれはなんか長時間労働をなんか10年とか続けていくのは厳しいなっていうふうに思ったんですかそれともなんか10年後の先輩みたいな人たちが会社にいてうわあいつらにはなりたくねーなうわすごいなんかちょっと答えにくい質問しちゃった",
      "start": 442669,
      "end": 494350,
      "timestamp": "07:22"
    },
    {
      "speaker": "B",
      "text": "当たり前だよそれ答えにくい",
      "start": 494350,
      "end": 495972,
      "timestamp": "08:14"
    },
    {
      "speaker": "A",
      "text": "もうちょっとぼんやり言うと具体的にはどういうところがイメージできなくて海外で働こうかな",
      "start": 498559,
      "end": 506103,
      "timestamp": "08:18"
    },
    {
      "speaker": "C",
      "text": "と思ったんですかそうですねどっちかっていうと10年後とかのキャリアを先輩とか上司の人とかを見て例えば日本だったらシステムエンジニアになってそこからプロジェクトマネージャーになってみたいなパスがあると思うんですけどそこを見たときに結局40代になっても50代になっても同じかむしろそれ以上の長時間労働で働いているっていうそのパスをずっと見てた時にこれが40代、今は20代の時は良かったんですけど40代とかになって続けられるのかっていうのと、あとは女性の人のキャリアを見ていると、やっぱ結婚して、なんか出産して、で、結局退職しちゃう人とかが結構多かったので、そこでちょっと考える。ことはありましたね確か",
      "start": 506103,
      "end": 567549,
      "timestamp": "08:26"
    },
    {
      "speaker": "A",
      "text": "にですよねスキルなんかあの僕なんか全てのSEとかそうSEの企業がそうではないとは思うんですけど僕の働いてたところだとちょっとなんかスキルがぼんやりしてるなぁみたいなイメージもあってそれがちょっとなんか不安だったっていうのは僕思ってたんですけどそういうのってありますかなんか結局僕何やってんだろうみたいなのをずっと思って",
      "start": 567549,
      "end": 589877,
      "timestamp": "09:27"
    },
    {
      "speaker": "C",
      "text": "てああそれはそれは確かにありますねあのさっきちょっと言ったように、すごいマイナーな言語をやっていて、そのときもほとんど、結局、プロジェクトの合言葉は、既存に習えなんですよね。",
      "start": 589877,
      "end": 607840,
      "timestamp": "09:49"
    },
    {
      "speaker": "B",
      "text": "なるほどね、分かりやすいわ。",
      "start": 607840,
      "end": 611452,
      "timestamp": "10:07"
    },
    {
      "speaker": "C",
      "text": "あのドキュメントも本当になんか、Gogleで検索して、1個ちゃんとしたドキュメントがあって、それ以外は特に何も出てこないので、なんかわからなかったことがあったら、既存に習えみたいな感じで、結局、まあ割とパズル感覚でボーディングやってたんですね。で、それを見た時に結局基礎もないし、ここからどこ行こうみたいな不安は少しありましたねなるほど",
      "start": 611462,
      "end": 644615,
      "timestamp": "10:11"
    },
    {
      "speaker": "B",
      "text": "ですねじゃあその不安の解消先としてといったあれかもしれませんがちょっと次のキャリアを目指す先っていう部分が海外っていうねお話に多分なるのかなというふうに思うんですがいきなりでも海外というのもまあまあレアですよねやっぱり1回ちょっと日本で転職してとかそれこそマイナーではないといったメジャーな言語で仕事1回してから海外いいみたいなのもあんまり考えはしなかっ",
      "start": 644615,
      "end": 666063,
      "timestamp": "10:44"
    },
    {
      "speaker": "C",
      "text": "たんですかそういやそれも考えたんですけど、なんかその頃にはもうなんか海外楽しそうっていう。テンションの方が高かったので、日本の選択肢はその時はもう考えず、とりあえずやってみようみたいな感じで。",
      "start": 666063,
      "end": 688740,
      "timestamp": "11:06"
    },
    {
      "speaker": "A",
      "text": "それ決めてからカナダに来てコーナーストーンっていう学校に行ったと思うんですけどその時点でウェブ系の技術は自分で学習されて",
      "start": 688750,
      "end": 701724,
      "timestamp": "11:28"
    },
    {
      "speaker": "C",
      "text": "たんですかウェブ系は",
      "start": 701724,
      "end": 705808,
      "timestamp": "11:41"
    },
    {
      "speaker": "A",
      "text": "ごめんなさいiOSなんだろうそのごめんなさいモダンな技術というかそのビズっていう言語をずっとやって4年間とかやってきたと思うんですけど、その後、そこからのなんか技術のキャッチアップみたいなのは、なんかどういう風にされたのかなと思って。",
      "start": 705808,
      "end": 722860,
      "timestamp": "11:45"
    },
    {
      "speaker": "C",
      "text": "そうですねウェブ系に関してはビズ以外にちょこっとだけJavaでバックエンドをする機会もあったのでそこでちょっと基礎を学んだっていうのとiOSに関してはもう完全に一からやったのでそれこそUDEMYとかオンラインコースの授業を見て学んだって感じですねじゃあ",
      "start": 722870,
      "end": 748276,
      "timestamp": "12:02"
    },
    {
      "speaker": "A",
      "text": "それはもう本当にカナダに来てからってことになり",
      "start": 748276,
      "end": 750877,
      "timestamp": "12:28"
    },
    {
      "speaker": "C",
      "text": "ますよねあそうですね、カナダに来る、なんか来ようと思って準備を始めたあたりからですね。",
      "start": 750877,
      "end": 758419,
      "timestamp": "12:30"
    },
    {
      "speaker": "B",
      "text": "なるほどね。まあちょっと視聴者の方にね、先にちょっと伝えちゃおうかなと思うんですけど、まあしょうこさんが今回むちゃくちゃいいとこにね就職されてっていう部分で、いろいろ今日ちょっとネコリハホイ聞きたいんですけど、前提としてね、割と僕はしょうこさんはとがし用タイプで、気がついたらなんかめっちゃいろんなとこ働いてて、気がついたら転職しててみたいな。あんまり前提を知らないっていうのがまずあるんですよね。なので僕もちょっといろいろとねほりほほり聞きたいなと思うんですが、学校期間中って、2019年に特交されたんでしたっけ?2019年、",
      "start": 758419,
      "end": 792730,
      "timestamp": "12:38"
    },
    {
      "speaker": "C",
      "text": "春?そうですね、2019年の3月くらいに。",
      "start": 792730,
      "end": 796902,
      "timestamp": "13:12"
    },
    {
      "speaker": "B",
      "text": "3月とか、じゃあコロナ前ですね、そうすると。",
      "start": 796902,
      "end": 800023,
      "timestamp": "13:16"
    },
    {
      "speaker": "C",
      "text": "そうですね。",
      "start": 800023,
      "end": 800760,
      "timestamp": "13:20"
    },
    {
      "speaker": "B",
      "text": "よかったよかったでも蓋を開けてみればっていう話いきなりするのもあれですがiOSの勉強をしたりとかプログラミングの勉強をしたりとかモダンな技術もちょっとキャッチアップしなくちゃいけないしっていう部分で就職活動これはお二人もそうかなと思いますが進む年っていうのはコロナなわけじゃないですか割と就活も大変やなっていう時期によく見つかったっていうのもそうだし学生期間中よく技術のキャッチアップできたなっていう部分もそうだし就職活動も含めてちょっと全般聞きたいんですがまず技術的なところからいこうか割と学校の授業ってためになりました?",
      "start": 800770,
      "end": 837904,
      "timestamp": "13:20"
    },
    {
      "speaker": "C",
      "text": "率直にいや授業はそうですね正直あんまりあんまりあの聞いてなかったあんまり聞いてなかったそうですねあそこも飛ばし量",
      "start": 837904,
      "end": 849837,
      "timestamp": "13:57"
    },
    {
      "speaker": "A",
      "text": "タイプなわけですねまあでも結構うまくいってる人たちはだいたいそうなんじゃないですかあんまり期待してないというかそれで言うとあと僕は就職した時点ではコロナにまだなって本当にコロナになったと同時に僕は就職した",
      "start": 849837,
      "end": 871905,
      "timestamp": "14:09"
    },
    {
      "speaker": "B",
      "text": "んですよそうだったっけ",
      "start": 871905,
      "end": 872946,
      "timestamp": "14:31"
    },
    {
      "speaker": "A",
      "text": "そうなんで多分そのちょっとあのコンテキストを言うと僕も同じ学校にいて行ってて多分半年違いか3ヶ月違いで多分入っているのかなクラス的にはだから僕の台までは一応そのあのコロナ前に就職を終えてしまった人たちもいてまあ僕も含めて多分そのコーナーストーンの台で言うとそのしょうこさんたちの台からえっとまあ完全にコロナの後というかコロナの中就職するっていう感じになると思うんですけどまあでもそうですよねあのコーナーストーンはすごい何がいいかというとビザをくれる学校なんでそんなに高い金額ではなくビザワークビザを1年くれるっていう良さがあるんでそうですね、",
      "start": 872946,
      "end": 919540,
      "timestamp": "14:32"
    },
    {
      "speaker": "B",
      "text": "あとはあれか、当時はまだワーホリ2年じゃなかったから、しょうこさんの時もワーホリ1年の時ですもんね、だからコープが学校1年、コープ1年、ワーホリ1年っていう王道ルートをたどろうと思った方ですよね、",
      "start": 919540,
      "end": 933847,
      "timestamp": "15:19"
    },
    {
      "speaker": "C",
      "text": "しょうこさんははいそうですね",
      "start": 933847,
      "end": 935978,
      "timestamp": "15:33"
    },
    {
      "speaker": "B",
      "text": "そうですよねなるほどなるほどじゃあ1年間の学校生活っていう部分がとりあえずビザも出るしっていうことだと思いますがそういう勉強に全集中ではなかったみたいな題っていうのは一体しょうこさん何をされていたのかなって学校期間",
      "start": 935978,
      "end": 949904,
      "timestamp": "15:35"
    },
    {
      "speaker": "C",
      "text": "中就活ですかはい学校期間中はひたすら自分でとりあえずiOSを始め始めたのが、カナダに来るって決まってからなので、とりあえずは、基礎をひたすら、授業中もゆうでみとか見ながら、学ぶっていうのと、それをした後に、一応ボランティアを探しまして、たまたま、現地のスタートアップみたいな、すごい小さい会社、スタートアップでもないぐらいの、一人の女の人がやってるんですけど、そこの会社で、その会社っていうのがバンクーバーに来た観光客の人用にクイズを解きながらバンクーバーの街を回れるっていうアプリを作りたいみたいなっていうのがあったのでそこで一応ボランティアとしてiOSアプリを作るっていうふうなことはしてましたなる",
      "start": 949904,
      "end": 1017482,
      "timestamp": "15:49"
    },
    {
      "speaker": "B",
      "text": "ほどですね素晴らしいそれがじゃあ最初のカナダでおける最初の職歴というかねあのレジュメにかける内容だったってことですもんねそうですね素晴らしいじゃあもう学校期間中に職歴かけることもできたしまああのねコープの期間に打って出るっていうタイミングで割とレジュメ的な準備もできてただろうしっていうまあなんだろうかじゃああの学生期間中はもうねあのiOSデベロッパーとしての仕事とボランティアとっていうんで結構充実したじゃあ1年間だったってイメージだったんです",
      "start": 1017482,
      "end": 1043690,
      "timestamp": "16:57"
    },
    {
      "speaker": "C",
      "text": "かねそうですね、いやめちゃめちゃ忙しかったってイメージですね、なんかそれ以外もあとなんかハカソンとかをとりあえず何か見れば参加したりとかあとは、あ、あのもともと大志、あのクラスメイトの加藤大志がよくなんかハッカーランクみたいなああやってましたねはい、あの自分で作ってでなんかポストしてみたいなのをやっててあっなんかちょっと面白そうやなっていうので私も違うボランティアとは別のアプリを作ってそこに投稿してみたりと",
      "start": 1043690,
      "end": 1084618,
      "timestamp": "17:23"
    },
    {
      "speaker": "B",
      "text": "かもしてましたそう",
      "start": 1084618,
      "end": 1086019,
      "timestamp": "18:04"
    },
    {
      "speaker": "A",
      "text": "なんですねめっちゃインフルエンスさ",
      "start": 1086019,
      "end": 1087020,
      "timestamp": "18:06"
    },
    {
      "speaker": "B",
      "text": "れてるね素晴らしいたいしさんはいい印象すごい与えてるよねその後のマリエさんとかもそうだしたいしさんもそうだし個人で自分で作ったやつをうまくプレゼンテーションするみたいなのも文化としてちょっと古くいねづかせてくれたのでありがたい限り",
      "start": 1087020,
      "end": 1103373,
      "timestamp": "18:07"
    },
    {
      "speaker": "A",
      "text": "ですね私それもそうだしやっぱその同じ代に多分結構強めのエンジニアがいるのはいいことですよねそれでいうと僕もあのコウヘイ君っていう今もまあ多分バンクーバーにいると思うんですけど彼がクラスメイトで僕はまあwebなんか同じような多分しょうかさんと割と同じようなキャリアを進んでからえっとこっちでweb系を勉強したんですけど彼もまあすごい何でも詳しくて辞書みたいな何でも答えてくれる人だったんであのすごいなんていうんだろうな活用させてもらったっていうか、色々教えてもらいながらやれたっていうのがあって、そういう人がやっぱクラスとかに1人いるとやっぱりちょっと、なんだろうな、すごい勉強とかもはかどるのかなっていうふうに思いましたね。なんかもう3回も就職したっていう風に聞いて結構僕的にはなんかあんまり日本の人でこっちに来て転職をする人がいなくて結構嬉しいので色々聞いていきたいと思いつつちょっとその前に英語について聞いていきたいなと思うんですけど大学はその英語っていうわけではなくてどっちかというとカルチャー的なものだったっていう風に言ったと思うんですけどそれは英語で勉強されるんですかそれとも全然日本語でやられるやられたんです",
      "start": 1103373,
      "end": 1173845,
      "timestamp": "18:23"
    },
    {
      "speaker": "C",
      "text": "か全部日本語ですね。英語は英語のクラスがありまして、英語とあと中国語をそれを週に何回かクラス",
      "start": 1173845,
      "end": 1186949,
      "timestamp": "19:33"
    },
    {
      "speaker": "A",
      "text": "でやるという形ですね。どうだったんですか?ちょっと難しいね、",
      "start": 1186949,
      "end": 1195357,
      "timestamp": "19:46"
    },
    {
      "speaker": "C",
      "text": "質問。どうなんでしょう?英語、得意…一応、大学期間中に4ヶ月ぐらいかな、トロントに語学留学っていう形で行ってたりもするので、得意というかは、英語はわりと好きだったって感じです",
      "start": 1195357,
      "end": 1213620,
      "timestamp": "19:55"
    },
    {
      "speaker": "A",
      "text": "ね。ちなみになんか、検定とか受けました?検定っていうんだっけある?テストなの?トーイックとかIELTSみたい",
      "start": 1213620,
      "end": 1219904,
      "timestamp": "20:13"
    },
    {
      "speaker": "C",
      "text": "な。えっと、その当時はあんまり受けたんですけど、ちょっと点数的にはあんまり覚えてないです。でも、そうなる履歴書に書けるような点数じゃなかった",
      "start": 1219904,
      "end": 1232515,
      "timestamp": "20:19"
    },
    {
      "speaker": "B",
      "text": "です。しかも2019年前後やったら、あれはですね、コーナーストーン、お二人の行かれたカレッジの英語のリクアイメントも結構低かったですよね、",
      "start": 1232515,
      "end": 1240913,
      "timestamp": "20:32"
    },
    {
      "speaker": "C",
      "text": "多分。あ、そうですね、コーナーストーンは低いしザル、ザルだからねそうですね、あのギリ、ギリ突破したって感じですあ、そうですね、コーナーストーンの時は確か",
      "start": 1240913,
      "end": 1251518,
      "timestamp": "20:40"
    },
    {
      "speaker": "B",
      "text": "620点ぐらいとかそう、620点でね、今となっては今もうなんか850点とか60点とかないとダメみたいなそんな話とかそんなことになってるんですかそう、てかそもそも今多分トイックダメですねおそらくIL26。\n5かリオリン5120にないと取れなくなったんでもう今と昔はだいぶ違うっていうのは",
      "start": 1251518,
      "end": 1269546,
      "timestamp": "20:51"
    },
    {
      "speaker": "A",
      "text": "ね、実はあるんですがまあ前はほらあのコーナーストーンやっぱりいっぱい来てほしいフェーズで今はね溢れてるっていうか溢れてるとしかっていうとだって僕の時なんてあのトイックの僕紙なくしてて出せないって言ったらじゃあテスト受けてって言われてテストの日風邪引いていかなかったらなんかパスされててなんか受けなくてよかったみたいな今では考えられないですよねなるほど",
      "start": 1269546,
      "end": 1294758,
      "timestamp": "21:09"
    },
    {
      "speaker": "B",
      "text": "ねいや素晴らしいじゃあ英語の部分俺もちょっと気にはなってたんですけどねじゃあ割と留学に行くにあたっての英語の自信みたいなのでじゃあ徒効してから全部身につけてたみたいな感じです",
      "start": 1294758,
      "end": 1304860,
      "timestamp": "21:34"
    },
    {
      "speaker": "C",
      "text": "か?あ、そうですねまあその大学卒業後も英語は好きやったので徒効するまでになんかまあ例えばネットフリックスとかで英語でなんかドラマとか映画見たりとかあとなんかポッドキャストでなんかバイリンガルニュースっていう英語と日本語を、2人のキャストの出てくる人がいて、1人は英語で、1人は日本語で喋ってるっていうのなんですけど、それとかをわりとずっと聞いてました",
      "start": 1304860,
      "end": 1341163,
      "timestamp": "21:44"
    },
    {
      "speaker": "B",
      "text": "ね。素晴らしい。だいたいバイリンガルニュースか、あとはNHKの物語のラジオみたいなやつの英語のやつですね。",
      "start": 1341163,
      "end": 1350361,
      "timestamp": "22:21"
    },
    {
      "speaker": "A",
      "text": "あ、それ僕やったことありますあるっしょ、あの2つだ!なんかさ、NHKのサッシが売ってるやつだよね2週に1回か週に1回",
      "start": 1350371,
      "end": 1356953,
      "timestamp": "22:30"
    },
    {
      "speaker": "B",
      "text": "か忘れたけどすっごい簡単な英語で物語をさ、ちょっとなんか言ってくれるやつあるじゃないですかなんかあの2つがすごい人気だよ",
      "start": 1356953,
      "end": 1362935,
      "timestamp": "22:36"
    },
    {
      "speaker": "C",
      "text": "な、フロックの中でもまあ確かにバイリンガルニュースは割と面白い、トピック面白いのとあとなんか、まあ一応日本語と英語でなんか午後にやるんで、英語わからなくてもなんとなく意味はわかるみたいなわかるっすよ",
      "start": 1362935,
      "end": 1379115,
      "timestamp": "22:42"
    },
    {
      "speaker": "A",
      "text": "ね、素晴らしい。ほかになんか学習され、なんか勉強というかされました?こっち来てでも、来る前でもいいんです",
      "start": 1379115,
      "end": 1388200,
      "timestamp": "22:59"
    },
    {
      "speaker": "C",
      "text": "けど。えっと、来る前はほんとそれぐらいですね。なんか、えっと、まあ、いわゆる単語帳とか文法帳とかをやろうとは思ってたんですけど、それもなんか最初、まあ、結局3日坊主で続かないっていう感じだったので、はい、続いたのはほんとその2つです",
      "start": 1388200,
      "end": 1407971,
      "timestamp": "23:08"
    },
    {
      "speaker": "A",
      "text": "ね。結構そしたらなんか聞いた感じ僕と同じぐらいのレベルなのかなちょっと僕と一緒にされたらかわいそうかもしれないですけど思うんですけど苦労しませんでした就職したりし",
      "start": 1407971,
      "end": 1420402,
      "timestamp": "23:27"
    },
    {
      "speaker": "C",
      "text": "てそうですねめちゃめちゃ苦労しました最初ですねハッカソンに行ってなんか源氏の大学生と一緒に一緒にものを作ろうってなった時にまず何を言ってるのかわからない今のところから始まりで就職したら奇跡的に就職はできたんですけどその後なんかチームで最初のオリエンテーションみたいなのはもうほぼほぼ何言ってるのか分からないっていう状況が続い",
      "start": 1420402,
      "end": 1451426,
      "timestamp": "23:40"
    },
    {
      "speaker": "B",
      "text": "てましたねみんな多分そこは通る道なんだろうなと思いつつそろそろ就職の方に話ちょっと進めましょうかそ",
      "start": 1451426,
      "end": 1459572,
      "timestamp": "24:11"
    },
    {
      "speaker": "A",
      "text": "したらはいそうですね",
      "start": 1459572,
      "end": 1461313,
      "timestamp": "24:19"
    },
    {
      "speaker": "B",
      "text": "はい就活じゃないやっぱりすごい気になるのがやっぱり2019年とか20年とかっていうねコロナがそろそろみたいな年のやっぱり就活事情ってだいぶ気になる人も多いと思うんですがショウさんが就活自体をボランティアの後なのかな始められたのっていうのはいつ頃からですか",
      "start": 1461313,
      "end": 1479993,
      "timestamp": "24:21"
    },
    {
      "speaker": "C",
      "text": "ちなみにえっと就活始めたのはコロナが始まってやばいってなってた時期ですねじゃあ",
      "start": 1479993,
      "end": 1488035,
      "timestamp": "24:39"
    },
    {
      "speaker": "B",
      "text": "もう全部クローズしてるじゃないですか",
      "start": 1488035,
      "end": 1489355,
      "timestamp": "24:48"
    },
    {
      "speaker": "C",
      "text": "はい、もう全部閉まって、人と会うこともできないしっていうところで、みんなもう手探りで、ニュースとかもどんどんみんな首切られてみたいな",
      "start": 1489961,
      "end": 1504126,
      "timestamp": "24:49"
    },
    {
      "speaker": "B",
      "text": "っていう時期に始めました。僕フロックやってから12年、カナダ住んでから18年になりますが、もうあれ以上にアンコッキーは経験したことがなくて、仕事なんてあるわけないじゃん、みたいな",
      "start": 1504126,
      "end": 1520573,
      "timestamp": "25:04"
    },
    {
      "speaker": "C",
      "text": "ね。そうです、そう",
      "start": 1520573,
      "end": 1521934,
      "timestamp": "25:20"
    },
    {
      "speaker": "B",
      "text": "です。だったと思いますが、割とその頃でも生活はできてたんですか?日本の仕事とか受けてらっしゃったりとかした?そんなこと",
      "start": 1521934,
      "end": 1529155,
      "timestamp": "25:21"
    },
    {
      "speaker": "C",
      "text": "ない?貯金?そうですね、貯金を崩してやっていたのと、あと、思ってたより早く決まったんですよね。結局決まったんですか?はい。就活始めて2、3ヶ月で決まったんです",
      "start": 1529155,
      "end": 1547658,
      "timestamp": "25:29"
    },
    {
      "speaker": "B",
      "text": "よ。えーすごいじゃあ何2020年の本当にコロナ始まってから3月4月とかだとそうなったら5、6月とかそのくらいだったみたいなえーどういう",
      "start": 1547658,
      "end": 1559609,
      "timestamp": "25:47"
    },
    {
      "speaker": "C",
      "text": "からくり?いやどうなんでしょうねなんかそうですよもうとりあえずひたすら応募してみてそうですよね、なんか、いや、私もあんまりよくわかってないんです",
      "start": 1559609,
      "end": 1575468,
      "timestamp": "25:59"
    },
    {
      "speaker": "A",
      "text": "けど。パニックにはなってたけどそのなんかまだなんかそんな何も起こってなかったんじゃないですかわかんないけどえーどうかな僕が決まったのも3月で3",
      "start": 1575468,
      "end": 1591431,
      "timestamp": "26:15"
    },
    {
      "speaker": "B",
      "text": "月はまだちょっと分かるんだ",
      "start": 1591431,
      "end": 1592652,
      "timestamp": "26:31"
    },
    {
      "speaker": "A",
      "text": "けどでもまぁ2ヶ月か",
      "start": 1592652,
      "end": 1595714,
      "timestamp": "26:32"
    },
    {
      "speaker": "B",
      "text": "そうでもその2ヶ月はすごかったよだってあのリクルティングの数字とか追いかけるのも俺らの仕事やからそれは追いかけてたけど前半1,2,3月まではむしろむちゃくちゃ景気良かったんですよ今までのねなんか2019年の名残があったから4月5月でニュースです国境閉めます入れられません女性金出すから人よこすなってなってからかがもう求人数は8分の1とか10分の1とかみたいな感じになってたんであれはもうみんな無理だろうなって思ってたんですが",
      "start": 1595714,
      "end": 1631772,
      "timestamp": "26:35"
    },
    {
      "speaker": "C",
      "text": "はい、まさしくその時期に、なぜか決まったんですよ",
      "start": 1632495,
      "end": 1638179,
      "timestamp": "27:12"
    },
    {
      "speaker": "A",
      "text": "ね。しかもあれですよね、なんかあのその時期ってあんまりなんかフロックの中でも、そのSaaSとか、その何だろう、就職した人たちもあんまりいなくて、なんかあんまりなんか知識がたまってなかったのかなみたいなふうに思うんですけど、なんだろう結構みんなマスアプライしてたみたい",
      "start": 1638179,
      "end": 1655470,
      "timestamp": "27:18"
    },
    {
      "speaker": "C",
      "text": "な。確かに。そうです",
      "start": 1655470,
      "end": 1656930,
      "timestamp": "27:35"
    },
    {
      "speaker": "A",
      "text": "ね。やっぱり結構送られました、その時期とは",
      "start": 1656930,
      "end": 1660513,
      "timestamp": "27:36"
    },
    {
      "speaker": "C",
      "text": "いえ。そうそれもそうなんですけどあのマスアプライの時期なんですけど結局トータルで40件ぐらいうおーすげーすげーのアプライでしたねなんなんですかラッキーなんですかラッキーなんじゃないかなと私は思ってるんです",
      "start": 1660513,
      "end": 1683983,
      "timestamp": "27:40"
    },
    {
      "speaker": "B",
      "text": "けどあれかなスキルセットがドハマリしたと",
      "start": 1683983,
      "end": 1687625,
      "timestamp": "28:03"
    },
    {
      "speaker": "C",
      "text": "かそうですね、一応IOSなので、スキルセットは確かにはまっていたっていうのがあるのと、あと多分この会社に関しては、決め手はよくブロックで言われている、面接でコーディングでうまくできなかった時に、あとでもう1回メールを送って、こういうのでやりましたみたいな感じ。でやったのが一番効果的やったかなと",
      "start": 1687625,
      "end": 1721344,
      "timestamp": "28:07"
    },
    {
      "speaker": "B",
      "text": "は思います素晴らしい一応業種もそのきっかけかもしれないなって思ったんですけど何の会社だったんですか",
      "start": 1721344,
      "end": 1728469,
      "timestamp": "28:41"
    },
    {
      "speaker": "C",
      "text": "ね最初の一社目って一番最初は一応IoT関係の会社で会社自体はハードウェアを作ってるセンサーとかのハードウェアを作ってる会社でそこで比較的新しくソフトウェア部門ができてでそこで就職っていう",
      "start": 1728469,
      "end": 1749379,
      "timestamp": "28:48"
    },
    {
      "speaker": "B",
      "text": "形ですね素晴らしいこのポッドキャストに出てくれた人やとヤンマーさんとかもそうよねあの人最初確かiOSかなんかで入ってやっぱIoTの会社やったからやっぱIoTセンシアの最初の入り口ってIoTが多いんですねハードウェア",
      "start": 1749379,
      "end": 1762147,
      "timestamp": "29:09"
    },
    {
      "speaker": "A",
      "text": "作ってるようなそうですね結構相性がいいですよねIoTって言ったらまあiOSかモバイルが必要だしっていうのもあるし間違い",
      "start": 1762147,
      "end": 1771573,
      "timestamp": "29:22"
    },
    {
      "speaker": "B",
      "text": "ないもう",
      "start": 1771573,
      "end": 1774847,
      "timestamp": "29:31"
    },
    {
      "speaker": "A",
      "text": "じゃあ一社目からトロントに",
      "start": 1774847,
      "end": 1776388,
      "timestamp": "29:34"
    },
    {
      "speaker": "C",
      "text": "移ったんですかはい、そうですねそれはバンクーバー",
      "start": 1776388,
      "end": 1780491,
      "timestamp": "29:36"
    },
    {
      "speaker": "A",
      "text": "から就活をしてトロントに移れますよみたいな感じでしたのかそれとももうトロントに移っちゃってあっちで",
      "start": 1780491,
      "end": 1786314,
      "timestamp": "29:40"
    },
    {
      "speaker": "C",
      "text": "探してたんですかえっと就活してた時はバンクーバーにいてでも応募はもうどこでも行けますみたいな感じでトロントもバンクーバーもどこでも応募してまし",
      "start": 1786314,
      "end": 1800202,
      "timestamp": "29:46"
    },
    {
      "speaker": "A",
      "text": "たねちなみにちょっとなんか話から外れちゃうんですけど、トロントの方がいいんですか?なんかその留学もトロントだったっていうのも言ってたと思うんですけど、トロントってなんか寒いって言うじゃないですか。僕いまだに行ったことないんだ",
      "start": 1800202,
      "end": 1815259,
      "timestamp": "30:00"
    },
    {
      "speaker": "C",
      "text": "けど、トロント。そうですね、いや正直あのトロント、まあ留学行ってどんな感じか知ってたっていうのもあって、あんまりあの行きたくはなかったんですよね。どちらかというとバンクーバーに行きたく",
      "start": 1815259,
      "end": 1832814,
      "timestamp": "30:15"
    },
    {
      "speaker": "B",
      "text": "て。珍しいなと",
      "start": 1832814,
      "end": 1835316,
      "timestamp": "30:32"
    },
    {
      "speaker": "C",
      "text": "ね。ってなってたんですけど、そんな状況、選べる状況でもなかったん",
      "start": 1835316,
      "end": 1840740,
      "timestamp": "30:35"
    },
    {
      "speaker": "B",
      "text": "で、トロントに行きました。今後多分出てくるんじゃないかなと勝手に思っているあのね別の優吾さん松田優吾さんっていう方がフロックのメンバーにいらっしゃってその方もiOSエンジニアでトロント行かれたのでやっぱiOSはねなんだかんだといってトロントしかないとはもちろん言わないけどやっぱトロントの方が多いです",
      "start": 1840740,
      "end": 1859092,
      "timestamp": "30:40"
    },
    {
      "speaker": "A",
      "text": "よね間違いなくまあiOSというかバンクーバーがweb系しかないっていうそうだね間違い",
      "start": 1859092,
      "end": 1864535,
      "timestamp": "30:59"
    },
    {
      "speaker": "B",
      "text": "ないweb以外の文脈が難しい",
      "start": 1864535,
      "end": 1867797,
      "timestamp": "31:04"
    },
    {
      "speaker": "C",
      "text": "よねそうですねラウドの求人数はねやっぱトロントの方が多いですちなみ",
      "start": 1867797,
      "end": 1873783,
      "timestamp": "31:07"
    },
    {
      "speaker": "A",
      "text": "に、日本の人とか多いんですか?日本の人とか、日本食とか、なんか結構バンクーバーってやっぱりそこらへんのアクセスはいいじゃないですか。僕もちょっとだけ、ちょっとだけ次の会社でトロントもありかなーって考えてて、なんかどうなんだろうってちょっと個人的に気になったりするんです",
      "start": 1873783,
      "end": 1890254,
      "timestamp": "31:13"
    },
    {
      "speaker": "C",
      "text": "けど。そうですね、日本人も結構いると思います。でも、バンクーバーと比べたらやっぱり少ないですね。日本食は最近いろいろとできてきてるので、それもバンクーバーに比べたらちょっと少ないかなっていう感じなんですけど、特に困ることはないですね。ラーメンとかお寿司とか、うどんとか、結構アクセスでき",
      "start": 1890254,
      "end": 1914690,
      "timestamp": "31:30"
    },
    {
      "speaker": "A",
      "text": "ます。ちなみに、もうじゃあ3社目っていうと、1社目はどのぐらい働かれたんです",
      "start": 1914690,
      "end": 1921012,
      "timestamp": "31:54"
    },
    {
      "speaker": "C",
      "text": "か?1社目が2020年から2023年の夏ぐらいですね。3年ちょっとぐらい働きまし",
      "start": 1921012,
      "end": 1932064,
      "timestamp": "32:01"
    },
    {
      "speaker": "B",
      "text": "た。ということはコープは終わっているし、就労ビザになってるか永住権になってるかみたいな、ちょっといきなりビザステータスから入っちゃって申し訳ないんですが、どのようなステータスだったんです",
      "start": 1932064,
      "end": 1943037,
      "timestamp": "32:12"
    },
    {
      "speaker": "C",
      "text": "か?えっと、その時はレイオフされたんですよ",
      "start": 1943037,
      "end": 1948816,
      "timestamp": "32:23"
    },
    {
      "speaker": "B",
      "text": "ね。",
      "start": 1948816,
      "end": 1948976,
      "timestamp": "32:28"
    },
    {
      "speaker": "A",
      "text": "ああ、そうだったん",
      "start": 1948976,
      "end": 1949997,
      "timestamp": "32:28"
    },
    {
      "speaker": "B",
      "text": "だ。",
      "start": 1949997,
      "end": 1950587,
      "timestamp": "32:29"
    },
    {
      "speaker": "C",
      "text": "レイオフ。大変や。はい。で、その時はちょうど愛住県に申請してるところ",
      "start": 1950587,
      "end": 1958460,
      "timestamp": "32:30"
    },
    {
      "speaker": "B",
      "text": "で。",
      "start": 1958460,
      "end": 1958860,
      "timestamp": "32:38"
    },
    {
      "speaker": "C",
      "text": "えー。はい。で、そうですよ。なので、なんかやばいビザが切れるっていうすごい狭間の時期でした",
      "start": 1958860,
      "end": 1968305,
      "timestamp": "32:38"
    },
    {
      "speaker": "B",
      "text": "ね。確かに。でも1社目決まってるし、パッケージはレイオフってことは出てただろうし、はいまあ次の転職活動も一応生き残るみたいなもう2社目にちょっと話を移っちゃって大丈夫なんだろうか",
      "start": 1968305,
      "end": 1981080,
      "timestamp": "32:48"
    },
    {
      "speaker": "A",
      "text": "これちょっとパッケージが気になるそうだ",
      "start": 1981080,
      "end": 1985122,
      "timestamp": "33:01"
    },
    {
      "speaker": "C",
      "text": "ね、パッケージ気になるなえ、パッケージ、いや、パッケージあんまり覚えてない生活はできるあれですよねそうです",
      "start": 1985122,
      "end": 1996426,
      "timestamp": "33:05"
    },
    {
      "speaker": "A",
      "text": "ね、生活はできるまず会社からのやつがあるのとところはあるのと、ないところでも、IEでしたっけ?名前忘れちゃったな。EIだ、そうだ。エンプロイメントインシャランスか。があると思うんですけど、会社からのパッケージはなんかあったんです",
      "start": 1996426,
      "end": 2015474,
      "timestamp": "33:16"
    },
    {
      "speaker": "C",
      "text": "か?あ、そうですね。会社のパッケージはあって、たしか3ヶ月分",
      "start": 2015474,
      "end": 2021919,
      "timestamp": "33:35"
    },
    {
      "speaker": "A",
      "text": "ぐらい。じゃあ結構いい会社だ、",
      "start": 2021919,
      "end": 2024291,
      "timestamp": "33:41"
    },
    {
      "speaker": "B",
      "text": "すごい。そうです",
      "start": 2024291,
      "end": 2024981,
      "timestamp": "33:44"
    },
    {
      "speaker": "C",
      "text": "ね、間違いない。もらえましたね。そうですね、EIがそのビザのステータスがものすごく微妙なところもあってなんかアプライしたんですけど結局なんかもらえなかったです",
      "start": 2024981,
      "end": 2039876,
      "timestamp": "33:44"
    },
    {
      "speaker": "A",
      "text": "ねえ、そんなことあるんです",
      "start": 2039876,
      "end": 2041377,
      "timestamp": "33:59"
    },
    {
      "speaker": "C",
      "text": "か?そっかはい、そのビザの本当に切り替え中やったんですよなんかPRのOKですってきてで、なんか申請が出るまでブリッジのオープンワークパーミットとかも申請してた時なのでその微妙なステータスを言って",
      "start": 2041377,
      "end": 2063074,
      "timestamp": "34:01"
    },
    {
      "speaker": "B",
      "text": "しまってもらえなかったですねじゃあ会社のパッケージからは出てきたけどEIはもらえずっていうのでなんとか食いつなぎの収穫しのっていうことかそうですねなるほどねやってた内容はIoT周りでハードウェアとつなぐiOSのアプリを作るっていうのは分かりやすいなって思うんですがやっぱりレイオフのきっかけになったのはコロナなのか",
      "start": 2063074,
      "end": 2086440,
      "timestamp": "34:23"
    },
    {
      "speaker": "C",
      "text": "なって",
      "start": 2086440,
      "end": 2086860,
      "timestamp": "34:46"
    },
    {
      "speaker": "A",
      "text": "いうレイオフの",
      "start": 2086860,
      "end": 2089588,
      "timestamp": "34:46"
    },
    {
      "speaker": "C",
      "text": "きっかけ、いやそうですね、コロナはもう終わっていて、もう本当レイオフのきっかけは多分本当に会社がその時重くいってなくて、まあ人員数削減しないといけないというのと、あと多分なんかサフトフォーカスしてないよみたいなことがあってたので",
      "start": 2089588,
      "end": 2112897,
      "timestamp": "34:49"
    },
    {
      "speaker": "A",
      "text": "全体何人くらいの?同じこと言おうと聞こうとした希望的にはどんな感じの会社だったんです",
      "start": 2112897,
      "end": 2118781,
      "timestamp": "35:12"
    },
    {
      "speaker": "C",
      "text": "か?えっと希望的には大体でいいですよ大体全然結構大きめの会社ではあったと思いますあのハードウェアの会社としては一応私がいた期間に他の会社買収したりとかもしてちょっと大きくなってっていう",
      "start": 2118781,
      "end": 2142826,
      "timestamp": "35:18"
    },
    {
      "speaker": "B",
      "text": "形でしたねそういうことですね素晴らしいじゃあそちらの会社でポジションはちなみにIOSデベロッパーシニアとかインターミディットとか分かれてるんです",
      "start": 2142826,
      "end": 2152254,
      "timestamp": "35:42"
    },
    {
      "speaker": "C",
      "text": "か?ジュニア?いや何も分かれてなくて本当にIOSデベロッパーだけでした",
      "start": 2152254,
      "end": 2157859,
      "timestamp": "35:52"
    },
    {
      "speaker": "A",
      "text": "ねちなみに、全然、なんだろう、ぼやっとでいいんですけど、日本の、なんだろう、最後の会社と比べて、なんか給料的には上がったんですか、下がったんですか?結構なんか、1社目だとさ、結構下がる、1回目は下がるよって人も結構多いじゃないです",
      "start": 2157859,
      "end": 2175735,
      "timestamp": "35:57"
    },
    {
      "speaker": "C",
      "text": "か。確かに。そうですね、日本の会社と比べたら上がったイメージです",
      "start": 2175735,
      "end": 2181420,
      "timestamp": "36:15"
    },
    {
      "speaker": "B",
      "text": "ね。素晴らしい、1社目からか、素晴らしいです",
      "start": 2181420,
      "end": 2183202,
      "timestamp": "36:21"
    },
    {
      "speaker": "A",
      "text": "ね。すごいじゃあなんかなんていうか効率がいいですね1年間学校に海外行ってでもうその次からはなんていうんだろう金額的な意味ではキャリアアップになるわけ",
      "start": 2183202,
      "end": 2195153,
      "timestamp": "36:23"
    },
    {
      "speaker": "C",
      "text": "だからそうですねおだし",
      "start": 2195153,
      "end": 2197672,
      "timestamp": "36:35"
    },
    {
      "speaker": "B",
      "text": "ょー素晴らしいじゃあそういった形で日本のようなIOSエンジニアとしてIoTの会社で3年働きレイオフの時期にちょっと当たってしまって一応EIはもらえないけどパッケージは出ててとりあえず食いつなぎはしながらっていう形で転職活動ただやっぱりビザのステータス的にはいくら3年働いていたキャリアがあったとしてもPR申請中のブリッジステータスってことですよねアクパミット",
      "start": 2197672,
      "end": 2223434,
      "timestamp": "36:37"
    },
    {
      "speaker": "C",
      "text": "としてはそうです",
      "start": 2223434,
      "end": 2224736,
      "timestamp": "37:03"
    },
    {
      "speaker": "B",
      "text": "ね。転職はできるのか、そのステータス",
      "start": 2224736,
      "end": 2227638,
      "timestamp": "37:04"
    },
    {
      "speaker": "C",
      "text": "って。そう、そうなんですよね。そこが私も結構心配ではあったんですけど、レイオフをされた後に、とりあえず休憩しようっていうことで、1ヶ月、2ヶ月ぐらいバカンス勝手にしてたんです",
      "start": 2227638,
      "end": 2248158,
      "timestamp": "37:07"
    },
    {
      "speaker": "A",
      "text": "ね。何したんです",
      "start": 2248158,
      "end": 2248779,
      "timestamp": "37:28"
    },
    {
      "speaker": "C",
      "text": "か?えっと、ピーアイに行ったりしてまし",
      "start": 2248779,
      "end": 2252505,
      "timestamp": "37:28"
    },
    {
      "speaker": "A",
      "text": "た。ちょっと待って、ピーアイって何です",
      "start": 2252505,
      "end": 2255748,
      "timestamp": "37:32"
    },
    {
      "speaker": "C",
      "text": "か?プリンセドワードアイランドって、赤毛の",
      "start": 2255748,
      "end": 2259412,
      "timestamp": "37:35"
    },
    {
      "speaker": "A",
      "text": "アンド。カナダなの、あれ",
      "start": 2259412,
      "end": 2262555,
      "timestamp": "37:39"
    },
    {
      "speaker": "B",
      "text": "は?カナダよ、",
      "start": 2262555,
      "end": 2263066,
      "timestamp": "37:42"
    },
    {
      "speaker": "C",
      "text": "カナダ。そうです、",
      "start": 2263066,
      "end": 2263977,
      "timestamp": "37:43"
    },
    {
      "speaker": "A",
      "text": "カナダ。そうなん",
      "start": 2263977,
      "end": 2264998,
      "timestamp": "37:43"
    },
    {
      "speaker": "C",
      "text": "だ、行ってみるといいよ、すごいいいよ。めちゃめちゃよかった",
      "start": 2264998,
      "end": 2268081,
      "timestamp": "37:44"
    },
    {
      "speaker": "B",
      "text": "です、お",
      "start": 2268081,
      "end": 2268421,
      "timestamp": "37:48"
    },
    {
      "speaker": "C",
      "text": "すすめ。",
      "start": 2268421,
      "end": 2269572,
      "timestamp": "37:48"
    },
    {
      "speaker": "B",
      "text": "素晴らしい。じゃあそちらのピアノね、プリンセイドワールドアイランド行ってとかって1ヶ月をね、バカンスバカンスの期間は何?ブリッジステータスのままでってことですよ",
      "start": 2269572,
      "end": 2279355,
      "timestamp": "37:49"
    },
    {
      "speaker": "C",
      "text": "ね?あ、そうですそうです、もう結局なんか就活もね、今のステータスが結構割と難しいかなと思ってたので確かにそのままバカンスをしていてで、まあバカンスを終えたぐらいに、たまたまの知り合いの人まあコネクションですね、コネクションの関係でスタートアップの会社に来ないかっていう話があったので、そこにそのまま就職したという形",
      "start": 2279355,
      "end": 2311644,
      "timestamp": "37:59"
    },
    {
      "speaker": "B",
      "text": "です。やっぱり3年の彼方でのちゃんと職域もあったしこの人やら問題ないやろうみたいなそういうなんかいくらねリファレンスとかリファラルとはいえどもさこうね外国人でちょっとビザの生活も安定せずにってなるとまあまあ雇う側もハードルはあるんじゃないかなと思いますがその辺はやっぱりその3年のキャリアっていう部分が生き",
      "start": 2311644,
      "end": 2330580,
      "timestamp": "38:31"
    },
    {
      "speaker": "C",
      "text": "たイメージですかねそうですね。もともと業界もIoTの業界の会社だったので、そこは今までの経験をすぐに活かせるっていうところもあって、取ってもらえたっていう形",
      "start": 2330580,
      "end": 2346107,
      "timestamp": "38:50"
    },
    {
      "speaker": "A",
      "text": "です。樋口そういうことですね深井結構あれですよね心強めですよねレイオフされて1ヶ月バカンスに行けるのは結構頑丈なのかな樋口言えないからね僕はあんまりメンタルっていう言葉のない世界で生きてきたんで、僕も頑丈なんですけど、でもなんかこの頃結構そう、なんかね聞くじゃないですか、メンタルが大変みたいなの結構聞くんで、なんかそうなのかっていうのでこの頃ちょっと学んできたんですけど、それを考えるとレイオフされて1ヶ月、よし休憩っていけんのはなかなか3年働いたからちょっとお金貯めれたとかもいろいろあるとは思いつつそうです",
      "start": 2346107,
      "end": 2393963,
      "timestamp": "39:06"
    },
    {
      "speaker": "C",
      "text": "ね、メンタル強いっていうかあんまり楽観的な感じはあると思いますめっちゃいいと思いますなんとかなるやろうっていう感じであと長い、一定の1ヶ月か2ヶ月のこの際やから楽しもうっていう感じでそうですよ",
      "start": 2393963,
      "end": 2420406,
      "timestamp": "39:53"
    },
    {
      "speaker": "A",
      "text": "ねやっぱ会社と会社の間はね1ヶ月ぐらい空けて休んだほうがいいですよ",
      "start": 2420406,
      "end": 2424527,
      "timestamp": "40:20"
    },
    {
      "speaker": "B",
      "text": "ねせっかくなんでそうなんかギャップイヤー的なねギャップタイミングみたいなねそうそうそう大人の夏休みですいやてするとあれですねちょっと第3社目の話に行くとすごいちょっと興味津々で俺らもすごい聞いちゃいそうだからあの一旦ちょっと2社目のねあの何ちょっとバカンスに行ったっていうわかりやすいところで一旦し",
      "start": 2424527,
      "end": 2445151,
      "timestamp": "40:24"
    },
    {
      "speaker": "A",
      "text": "てみますかはいそうですねありがとうございます続きは次回",
      "start": 2445151,
      "end": 2449053,
      "timestamp": "40:45"
    },
    {
      "speaker": "C",
      "text": "ということでということ",
      "start": 2449053,
      "end": 2451834,
      "timestamp": "40:49"
    },
    {
      "speaker": "A",
      "text": "で最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございまし",
      "start": 2451834,
      "end": 2469545,
      "timestamp": "40:51"
    }
  ],
  "highlight1": "「文系からシステムエンジニア」っていうパターンでは珍しくないけど、海外でさらにiOSエンジニアとして働くことに成功したしょうこさんのキャリアパスがとても面白いので、詳しくはPodcastで話しています。",
  "highlight2": "日本での就職活動と比べて、カナダでの就職活動はどうだったのかなって思ったら、コロナ真っただ中で就職活動を始めたしょうこさんの話がとても参考になりそうです、詳しくはPodcastで話しています。",
  "highlight3": "しょうこさんが海外で働くことを決意したきっかけや、レイオフを乗り越えて新しいキャリアを築くまでの道のりがとてもインスパイアされるので、詳しくはPodcastで話しています。"
}