{
  "episodeGuid": "9801adae-b65f-478f-837c-c3081ab8e51c",
  "episodeTitle": "モバイルから未経験バックエンドへ！レイオフを乗り越えたエンジニアの転職戦略（後半）#14",
  "transcribedAt": "2025-10-19T06:34:50.053Z",
  "duration": 2619,
  "fullText": "はいそしたら今回も前回に引き続きヤンマーさんに来ていただきましたよろしくお願いし。ますよろしくお願いします一。社目はどのぐらい何年結局3年働いたんです。かなんだかんだ2年半ぐらいですねそれぐらいやってましたもう飽きてましたねで飽きちゃう飽きちゃうね2年ぐらいしたらもうなんかもうなんかいいかなみたいな感じでっていう感じででやっぱモバイルって本当にapi通してフロントだったんでバッグエンドの欲しいてみたいなモバイルのままずっとやるの無理だなと思ってその頃から2年ぐらいした頃からめちゃぐちゃバッグエンド生きてみたいなそういう気持ちがめっちゃありましたねその時から。なんかその1社目のまあなんか働き方日本での働き方の違いとかもちょっと突っ込んで後で聞いていきたいんですけどとりあえずあのインタビューにフォーカスしてえっと2社目2社目のなんだろうえっとインタビューはどうでしたかどんな感じの流れだったんですかそうですね。2社目はどうだったっけな確かそれは一番最初はなんか人事と30分くらい話したのかなでその後にじゃあマネージャーと話すよみたいな感じになってその後もう1回マネージャーと30分くらい話したのかなそれが実際今僕のボスというかマネージャーソフトエンジニアのマネージャーの人ですねその時になんか軽くでも本当それが半分カルチャーフィットみたいななんか感じでしたねなんか馬が合うかみたいな感じだとどういうこと知ってるとかなんかでももうなんかその時点で実はなんかそれも運だったんですけどそのマネージャーが結構前モバイルの開発しててなんかすげー話あってうまかったんでもうその時点で結構ノリノリっていう感じでしたねそれが2回目ででその後に珍しくあのアサイメントを渡されたんですよねあのでそれがどんな内容言っていいのかなまあなんかあのapiを実装してくださいっていう特定のでえっとまあそれ面白かったんですけど本当はあの23時間で解いて提出してねってやつだったんですけどその頃僕なんかめちゃくちゃ他のインタビューがたまたまめっちゃ重なっててでしかも風邪も引いてたねそのインなんかそれもうなんか今やれる状態じゃなかったんですよねだからもう適当になんかもう人事の人にこれごめん来週出していいって言ってそしたらなんか人事ちょっと踊れてたんですけどもういいんじゃないみたいになって来週ってことは結局なんかもう数日間めっちゃ余裕があるんですよねだから結局その2,3時間のやつをもう数日間めっちゃ時間かけてしかもちょうどその頃ってチャットGPTとかが流行りだしたんで僕はそのアサイメントをもう何も分かんなかったんですけどもうググりまくりのチャットGPTでオラオラやって時間かけてガッと退出してその提出した後に最終面接が実際に会社に行って会社で周りの3,4人ぐらいのチームの人と交論しながら作ったAPIを見せて説明して話し合うっていうのを出したねそれが大体の面接の流れでし。た。4ステップじゃあったって。事なのかなそうです。ね最初から合わせるとリクルーター合わせる。と簡単に言うとそうリクルーター。30分って結構長いと思うんですけど何話したん。ですか実際いやーわかんないですちょっともしかしたら15分ぐらいだったかもしれないですねすいませんちょっと覚えてないんですけどもっと軽いかもしれなかったですじゃあ。普通にまあなんだろういつものリクルーター面接みたいな感じであのビザはあるのかみたいななんか本当にひどい人じゃなければ通るあのいつも。の流れのやつって感じですか本当になんかフォースクリーミングみたいな感じのしかも電話だっ。たかなあとはカルチャラルフィットみたいなのをマネージャーと最初に話すっていうのも結構珍しいって珍しいパターンですよねなんかそのアサイメント先に渡した方がその会社は時間取られなくていいじゃないですかできない人はもう次に進まなくていいという確か。に結構そうですねそこは珍しかったかもしれないですね僕もいきなりマネージャーと話すんだみたいなたまにあるんですけど会社によっては。私もそうでした同じ流れマネージャー後に1回目?2回目か。ポンコールの後で。カルチュラルフィットのお話って、ビヘイビュラルクエスチョンとはまだ違うん?そうですねそういう本当のガチガチのビヘイビュアルクエスチョンではなかったですねちょっと含まれてたかもしれないんですけども本当どっちかっていうと最初から話して半分ちょっと技術的な基礎があるのかなみたいな感じなのとなんとなくこいつと一緒に働けそうかなぐらいの感じでいわゆるあなたがものすごい締め切りに追われた経験はありますかどう乗り越えましたかみたいなガチガチなやつは多分なかったかなって覚えてる感じ。ですねまあなんか会社によってそこら辺がすでに何かドキュメント化されててこういうの聞いてねみたいな会社もあれば割とマネージャーのさじ加減みたいなところもあるんでじゃあ山さんの場合は何かマネージャーのさじ加減でそのまあビヘイビラルみたいなこともちょっとは聞きまあ混ぜながらのカラチャラフィットを見たみたい。なそうですねあの完全にうちはノリやと思いますねあの僕もはその後にあの入ってからあのコープのインタビューコープ生のインタビューのプロセスでインタビューの面接感として立つだったんですけど完全にチーム内でどうやって先行召喚みたいな感じでノリで自分を提案してあってやるって感じだったんで本当にそんなにシステムあの構造化されてないっていう感じですねで。じゃあそのマネージャーと話した時にすでにそのなんだろう感覚的にはなんか結構いい感じだなぁみたいなのはあったんですよねそう。ですねでも本当にやっぱその時モバイルで全然バックエンド知らなかったんでなんかこれいけるやろっていう感覚というよりは単純にこの人となんかめっちゃ話し合うなぁみたいな感じなだけでこの後ゲス来たらもうダメかなぁとは思ってましたけど。じゃあ完全バックエンドのポジションなんですかもうフロントとかモバイル他のことはしないみたいな感じのポジションなんですか。実際今やってる業務内容的にはほぼほぼバックエンドですねたまになんかツールとかであのweb系のやつをUIとかをいじることもあるんですけども割合的には28か19ぐらいでバックエンドがメインですねだからマジで良かったですねバック。エンドのどのなんだろう技術に惹かれて興味を持ったんですか?うーんそうっすね結構でもなんかちょっとインフラ周りもあるっていうのがすごい良かったですねなんかバックエンドって言っても本当になんかapiだけ作ってとかもうなんかあのjsonで返してとかじゃなくて結構募集用語を見たらなんかそのクバネティシとかカフカとかそこらへんのやつもあったんでめっちゃいいやんってなってあの全然知らないんですけどでもなんか結構やっぱそういうあのところもやっぱ学びたいなっていうか身につけたいな経験したいなっていうのがあったんでそこはすごい良かったですねそ。したらその後にアセスメントを渡されてまあできないなりになんかえっとググってちょっとgpt使ってなんとか出してえっとその後その次のじゃあ面接にそのまま答えというかをまあみんなにお披露目しながらなんか説明したみたいな感じそうですね。完全にもう公開処刑だったんですけど僕の中ではマジでミスったなって思っててもしかしたらわかんないですけど本当になんか本当にチャットGPTなかったら多分時間かけなかったら無理だったと思うしそこで行ってしかも会社に行って会社のミーティングルームみたいな感じでそこでこうみんな実際いてめっちゃ質問されてしかも結構答えられない部分とかもあってあっそうですねその通りですねみたいな感じだったんで同じであーこれ落ちたかなーっていう感じの僕は雰囲気は勝手に自分で勝ち取っあの勝ち取っちゃないわなんか感じ取ってましたねなんか特にあのはいごめんなさいそれ。はえっとホワイトボードでなんか見せるみたいな感じですかそれとも。なんかそうですねあのホワイトボードじゃなくてあれですねあのもう自分のスクリーンをシェアするっていう感じでしたね何。人ぐらいでどんなポジションの人が何人ぐらいいたん。ですか多分4人だったかな僕を除けば一人がリードで一人がその最初やったマネージャーの人で一人がソフトウェアエンジニアインターミネートぐらいのポジションでもう一人がQAの人でした。ねでその人たちにじゃあまず説明をしてこういう実装にしましたなんか理由はこれこれでみたいなのを説明してじゃあそのでそこから質問されてなんか深掘りしていくみたい。なタイプもうその通りですもう最初に説明してで後から深掘りでこうボットこうしたらどうするとかこういう問題点あるよねーとかあの後他の知識とかもいろいろ聞かれるっていうスタイルでしたねどのぐらいの。長さやられたんですか時間的に全部で1。時間ぐらいかなっていう感じでしたねでそれがもうじゃあ最終それが最終でしたねその後にもうこれ絶対落ちたかなと思ってもうあの今でも覚えてるんですけどオフィスをとぼとぼ去りながらちょっと半泣きになりながら心の中でと思ってたんですけどなんかまさかの1週間か2週間ぐらいした後になんかメール来てすげーいい話あるから電話時間あるみたいな感じで人事から来てマジかよみたい。な感じでした一番ワクワクしていい時間でしたよね。オファー待つ時間一番幸せAPIに。関するツッコミってその当時からAPI設計って色々書籍出てたりとかベストプラクティスとかあるじゃないですか私もそこまで詳しくないんですけどそういうのを勉強していってたのかそれかハインサイトですけどもしかして勉強してたらもっと良かったのかなとかそういうその辺の感想とかありますか?そうですね勉強してたんですけども実装経験が全然なかったっていう感じですねなのでなんか色々書籍は見てたし色々YouTbeとかなんかやってなんとなくAPIってこうやるんだなと思ってたんですけどやっぱいざ自分でもの作れってなると小規模でもあれこれ実際どうしたらいいのかなみたいな感じで結構ちょっとそこの設計が甘かったりっていう部分はあったまぁでも多分一番終わったなって思った瞬間がその僕結構やっぱまぁこれ多分誰でもやると思うんですけどそんななんかその言語とかフレームワークとか知らなくてもバンバン応募するっていうのがやっぱ基本結構重要じゃないですかもうあの最初慣れない人はまぁ今だったら結構あの割と完璧に当たる方をめっちゃやるっていうのも重要かもしれないですけど僕は結構ノリでもどこでもやったりみたいな感じだったんで全然知らなくてもまぁできるっしょみたいな感じできるぞって言ってたんですけどもそれで結構最終までごまかしてたんですけどなんか最後あの最終面接であのマネージャーにじゃあコットフレームワークコットリンとあのスプリングブートってやつだったんですけどジャバ系のあのその経験あるのって言われて僕はないですってその時は嘘つけなかったんで言ったらそのマネージャーがマジかーみたいな感じで結構ちょっとショックを受けたみたいなかっ顔してたんでなんかザワザワみたいな感じになってたんですよねなんかもうそれでああやべえやべえと思ってああもうやっぱついにバレたかみたいな感じで終わりです終わりですバイバイみたいな感じでさよならもう帰りたいですでもここはあのオフィスなんで帰れませんみたいな感じでもうその瞬間から僕はずっと帰りたい帰りたいと思いながらやっ。てましたで、そのいい話っていうのがあって、オファーをもらったと思うんですけど、ちょっとまた前回に引き続き、年収公開してもよかった、いいってことだったんで教えてもらってもいいですか?そうですね、そのポジションは、今のポジションは100Kですね。を下げました下がっちゃいましたの全然いいですもう本当にこれは僕の中ではそのレイオフさえ105の時にもう本当にもレオフ関係なしにとりあえず僕はもう思えるじゃなくても1から最初からでもいいから絶対バックエンドももういいバックエンドめっちゃ行きたいなってでバックエンド行くのはもちろんそのいきなり傾向移動は無理だからもうもうジュニアでもいい、なんならインターシップでもいいから、もうバックエンドから始めたいってなって、そうなったら場合はもう全然60Kとか80Kからでもスタート全然OKっていうメンタルだったんで。もうそっからしたら、え、マジで?って言って。なんかその給与円字も80から100って書いてあったんですよね、バックエンドその文字。なので一番100の方もらってるやんみたいなって。うっせぇやろ?ってなって逆に緊張するわ。え、どういうこと?みたいな感じで結構その当時は、その当時はもう超高ぇじゃんみたいな。僕の中でも頂点でしたね。え、マジで?もうバックエンド100最高やんと思ってたんですけどもやっぱ人っていうのはやっぱりこう慣れっていうかまあ欲があるもんで半年経ってなんかもうバックエンドある程度できるようになったなーって思い出すとめっちゃなんか個人的に低いっていうかいやだってバンクーバーのソフトエンジンはバックエンドがもっと高いんじゃない?あとプラス20Kか30Kあるんじゃね?みたいな感じだって最近はもう低いなぁ低いなぁと思いながらもうなんか上げてくれって交渉しながら転職ちょっと始めちゃったっていう横まみれの感じ。ですね人間上と比べちゃうんでねそこは仕方ないですよねそしたら次にインタビューの話は大体聞けたかなと思うんで1社目のレイオフについて結構よくあることとはいえ、結構貴重な経験ではあるじゃないですか。なんだろうな、どっから話してもらいましょうかね。当日というか、どんな感じで知らされたんですか?それがですね、当日やっぱその朝起きるじゃないですか。でまぁなんかちょっとスラック確認した時になんかその一番一番じゃないですけど街の中でもやっぱこうプロダクトマネージャーみたいなちょっと今日1偉い側の人がいるじゃないですかちょっとみたいなそういうちょっとビジネス側からの偉い人からのなんかダイレクトメールがあってなんかあのご縁だけどちょっとあと15分後に大事なミーティングがあるんだ申し訳ないけど来てくれみたいな明らかに中のトーンが暗いな暗いっていうのがわかるし緊急みたいな感じが来てこの中トーンであって言うちょっと察しましたねそれでなっで、そのミーティングに参加したら、もうなんかめちゃくちゃそのマネージャーみたいな人が、もう神妙な顔で、もう泣きそうな顔で、もう申し訳ないみたいな感じの顔にしてて、しかもその集まってる人が僕だけじゃなくて、なんかチームの人だけじゃなくて、なんかちょっと関係ない人までもいろいろ混じってて、でもなんか10人か分かんないけどそれぐらいの人だったんで、それでほぼほぼ察しましたね。あ、これついに来たわーっていう。で、。それじゃあワンオンじゃなかったんですね。ワンオンじゃなかったですね。じゃあもうレイオフされる人みんな一気にやろうみたいな。そうですね。ミーティングだったのか基本1。On1なんですね僕逆になんか一気にやるっていうのが今までのなんか調子きいてた?分かんない僕は分かんないけど経験した人の話はあんまり聞いたことないからあんまり気にしたことなかったから分かんなかったけどじゃあみんなででもなんかパッケージの話とかってあるじゃないですかその後のこととかってでそのパッケージとかって結構やっぱり給料とかによるからそのあまりお給料の何ヶ月分とかっていう話なのかなちょっとそこらへんも聞いていきましょう。そうですねそこはの本当に間違いなくてなのでその全体の周知はマジで15分からまあ20分ぐらいでもうあのジェラーな情報申し訳ないけども会社の都合上あの君たちをレイオフせざるを得なくなったって本当に申し訳ないとやっぱそういうあの感じでやってでその後に後から詳しい情報はHRがメールするんでそれを見て連絡してくれとりあえずこれは通知のミーティングだみたいな感じで終わるっていう感じですねでその後に実際にちゃんとしたオフィシャルの中メールがHRから来てそこで多分実際にそこからHRとメールでパッケージとかそういうやりとりをやっていくっていう感じだと思います。もしかしたらその前にちょっと1回とのワンワン挟んだかもしれないですけど、ちょっと僕はあんま覚えてないですね。パッケージの内容はどんな感じだったんですか?パッケージはですね、多分セバレンスっていうそういう用の退職金で多分2ヶ月だったかのうちは2ヶ月のフルの給料を出すっていう感じだったと思いますねそれと何かプラスでもう1個ぐらいあった気がするんですけども基本的には2ヶ月ぐらいの給料をプラスで出してくれるっていうのがありましたねあとは何かその保険も2、3ヶ月くらいかな期間忘れちゃったんですけど3ヶ月か半年かわかんないですけども保険はまだ当分は使えるよっていうのも入って。ましたねその時はもうPRになってたんです。よねそうなんですそれが一番良かったですね結構半年か1年か忘れちゃったんですけどももうPR取った後だったんでもう全然っていうしかもちょうど転職活動を始めたぐらいだったんでむしろ僕の場合は時間くれたし転職活動をしながらお金もらえるやんみたいな感じでショックだったんですけど後々ラッキーだなっていうふうに思えるようになりましたね。ちょっと説明入れると、PRっていうのは視聴者のために、多分わかんない人もいると思うんで、永住権っていうもので、カナダで働く上では、ワークビザーとか、日本人だったらワークビザーとか、もしくは永住権、もしくは市民権が必要なんだけど、永住権持ってると転職もできるし、給料も上がりやすいみたいな、よく言われてますね。っていうのがあれなんですけど。A受験ないとアレなんですよね。A受験がいいというよりA受験がないともうその会社にサポートしてもらうしかないんでこういうふうに首切られた時に次がなくなるっていうのが一番やっぱいけない働けない状態になるんでなのでもうA受験超重要でしたね。ラッキーでしたなんか細かいところがあのちょっとaオフの話に戻ってえっと細かいところなんですけどあの会社から支給されてたパソコンとかの荷物とかだったりあのオフィスがもしあったとしたらオフィスに置いてた自分の荷物とかってどうなるん。ですかえーと、それですね、結構面白いんですけど、僕まだ全然語っちゃうんですけど、基本的には荷物はもう全然後からHRがラベルみたいなのが来て、これ貼って送り返してねっていう感じがあれですね。で、オフィスに関しては僕はもう本社がケローナーだったんでオフィスに何かがあるっていうものではなかったんでそこに関しては全然大丈夫だったんですけどもまあでも一番おもろかったのはあれですねそのなんか最初にやった全体通知のなんかそのミーティングがあってでちょっとジンジンとやり取りしたいでその後多分30分かな1時間もしないと思うんですけどもその1時間しないうちにもうなんかいきなり会社のパソコン全部シャットダウンしたんですよねブーンってだって真っ暗になってでそのなんか再起動したらもうなんかあの知らない画面になってるんですよねもうあのログインできない画面になっててもう使えないじゃんみたいな全部データどうなってんのみたいな感じでもう本当にそこから先は全くあの使えないもうもう会社のパソコン使えないでもう僕はリモートだったんでオフィスにも行けないもうその時点で基本的なもう会社とのやり取りはもうレイオフ発あの発表してからもう1時間ぐらいでもう完全にシャットダウンっていう感じでしたねでもう本当に後はやり取りはなんか就活用に使ってたアプライ用に使ってたメールで人事がまあメールくれたんでそこでも本当にあの会社の人ではないアウトな人としてして外部の人として人事とやり取りしながらさっき言ったそのパッケージの話とかやりあのサインの話とかまああとは荷物をどう送り返すかとかそういう事務的な話をひたすらやっていくっていう感じでなのでなんかお別れさよならもないしもう連絡先ももう無理っていうもうやべえっていう感じですよねこれがレオフカーっていう感じ。はすごいしましたよそよそしいのがなんか急にいや、。ほんとにね。嫌なもの感が出て嫌ですね、なんか。そう。こっちはなんか大体、やめるって言ったら2週間前ぐらいに事前に通知してやめないといけないのに、そっちは切るときはもう1時間で切れるの?と思いましたよね。ねー、白状な。まあ何されるかわかんないとかっていうのがまあ特にパソコンでねあのデータを使ってエンジニアリングしてるから変なものとかなんかgitにあげられたりとかそのコード変えられたりとかっていうのは怖いから仕方ないのかなってとか変な情報をね他の社員に拡散されたりとかっていうのも人によっては考える人どもいると思うんでしょうがないかなって思いつつでもやられた側からしたら冷たこいつってなりますよね冷たー。ってなるし超ビビりますねあ、ほんまにそれやるんやってもうスパッて切られるんだなっていう数字でびっくりしましたねそれは失業保険。とかはもらえたんですか?バリバリもらえましたね最初の2ヶ月が会社のセバレンスでそれがあるうちは国も出せないんですけどもそれをカウントした後に多分僕の場合どれくらい出たっけな9ヶ月くらい出たんですよねなのでまとめて出るとかじゃなくてその就活活動をちゃんと2週間に1回報告しないといけないんですけどもその報告している限りは多分月1か2週間に1回国から出てくれてでそれが9ヶ月続くっていう感じなんでいきなり9ヶ月間もらえるわけじゃないんですけどもでも会社の2ヶ月をね9ヶ月やったらもうほぼ1年やんみたいな感じで僕はもう1年間イエーイみたいな感じの自由に逃げたぜみたいな感じ。でしたねそれは全額なんですか?いや、。制限はありますね。その最初の2ヶ月の会社のやつはもう全額なんですけども、政府のやつは基本的にはフルタイムの給料の何%かそれか上限があって、確かマックスが月20…2400か2500か2600か忘れたんですけど、2000から2500ぐらいの。だから日本円にすると20から25万ぐらい月付きもらえるっていう感じですね。これやるとだいぶ余裕を持って転職活動できますね。全然違いますね。だって9ヶ月とかだったらもう200万ぐらいじゃないですか。200万以上か。それを保証されてるって言ったら、もう全然ね、もう気が楽すぎて、ありがとう、カナダっていう感じでしたね、。そこは。なんかその、食いパクれるって思わずにできるのいいですよね、なんか。いや、。間違いないですね。家賃払えないとかってなったら。いや、そう、それがね、全然、そのメンタル的にその焦りがないっていうのがめっちゃ良かったですねそのおかげで結構しっかり転職活動に本格的に集中できたからそれがすごい大きかったですね。僕はでも、逆に、2500しかもらえないんだってちょっと思っちゃいました。逆にね。確かに、ヤンマーさんの状況からしたら全然ね、一人暮らしでいいかもしれないけど、逆に、なんだろう、そういう人じゃなくて、もうお子さんがいて、例えば、家のローン払ってて、車も払ってて、で、子供ののなんだろう保育園みたいなのとかも払ってるって言ったら結構マイナスになるのかなみたいな。それを言うと多分人によって変わるかなって思ってその一人で不要とかない場合はそれぐらいの値段で多分子供とかもし家族がいた場合はもうちょい変わるんじゃないかなって僕ちょっとないんだよさすがにだと思いますねで。もじゃあそしたら9ヶ月はえっと9ヶ月11ヶ月はゆっくりしてから就職したみたいな感じなんですか。なんだかんだ僕結構そこは自分でも何でかわからなかったんですけど結構もう最初レイオフされた後からもう普通に転職がちってましたねもう全くバケーションは全然取らなかったですね不思議なことに休みは良かったんですけどマジで転職に燃えてて。休めないですよね。ちょっとなんか、。それでも怖いじゃないですか。しかもあれなんか、一応カナダのルール的に転職活動を見せないと、職業等を探してるっていうのを見せないともらえないし、あと、かつ国離れたらいけないんですよね。例えば日本。日本行って帰ってて1ヶ月間ぐらい行ってると、その1ヶ月間はもらえないし、なんでかっていうと、カナダで転職活動しないんで、そこはいらないでしょみたいになっちゃうし、しかもその1ヶ月が後々ずれるとかじゃなくて、9ヶ月のうち1ヶ月がなくなって8ヶ月分しかもらえなくなるんで、それ考えるともうなんかしかもそのとき、れいふされたのは5月ぐらいだったんで、なんかもうそっから6月、7月、8月、暑い時期に帰ってもいいないかなと思ったんで、もうなんかそこら辺の夏の時期まるまる転職になった。っていう感じですね。転職活動中でして、政府にはどうやって報告するんですか?何を提出すればいいんですか?なんかあのウェブサイトあるんですよねログインしてアカウント作ってログインしてなんかよくわかんないめっちゃ使いにくいんですけどなんか入ってでなんかポチポチポチってボタンを押してあの今カナダにいますかとかやってもう選択するだけででポチッと最後サブミットを押したら。オッケーっていう感じですねアンケートみたいな感じそうですねアンケート。で一応あの電話もすることもできるんですけどもそれを2週間に1回地味に忘れちゃうっていう地味に。忘れますそうですねそうしたらお金入ってこない。そう結構多くこれこれもマジでどうでもいいっていうかまあマイナー情報なんですけど最初のそのセバレンスの2ヶ月があるじゃないですか彼最初あの全然報告しなくていいんかなと思ってたらその2ヶ月も一応なんかもらってないのに報告しないといけなくてらしくてあのそれで報告なくてちょっと危うく失いかけて危ない危ないってなったんでもしレイオフされた人はそのレイオフされた直後に必要な書類を会社からもらってすぐにそれを政府に提出してそこから毎週毎週じゃない2週間に1回報告するようにしましょう覚えておき。ますいつなるかわかんないからあの、。レイオフされた時には是非ヤンマーさんに連絡して。そうですね、僕に全然相談するように。ツイッターかなんか多分概要欄に載っけておくんで。ありがとうございます。あと僕結構その時になんかノートの記事も書いたんで、レイオフでされたら。確かに。そこら辺も載っけておきます、概要欄に。そしたら。そしたらレイオフも大体いい感じに分かったかなと思うんでちょっと実際働いてみてざっくりした質問になるんですけどどうですか?日本となんか日本の時はちょっと病んじゃったみたいなさっき話があったと前回の中であったと思うんですけどなんかどうですか?僕はたまたまかもしれないですけどめっちゃこっちいいですねめっちゃ相性良くて本当にそれは日本が会社が悪かったっていうよりはなんかただただこっちの馬があってしかも両方ともその前の会社も今の会社もカナディアンのが本社の会社なんでもうみんな人結構めっちゃ優しいし怒らないしなんか失敗に対してめっちゃ寛容だからなんか働いててめっちゃそのどうしようみたいな怖いみたいなあんまないしもう最高っすねもちろんその業務つまんねーとかストレスがめっちゃありますよもうなんかあーもうイライラするっていうのはめちゃくちゃありますけどもなんかそのあー明日から仕事どうしようとか仕事したくないとかでそれでめっちゃこう精神やむっていうのは全然ないとなりましたねありがたい。こと具体的にはなんかどういうところで違いを感じ。ますかそうですねまぁさっき言ったみたいにその失敗に対してめっちゃ寛容なんでなんかこれやったからダメとかお前これどうすんだみたいな言葉遣いも荒くないしもうなんか基本プラス思考っていうか加点方式なんでこういうことに対してすげーいいじゃんとかっていう方式なんですごいこっちもメンタル楽だしやっぱりなんかその年功序列っていうのもないし実力主義だしあとは基本的にそのやっぱりみんなが気持ちよく働けるように環境を整えるっていうのもあるしなんかそういう諸々全部含めてですかねあと5時以降は基本働かなくていいしどんだけ忙しくてもほぼほぼそういう。のはあって逆にじゃあそこら辺がなんだろうその結構上司がきつく当たる人だったんですか日本の時。は上司というか周りやっぱこの先輩後輩っていうのがやっぱこうあのまあ多分業務内容上ちょっとそういうやつあるを得ない場面があったかもしれないですけどもやっぱりこう年功序列でなっちゃうと、どうしてもありますね。結構苦手だったのが、飲み会の場とかで、漢字やらないといけないっていうのが、すごいストレスでした、。日本の場合は。私も漢字経験あるんですけど、この上司はこういう料理が好きだからとか、こういう席順じゃないと満足しないからとか、すっごいつまんないこと気にして、前々から自分の本業以外にすっごい時間割いて、こうプランしないといけなくて何のために私これやってんだろうとかって。思ってますいやー本当にそんな感じでしたねもうなんかその年齢を考えてその胃に優しいところを選ばないといけないとかなんかいや本当に本当に選んちゃんとバッチリ下見も行かないといけないんですよねで下見行ってちゃんとそこで良いところ客の席とか店の雰囲気とかやって選んでいかないといけないし選んでもここのところ脂っこいなーって言われることも全然あったりし。て本当に半分。そうですねまあなんでも本当にそれがある意味その接待するっていうマネジメントの一つなんかな仕事としてまあなんでそれも含めてあのそういうなのに対応できるようになれやみたいなそういうのも含めてまあ仕事できるようになるって言うなぜみたいなそういうなんでまあそういう文化は全然そういうのがあるんだなっていうのはわかるんですけど単純に僕はそういうのが自分には合ってないっていうかそういうのは仕事として入れたくないっていうのが僕の中であったっていう感じですねマストとして入るとすごい嫌だなそしたら。差し支えない範囲で業務内容今バックエンドのことについてやってると思うんですけどドメイン的にはどういう会社とかアプリみたいなのに。携わってるんですか今の会社でいうとセキュリティですね結構認証系のところで例えばアカウント作るときによくパスポートとか運転免許証とか提出してあそうそうIDチェックで顔やったり顔を写真撮ったりそういうのを捌くところですねそういうのをデータとして受け取って他の処理のところに回してその結果を受け取ってやるっていうのをバックエンドとしてそこら辺のAPIとかデータの処理をやるっていうところを今やってるっていう。感じですねじゃあ結構硬いアプリとかに組み込むインテグレーションみたいな形で入れられるみたいなアプリなんですかそれとも結構そのアプリとは離れたところでなんだろうどういう感じで動くんですか?うちはあれですねAPIとして提供してるんでAPIをその結構ビッグテックとかに提供してそこがAPIとして使ってるっていう感じですね最終的な形は基本的にはAPIもうちょっとなんかSDKとかもあったりするんですけどもSDKとAPIでその2つでメインは提供してるんですねうちの部門はです。ねフロントエンドはもうないんですかその会社の機能と。してえーとほぼ一応あるんですよねでそれが例えばそのなんかフロントエンドと合わせて提供しているというプロダクトもあるしそれが一つあるしあとはなんかその社内のツールとしてそのapiを例えば本当に動いてるかっていうのに可視化ツールみたいな中のデブツールみたいなのがあるんでそういうのも一応あの外には出してないけど中のその開発ツールとして作らないといけない作った方が効率化するんでそういうためのフロントエンドをたまにいじるって時もありますでもほぼほぼメインはバックエンドですねここもカナダ。の会社で規模的には前のモバイルの時よりも大きいんですか?それは大きくなりましたねありがたいことに前のケローナの会社は100人ぐらいで技術部分が20人ぐらいだったかな150か100か分かんないですけどもだったんですけど今の会社結構全部で400ぐらいになって技術も結構もう半分か分かんないですけども全然あるっていう感じなんで全然その傾向としてはいい方向に行ったんでそこはすっげー良かったですね本当にバックエンド生きるだけじゃなくてなので一応納得して給料、ちょっと下がったけどいいかなみたいな、その年には。そのカルチャーとか、会社のカルチャーとか働き方とかも前のケローナの会社とまた違う頃はあります。そうですね、ちょっと厳しくなりましたね。前のやつは、もう本当に差別的か、っていうか偏見かもしれないですけど、本当にケローナの白人が多くて、もう本当に西側のカルチャーだったんで、マジでバケーション大切にして、もう50以降働くなんてとんでもねーみたいな感じだったんですけども、今は結構やっぱマルチカルチャーでいろいろあって結構やっぱセキュリティーなんでオンコールとかもあったりするんで忙しい時はちょっとこうあとはなんか結構働くし結構うちなんかリモートでアメリカで在住で働いてる人もコアメンバーで多いんでアメリカ住んでるとみんななんかやる気があったから結構ヨロサクまでやりたい人はやってる人もいるしそうなんで前よりはやっぱりこう結構ガツガツしたっていう感じあるんですけどでもそれを加えても結局はそのうちのチーム自身は結構マネージャーがそのもう本当に知るって言うんですけどももうめっちゃあの入力話となんで僕もこの前その1週間ぐらい親が来た時に案内しててちょっと気になってたんでスラックのメッセージとか見てたらあのスラックのメッセージ見てるのわかるから見るのを禁止しますっていうのを上司が冗談っぽく言ってくれていやもう最高やなぁみたいなありがたいなんで終わったん。だろう。そしたら今まで一社目はモバイルの分野で働いてバックエンドこれから取り組んでみたいこととか関わってみたい仕事とかドメインとかでもいいんですけどありますか?そうですねドメインに関してはそんなにこだわりはないんですけどもいろいろドメインでもいいかなと思ってて分野に関してはやっぱりもうちょっと奥行きたいっていうかバックエンドでもやっぱりもっとデータを扱うところETLみたいな感じの大量のデータを扱うっていうのがすごいスケーリングとか考えてのところをもっとやりたいなっていう感じですねすごいデータ量が多くなった時にどう負荷分散するのかとかそういうのを経験できるとすごい僕のキャリア的にもなんか今後いろいろ対応できそうかなっていうのもあってそこを経験したいからもっともっとこう大きめの会社もっとスケールの大きなものを扱う会社に行きたいなっていうのはすごい世の中で。考えてますねちょっとまあなんか余談みたいな話になるんですけどあの結構意外とそこ携わるのって大変できっとあの大きい会社だともうできてるんですよねそのだからそこからのアップデートとアップデートもなんかあんまりない可能性もあるしだからなんか狙いなんか結構その狙いに行くところが重要なのかもしれないですね例えばなんか僕の今の会社はもちろんそのなんかスケーリングとか考えられて作られてるんですけどまあ今そういうチームの人たちはなんかいろいろやることはあると思うけど最初から作るってことはないし僕たちもどういうふうにそのデータとかが分散されたりとかウェブのインスタンスが違う国にあったりだとかっていうの理解はしてるけどあるっていうのがわかるだけでそこら辺について触れることっていうのが全くなかったりするんでそうなんですねだからなんかちょうど成長してる会社とかもしくは大きい会社でアプリをいっぱい持ってるわなんかまあamazonだとかなんかいろんな企業買収とかいろいろしているところでそこからなんか小さいプロダクトから大きいところまでたぶん触れたりするとまあ触れるのかも。しれないけど結構意外とそこ。ピンポイントで狙いに行くと難しかったりはするかもしれない。ですねそうなんですねめっちゃいいこと知れましたありがとうございますそれ事前に心構えで出ると入った時にもし今後入れた時になんかなんやって思わずに済む。んでなるほどでももちろんデータっていうか自分の会社にあるものなんでこういうふうに動いてるんだとかっていうので理解とかの勉強にはなるから見てて楽しいとは思うけどそこら辺を自分で作っていくっていう経験は意外と難しい経験として得るのは結構難しいの。かなっていうでもそう。いうところがインタビューに出ますもんねビッグテックとか入ろうと思ったら。そうなんですよ、そんな求めてくるから間違いないですよ、。だから勉強してたらいや、。なりますなりますそうなんですよ、。そんな聞かれるからめっちゃやるんかなと思って絶対必要なんだろうなと思ったら意外と場所によってはもう完成されてるっていうのがあるんですねまあ。なんかできる知識を持ってるとかまあそのベースがあってそのまあプロダクト作るチームエンジニアだとしてもそこを生かせるみたいなまあエンジニアを求めてるってことなのかなって僕は思ってますけどどうなんでしょうまあ。そういう意味では結構今の会社ちょうどここの2、3ヶ月一番スケーリングで悩んでる時なんである意味結構勉強になるかもしれないですね今の会社でも今週のリリースもちょうどそれでめっちゃやばかったみたいなのがあったんで。そしたら、今後はシステムデザインみたいなこととか、ちょっと大きい会社経験してみたいとかってしてみたいと思うんですけど、ちょっともっと長い目で見たときに、ずっとカナダにいるとか予定ですかそれともやっぱり日本その後々帰りたいなぁとかもうすでにプランあったりしますかそれともまあ他の国行くとかもあるかも選択肢としてはあると思うんですけどいやー。そこ本当悩みどころであんまり考えてないですねなんか本当にどうなるかわかんないっていうのはあるしAIの感じもあるしなんかキャリアどうなるかわかんないんで僕はあえて逆に今目先のちょっととりあえずポジション的にインターメディアからシニアでの視野を持てるで大規模なあの開発にも経験があるっていうのを目標にあえてその数年先のものだけはまあそのさっそこぐらいまではちょっとカナダでか欧米かわかんないですけどその範囲でできるようにしときたいっていうのがあってそっから先はマジで未知ですねなんかもう理由としてはもう多分その時にならないとわかんないかなっていうのがあってその時に実際になれるかもわかんないしなった場合にじゃあなんかそこで満足して帰るっていう感じもあるかもしれないし逆にもっとカナダ行きたいなとかもあるかもしれないしその時に他のところに行きたいなっていうのもあるかもしれないし多分その時のその結果次第全然変わるから僕はなんかここ数年先ぐらいしか見てなくてそこから先はなんかもう考えないっていうか、考えてないっていうか、難しいところはあるんですね。まあ、ただ…ない。全然じゃあ、カナダに今後もずっと留まる、まあ、定年するまで働くみたいなのもあり得るっていうと…。あり得るかもしれないし、5年後ぐらいにはちょっと他の国行くかなっていうのもあるかもしれないし、本当にいろいろって感じですね。日本はなるかも、可能性ともありかも。日本は全然アリですよ全然アリなんですけど僕の中で今日本帰ってない理由が多分今帰ったら僕はちょっと納得できないなっていうかもう一段階ちょっとカナダで色々経験したいなっていう欲望があるから野望があるから今帰ってないだけでそれがどうなるか次第で結構日本はいつ帰るかっていうのは決めるかもしれないですねもしかしたらもう来年ぐらいに行くってなってるかもしれないですけど今のところちょっとないです。ね。ただ定年後もずっとここで一生っていうのはちょっと考えてないかもしれないですねちょっとそのいろいろ家関係もあるし医療関係もあるんで今のところビジョンとしてずっといれるのかなっていうのもあったりしてでもそこまで長く考えてもちょっと今考えてもいいんじゃないかなっていう感じなんでまあそんな感じですかね確かに、。そうですね。そしたら、最後の質問なんですけど、ヤンマーさんみたいに、少し日本での経験、プログラミングしたことあるよっていう人で、英語はどっちでもいいかな、できてもできないと思うっていう人がいるとして、どんなアドバイスをしてあげられますか?そうですねそこはなんかその決めてる人に対してはもう何も言えることがないっていうか自分なりの方法でやってくださいっていう感じなんですけど迷ってる人がいたらもしあのなんか迷ってていかないとなった時にずっとなんかモヤモヤ感が残りそうみたいな感じがありそうだったらもうとりあえず行ってみるっていうのはありなんじゃないかなーっていうのはすごい思いますねそこだけですかねを言えるのはうんとりあえずやっ行ってから考えろとそうですね、なんかやっぱもしかしたら危険とかリスクとかあるかもしれないですけどでもなんかずっとモヤモヤしたまま残して暮らすっていうのもなんか結構もったいないっていうかなんとなく自分の中でフツフツとこう燃えるものがあるんだったら一回それをバーンとぶつけてみるっていうのはすごいいいんじゃないかなっていうのは思いますねそれがまあカナダじゃなくてもいいし何かしらの形になってもいいんですけども。って思います僕ははいありがとうございましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "はいそしたら今回も前回に引き続きヤンマーさんに来ていただきましたよろしくお願いし。",
      "start": 28,
      "end": 5830,
      "timestamp": "00:00"
    },
    {
      "speaker": "Yanmer",
      "text": "ますよろしくお願いします一。",
      "start": 5830,
      "end": 7651,
      "timestamp": "00:05"
    },
    {
      "speaker": "Ryo",
      "text": "社目はどのぐらい何年結局3年働いたんです。",
      "start": 7651,
      "end": 10992,
      "timestamp": "00:07"
    },
    {
      "speaker": "Yanmer",
      "text": "かなんだかんだ2年半ぐらいですねそれぐらいやってましたもう飽きてましたねで飽きちゃう飽きちゃうね2年ぐらいしたらもうなんかもうなんかいいかなみたいな感じでっていう感じででやっぱモバイルって本当にapi通してフロントだったんでバッグエンドの欲しいてみたいなモバイルのままずっとやるの無理だなと思ってその頃から2年ぐらいした頃からめちゃぐちゃバッグエンド生きてみたいなそういう気持ちがめっちゃありましたねその時から。",
      "start": 10992,
      "end": 41687,
      "timestamp": "00:10"
    },
    {
      "speaker": "Ryo",
      "text": "なんかその1社目のまあなんか働き方日本での働き方の違いとかもちょっと突っ込んで後で聞いていきたいんですけどとりあえずあのインタビューにフォーカスしてえっと2社目2社目のなんだろうえっとインタビューはどうでしたかどんな感じの流れだったんですかそうですね。",
      "start": 42965,
      "end": 61321,
      "timestamp": "00:42"
    },
    {
      "speaker": "Yanmer",
      "text": "2社目はどうだったっけな確かそれは一番最初はなんか人事と30分くらい話したのかなでその後にじゃあマネージャーと話すよみたいな感じになってその後もう1回マネージャーと30分くらい話したのかなそれが実際今僕のボスというかマネージャーソフトエンジニアのマネージャーの人ですねその時になんか軽くでも本当それが半分カルチャーフィットみたいななんか感じでしたねなんか馬が合うかみたいな感じだとどういうこと知ってるとかなんかでももうなんかその時点で実はなんかそれも運だったんですけどそのマネージャーが結構前モバイルの開発しててなんかすげー話あってうまかったんでもうその時点で結構ノリノリっていう感じでしたねそれが2回目ででその後に珍しくあのアサイメントを渡されたんですよねあのでそれがどんな内容言っていいのかなまあなんかあのapiを実装してくださいっていう特定のでえっとまあそれ面白かったんですけど本当はあの23時間で解いて提出してねってやつだったんですけどその頃僕なんかめちゃくちゃ他のインタビューがたまたまめっちゃ重なっててでしかも風邪も引いてたねそのインなんかそれもうなんか今やれる状態じゃなかったんですよねだからもう適当になんかもう人事の人にこれごめん来週出していいって言ってそしたらなんか人事ちょっと踊れてたんですけどもういいんじゃないみたいになって来週ってことは結局なんかもう数日間めっちゃ余裕があるんですよねだから結局その2,3時間のやつをもう数日間めっちゃ時間かけてしかもちょうどその頃ってチャットGPTとかが流行りだしたんで僕はそのアサイメントをもう何も分かんなかったんですけどもうググりまくりのチャットGPTでオラオラやって時間かけてガッと退出してその提出した後に最終面接が実際に会社に行って会社で周りの3,4人ぐらいのチームの人と交論しながら作ったAPIを見せて説明して話し合うっていうのを出したねそれが大体の面接の流れでし。",
      "start": 61321,
      "end": 185632,
      "timestamp": "01:01"
    },
    {
      "speaker": "Ayaka",
      "text": "た。",
      "start": 185632,
      "end": 185652,
      "timestamp": "03:05"
    },
    {
      "speaker": "Ryo",
      "text": "4ステップじゃあったって。",
      "start": 187640,
      "end": 189141,
      "timestamp": "03:07"
    },
    {
      "speaker": "Yanmer",
      "text": "事なのかなそうです。",
      "start": 189141,
      "end": 189842,
      "timestamp": "03:09"
    },
    {
      "speaker": "Ryo",
      "text": "ね最初から合わせるとリクルーター合わせる。",
      "start": 189842,
      "end": 191843,
      "timestamp": "03:09"
    },
    {
      "speaker": "Yanmer",
      "text": "と簡単に言うとそうリクルーター。",
      "start": 191843,
      "end": 193345,
      "timestamp": "03:11"
    },
    {
      "speaker": "Ryo",
      "text": "30分って結構長いと思うんですけど何話したん。",
      "start": 193345,
      "end": 197007,
      "timestamp": "03:13"
    },
    {
      "speaker": "Yanmer",
      "text": "ですか実際いやーわかんないですちょっともしかしたら15分ぐらいだったかもしれないですねすいませんちょっと覚えてないんですけどもっと軽いかもしれなかったですじゃあ。",
      "start": 197007,
      "end": 205512,
      "timestamp": "03:17"
    },
    {
      "speaker": "Ryo",
      "text": "普通にまあなんだろういつものリクルーター面接みたいな感じであのビザはあるのかみたいななんか本当にひどい人じゃなければ通るあのいつも。",
      "start": 205512,
      "end": 215959,
      "timestamp": "03:25"
    },
    {
      "speaker": "Yanmer",
      "text": "の流れのやつって感じですか本当になんかフォースクリーミングみたいな感じのしかも電話だっ。",
      "start": 215959,
      "end": 219001,
      "timestamp": "03:35"
    },
    {
      "speaker": "Ryo",
      "text": "たかなあとはカルチャラルフィットみたいなのをマネージャーと最初に話すっていうのも結構珍しいって珍しいパターンですよねなんかそのアサイメント先に渡した方がその会社は時間取られなくていいじゃないですかできない人はもう次に進まなくていいという確か。",
      "start": 219001,
      "end": 239961,
      "timestamp": "03:39"
    },
    {
      "speaker": "Yanmer",
      "text": "に結構そうですねそこは珍しかったかもしれないですね僕もいきなりマネージャーと話すんだみたいなたまにあるんですけど会社によっては。",
      "start": 239961,
      "end": 248344,
      "timestamp": "03:59"
    },
    {
      "speaker": "Ayaka",
      "text": "私もそうでした同じ流れマネージャー後に1回目?2回目か。ポンコールの後で。カルチュラルフィットのお話って、ビヘイビュラルクエスチョンとはまだ違うん?",
      "start": 248344,
      "end": 263116,
      "timestamp": "04:08"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですねそういう本当のガチガチのビヘイビュアルクエスチョンではなかったですねちょっと含まれてたかもしれないんですけども本当どっちかっていうと最初から話して半分ちょっと技術的な基礎があるのかなみたいな感じなのとなんとなくこいつと一緒に働けそうかなぐらいの感じでいわゆるあなたがものすごい締め切りに追われた経験はありますかどう乗り越えましたかみたいなガチガチなやつは多分なかったかなって覚えてる感じ。",
      "start": 263126,
      "end": 292993,
      "timestamp": "04:23"
    },
    {
      "speaker": "Ryo",
      "text": "ですねまあなんか会社によってそこら辺がすでに何かドキュメント化されててこういうの聞いてねみたいな会社もあれば割とマネージャーのさじ加減みたいなところもあるんでじゃあ山さんの場合は何かマネージャーのさじ加減でそのまあビヘイビラルみたいなこともちょっとは聞きまあ混ぜながらのカラチャラフィットを見たみたい。",
      "start": 292993,
      "end": 314085,
      "timestamp": "04:52"
    },
    {
      "speaker": "Yanmer",
      "text": "なそうですねあの完全にうちはノリやと思いますねあの僕もはその後にあの入ってからあのコープのインタビューコープ生のインタビューのプロセスでインタビューの面接感として立つだったんですけど完全にチーム内でどうやって先行召喚みたいな感じでノリで自分を提案してあってやるって感じだったんで本当にそんなにシステムあの構造化されてないっていう感じですねで。",
      "start": 314085,
      "end": 338666,
      "timestamp": "05:14"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあそのマネージャーと話した時にすでにそのなんだろう感覚的にはなんか結構いい感じだなぁみたいなのはあったんですよねそう。",
      "start": 338666,
      "end": 346609,
      "timestamp": "05:38"
    },
    {
      "speaker": "Yanmer",
      "text": "ですねでも本当にやっぱその時モバイルで全然バックエンド知らなかったんでなんかこれいけるやろっていう感覚というよりは単純にこの人となんかめっちゃ話し合うなぁみたいな感じなだけでこの後ゲス来たらもうダメかなぁとは思ってましたけど。",
      "start": 346609,
      "end": 361113,
      "timestamp": "05:46"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあ完全バックエンドのポジションなんですかもうフロントとかモバイル他のことはしないみたいな感じのポジションなんですか。",
      "start": 363052,
      "end": 370535,
      "timestamp": "06:03"
    },
    {
      "speaker": "Yanmer",
      "text": "実際今やってる業務内容的にはほぼほぼバックエンドですねたまになんかツールとかであのweb系のやつをUIとかをいじることもあるんですけども割合的には28か19ぐらいでバックエンドがメインですねだからマジで良かったですねバック。",
      "start": 370535,
      "end": 387200,
      "timestamp": "06:10"
    },
    {
      "speaker": "Ayaka",
      "text": "エンドのどのなんだろう技術に惹かれて興味を持ったんですか?",
      "start": 387200,
      "end": 393570,
      "timestamp": "06:27"
    },
    {
      "speaker": "Yanmer",
      "text": "うーんそうっすね結構でもなんかちょっとインフラ周りもあるっていうのがすごい良かったですねなんかバックエンドって言っても本当になんかapiだけ作ってとかもうなんかあのjsonで返してとかじゃなくて結構募集用語を見たらなんかそのクバネティシとかカフカとかそこらへんのやつもあったんでめっちゃいいやんってなってあの全然知らないんですけどでもなんか結構やっぱそういうあのところもやっぱ学びたいなっていうか身につけたいな経験したいなっていうのがあったんでそこはすごい良かったですねそ。",
      "start": 393580,
      "end": 424527,
      "timestamp": "06:33"
    },
    {
      "speaker": "Ryo",
      "text": "したらその後にアセスメントを渡されてまあできないなりになんかえっとググってちょっとgpt使ってなんとか出してえっとその後その次のじゃあ面接にそのまま答えというかをまあみんなにお披露目しながらなんか説明したみたいな感じそうですね。",
      "start": 424527,
      "end": 447114,
      "timestamp": "07:04"
    },
    {
      "speaker": "Yanmer",
      "text": "完全にもう公開処刑だったんですけど僕の中ではマジでミスったなって思っててもしかしたらわかんないですけど本当になんか本当にチャットGPTなかったら多分時間かけなかったら無理だったと思うしそこで行ってしかも会社に行って会社のミーティングルームみたいな感じでそこでこうみんな実際いてめっちゃ質問されてしかも結構答えられない部分とかもあってあっそうですねその通りですねみたいな感じだったんで同じであーこれ落ちたかなーっていう感じの僕は雰囲気は勝手に自分で勝ち取っあの勝ち取っちゃないわなんか感じ取ってましたねなんか特にあのはいごめんなさいそれ。",
      "start": 447114,
      "end": 490722,
      "timestamp": "07:27"
    },
    {
      "speaker": "Ryo",
      "text": "はえっとホワイトボードでなんか見せるみたいな感じですかそれとも。",
      "start": 490722,
      "end": 496104,
      "timestamp": "08:10"
    },
    {
      "speaker": "Yanmer",
      "text": "なんかそうですねあのホワイトボードじゃなくてあれですねあのもう自分のスクリーンをシェアするっていう感じでしたね何。",
      "start": 496104,
      "end": 504323,
      "timestamp": "08:16"
    },
    {
      "speaker": "Ryo",
      "text": "人ぐらいでどんなポジションの人が何人ぐらいいたん。",
      "start": 504323,
      "end": 507404,
      "timestamp": "08:24"
    },
    {
      "speaker": "Yanmer",
      "text": "ですか多分4人だったかな僕を除けば一人がリードで一人がその最初やったマネージャーの人で一人がソフトウェアエンジニアインターミネートぐらいのポジションでもう一人がQAの人でした。",
      "start": 507404,
      "end": 522390,
      "timestamp": "08:27"
    },
    {
      "speaker": "Ryo",
      "text": "ねでその人たちにじゃあまず説明をしてこういう実装にしましたなんか理由はこれこれでみたいなのを説明してじゃあそのでそこから質問されてなんか深掘りしていくみたい。",
      "start": 522390,
      "end": 536998,
      "timestamp": "08:42"
    },
    {
      "speaker": "Yanmer",
      "text": "なタイプもうその通りですもう最初に説明してで後から深掘りでこうボットこうしたらどうするとかこういう問題点あるよねーとかあの後他の知識とかもいろいろ聞かれるっていうスタイルでしたねどのぐらいの。",
      "start": 536998,
      "end": 551050,
      "timestamp": "08:56"
    },
    {
      "speaker": "Ryo",
      "text": "長さやられたんですか時間的に全部で1。",
      "start": 551050,
      "end": 553411,
      "timestamp": "09:11"
    },
    {
      "speaker": "Yanmer",
      "text": "時間ぐらいかなっていう感じでしたねでそれがもうじゃあ最終それが最終でしたねその後にもうこれ絶対落ちたかなと思ってもうあの今でも覚えてるんですけどオフィスをとぼとぼ去りながらちょっと半泣きになりながら心の中でと思ってたんですけどなんかまさかの1週間か2週間ぐらいした後になんかメール来てすげーいい話あるから電話時間あるみたいな感じで人事から来てマジかよみたい。",
      "start": 553411,
      "end": 579575,
      "timestamp": "09:13"
    },
    {
      "speaker": "Ryo",
      "text": "な感じでした一番ワクワクしていい時間でしたよね。",
      "start": 579575,
      "end": 585932,
      "timestamp": "09:39"
    },
    {
      "speaker": "Yanmer",
      "text": "オファー待つ時間一番幸せAPIに。",
      "start": 585932,
      "end": 590714,
      "timestamp": "09:45"
    },
    {
      "speaker": "Ayaka",
      "text": "関するツッコミってその当時からAPI設計って色々書籍出てたりとかベストプラクティスとかあるじゃないですか私もそこまで詳しくないんですけどそういうのを勉強していってたのかそれかハインサイトですけどもしかして勉強してたらもっと良かったのかなとかそういうその辺の感想とかありますか?",
      "start": 590714,
      "end": 618317,
      "timestamp": "09:50"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね勉強してたんですけども実装経験が全然なかったっていう感じですねなのでなんか色々書籍は見てたし色々YouTbeとかなんかやってなんとなくAPIってこうやるんだなと思ってたんですけどやっぱいざ自分でもの作れってなると小規模でもあれこれ実際どうしたらいいのかなみたいな感じで結構ちょっとそこの設計が甘かったりっていう部分はあったまぁでも多分一番終わったなって思った瞬間がその僕結構やっぱまぁこれ多分誰でもやると思うんですけどそんななんかその言語とかフレームワークとか知らなくてもバンバン応募するっていうのがやっぱ基本結構重要じゃないですかもうあの最初慣れない人はまぁ今だったら結構あの割と完璧に当たる方をめっちゃやるっていうのも重要かもしれないですけど僕は結構ノリでもどこでもやったりみたいな感じだったんで全然知らなくてもまぁできるっしょみたいな感じできるぞって言ってたんですけどもそれで結構最終までごまかしてたんですけどなんか最後あの最終面接であのマネージャーにじゃあコットフレームワークコットリンとあのスプリングブートってやつだったんですけどジャバ系のあのその経験あるのって言われて僕はないですってその時は嘘つけなかったんで言ったらそのマネージャーがマジかーみたいな感じで結構ちょっとショックを受けたみたいなかっ顔してたんでなんかザワザワみたいな感じになってたんですよねなんかもうそれでああやべえやべえと思ってああもうやっぱついにバレたかみたいな感じで終わりです終わりですバイバイみたいな感じでさよならもう帰りたいですでもここはあのオフィスなんで帰れませんみたいな感じでもうその瞬間から僕はずっと帰りたい帰りたいと思いながらやっ。",
      "start": 618317,
      "end": 705900,
      "timestamp": "10:18"
    },
    {
      "speaker": "Ryo",
      "text": "てましたで、そのいい話っていうのがあって、オファーをもらったと思うんですけど、ちょっとまた前回に引き続き、年収公開してもよかった、いいってことだったんで教えてもらってもいいですか?",
      "start": 705900,
      "end": 719565,
      "timestamp": "11:45"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね、そのポジションは、今のポジションは100Kですね。を下げました下がっちゃいましたの全然いいですもう本当にこれは僕の中ではそのレイオフさえ105の時にもう本当にもレオフ関係なしにとりあえず僕はもう思えるじゃなくても1から最初からでもいいから絶対バックエンドももういいバックエンドめっちゃ行きたいなってでバックエンド行くのはもちろんそのいきなり傾向移動は無理だからもうもうジュニアでもいい、なんならインターシップでもいいから、もうバックエンドから始めたいってなって、そうなったら場合はもう全然60Kとか80Kからでもスタート全然OKっていうメンタルだったんで。もうそっからしたら、え、マジで?って言って。なんかその給与円字も80から100って書いてあったんですよね、バックエンドその文字。なので一番100の方もらってるやんみたいなって。うっせぇやろ?ってなって逆に緊張するわ。え、どういうこと?みたいな感じで結構その当時は、その当時はもう超高ぇじゃんみたいな。僕の中でも頂点でしたね。え、マジで?もうバックエンド100最高やんと思ってたんですけどもやっぱ人っていうのはやっぱりこう慣れっていうかまあ欲があるもんで半年経ってなんかもうバックエンドある程度できるようになったなーって思い出すとめっちゃなんか個人的に低いっていうかいやだってバンクーバーのソフトエンジンはバックエンドがもっと高いんじゃない?あとプラス20Kか30Kあるんじゃね?みたいな感じだって最近はもう低いなぁ低いなぁと思いながらもうなんか上げてくれって交渉しながら転職ちょっと始めちゃったっていう横まみれの感じ。",
      "start": 719565,
      "end": 811829,
      "timestamp": "11:59"
    },
    {
      "speaker": "Ryo",
      "text": "ですね人間上と比べちゃうんでねそこは仕方ないですよねそしたら次にインタビューの話は大体聞けたかなと思うんで1社目のレイオフについて結構よくあることとはいえ、結構貴重な経験ではあるじゃないですか。なんだろうな、どっから話してもらいましょうかね。当日というか、どんな感じで知らされたんですか?",
      "start": 811829,
      "end": 839943,
      "timestamp": "13:31"
    },
    {
      "speaker": "Yanmer",
      "text": "それがですね、当日やっぱその朝起きるじゃないですか。でまぁなんかちょっとスラック確認した時になんかその一番一番じゃないですけど街の中でもやっぱこうプロダクトマネージャーみたいなちょっと今日1偉い側の人がいるじゃないですかちょっとみたいなそういうちょっとビジネス側からの偉い人からのなんかダイレクトメールがあってなんかあのご縁だけどちょっとあと15分後に大事なミーティングがあるんだ申し訳ないけど来てくれみたいな明らかに中のトーンが暗いな暗いっていうのがわかるし緊急みたいな感じが来てこの中トーンであって言うちょっと察しましたねそれでなっで、そのミーティングに参加したら、もうなんかめちゃくちゃそのマネージャーみたいな人が、もう神妙な顔で、もう泣きそうな顔で、もう申し訳ないみたいな感じの顔にしてて、しかもその集まってる人が僕だけじゃなくて、なんかチームの人だけじゃなくて、なんかちょっと関係ない人までもいろいろ混じってて、でもなんか10人か分かんないけどそれぐらいの人だったんで、それでほぼほぼ察しましたね。あ、これついに来たわーっていう。で、。",
      "start": 839943,
      "end": 906069,
      "timestamp": "13:59"
    },
    {
      "speaker": "Ryo",
      "text": "それじゃあワンオンじゃなかったんですね。",
      "start": 906069,
      "end": 907971,
      "timestamp": "15:06"
    },
    {
      "speaker": "Yanmer",
      "text": "ワンオンじゃなかったですね。",
      "start": 907971,
      "end": 910304,
      "timestamp": "15:07"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあもうレイオフされる人みんな一気にやろうみたいな。",
      "start": 910304,
      "end": 913056,
      "timestamp": "15:10"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね。",
      "start": 913056,
      "end": 914450,
      "timestamp": "15:13"
    },
    {
      "speaker": "Ryo",
      "text": "ミーティングだったのか基本1。",
      "start": 914460,
      "end": 916121,
      "timestamp": "15:14"
    },
    {
      "speaker": "Yanmer",
      "text": "On1なんですね僕逆になんか一気にやるっていうのが今までのなんか調子きいてた?",
      "start": 916121,
      "end": 920504,
      "timestamp": "15:16"
    },
    {
      "speaker": "Ryo",
      "text": "分かんない僕は分かんないけど経験した人の話はあんまり聞いたことないからあんまり気にしたことなかったから分かんなかったけどじゃあみんなででもなんかパッケージの話とかってあるじゃないですかその後のこととかってでそのパッケージとかって結構やっぱり給料とかによるからそのあまりお給料の何ヶ月分とかっていう話なのかなちょっとそこらへんも聞いていきましょう。",
      "start": 920504,
      "end": 943737,
      "timestamp": "15:20"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですねそこはの本当に間違いなくてなのでその全体の周知はマジで15分からまあ20分ぐらいでもうあのジェラーな情報申し訳ないけども会社の都合上あの君たちをレイオフせざるを得なくなったって本当に申し訳ないとやっぱそういうあの感じでやってでその後に後から詳しい情報はHRがメールするんでそれを見て連絡してくれとりあえずこれは通知のミーティングだみたいな感じで終わるっていう感じですねでその後に実際にちゃんとしたオフィシャルの中メールがHRから来てそこで多分実際にそこからHRとメールでパッケージとかそういうやりとりをやっていくっていう感じだと思います。もしかしたらその前にちょっと1回とのワンワン挟んだかもしれないですけど、ちょっと僕はあんま覚えてないですね。",
      "start": 943737,
      "end": 1002679,
      "timestamp": "15:43"
    },
    {
      "speaker": "Ryo",
      "text": "パッケージの内容はどんな感じだったんですか?",
      "start": 1002679,
      "end": 1004982,
      "timestamp": "16:42"
    },
    {
      "speaker": "Yanmer",
      "text": "パッケージはですね、多分セバレンスっていうそういう用の退職金で多分2ヶ月だったかのうちは2ヶ月のフルの給料を出すっていう感じだったと思いますねそれと何かプラスでもう1個ぐらいあった気がするんですけども基本的には2ヶ月ぐらいの給料をプラスで出してくれるっていうのがありましたねあとは何かその保険も2、3ヶ月くらいかな期間忘れちゃったんですけど3ヶ月か半年かわかんないですけども保険はまだ当分は使えるよっていうのも入って。",
      "start": 1004982,
      "end": 1046635,
      "timestamp": "16:44"
    },
    {
      "speaker": "Ayaka",
      "text": "ましたねその時はもうPRになってたんです。",
      "start": 1046635,
      "end": 1050476,
      "timestamp": "17:26"
    },
    {
      "speaker": "Yanmer",
      "text": "よねそうなんですそれが一番良かったですね結構半年か1年か忘れちゃったんですけどももうPR取った後だったんでもう全然っていうしかもちょうど転職活動を始めたぐらいだったんでむしろ僕の場合は時間くれたし転職活動をしながらお金もらえるやんみたいな感じでショックだったんですけど後々ラッキーだなっていうふうに思えるようになりましたね。",
      "start": 1050476,
      "end": 1074840,
      "timestamp": "17:30"
    },
    {
      "speaker": "Ryo",
      "text": "ちょっと説明入れると、PRっていうのは視聴者のために、多分わかんない人もいると思うんで、永住権っていうもので、カナダで働く上では、ワークビザーとか、日本人だったらワークビザーとか、もしくは永住権、もしくは市民権が必要なんだけど、永住権持ってると転職もできるし、給料も上がりやすいみたいな、よく言われてますね。っていうのがあれなんですけど。",
      "start": 1076830,
      "end": 1103132,
      "timestamp": "17:56"
    },
    {
      "speaker": "Yanmer",
      "text": "A受験ないとアレなんですよね。A受験がいいというよりA受験がないともうその会社にサポートしてもらうしかないんでこういうふうに首切られた時に次がなくなるっていうのが一番やっぱいけない働けない状態になるんでなのでもうA受験超重要でしたね。",
      "start": 1103142,
      "end": 1119408,
      "timestamp": "18:23"
    },
    {
      "speaker": "Ryo",
      "text": "ラッキーでしたなんか細かいところがあのちょっとaオフの話に戻ってえっと細かいところなんですけどあの会社から支給されてたパソコンとかの荷物とかだったりあのオフィスがもしあったとしたらオフィスに置いてた自分の荷物とかってどうなるん。",
      "start": 1119408,
      "end": 1136397,
      "timestamp": "18:39"
    },
    {
      "speaker": "Yanmer",
      "text": "ですかえーと、それですね、結構面白いんですけど、僕まだ全然語っちゃうんですけど、基本的には荷物はもう全然後からHRがラベルみたいなのが来て、これ貼って送り返してねっていう感じがあれですね。で、オフィスに関しては僕はもう本社がケローナーだったんでオフィスに何かがあるっていうものではなかったんでそこに関しては全然大丈夫だったんですけどもまあでも一番おもろかったのはあれですねそのなんか最初にやった全体通知のなんかそのミーティングがあってでちょっとジンジンとやり取りしたいでその後多分30分かな1時間もしないと思うんですけどもその1時間しないうちにもうなんかいきなり会社のパソコン全部シャットダウンしたんですよねブーンってだって真っ暗になってでそのなんか再起動したらもうなんかあの知らない画面になってるんですよねもうあのログインできない画面になっててもう使えないじゃんみたいな全部データどうなってんのみたいな感じでもう本当にそこから先は全くあの使えないもうもう会社のパソコン使えないでもう僕はリモートだったんでオフィスにも行けないもうその時点で基本的なもう会社とのやり取りはもうレイオフ発あの発表してからもう1時間ぐらいでもう完全にシャットダウンっていう感じでしたねでもう本当に後はやり取りはなんか就活用に使ってたアプライ用に使ってたメールで人事がまあメールくれたんでそこでも本当にあの会社の人ではないアウトな人としてして外部の人として人事とやり取りしながらさっき言ったそのパッケージの話とかやりあのサインの話とかまああとは荷物をどう送り返すかとかそういう事務的な話をひたすらやっていくっていう感じでなのでなんかお別れさよならもないしもう連絡先ももう無理っていうもうやべえっていう感じですよねこれがレオフカーっていう感じ。",
      "start": 1136397,
      "end": 1244011,
      "timestamp": "18:56"
    },
    {
      "speaker": "Ayaka",
      "text": "はすごいしましたよそよそしいのがなんか急にいや、。",
      "start": 1244011,
      "end": 1250143,
      "timestamp": "20:44"
    },
    {
      "speaker": "Yanmer",
      "text": "ほんとにね。",
      "start": 1250143,
      "end": 1251114,
      "timestamp": "20:50"
    },
    {
      "speaker": "Ayaka",
      "text": "嫌なもの感が出て嫌ですね、なんか。",
      "start": 1251114,
      "end": 1253397,
      "timestamp": "20:51"
    },
    {
      "speaker": "Yanmer",
      "text": "そう。こっちはなんか大体、やめるって言ったら2週間前ぐらいに事前に通知してやめないといけないのに、そっちは切るときはもう1時間で切れるの?と思いましたよね。",
      "start": 1253397,
      "end": 1263647,
      "timestamp": "20:53"
    },
    {
      "speaker": "Ayaka",
      "text": "ねー、白状な。",
      "start": 1263647,
      "end": 1267290,
      "timestamp": "21:03"
    },
    {
      "speaker": "Ryo",
      "text": "まあ何されるかわかんないとかっていうのがまあ特にパソコンでねあのデータを使ってエンジニアリングしてるから変なものとかなんかgitにあげられたりとかそのコード変えられたりとかっていうのは怖いから仕方ないのかなってとか変な情報をね他の社員に拡散されたりとかっていうのも人によっては考える人どもいると思うんでしょうがないかなって思いつつでもやられた側からしたら冷たこいつってなりますよね冷たー。",
      "start": 1267300,
      "end": 1300629,
      "timestamp": "21:07"
    },
    {
      "speaker": "Yanmer",
      "text": "ってなるし超ビビりますねあ、ほんまにそれやるんやってもうスパッて切られるんだなっていう数字でびっくりしましたねそれは失業保険。",
      "start": 1300629,
      "end": 1309340,
      "timestamp": "21:40"
    },
    {
      "speaker": "Ryo",
      "text": "とかはもらえたんですか?",
      "start": 1309340,
      "end": 1311332,
      "timestamp": "21:49"
    },
    {
      "speaker": "Yanmer",
      "text": "バリバリもらえましたね最初の2ヶ月が会社のセバレンスでそれがあるうちは国も出せないんですけどもそれをカウントした後に多分僕の場合どれくらい出たっけな9ヶ月くらい出たんですよねなのでまとめて出るとかじゃなくてその就活活動をちゃんと2週間に1回報告しないといけないんですけどもその報告している限りは多分月1か2週間に1回国から出てくれてでそれが9ヶ月続くっていう感じなんでいきなり9ヶ月間もらえるわけじゃないんですけどもでも会社の2ヶ月をね9ヶ月やったらもうほぼ1年やんみたいな感じで僕はもう1年間イエーイみたいな感じの自由に逃げたぜみたいな感じ。",
      "start": 1311332,
      "end": 1358089,
      "timestamp": "21:51"
    },
    {
      "speaker": "Ryo",
      "text": "でしたねそれは全額なんですか?いや、。",
      "start": 1358089,
      "end": 1360931,
      "timestamp": "22:38"
    },
    {
      "speaker": "Yanmer",
      "text": "制限はありますね。その最初の2ヶ月の会社のやつはもう全額なんですけども、政府のやつは基本的にはフルタイムの給料の何%かそれか上限があって、確かマックスが月20…2400か2500か2600か忘れたんですけど、2000から2500ぐらいの。だから日本円にすると20から25万ぐらい月付きもらえるっていう感じですね。",
      "start": 1360931,
      "end": 1390414,
      "timestamp": "22:40"
    },
    {
      "speaker": "Ayaka",
      "text": "これやるとだいぶ余裕を持って転職活動できますね。",
      "start": 1390414,
      "end": 1395172,
      "timestamp": "23:10"
    },
    {
      "speaker": "Yanmer",
      "text": "全然違いますね。だって9ヶ月とかだったらもう200万ぐらいじゃないですか。200万以上か。それを保証されてるって言ったら、もう全然ね、もう気が楽すぎて、ありがとう、カナダっていう感じでしたね、。",
      "start": 1395182,
      "end": 1409280,
      "timestamp": "23:15"
    },
    {
      "speaker": "Ayaka",
      "text": "そこは。なんかその、食いパクれるって思わずにできるのいいですよね、なんか。",
      "start": 1409280,
      "end": 1415794,
      "timestamp": "23:29"
    },
    {
      "speaker": "Ryo",
      "text": "いや、。",
      "start": 1415794,
      "end": 1416144,
      "timestamp": "23:35"
    },
    {
      "speaker": "Ayaka",
      "text": "間違いないですね。家賃払えないとかってなったら。",
      "start": 1416144,
      "end": 1418916,
      "timestamp": "23:36"
    },
    {
      "speaker": "Yanmer",
      "text": "いや、そう、それがね、全然、そのメンタル的にその焦りがないっていうのがめっちゃ良かったですねそのおかげで結構しっかり転職活動に本格的に集中できたからそれがすごい大きかったですね。",
      "start": 1418916,
      "end": 1432240,
      "timestamp": "23:38"
    },
    {
      "speaker": "Ryo",
      "text": "僕はでも、逆に、2500しかもらえないんだってちょっと思っちゃいました。逆にね。確かに、ヤンマーさんの状況からしたら全然ね、一人暮らしでいいかもしれないけど、逆に、なんだろう、そういう人じゃなくて、もうお子さんがいて、例えば、家のローン払ってて、車も払ってて、で、子供ののなんだろう保育園みたいなのとかも払ってるって言ったら結構マイナスになるのかなみたいな。",
      "start": 1434545,
      "end": 1465077,
      "timestamp": "23:54"
    },
    {
      "speaker": "Yanmer",
      "text": "それを言うと多分人によって変わるかなって思ってその一人で不要とかない場合はそれぐらいの値段で多分子供とかもし家族がいた場合はもうちょい変わるんじゃないかなって僕ちょっとないんだよさすがにだと思いますねで。",
      "start": 1465077,
      "end": 1480864,
      "timestamp": "24:25"
    },
    {
      "speaker": "Ryo",
      "text": "もじゃあそしたら9ヶ月はえっと9ヶ月11ヶ月はゆっくりしてから就職したみたいな感じなんですか。",
      "start": 1480864,
      "end": 1488071,
      "timestamp": "24:40"
    },
    {
      "speaker": "Yanmer",
      "text": "なんだかんだ僕結構そこは自分でも何でかわからなかったんですけど結構もう最初レイオフされた後からもう普通に転職がちってましたねもう全くバケーションは全然取らなかったですね不思議なことに休みは良かったんですけどマジで転職に燃えてて。",
      "start": 1488071,
      "end": 1505047,
      "timestamp": "24:48"
    },
    {
      "speaker": "Ryo",
      "text": "休めないですよね。ちょっとなんか、。",
      "start": 1506880,
      "end": 1510112,
      "timestamp": "25:06"
    },
    {
      "speaker": "Yanmer",
      "text": "それでも怖いじゃないですか。しかもあれなんか、一応カナダのルール的に転職活動を見せないと、職業等を探してるっていうのを見せないともらえないし、あと、かつ国離れたらいけないんですよね。例えば日本。日本行って帰ってて1ヶ月間ぐらい行ってると、その1ヶ月間はもらえないし、なんでかっていうと、カナダで転職活動しないんで、そこはいらないでしょみたいになっちゃうし、しかもその1ヶ月が後々ずれるとかじゃなくて、9ヶ月のうち1ヶ月がなくなって8ヶ月分しかもらえなくなるんで、それ考えるともうなんかしかもそのとき、れいふされたのは5月ぐらいだったんで、なんかもうそっから6月、7月、8月、暑い時期に帰ってもいいないかなと思ったんで、もうなんかそこら辺の夏の時期まるまる転職になった。",
      "start": 1510112,
      "end": 1556713,
      "timestamp": "25:10"
    },
    {
      "speaker": "Ayaka",
      "text": "っていう感じですね。転職活動中でして、政府にはどうやって報告するんですか?何を提出すればいいんですか?",
      "start": 1556713,
      "end": 1565586,
      "timestamp": "25:56"
    },
    {
      "speaker": "Yanmer",
      "text": "なんかあのウェブサイトあるんですよねログインしてアカウント作ってログインしてなんかよくわかんないめっちゃ使いにくいんですけどなんか入ってでなんかポチポチポチってボタンを押してあの今カナダにいますかとかやってもう選択するだけででポチッと最後サブミットを押したら。",
      "start": 1565596,
      "end": 1581502,
      "timestamp": "26:05"
    },
    {
      "speaker": "Ayaka",
      "text": "オッケーっていう感じですねアンケートみたいな感じそうですねアンケート。",
      "start": 1581502,
      "end": 1585844,
      "timestamp": "26:21"
    },
    {
      "speaker": "Yanmer",
      "text": "で一応あの電話もすることもできるんですけどもそれを2週間に1回地味に忘れちゃうっていう地味に。",
      "start": 1585844,
      "end": 1591986,
      "timestamp": "26:25"
    },
    {
      "speaker": "Ayaka",
      "text": "忘れますそうですねそうしたらお金入ってこない。",
      "start": 1591986,
      "end": 1596800,
      "timestamp": "26:31"
    },
    {
      "speaker": "Yanmer",
      "text": "そう結構多くこれこれもマジでどうでもいいっていうかまあマイナー情報なんですけど最初のそのセバレンスの2ヶ月があるじゃないですか彼最初あの全然報告しなくていいんかなと思ってたらその2ヶ月も一応なんかもらってないのに報告しないといけなくてらしくてあのそれで報告なくてちょっと危うく失いかけて危ない危ないってなったんでもしレイオフされた人はそのレイオフされた直後に必要な書類を会社からもらってすぐにそれを政府に提出してそこから毎週毎週じゃない2週間に1回報告するようにしましょう覚えておき。",
      "start": 1596800,
      "end": 1629620,
      "timestamp": "26:36"
    },
    {
      "speaker": "Ayaka",
      "text": "ますいつなるかわかんないからあの、。",
      "start": 1629620,
      "end": 1633313,
      "timestamp": "27:09"
    },
    {
      "speaker": "Ryo",
      "text": "レイオフされた時には是非ヤンマーさんに連絡して。",
      "start": 1633313,
      "end": 1636165,
      "timestamp": "27:13"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね、僕に全然相談するように。",
      "start": 1636165,
      "end": 1638017,
      "timestamp": "27:16"
    },
    {
      "speaker": "Ryo",
      "text": "ツイッターかなんか多分概要欄に載っけておくんで。",
      "start": 1638017,
      "end": 1640939,
      "timestamp": "27:18"
    },
    {
      "speaker": "Yanmer",
      "text": "ありがとうございます。あと僕結構その時になんかノートの記事も書いたんで、レイオフでされたら。",
      "start": 1640939,
      "end": 1646034,
      "timestamp": "27:20"
    },
    {
      "speaker": "Ryo",
      "text": "確かに。そこら辺も載っけておきます、概要欄に。そしたら。そしたらレイオフも大体いい感じに分かったかなと思うんでちょっと実際働いてみてざっくりした質問になるんですけどどうですか?日本となんか日本の時はちょっと病んじゃったみたいなさっき話があったと前回の中であったと思うんですけどなんかどうですか?",
      "start": 1646034,
      "end": 1670003,
      "timestamp": "27:26"
    },
    {
      "speaker": "Yanmer",
      "text": "僕はたまたまかもしれないですけどめっちゃこっちいいですねめっちゃ相性良くて本当にそれは日本が会社が悪かったっていうよりはなんかただただこっちの馬があってしかも両方ともその前の会社も今の会社もカナディアンのが本社の会社なんでもうみんな人結構めっちゃ優しいし怒らないしなんか失敗に対してめっちゃ寛容だからなんか働いててめっちゃそのどうしようみたいな怖いみたいなあんまないしもう最高っすねもちろんその業務つまんねーとかストレスがめっちゃありますよもうなんかあーもうイライラするっていうのはめちゃくちゃありますけどもなんかそのあー明日から仕事どうしようとか仕事したくないとかでそれでめっちゃこう精神やむっていうのは全然ないとなりましたねありがたい。",
      "start": 1670003,
      "end": 1716312,
      "timestamp": "27:50"
    },
    {
      "speaker": "Ryo",
      "text": "こと具体的にはなんかどういうところで違いを感じ。",
      "start": 1716312,
      "end": 1721136,
      "timestamp": "28:36"
    },
    {
      "speaker": "Yanmer",
      "text": "ますかそうですねまぁさっき言ったみたいにその失敗に対してめっちゃ寛容なんでなんかこれやったからダメとかお前これどうすんだみたいな言葉遣いも荒くないしもうなんか基本プラス思考っていうか加点方式なんでこういうことに対してすげーいいじゃんとかっていう方式なんですごいこっちもメンタル楽だしやっぱりなんかその年功序列っていうのもないし実力主義だしあとは基本的にそのやっぱりみんなが気持ちよく働けるように環境を整えるっていうのもあるしなんかそういう諸々全部含めてですかねあと5時以降は基本働かなくていいしどんだけ忙しくてもほぼほぼそういう。",
      "start": 1721136,
      "end": 1760803,
      "timestamp": "28:41"
    },
    {
      "speaker": "Ryo",
      "text": "のはあって逆にじゃあそこら辺がなんだろうその結構上司がきつく当たる人だったんですか日本の時。",
      "start": 1760803,
      "end": 1767509,
      "timestamp": "29:20"
    },
    {
      "speaker": "Yanmer",
      "text": "は上司というか周りやっぱこの先輩後輩っていうのがやっぱこうあのまあ多分業務内容上ちょっとそういうやつあるを得ない場面があったかもしれないですけどもやっぱりこう年功序列でなっちゃうと、どうしてもありますね。結構苦手だったのが、飲み会の場とかで、漢字やらないといけないっていうのが、すごいストレスでした、。",
      "start": 1767509,
      "end": 1792012,
      "timestamp": "29:27"
    },
    {
      "speaker": "Ayaka",
      "text": "日本の場合は。私も漢字経験あるんですけど、この上司はこういう料理が好きだからとか、こういう席順じゃないと満足しないからとか、すっごいつまんないこと気にして、前々から自分の本業以外にすっごい時間割いて、こうプランしないといけなくて何のために私これやってんだろうとかって。",
      "start": 1792012,
      "end": 1812458,
      "timestamp": "29:52"
    },
    {
      "speaker": "Yanmer",
      "text": "思ってますいやー本当にそんな感じでしたねもうなんかその年齢を考えてその胃に優しいところを選ばないといけないとかなんかいや本当に本当に選んちゃんとバッチリ下見も行かないといけないんですよねで下見行ってちゃんとそこで良いところ客の席とか店の雰囲気とかやって選んでいかないといけないし選んでもここのところ脂っこいなーって言われることも全然あったりし。",
      "start": 1812458,
      "end": 1835995,
      "timestamp": "30:12"
    },
    {
      "speaker": "Ayaka",
      "text": "て本当に半分。",
      "start": 1835995,
      "end": 1837576,
      "timestamp": "30:35"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですねまあなんでも本当にそれがある意味その接待するっていうマネジメントの一つなんかな仕事としてまあなんでそれも含めてあのそういうなのに対応できるようになれやみたいなそういうのも含めてまあ仕事できるようになるって言うなぜみたいなそういうなんでまあそういう文化は全然そういうのがあるんだなっていうのはわかるんですけど単純に僕はそういうのが自分には合ってないっていうかそういうのは仕事として入れたくないっていうのが僕の中であったっていう感じですねマストとして入るとすごい嫌だなそしたら。",
      "start": 1839433,
      "end": 1869309,
      "timestamp": "30:39"
    },
    {
      "speaker": "Ryo",
      "text": "差し支えない範囲で業務内容今バックエンドのことについてやってると思うんですけどドメイン的にはどういう会社とかアプリみたいなのに。",
      "start": 1869309,
      "end": 1879417,
      "timestamp": "31:09"
    },
    {
      "speaker": "Yanmer",
      "text": "携わってるんですか今の会社でいうとセキュリティですね結構認証系のところで例えばアカウント作るときによくパスポートとか運転免許証とか提出してあそうそうIDチェックで顔やったり顔を写真撮ったりそういうのを捌くところですねそういうのをデータとして受け取って他の処理のところに回してその結果を受け取ってやるっていうのをバックエンドとしてそこら辺のAPIとかデータの処理をやるっていうところを今やってるっていう。",
      "start": 1879417,
      "end": 1909459,
      "timestamp": "31:19"
    },
    {
      "speaker": "Ryo",
      "text": "感じですねじゃあ結構硬いアプリとかに組み込むインテグレーションみたいな形で入れられるみたいなアプリなんですかそれとも結構そのアプリとは離れたところでなんだろうどういう感じで動くんですか?",
      "start": 1909459,
      "end": 1927257,
      "timestamp": "31:49"
    },
    {
      "speaker": "Yanmer",
      "text": "うちはあれですねAPIとして提供してるんでAPIをその結構ビッグテックとかに提供してそこがAPIとして使ってるっていう感じですね最終的な形は基本的にはAPIもうちょっとなんかSDKとかもあったりするんですけどもSDKとAPIでその2つでメインは提供してるんですねうちの部門はです。",
      "start": 1927257,
      "end": 1947920,
      "timestamp": "32:07"
    },
    {
      "speaker": "Ayaka",
      "text": "ねフロントエンドはもうないんですかその会社の機能と。",
      "start": 1947920,
      "end": 1951614,
      "timestamp": "32:27"
    },
    {
      "speaker": "Yanmer",
      "text": "してえーとほぼ一応あるんですよねでそれが例えばそのなんかフロントエンドと合わせて提供しているというプロダクトもあるしそれが一つあるしあとはなんかその社内のツールとしてそのapiを例えば本当に動いてるかっていうのに可視化ツールみたいな中のデブツールみたいなのがあるんでそういうのも一応あの外には出してないけど中のその開発ツールとして作らないといけない作った方が効率化するんでそういうためのフロントエンドをたまにいじるって時もありますでもほぼほぼメインはバックエンドですねここもカナダ。",
      "start": 1951614,
      "end": 1984130,
      "timestamp": "32:31"
    },
    {
      "speaker": "Ayaka",
      "text": "の会社で規模的には前のモバイルの時よりも大きいんですか?",
      "start": 1984130,
      "end": 1991655,
      "timestamp": "33:04"
    },
    {
      "speaker": "Yanmer",
      "text": "それは大きくなりましたねありがたいことに前のケローナの会社は100人ぐらいで技術部分が20人ぐらいだったかな150か100か分かんないですけどもだったんですけど今の会社結構全部で400ぐらいになって技術も結構もう半分か分かんないですけども全然あるっていう感じなんで全然その傾向としてはいい方向に行ったんでそこはすっげー良かったですね本当にバックエンド生きるだけじゃなくてなので一応納得して給料、ちょっと下がったけどいいかなみたいな、その年には。",
      "start": 1991665,
      "end": 2023972,
      "timestamp": "33:11"
    },
    {
      "speaker": "Ayaka",
      "text": "そのカルチャーとか、会社のカルチャーとか働き方とかも前のケローナの会社とまた違う頃はあります。",
      "start": 2023972,
      "end": 2033565,
      "timestamp": "33:43"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね、ちょっと厳しくなりましたね。前のやつは、もう本当に差別的か、っていうか偏見かもしれないですけど、本当にケローナの白人が多くて、もう本当に西側のカルチャーだったんで、マジでバケーション大切にして、もう50以降働くなんてとんでもねーみたいな感じだったんですけども、今は結構やっぱマルチカルチャーでいろいろあって結構やっぱセキュリティーなんでオンコールとかもあったりするんで忙しい時はちょっとこうあとはなんか結構働くし結構うちなんかリモートでアメリカで在住で働いてる人もコアメンバーで多いんでアメリカ住んでるとみんななんかやる気があったから結構ヨロサクまでやりたい人はやってる人もいるしそうなんで前よりはやっぱりこう結構ガツガツしたっていう感じあるんですけどでもそれを加えても結局はそのうちのチーム自身は結構マネージャーがそのもう本当に知るって言うんですけどももうめっちゃあの入力話となんで僕もこの前その1週間ぐらい親が来た時に案内しててちょっと気になってたんでスラックのメッセージとか見てたらあのスラックのメッセージ見てるのわかるから見るのを禁止しますっていうのを上司が冗談っぽく言ってくれていやもう最高やなぁみたいなありがたいなんで終わったん。",
      "start": 2033575,
      "end": 2106786,
      "timestamp": "33:53"
    },
    {
      "speaker": "Ayaka",
      "text": "だろう。",
      "start": 2106786,
      "end": 2108387,
      "timestamp": "35:06"
    },
    {
      "speaker": "Ryo",
      "text": "そしたら今まで一社目はモバイルの分野で働いてバックエンドこれから取り組んでみたいこととか関わってみたい仕事とかドメインとかでもいいんですけどありますか?",
      "start": 2112585,
      "end": 2131041,
      "timestamp": "35:12"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですねドメインに関してはそんなにこだわりはないんですけどもいろいろドメインでもいいかなと思ってて分野に関してはやっぱりもうちょっと奥行きたいっていうかバックエンドでもやっぱりもっとデータを扱うところETLみたいな感じの大量のデータを扱うっていうのがすごいスケーリングとか考えてのところをもっとやりたいなっていう感じですねすごいデータ量が多くなった時にどう負荷分散するのかとかそういうのを経験できるとすごい僕のキャリア的にもなんか今後いろいろ対応できそうかなっていうのもあってそこを経験したいからもっともっとこう大きめの会社もっとスケールの大きなものを扱う会社に行きたいなっていうのはすごい世の中で。",
      "start": 2131041,
      "end": 2174583,
      "timestamp": "35:31"
    },
    {
      "speaker": "Ryo",
      "text": "考えてますねちょっとまあなんか余談みたいな話になるんですけどあの結構意外とそこ携わるのって大変できっとあの大きい会社だともうできてるんですよねそのだからそこからのアップデートとアップデートもなんかあんまりない可能性もあるしだからなんか狙いなんか結構その狙いに行くところが重要なのかもしれないですね例えばなんか僕の今の会社はもちろんそのなんかスケーリングとか考えられて作られてるんですけどまあ今そういうチームの人たちはなんかいろいろやることはあると思うけど最初から作るってことはないし僕たちもどういうふうにそのデータとかが分散されたりとかウェブのインスタンスが違う国にあったりだとかっていうの理解はしてるけどあるっていうのがわかるだけでそこら辺について触れることっていうのが全くなかったりするんでそうなんですねだからなんかちょうど成長してる会社とかもしくは大きい会社でアプリをいっぱい持ってるわなんかまあamazonだとかなんかいろんな企業買収とかいろいろしているところでそこからなんか小さいプロダクトから大きいところまでたぶん触れたりするとまあ触れるのかも。",
      "start": 2174583,
      "end": 2254458,
      "timestamp": "36:14"
    },
    {
      "speaker": "Yanmer",
      "text": "しれないけど結構意外とそこ。",
      "start": 2254458,
      "end": 2257140,
      "timestamp": "37:34"
    },
    {
      "speaker": "Ryo",
      "text": "ピンポイントで狙いに行くと難しかったりはするかもしれない。",
      "start": 2257140,
      "end": 2260002,
      "timestamp": "37:37"
    },
    {
      "speaker": "Yanmer",
      "text": "ですねそうなんですねめっちゃいいこと知れましたありがとうございますそれ事前に心構えで出ると入った時にもし今後入れた時になんかなんやって思わずに済む。",
      "start": 2260002,
      "end": 2268209,
      "timestamp": "37:40"
    },
    {
      "speaker": "Ryo",
      "text": "んでなるほどでももちろんデータっていうか自分の会社にあるものなんでこういうふうに動いてるんだとかっていうので理解とかの勉強にはなるから見てて楽しいとは思うけどそこら辺を自分で作っていくっていう経験は意外と難しい経験として得るのは結構難しいの。",
      "start": 2268209,
      "end": 2289943,
      "timestamp": "37:48"
    },
    {
      "speaker": "Yanmer",
      "text": "かなっていうでもそう。",
      "start": 2289943,
      "end": 2291144,
      "timestamp": "38:09"
    },
    {
      "speaker": "Ayaka",
      "text": "いうところがインタビューに出ますもんねビッグテックとか入ろうと思ったら。",
      "start": 2291144,
      "end": 2294705,
      "timestamp": "38:11"
    },
    {
      "speaker": "Yanmer",
      "text": "そうなんですよ、そんな求めてくるから間違いないですよ、。",
      "start": 2296408,
      "end": 2303131,
      "timestamp": "38:16"
    },
    {
      "speaker": "Ayaka",
      "text": "だから勉強してたらいや、。",
      "start": 2303131,
      "end": 2305722,
      "timestamp": "38:23"
    },
    {
      "speaker": "Ryo",
      "text": "なりますなりますそうなんですよ、。",
      "start": 2305722,
      "end": 2307893,
      "timestamp": "38:25"
    },
    {
      "speaker": "Yanmer",
      "text": "そんな聞かれるからめっちゃやるんかなと思って絶対必要なんだろうなと思ったら意外と場所によってはもう完成されてるっていうのがあるんですねまあ。",
      "start": 2307893,
      "end": 2316515,
      "timestamp": "38:27"
    },
    {
      "speaker": "Ryo",
      "text": "なんかできる知識を持ってるとかまあそのベースがあってそのまあプロダクト作るチームエンジニアだとしてもそこを生かせるみたいなまあエンジニアを求めてるってことなのかなって僕は思ってますけどどうなんでしょうまあ。",
      "start": 2316515,
      "end": 2331198,
      "timestamp": "38:36"
    },
    {
      "speaker": "Yanmer",
      "text": "そういう意味では結構今の会社ちょうどここの2、3ヶ月一番スケーリングで悩んでる時なんである意味結構勉強になるかもしれないですね今の会社でも今週のリリースもちょうどそれでめっちゃやばかったみたいなのがあったんで。",
      "start": 2331198,
      "end": 2345462,
      "timestamp": "38:51"
    },
    {
      "speaker": "Ryo",
      "text": "そしたら、今後はシステムデザインみたいなこととか、ちょっと大きい会社経験してみたいとかってしてみたいと思うんですけど、ちょっともっと長い目で見たときに、ずっとカナダにいるとか予定ですかそれともやっぱり日本その後々帰りたいなぁとかもうすでにプランあったりしますかそれともまあ他の国行くとかもあるかも選択肢としてはあると思うんですけどいやー。",
      "start": 2348903,
      "end": 2375405,
      "timestamp": "39:08"
    },
    {
      "speaker": "Yanmer",
      "text": "そこ本当悩みどころであんまり考えてないですねなんか本当にどうなるかわかんないっていうのはあるしAIの感じもあるしなんかキャリアどうなるかわかんないんで僕はあえて逆に今目先のちょっととりあえずポジション的にインターメディアからシニアでの視野を持てるで大規模なあの開発にも経験があるっていうのを目標にあえてその数年先のものだけはまあそのさっそこぐらいまではちょっとカナダでか欧米かわかんないですけどその範囲でできるようにしときたいっていうのがあってそっから先はマジで未知ですねなんかもう理由としてはもう多分その時にならないとわかんないかなっていうのがあってその時に実際になれるかもわかんないしなった場合にじゃあなんかそこで満足して帰るっていう感じもあるかもしれないし逆にもっとカナダ行きたいなとかもあるかもしれないしその時に他のところに行きたいなっていうのもあるかもしれないし多分その時のその結果次第全然変わるから僕はなんかここ数年先ぐらいしか見てなくてそこから先はなんかもう考えないっていうか、考えてないっていうか、難しいところはあるんですね。まあ、ただ…ない。",
      "start": 2375405,
      "end": 2449658,
      "timestamp": "39:35"
    },
    {
      "speaker": "Ryo",
      "text": "全然じゃあ、カナダに今後もずっと留まる、まあ、定年するまで働くみたいなのもあり得るっていうと…。",
      "start": 2449658,
      "end": 2456310,
      "timestamp": "40:49"
    },
    {
      "speaker": "Yanmer",
      "text": "あり得るかもしれないし、5年後ぐらいにはちょっと他の国行くかなっていうのもあるかもしれないし、本当にいろいろって感じですね。",
      "start": 2456310,
      "end": 2465923,
      "timestamp": "40:56"
    },
    {
      "speaker": "Ayaka",
      "text": "日本はなるかも、可能性ともありかも。",
      "start": 2465923,
      "end": 2470018,
      "timestamp": "41:05"
    },
    {
      "speaker": "Yanmer",
      "text": "日本は全然アリですよ全然アリなんですけど僕の中で今日本帰ってない理由が多分今帰ったら僕はちょっと納得できないなっていうかもう一段階ちょっとカナダで色々経験したいなっていう欲望があるから野望があるから今帰ってないだけでそれがどうなるか次第で結構日本はいつ帰るかっていうのは決めるかもしれないですねもしかしたらもう来年ぐらいに行くってなってるかもしれないですけど今のところちょっとないです。",
      "start": 2470028,
      "end": 2496077,
      "timestamp": "41:10"
    },
    {
      "speaker": "Ayaka",
      "text": "ね。",
      "start": 2496077,
      "end": 2496097,
      "timestamp": "41:36"
    },
    {
      "speaker": "Yanmer",
      "text": "ただ定年後もずっとここで一生っていうのはちょっと考えてないかもしれないですねちょっとそのいろいろ家関係もあるし医療関係もあるんで今のところビジョンとしてずっといれるのかなっていうのもあったりしてでもそこまで長く考えてもちょっと今考えてもいいんじゃないかなっていう感じなんでまあそんな感じですかね確かに、。",
      "start": 2498018,
      "end": 2521447,
      "timestamp": "41:38"
    },
    {
      "speaker": "Ryo",
      "text": "そうですね。そしたら、最後の質問なんですけど、ヤンマーさんみたいに、少し日本での経験、プログラミングしたことあるよっていう人で、英語はどっちでもいいかな、できてもできないと思うっていう人がいるとして、どんなアドバイスをしてあげられますか?",
      "start": 2521447,
      "end": 2541753,
      "timestamp": "42:01"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですねそこはなんかその決めてる人に対してはもう何も言えることがないっていうか自分なりの方法でやってくださいっていう感じなんですけど迷ってる人がいたらもしあのなんか迷ってていかないとなった時にずっとなんかモヤモヤ感が残りそうみたいな感じがありそうだったらもうとりあえず行ってみるっていうのはありなんじゃないかなーっていうのはすごい思いますねそこだけですかねを言えるのはうんとりあえずやっ行ってから考えろとそうですね、なんかやっぱもしかしたら危険とかリスクとかあるかもしれないですけどでもなんかずっとモヤモヤしたまま残して暮らすっていうのもなんか結構もったいないっていうかなんとなく自分の中でフツフツとこう燃えるものがあるんだったら一回それをバーンとぶつけてみるっていうのはすごいいいんじゃないかなっていうのは思いますねそれがまあカナダじゃなくてもいいし何かしらの形になってもいいんですけども。",
      "start": 2541763,
      "end": 2596332,
      "timestamp": "42:21"
    },
    {
      "speaker": "Ryo",
      "text": "って思います僕ははいありがとうございましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2596332,
      "end": 2617267,
      "timestamp": "43:16"
    }
  ],
  "highlight1": "カナダでバックエンドエンジニアになったヤンマーさん、年収100Kオファーもらったという幸せな話を聞いてみた。",
  "highlight2": "レイオフされたときの会社の対応が冷たかったけど、政府の失業保険で9ヶ月間もらえちゃったという話。",
  "highlight3": "ヤンマーさんによると、カナダの会社では失敗に対して寛容で、年功序列もなく、5時以降は基本的に働かないそうだ。"
}