{
  "episodeGuid": "9c3f6816-2a68-4373-8c11-954083f080e8",
  "episodeTitle": "もしや技術より大事？未経験からカナダ就職を成功させた「ソフトスキル」戦略（前半）#15",
  "transcribedAt": "2025-10-18T00:25:01.636Z",
  "duration": 2442,
  "fullText": "それでは今回はひろし君に来ていただきました簡単に経歴を教えていただいて。もいいですかはい私は磯部ひろしといいまして現在は楽天グループでロジスティクス分野のプロダクトマネージャーとして東京で働いてます2021年から2024年の間カナダに住んでまして住んでいた頃は初めは1年4ヶ月ランガラカレッジのWeb&モバイルアプリケーションWMDと呼ばれるそこに通いまして卒業直後に電気自動車系のスタートアップに就職しましてWebモバイルのエンジニアとして2年間働きましたそこから日本に本帰国をしましてニッサン自動車で1年間働いた後今に至るという感じですね。まずはそしたら結構遡るんですけどカナダに渡航する経緯みたいなのがあったら。教えてくださいそうですね僕は今社会人11年目ぐらいになるんですけど初めは営業をやってたんですね4年ぐらいですかね全然仕事面白くねえなみたいな全然頑張りたくねえなみたいな感じでノロノロと生きてたんですけどその次に何かの巡り合わせでウェブマーケティング系のベンチャーに入りましてそこでIT系の分野に本格的に触れることになったんですねそこですごいいろんな成功体験を得ることができて自分的にもすごい肌に合っていたなというのがあって自分はもうIT界隈でずっと生きていこうというふうに思ったんですよねそこでITに登り込んでいく中でエンジニアの人たちと近くで働く機会も結構あってで、HTMLのコードとかちょっと書かせてもらったりとかする中ですごい面白いなって思うようになったんですよねエンジニアになるのも選択肢としてありだなっていうのを考え始めてそこでいろいろリサーチし始めたらですねどういうきっかけだったか忘れたんですけどカナダでエンジニアになるっていう選択肢もあるぞみたいな感じでフロッグのページにたどり着いたんですよねで、僕は外国語系の大学を卒業しているということもあって海外で働く生活するみたいなことに昔から興味はあったんですけどなんかそんなことを想像できる感じじゃないよねっていうのであんまり現実の選択肢として考えてなかったんですけどなんかそのフロックの情報を見始めてからそれが現実味を帯び始めたというかそれでじゃあまず説明会に行ってみるかっていうのでこういう学校があってこれぐらいの学期があったら通えますよとかこういうルートで就職できますよっていうのを聞く中でこれなんかできるなみたいなやってみるかっていうのを感じて行動に移し始めて計画を立て始めたっていうのが経緯。ですね具体的にはそのフロックの何を見てああできそうだなみたいな思ったんですか何で情報収集をされたんです。かまずはその説明会に行ったっていうのがなんかあのこういう選択肢があるんだこういう団体があるんだっていうので当時秀人さんという方があの説明会のホストをしてたんですけれどもそこに行ってで大学のチラシをもらったんですよねでその時にコーナーストーンまあその時あのこれいけるかもって思ったのがコーナーストーンだったんですけどでコーナーストーンで確か当時はまあ1年でプラスコープで学費200万ぐらいんだよでこれだったらなんか頑張ってお金貯めてでコープで1年働いてってやったらなんか頑張ればフロッグの助けもあれば頑張ってもいけるんじゃないかってまぁ当時のそのなんですかね資金状況とかもあの考えながらなんかいけそうだなって思ったっていうのがまあ初めだったような気。がしますねなんか働いてる時にエンジニアの人と一緒に働く機会があってITの分野にコーディングするっていうことに興味が出たっていうの私も似たような経験でカナダに来ることにしたのでちょっと共感するところがありました本当。ですかはいしろし君の場合はあれですよね銀コインでしたよね確か来る前。は来る前はそのウェブマーケティングのベンチャーにいたんですけど銀行員は社会人の一番初めは銀行員でした。ねそういうことね、じゃあその銀行員から始めて日本で転職をしてウェブマーケティングの時にコーディングするとかだったりちょっとそのエンジニアと関わるみたいな機会ができたってことなのかなそうですねそうなんですね、もうなんかあの何かの記事かわかんないあのフロックの売り出し方なのか銀コインからみたいな感じだったからなんかその銀コインってところがでかすぎてそっからもう銀コインのまま来たのかと思う。銀コインから直接カナダに来。たのかなって思ってましたね。銀コインって言う方が今日ね若干引きがあるんでちょっとあのそこが独り歩きしてる気分はあるんですけどまぁでもあの実際銀コインではあったんで嘘ではないかなという確か。に確かにでえっと外国語学校出てたんですね全然知らなかったじゃあ外国語学部ですね学部はいそしたらじゃあ英語はもう完璧だったみたいな感じなんです。かまあ完璧ではなかったんですけどあの得意分野ではありましたねでもあのなんでしょうね、カナダで学校とかに通う中でプレゼントとかする機会もあると思うんですけどそこではまあたくさん恥ずかしい思いをしましたしなんで自分はこんなにできないんだっていうことを思ったのはありますけどコミュニケーションを取るっていうところに大きな問題があったわけでは渡航時点でもなかったかなという気はしますなんか。そのなんだろうカナダに行こうかなって思うその準備をする前の時点でなんかどのぐらいのレベルあったとか。ってわかりますかえっとじゃあ留学しましょうってなってあのアイエルツが必要ですねってなってまぁじゃあ受けましょうっていうので出願とかする前に出願の条件がそのアイエルツの点数であると思うんですけどもまずアイエルツ受けましょうってで1回初めに初めて受けたアイエルツの点数がオーバーオール6。\n0でしたねで、トイレでいうと900ちょい、940とかは取ってたと思うんですけどそれぐらいのレベルでしたねおー、。で、えっとじゃあもうそれをそのまま使った、そのIL2を使って入学できたんですか?それともその後に自分でまた勉強して出願のためにまた取り直したみたいな。のがあったんですか?結局、CICCCいいなって思ったんですけど、ビザの話とか色々聞いていく中で、学費はちょっと高いけどランガレにした方がいいなってなったんですよね。で、ランガラの出願条件がIELTSOveral6。\n5だったんでいけるっしょみたいな感じで初めてIELTS受けたんですけどやべえ足りてねえみたいになって今まで英語が得意分野であんまり英語で挫折した経験がなかったのでやべえやべえってなって死ぬ気で勉強したんですよねそしたら高校前にはIELTS7。\n5まで上げることができてそれで晴れてランガラに出願できたっていう経緯はありましたね。抜きで何されたんですか?その1。\n5を上げるって結構かかりますよねなんか1上げるのに半年とかでしたっけ目安。ってだいたいまあなんか目安はなんか0。\n5でTOEIC100ぐらいの間隔みたいな記事はありますけどでもやったことといえばまずそのIELTSの採点基準を勉強したっていうのはありますねなんかYouTbeとかにIELTSスピーキング8。\n0のモデルアンサーみたいなのが上がってたりするんですけどなんかあれこれ意外と流暢じゃないなみたいなのを思ったんですよねで、再転換はどんなことを見てるんだろうって思った時に、流暢さみたいなのはあんまりその…もちろん重要なんですけど、トピックに外れてないかとかフィラーワードを不必要に使ってないかとかなんか英語そのものよりもロジカルにコミュニケーションを取るみたいなところになんか主眼が置かれているような印象を受けたんですよね採点基準とかを見た時にだからなんかそこはなんか自分のフォーカスポイントがちょっと違ってたなみたいなのを思ってじゃIL2で高得点を取るための喋り方とか文章の書き方ってなんだろうっていうのを勉強し始めたっていうのがありますねそれに加えてあの毎日あの仕事に行く前に30分その英会話レッスンをやってたって感じ。ですじゃあなんかちょっとどっちかというとIELTSのハックというかそのテストっていう形式にがあるからこそのちょっとそのハッキングみたいなのができたみたいな感じなんです。よねそうですね、もうとにかく点数を取ることがもう先決だっていうので、そこを攻略しにかかったって感じですね。もともとIL-6でTOEICだと900何十あったってことですけど、その大学時代とか、インプット、アウトプットどういう勉強されたんですか?大学の時その900いくらを取ったのは多分大学2回生ぐらいの時だったと思うんですけどなんかあの1回初め本当初め抜けた時はなんか700800いかないぐらいだったの気がするんですよねでなんかあのなんか自分的なちょっと悔しかったというかなんかもっといけんだろうみたいなことをちょっと思ったまあ英語が得意分野でもあったんでやるだけちょっとやってみるかっていうのでまずはその語彙を増やしましたねTOEICって受動的な試験じゃないですか選択肢ですしアウトプットがないリスニングと選択問題リーディングの選択問題全部選択問題ですよねなんでまずは語彙を増やす必要があるなっていうのでキクタンっていう英単語集の900点目指す人用のやつみたいなのを買ってそれを語彙を増やしましたねでそれと高校時代にあったなんかネクステージという文法書みたいなまあコロケーションとかを学べる文法書だったと思うんですけどそれをなんかこうなんだろうな部活やってたんですけどあのその部活に行く途中のバスの中でこうぐるぐるやったりとかしているとなんか900点取れたって感じですね。そうですね真面目ですね部活に行く途中とかなんかさっきもあの学校に行く途中みたいなワードが出てたけど会社に行く途中かなすごいじゃあ結構コツコツとずっとなんだろう学生の頃からやってきたって感じなんです。ねまあそうですね社会人になってからそのカナダに行くってなるまではあんまりその英語の勉強って英語を使う機会もなかったってのあるんですけどあんまりやってなかったですけど大学の時代にガッと上げたっていうのはそれがそれがきっかけでし。たかなそのなんかテスト対策とかでILTとか遠いって言ってあのテストのどういう対策をするかで結構点数でポンって上がったりするかなって思うんですけど実際じゃああのカナダに渡航後、大学とか行って実際にコミュニケーションの場が増えた時。になんかギャップとか感じました?できると思っててもなかなかできないなってっていうのはなんかあのうまくここ言語ができないんですけどありましたねそのまあアイエルツも面接とかでありますけど言うてやっぱりあの何なあなたは何なりですか何十分何十秒で考えてくださいってすごいこうあの公主交代が明らかな場面だと思うんですけども、結構その実生活、英語圏での実生活ってなると、その限りでないというか、なんかグイッと入っていかないといけないとか、ちょっとジョークを言った方が場を和ませられるようなとか、なんか頑張って言ったけど意外と場がしらけちゃったなみたいなとかもあると思うんで、英語学そのものを超えたところに、英語運用能力というもと中小的な概念があって、そこに入っていかないと、ちょっと生きていくってなるときついよな、やっぱまだまだだなって思ったギャップっていうのはありましたね。そこはもう、馬鹿ずを踏んで、裸をつかんでいくしかないとは思うんですけど。勉強頑張った人ほどそういうのってショック受けて、私も同じ部類だなって思ったんですけど、勝手に。なんか勉強して単語数増やしていい点取れたとかって思って実際にネイティブと話してみるとあれなんか大丈夫かな今大丈夫だったかな今の回収とかすごい不安に思ったりとかしてっていうのがあったのでそういう人いっぱいいるんだなーってちょっと自分。も勇気をもらいましたみんな、りょうさんもそうだと思い。ますよりょうさん結構ドドドって言ってるからな僕どうなっ。たかなぁ僕あんまりなんだろうなんかあんまジョークのこととかはあんまそう考えるんだってちょっと思って聞いてました気にしなかったかもしれないです通じなかったら残念ぐらいであとは多分僕はあんまりインプットとかちゃんと頑張ってコツコツやってたタイプでもなかったんでそこら辺に対してあんまり自信はなかったんですよねだからなんかまぁこんなもんだろう感はありました。だからなんかまぁこんなもんだろう感はありました。僕来る直前になんかあの英語のライズアップみたいな学校があって、それでなんか3ヶ月で教育300点あげるみたいな、それはあの5位をめちゃくちゃ増やしてくれたんでよかったんですけど、なんかそこでちょっとあのパッチ的になんだろ英語頑張った感じで、それ以外はなんかあんまり頑張ってこなかったのかな。で、なんだろ、あんまりそこらへんになんか悔しいみたいなのはなかったですね。Wel,Idin'tfkwasrealyupsetabouti。まぁ、。でも、ちょっと、あんまでもそのあとなんだろ、だから、。Wel,butIdon'kwhathappendafterhat,so。\n。\n。それこそ語彙の足りなさとかでその就職してからとかあの転職したタイミングで全然しゃべる人がガラッと変わってまた通じなくなったとかなんか語彙数こっちの人たちめっちゃ多いぞとかでなんか所々やっぱ悔しい思いみたいなのはしてるけどなんかあんまりその最初の入りはあんまり気にしなかったかもしんないです。ねまぁちょっとタイプによるところはありますよね。タイプによりますね本当になんかなんかやっぱ2人ともなんか聞いててインプットも多いし結構コツコツ頑張ってきたタイプなんでまあそういうふうに最初のところで感じやすいのかなみたいなのはありますねあとねなんか逆になんか度胸だけで来たみたいな人たちはなんか最初俺は来てんじゃねーみたいなところから入って徐々に徐々になんか難しいところとか入っていくとなんか全然ダメだみたいになるのかなって思うんで本当タイプ次第って感じですねそしたら英語のことは結構聞けたかなと思うんで技術について聞いていきたいんですけどウェブの会社にいたときにちょっとhtmlとかは使う機会があったそれとも見るぐらいみたいなそういう人たちが周りにいたぐらいな感じ。なんですか一応書いてはいたんですけど、本当なんか書いたっていうか修正したみたいな、アフィリエイトサイトみたいなあるじゃないですかで、この商品とこの商品の順位を入れ替えてください、そのDIVを入れ替えてくださいみたいな、あとは広告の計測タグをボディのとこに入れといてくださいみたいな、なんかそのレベル、ウェブマーケットの会社に行ったときはもうそれのレベルでしたね、やったのは。そうすると、カナダに来るまでは特に技術力を上げるのは自分ではせずにって感じですか?でも退職をして順序的に言うと出願して退職してちょっと時間があって投稿みたいな流れだったんですけどちょっと時間があっての時にUdemyでHTMLCSJavaScriptとあとAdobe系のフォト書とかいられですねを一通りちょっとやって一通りそのUdemyでやるだけなんで簡単なマークアップとちょっとJavaScriptでロジック組むぐらいのことはできるようにはなってランガラが始まったっていう感じです。ちょっと補足するとあれですよねランガラは2年間行って2年間のコースでその後3年間のビザがもらえるっていうのがバンクーバーにあるランガラカレッジの流れみたいな感じですよねそうですね。一応なんか2年なんですけど厳密に言うとその2年間で全部取り終えてくださいねというプログラムなんで詰めると1年4ヶ月で取れるんですね大体日本人の僕の知り合いは1年4ヶ月で終えている人がほとんどなので実質1年半もないぐらいのカリキュラムで3年のビザが出るという超お得なプランとなっておりますという感じですね今ちょっともしかしたら制度が変わっているかもしれないけど当時はそうでしたね。じゃあ基本的には技術力はその学校で1年4ヶ月の間に身につけたって感じ。なんですかまあそうですねただあの学校でまぁそこそこ予習してたのでそのランガルのカリキュラムはマージの初心者でも入っていけるカリキュラム構成になってるんですよで、そこでもう授業に全集中するというのとあとまあ課題もしっかり丁寧にやるで、あとはその自分SNとかでですねあの自分の近況とかを発信したりとかしてたのであの学校からちょっと仕事をもらったりとかあとは日本にいた頃の知り合いからちょっと開発系の仕事をもらったりとかっていうのはあったのでそういったところでちょっとした実務経験を積みながら学校のプロジェクトもやりながら技術力を高めていったっていうのがありました。かね学校からもらう仕事ってどんなのがあるんですか?よくLinkedIとかでランガラに行ってる方のレジュメとか経歴を見てるとランガラで働いたっていうのが何ヶ月とかあってどういうことなんだろうって私思ってたんですけど。なんかいろいろあるらしいんですよねあのランガラには大きく2つぐらいあんのかなあの僕まず一つ目がその学校で例えばなんだろうなそのなんかのショーケースをしますなった時にその専用のホームページウェブページを作るためのプロジェクトチームを作ってランガラの生徒で作ってコントラクト的に働くっていうものが一つと、もう一つが他の生徒の課題をマーキングするっていう仕事があってですね、僕はその校舎の仕事をいただいてましたね。プラス、先生の知り合いの家庭教師をやってくださいみたいな、ワードプレスを勉強している、ワードプレスじゃないかな、HTMLCSを勉強しようとしている知り合いがいるので、その人の家庭教師をやってくださいっていう仕事があってですね、そこの仕事をもらう方ってこともあります。なんか大学で言うTAみたいなティーチャーアシスタントみたいな話な。のかなまあTAの一個したというかTAはまた別にいるんですけど僕らがマーカーと呼ばれてましたねアサインメントマーカーみたいなこと言われてましたけどデベロップメント系の学部なんで課題っていうとなんかこういうアルゴリズムを持ったウェブページを作ってくださいみたいなそれでコードを見てこれ要件満たしてませんねとかこれちょっと書き方が悪すぎますねとかっていうのを100点満点とか10点満点で回転してやっていくみたいなあの。さっき学校の授業に全力投球するってことだったんですけど今までインタビューしてきた人たちはある程度学校のことをサボってちゃんとなんだろうその就職に必要なことをやることで就職ゲットしたぜみたいな人が結構多かった印象なんですけど広志くんは全力投球っていうのは本当もう学校に言われたことをちゃんとやるって感じだったんですかそれとも何だろうその学校でやることはそこそこにやっぱ就職のために最初から準備してきたタイプなのかなってどっちなのか。なって思いましたなんか初めどうやってカナダで生きていきましょうかねみたいな話を秀人さんに相談したことがあったんですよね当時のフログのコンサルタント的な立ち位置にしていた人ですけどGitHubとかあとLinkedIのプロフィールはいつ作りましょうかとかそういう話ってあるじゃないですかでその多分乱柄のカリキュラム構成だと後半多分めっちゃ忙しくなりますよみたいなプロジェクトがあるんでなんでそのプロジェクトが本格的に始まる前にそのGitHubとLinkedIを作っておいた方がいいですよっていう話があったんですよねなんでまあ確かに最初のうちはそんなに忙しくなかった全力投球してもまだあの時間は余ってる感じはあったんでその余った時間を使ってその就職に必要なツールのあのなんかなんですかねあの下地を作っておくというかあのプロフィールを作っておくのもそうですしそのユーデミーでですねそのあのなんだろうなKillerLinkedInプロファイルの作り方とかインタビューでなんかどうこうしたらこういうインタビューはダメですよとかこういうレジュメはダメですよみたいなコースを取って注釈活動を始めるための道具を作ってた仕込んでたみたいな感じですね初めのうちは。ランガローの中では具体的に何を勉強されるんですかなんかhtmlcsとかから始めると思うんですけど結構なんだろうこっちでよくあるとなんかweb系のえっとジョブポストが多いと思うんですけどなんかリアクトだったりタイプスクリプトだったりとかなんかそこらへんも勉強されるんです。かタイプスクリプトは残念ながらあのカリキュラムには入ってませんでしたねでもあのまあよく言われることですけどそのリアクトとかそのjavascriptベースのフレームワークを使う前にhtmlcsでちゃんとマークアップできるようになったかないとちょっと辛い場面がありますよねみたいなあの話がまあちょっとあったりすると思うんですけどランガラもそういうスタンスをとっていてまずは初めの一番ランカラってプロジェクト3回あるんですよで一番初めのやつはフレームワーク使ってはいけませんっていう縛りがあるんですよねでHTMLシリーズJavaScriptだけでやってくださいバックエンドはFirebaseでやってくださいみたいなのがあるんですけど2セメスター目からリアクトの授業が始まってリアクトでウェブアプリを作るっていう実地的な学習が始まっていくって感じでした。かねなんかバックエンドとかデータベースについてはどうです。かバックエンドはノードJSとJavaがあったんですけどJava…これ結構ね、ランガラも先生の質というとちょっと乱暴な言葉ではあるんですけど運ゲーみたいなところがあるんですよね僕の1個下ぐらいの高等の人たちはバックエンド系の言語の授業がかなり濃密でちゃんとしてましたよって感じなんですけど僕の時はですねノードJSの授業はまあそこそこちゃんとしてたんですけどJavaとデータベースのやつはなんかもうLinkedIラーニング見といてくださいじゃあねみたいなそんな感じの残念なやつだったんでそこまで重点的に。はやってなかったCSの知識とかも触れることなくアルゴリズムとかもなく結構実践的なフレームワークとかが多かった。そうですねあのまあ言うて1年4ヶ月の授業なのでそのcsのファンダメンタルのところからやるってなるとあのどうしてもやっぱちょっと時間が足りないととにかくそのカリキュラムの中で一旦就職できるレベルにまで持っていくっていうのがおそらくランガラwmdのあの史上名台的にあるような気がするのでまああの当時エンジニアとして働いてた頃まあ僕も今もそうですけれどももうちょっとそのコンピューターサイエンス的なファンダメンタルな知識はつけないとなぁみたいなあのことは思ってたのでちょっとまあそういう系の本を読んだりとってのはありましたけどまああの授業の内容としてはそんな感じここ。足りなかったなぁみたいなのありますかなんか先にを自分でやっとけばよかったなぁみたいなのってありまし。た自分でやっておけばよかったなっていうのはだいたいやってたような気がするんですよねなんでそのあまりその辺について後悔はないと記憶してます。さすがですそしたらえっと就職活動についてちょっと聞いていきたいなぁと思うんですけどなんだろうざっくり就職活動何したんですか。就職活動はですね僕ほとんど何もしてなくてあのまあ本当にレジュメをめっちゃアプライするとかいっぱいインタビューに行くっていう意味でのその就職活動ってほとんどしてなくてあのランガラーのプロジェクトする中でですねまあそのマーカーとして働く中でですねまあいろんな人とつながってランガの学内の人とつながってで学校経由でリファラルを3件ぐらいもらうことができたんですよねフルタイムの就職ででそれを3件プラスフロッグであのこういうポスト募集してるんですけどっていうなんか募集みたいなのがあってここに応募してそれが最終面接ぐらいまで進んでたんですよでそれ進んでた段階でここいいなっていうあの就職場所のリファラルがもらえたんでそっちに行きますっていうのであのまあ意思決定をしたっていうのがあります他にはまああのミートアップに行ったりもしてましたけどなんかレジュメを出した件数で言うと10件いかないぐらいでしたね就職活動っていうとえっと。なんだろう、それってそのレファレルだったりだとかそのフロックのやつとかって誰でもなんかチャンスが回ってくるわけじゃないじゃないですかそれってなんだろう、どうしてそれが自分に回ってきたなぁと思い。ますかなんかフロックのやつは僕はなんかそういう自分が何かコネクションができるとか業務経験を詰めそうだなっていうチャンスがあると0秒で食いつくっていうことを自分にルールとして課してたんですよあのとなんかそれが本当にあの実利があるものかどうかは動き出してから考えればいいみたいな感じだったんでまあそのフログ経由のあの求人応募についてはまああのとにかくあのなんかね0秒ポチっていうのがまあの秘訣だったかなと思うんですけどリファラルについてはですねあのまあ一つはマーカーをしてた時に近くで働いていた日本人の先生だったんですけれどもその人にそのマーカーの仕事のなんか丁寧さを買っていただけたっていうのがありますねっていうふうに言っていただきました個人的に連絡をいただけてその知り合いの会社でこういうポジションがあるんですけど広瀬さんだったらなんか合うかもって思いましたみたいなもう一つがコーディング系の授業ではなかったんですけどランガラでビジネス系の授業があったわけですよなんかビジネスプランを作ってロジカルにプレゼンテーションしましょうみたいなランガラにはそういうのがあったりするんですけどもそこで一緒だったプロジェクトチームが一緒だった女の子から私のハズバンドの会社でデベロッパーを募集してるんだけどみたいなものがあったのとでもう一つはまあこれがそのもう一つ一番最後のやつがあの自分の就職先もなったんですけれども乱柄の授業のプロジェクトでえっと2セメスター3セメスターかな2セメスターあの一緒にプロジェクトチームをやったあの友人からいただいたあのこのリファラルでしたねなんでまあ何をやったかっていうのはもう本当にあの自分に課されたことについてあの常に120%でやるっていうことをやっていたらなんかその姿勢が皆さんに買っていただけてあのそういうことにつながったであとはまあなんだろうな乱柄の授業まあ乱柄に限らずですけれども授業の場とかでなんかもうとにかくめちゃくちゃ発言してたんですよリモートの授業もありましたけどインパーソンの授業であったら一番前に絶対座って質問がなくてもうめっちゃ先生に質問するみたいなでなんかプロジェクトマネージャーやる人とかやったらはいやります0秒でまた手あげるみたいなのをやってたらなんかそのなんかそこそこ有名になっていって技術力としてはまだまだジュニアだけどなんかもうエグい前のめりのやつがおるみたいなので、そういうのにつながったのかなっていうふうに思います確かに、。ひろし君はずっとそういう印象ですね最初のそのレファラルとか自分で応募とかは、その就職のための応募とかしてないっていうのだけ聞くと結構この人ラッキーだったのかなってちょっと思いがちなんだけど本当に何事にもマイノメリでなんか前に僕ともう一人の人と広瀬くんでなんかイベントやった時があってそれもなんかどういう話からそれになったのかわかんないけどあのイベントやろうって僕が言ってでこれしなきゃこれしなきゃっていうのが広瀬くんがいるとどんどんどんどん勝手に進んでいくんですよこれがすごい行動力だなぁと思ってあとはなんだろうそのこれ俺やりますっていうのが本当に強くてやっぱなんかそういうなんだろう前のみの姿勢なんですかねやっぱりが変わったのかなってちょっと聞いてて思いましたね。見習わないといけないだってなかなか外に外にオポチュニティを求めて手を広げていく人はいっぱいいますけど今もらっている環境で100%やってその中で認めてもらってっていうのってなんかそちら方が意外と手っ取り早かったりしそうですよね。結果に深井でも僕が日本国内でデベロッパーとしての就労経験が3年とか4年ありますってなったらちょっとまたアプローチの方は変わってたような気もします僕は実務経験がなくてカナダに来る人ってランガラに通うってなっててももう既にCSの学位持ってますみたいな人もいるわけですよなんでその人たちとそのなんか正面切って戦うってなると技術力ではもう到底立ち打ちできないわけなのでその持たさるものの戦略としてそのソフトスキルでぶった切るみたいなあのことを自分の戦略としようっていうのは渡航前にちょっと決めてたっていうのがあるのでまああの戦略の違いかなとは思いますね。まあね技術ある人たちでもやっぱり結構それでもなんだろう難易度こっちで最初に就職するっていうのは難易度高い中で未経験からっていうのも当時すごいなんだろうすごいなって思ったし多分他の人もみんなそう思ってたしでもなんかそれこそコミュニティのフロックのスラックチャンネルとかでも、なんかどこのチャンネル見てもひろしくんいるぐらい、結構いつも発言して、なんかわーわーってか、なんか存在感があふれてたんで、まあなんかそういうところなの。かなっていうふうに思いますね。そしたら就職活動はそこら辺であと3つのレファラルとフロッグから来たものの1つがあったと思うんですけど面接はどんな。感じでしたか?面接でいうとフロッグ経由でやったやつしかなかったんですけどそこでは多分職種的にはワードプレスデベロッパーでデザインエージェンシー的な色が強い会社のポジションだったんですよねでそこで聞かれたのはなんかなんですかねそのキャリアゴールとかなんかじゃあのワークプレイスでこういうトラブルがあったりあなたならどういうふうに解決しますかっていうような質問があった気がしますね僕がまあジュニアレベルだったっていうももちろんあると思うのでそういうソフトスキルの質問が重視されていたってのもあると思うんですけどそのポジションではコーディング面接みたいなのはありませんでしてもう一つは結局就職先のあったところについてはですね社長面談ぐらいしかなくてそれはなぜかというとですねプロジェクトで一番近くで働いていたチームメイトからのリファラルだったんで彼は僕が働いたらどういう働き方をするかっていうのは容易に想像ができたと思うんですよそれを多分社長とか上司に伝えてくれて上司となる方とちょっと電話で話して何話したかわかんない覚えてないほとんど何も話してないんですけどじゃあなんか行ったら働けるみたいな話になって社長とこれも面談ぐらいの感じでしたね一応そのポートフォリオサイトみたいなのを作ってURLを渡してたんですけどなんかなかなかいいデザインだねみたいなことを褒めてもらったっていうのと僕そのまあ電気自動車系の分野にちょっと興味があったっていうのもあってそのこういうふうにキャッチアップしてますあなたの会社のビジネスこういうところがいいですよねどんなきっかけがあったんですか?みたいなことを質問してたらなんか社長もなんかちょっと嬉しそうにしてじゃあこれからよろしくみたいな感じでお仕事が始まったって感じでし。た本当になんかソフトスキルでぶった切ってる感じですね全体的にそしたら今まで聞いてこなかったんですけど日本にいた時から具体的にこっちに来てどのぐらいのお金使いました?どのぐらいあったらこっちで就職までお金持ちますかね?これ、そう、その質問のリストにあったんで、過去の記録をちょっと辿って思い出してたんですよ、さっき。見たらですね、16ヶ月渡航しました、じゃあカナダに着きました、今からカナダで生活しますってなってから、ランガラ卒業まで16ヶ月で、だいたい生活費で言うと42,000カナダドルぐらいでしたね。42,000カナダドル、。はい。で、前払いの額費とか、その航空券とかいろいろ含めたら、ミニマム5万カナダドルあったら。…ミニマムでだから500万ぐらいってことですかね。そうですね。レートはあると思うんですけど、当時ね、僕まだ85円とかのレートだったんで、もうちょっとあれなんですけど。確かに。なんでミニマム5万ドルだと思うんですけど金ドルだと思うんですけどそれだと卒業時にお金がなくなっちゃったっていう状況になると思うんでまあ650万とか700あったらそこそこ余裕を持っていけるのかなと思いますねでうまくいけばその在学中にちょっとパートタイムの仕事やったりとかもあると思うんで600あったら行ってもいいんじゃないかなって僕はちょっと思います1年。半くらいですよね。あれ?2年?あ、。1年4ヶ月ですね。あ、。1年4ヶ月。はい。えろし君は具体的にいくら持って行ったらいいかなか?僕は700ぐらいあった気。がしますね。結構貯めてたんですね。おじいちゃんが残してくれたやつとか、あとはその勤めてた会社がちょうどいいタイミングで上場して、その上場賞与がいいタイミングでもらえたみたいな、ちょっと運ゲー的なとこはあったんですけどね。そっか、そうですね、ランガラって確かその1年行って1年のビザもらえるっていう学校に比べるとちょっと高いのかなっていうのとあとはちょっと長いからそもそも頑張っても1年4ヶ月はかかっちゃうんであとは忙しいからパートタイムできる人もいるかもしんないけどちょっと難しいみたいなのを加味したら確かに600万700万ぐらいは必要なのかなって感じですよね僕とか彩香さんが言ったコーナーストーンだとそれも経験者か未経験者にも関わってくると思うけど経験者だと割と結構少ない金額でとりあえず来て学校分と飛行機とか払ってきてあとはリモートで日本の会社の働きながらみたいな人たちもいるからそういう人たちはもっともっと少ないんだけど今回の広志くんのパスで言うと何百万ぐらいあるといいかなって感じですねそうですねそしたら最後にカナダでの会社の年収についてちょっと聞いていっ。てもいいですか一番初めオファーをもらった時のスタートの年収は5万5千カナダドルでしたね。ということは550万ぐらい。550万、はい。で、3年後ぐらいに1回なんか交渉して、それがなんか60…あ、やったじゃん。6万5千になったのか。だから100円と1万ドル上げれたのがありますね。でその上がったぐらいのタイミングで田中雄介さん大下雄也さんの会社でちょっと副業としてお仕事をもらい出したのでそれが年間算すると1万4000ドルぐらいだったんですよねで、プラスフロックのインタビューも2ヶ月に1回ぐらいやらせてもらってたんで、昼食始まりましたっていうタイミングでは55Kの5万5千ドルのスタートだったんですけども、1年後ぐらいには8万ドルぐらいになってたって感じですね。おーすごい。なんだろう。働き方とかどうでした?なんか、。まあ、。練習とかのなんか満足度とかあとはその、なんだろう、結構じゃあ副業やれてたってことは結構ホワイトな感じで時間通りに終わるとかって感じだったんですか?なんかそもそも労働時間が全く管理されてなくて、えーなんで、まあ僕はあの8時間ちゃんと働いてそれのアウトプットをするっていうのは自分に課してましたけど残業みたいなのはもうほぼなかったと思いますね一回その同僚と、金曜日ちょっとじゃあ仕事終わりにご飯でも食べようぜみたいな話になった時に、大体5時ぐらいに終わると想定してたんで、じゃあ5時半ぐらいにするみたいな話をしたら、いやいや12時半ぐらいでいいだろみたいな。いやいや仕事どないすんねんみたいな。で、それでそういう感じの空気感だったんで、なんかちょっと緩すぎたっていうのはあるかもしれないですけど、労働時間的にはそんな感じだったんで、十分副業の時間は取れたと。まあなんだかんだそれでもなんかずっと働いてたみたいな気持ちはありますけどね副業もしっかりやっててとそんな感じでしたなんか。それこそひよしくんやっぱりその置かれた環境で頑張るみたいな人だから結構ちゃんとその9時5時なのかなって働いてそうだけど確かにその漢字聞くと同僚の漢字聞くと金曜日は午前休みたいな午前で終わりみたいな普通の日も3時4時ぐらいに終わるみたいな空気感が漂ってそうな。そうですねということで。最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "A",
      "text": "それでは今回はひろし君に来ていただきました簡単に経歴を教えていただいて。",
      "start": 168,
      "end": 5270,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "もいいですかはい私は磯部ひろしといいまして現在は楽天グループでロジスティクス分野のプロダクトマネージャーとして東京で働いてます2021年から2024年の間カナダに住んでまして住んでいた頃は初めは1年4ヶ月ランガラカレッジのWeb&モバイルアプリケーションWMDと呼ばれるそこに通いまして卒業直後に電気自動車系のスタートアップに就職しましてWebモバイルのエンジニアとして2年間働きましたそこから日本に本帰国をしましてニッサン自動車で1年間働いた後今に至るという感じですね。",
      "start": 5270,
      "end": 46388,
      "timestamp": "00:05"
    },
    {
      "speaker": "A",
      "text": "まずはそしたら結構遡るんですけどカナダに渡航する経緯みたいなのがあったら。",
      "start": 46388,
      "end": 52512,
      "timestamp": "00:46"
    },
    {
      "speaker": "B",
      "text": "教えてくださいそうですね僕は今社会人11年目ぐらいになるんですけど初めは営業をやってたんですね4年ぐらいですかね全然仕事面白くねえなみたいな全然頑張りたくねえなみたいな感じでノロノロと生きてたんですけどその次に何かの巡り合わせでウェブマーケティング系のベンチャーに入りましてそこでIT系の分野に本格的に触れることになったんですねそこですごいいろんな成功体験を得ることができて自分的にもすごい肌に合っていたなというのがあって自分はもうIT界隈でずっと生きていこうというふうに思ったんですよねそこでITに登り込んでいく中でエンジニアの人たちと近くで働く機会も結構あってで、HTMLのコードとかちょっと書かせてもらったりとかする中ですごい面白いなって思うようになったんですよねエンジニアになるのも選択肢としてありだなっていうのを考え始めてそこでいろいろリサーチし始めたらですねどういうきっかけだったか忘れたんですけどカナダでエンジニアになるっていう選択肢もあるぞみたいな感じでフロッグのページにたどり着いたんですよねで、僕は外国語系の大学を卒業しているということもあって海外で働く生活するみたいなことに昔から興味はあったんですけどなんかそんなことを想像できる感じじゃないよねっていうのであんまり現実の選択肢として考えてなかったんですけどなんかそのフロックの情報を見始めてからそれが現実味を帯び始めたというかそれでじゃあまず説明会に行ってみるかっていうのでこういう学校があってこれぐらいの学期があったら通えますよとかこういうルートで就職できますよっていうのを聞く中でこれなんかできるなみたいなやってみるかっていうのを感じて行動に移し始めて計画を立て始めたっていうのが経緯。",
      "start": 52512,
      "end": 171943,
      "timestamp": "00:52"
    },
    {
      "speaker": "A",
      "text": "ですね具体的にはそのフロックの何を見てああできそうだなみたいな思ったんですか何で情報収集をされたんです。",
      "start": 171943,
      "end": 181615,
      "timestamp": "02:51"
    },
    {
      "speaker": "B",
      "text": "かまずはその説明会に行ったっていうのがなんかあのこういう選択肢があるんだこういう団体があるんだっていうので当時秀人さんという方があの説明会のホストをしてたんですけれどもそこに行ってで大学のチラシをもらったんですよねでその時にコーナーストーンまあその時あのこれいけるかもって思ったのがコーナーストーンだったんですけどでコーナーストーンで確か当時はまあ1年でプラスコープで学費200万ぐらいんだよでこれだったらなんか頑張ってお金貯めてでコープで1年働いてってやったらなんか頑張ればフロッグの助けもあれば頑張ってもいけるんじゃないかってまぁ当時のそのなんですかね資金状況とかもあの考えながらなんかいけそうだなって思ったっていうのがまあ初めだったような気。",
      "start": 181615,
      "end": 232371,
      "timestamp": "03:01"
    },
    {
      "speaker": "C",
      "text": "がしますねなんか働いてる時にエンジニアの人と一緒に働く機会があってITの分野にコーディングするっていうことに興味が出たっていうの私も似たような経験でカナダに来ることにしたのでちょっと共感するところがありました本当。",
      "start": 232371,
      "end": 250887,
      "timestamp": "03:52"
    },
    {
      "speaker": "A",
      "text": "ですかはいしろし君の場合はあれですよね銀コインでしたよね確か来る前。",
      "start": 250887,
      "end": 256813,
      "timestamp": "04:10"
    },
    {
      "speaker": "B",
      "text": "は来る前はそのウェブマーケティングのベンチャーにいたんですけど銀行員は社会人の一番初めは銀行員でした。",
      "start": 256813,
      "end": 265541,
      "timestamp": "04:16"
    },
    {
      "speaker": "A",
      "text": "ねそういうことね、じゃあその銀行員から始めて日本で転職をしてウェブマーケティングの時にコーディングするとかだったりちょっとそのエンジニアと関わるみたいな機会ができたってことなのかなそうですねそうなんですね、もうなんかあの何かの記事かわかんないあのフロックの売り出し方なのか銀コインからみたいな感じだったからなんかその銀コインってところがでかすぎてそっからもう銀コインのまま来たのかと思う。",
      "start": 265541,
      "end": 294430,
      "timestamp": "04:25"
    },
    {
      "speaker": "B",
      "text": "銀コインから直接カナダに来。",
      "start": 294430,
      "end": 296732,
      "timestamp": "04:54"
    },
    {
      "speaker": "A",
      "text": "たのかなって思ってましたね。",
      "start": 296732,
      "end": 298374,
      "timestamp": "04:56"
    },
    {
      "speaker": "B",
      "text": "銀コインって言う方が今日ね若干引きがあるんでちょっとあのそこが独り歩きしてる気分はあるんですけどまぁでもあの実際銀コインではあったんで嘘ではないかなという確か。",
      "start": 298374,
      "end": 308440,
      "timestamp": "04:58"
    },
    {
      "speaker": "A",
      "text": "に確かにでえっと外国語学校出てたんですね全然知らなかったじゃあ外国語学部ですね学部はいそしたらじゃあ英語はもう完璧だったみたいな感じなんです。",
      "start": 308440,
      "end": 320829,
      "timestamp": "05:08"
    },
    {
      "speaker": "B",
      "text": "かまあ完璧ではなかったんですけどあの得意分野ではありましたねでもあのなんでしょうね、カナダで学校とかに通う中でプレゼントとかする機会もあると思うんですけどそこではまあたくさん恥ずかしい思いをしましたしなんで自分はこんなにできないんだっていうことを思ったのはありますけどコミュニケーションを取るっていうところに大きな問題があったわけでは渡航時点でもなかったかなという気はしますなんか。",
      "start": 320829,
      "end": 352327,
      "timestamp": "05:20"
    },
    {
      "speaker": "A",
      "text": "そのなんだろうカナダに行こうかなって思うその準備をする前の時点でなんかどのぐらいのレベルあったとか。",
      "start": 352327,
      "end": 360331,
      "timestamp": "05:52"
    },
    {
      "speaker": "B",
      "text": "ってわかりますかえっとじゃあ留学しましょうってなってあのアイエルツが必要ですねってなってまぁじゃあ受けましょうっていうので出願とかする前に出願の条件がそのアイエルツの点数であると思うんですけどもまずアイエルツ受けましょうってで1回初めに初めて受けたアイエルツの点数がオーバーオール6。\n0でしたねで、トイレでいうと900ちょい、940とかは取ってたと思うんですけどそれぐらいのレベルでしたねおー、。",
      "start": 360331,
      "end": 393161,
      "timestamp": "06:00"
    },
    {
      "speaker": "A",
      "text": "で、えっとじゃあもうそれをそのまま使った、そのIL2を使って入学できたんですか?それともその後に自分でまた勉強して出願のためにまた取り直したみたいな。",
      "start": 393161,
      "end": 403159,
      "timestamp": "06:33"
    },
    {
      "speaker": "B",
      "text": "のがあったんですか?結局、CICCCいいなって思ったんですけど、ビザの話とか色々聞いていく中で、学費はちょっと高いけどランガレにした方がいいなってなったんですよね。で、ランガラの出願条件がIELTSOveral6。\n5だったんでいけるっしょみたいな感じで初めてIELTS受けたんですけどやべえ足りてねえみたいになって今まで英語が得意分野であんまり英語で挫折した経験がなかったのでやべえやべえってなって死ぬ気で勉強したんですよねそしたら高校前にはIELTS7。\n5まで上げることができてそれで晴れてランガラに出願できたっていう経緯はありましたね。",
      "start": 403159,
      "end": 443987,
      "timestamp": "06:43"
    },
    {
      "speaker": "A",
      "text": "抜きで何されたんですか?その1。\n5を上げるって結構かかりますよねなんか1上げるのに半年とかでしたっけ目安。",
      "start": 447197,
      "end": 454465,
      "timestamp": "07:27"
    },
    {
      "speaker": "B",
      "text": "ってだいたいまあなんか目安はなんか0。\n5でTOEIC100ぐらいの間隔みたいな記事はありますけどでもやったことといえばまずそのIELTSの採点基準を勉強したっていうのはありますねなんかYouTbeとかにIELTSスピーキング8。\n0のモデルアンサーみたいなのが上がってたりするんですけどなんかあれこれ意外と流暢じゃないなみたいなのを思ったんですよねで、再転換はどんなことを見てるんだろうって思った時に、流暢さみたいなのはあんまりその…もちろん重要なんですけど、トピックに外れてないかとかフィラーワードを不必要に使ってないかとかなんか英語そのものよりもロジカルにコミュニケーションを取るみたいなところになんか主眼が置かれているような印象を受けたんですよね採点基準とかを見た時にだからなんかそこはなんか自分のフォーカスポイントがちょっと違ってたなみたいなのを思ってじゃIL2で高得点を取るための喋り方とか文章の書き方ってなんだろうっていうのを勉強し始めたっていうのがありますねそれに加えてあの毎日あの仕事に行く前に30分その英会話レッスンをやってたって感じ。",
      "start": 454465,
      "end": 537323,
      "timestamp": "07:34"
    },
    {
      "speaker": "A",
      "text": "ですじゃあなんかちょっとどっちかというとIELTSのハックというかそのテストっていう形式にがあるからこそのちょっとそのハッキングみたいなのができたみたいな感じなんです。",
      "start": 537323,
      "end": 548434,
      "timestamp": "08:57"
    },
    {
      "speaker": "B",
      "text": "よねそうですね、もうとにかく点数を取ることがもう先決だっていうので、そこを攻略しにかかったって感じですね。",
      "start": 548434,
      "end": 557291,
      "timestamp": "09:08"
    },
    {
      "speaker": "A",
      "text": "もともとIL-6でTOEICだと900何十あったってことですけど、その大学時代とか、インプット、アウトプットどういう勉強されたんですか?",
      "start": 557291,
      "end": 569455,
      "timestamp": "09:17"
    },
    {
      "speaker": "B",
      "text": "大学の時その900いくらを取ったのは多分大学2回生ぐらいの時だったと思うんですけどなんかあの1回初め本当初め抜けた時はなんか700800いかないぐらいだったの気がするんですよねでなんかあのなんか自分的なちょっと悔しかったというかなんかもっといけんだろうみたいなことをちょっと思ったまあ英語が得意分野でもあったんでやるだけちょっとやってみるかっていうのでまずはその語彙を増やしましたねTOEICって受動的な試験じゃないですか選択肢ですしアウトプットがないリスニングと選択問題リーディングの選択問題全部選択問題ですよねなんでまずは語彙を増やす必要があるなっていうのでキクタンっていう英単語集の900点目指す人用のやつみたいなのを買ってそれを語彙を増やしましたねでそれと高校時代にあったなんかネクステージという文法書みたいなまあコロケーションとかを学べる文法書だったと思うんですけどそれをなんかこうなんだろうな部活やってたんですけどあのその部活に行く途中のバスの中でこうぐるぐるやったりとかしているとなんか900点取れたって感じですね。",
      "start": 569465,
      "end": 646071,
      "timestamp": "09:29"
    },
    {
      "speaker": "A",
      "text": "そうですね真面目ですね部活に行く途中とかなんかさっきもあの学校に行く途中みたいなワードが出てたけど会社に行く途中かなすごいじゃあ結構コツコツとずっとなんだろう学生の頃からやってきたって感じなんです。",
      "start": 646071,
      "end": 661156,
      "timestamp": "10:46"
    },
    {
      "speaker": "B",
      "text": "ねまあそうですね社会人になってからそのカナダに行くってなるまではあんまりその英語の勉強って英語を使う機会もなかったってのあるんですけどあんまりやってなかったですけど大学の時代にガッと上げたっていうのはそれがそれがきっかけでし。",
      "start": 661156,
      "end": 675402,
      "timestamp": "11:01"
    },
    {
      "speaker": "C",
      "text": "たかなそのなんかテスト対策とかでILTとか遠いって言ってあのテストのどういう対策をするかで結構点数でポンって上がったりするかなって思うんですけど実際じゃああのカナダに渡航後、大学とか行って実際にコミュニケーションの場が増えた時。",
      "start": 675402,
      "end": 696629,
      "timestamp": "11:15"
    },
    {
      "speaker": "B",
      "text": "になんかギャップとか感じました?できると思っててもなかなかできないなってっていうのはなんかあのうまくここ言語ができないんですけどありましたねそのまあアイエルツも面接とかでありますけど言うてやっぱりあの何なあなたは何なりですか何十分何十秒で考えてくださいってすごいこうあの公主交代が明らかな場面だと思うんですけども、結構その実生活、英語圏での実生活ってなると、その限りでないというか、なんかグイッと入っていかないといけないとか、ちょっとジョークを言った方が場を和ませられるようなとか、なんか頑張って言ったけど意外と場がしらけちゃったなみたいなとかもあると思うんで、英語学そのものを超えたところに、英語運用能力というもと中小的な概念があって、そこに入っていかないと、ちょっと生きていくってなるときついよな、やっぱまだまだだなって思ったギャップっていうのはありましたね。そこはもう、馬鹿ずを踏んで、裸をつかんでいくしかないとは思うんですけど。",
      "start": 696629,
      "end": 766579,
      "timestamp": "11:36"
    },
    {
      "speaker": "C",
      "text": "勉強頑張った人ほどそういうのってショック受けて、私も同じ部類だなって思ったんですけど、勝手に。なんか勉強して単語数増やしていい点取れたとかって思って実際にネイティブと話してみるとあれなんか大丈夫かな今大丈夫だったかな今の回収とかすごい不安に思ったりとかしてっていうのがあったのでそういう人いっぱいいるんだなーってちょっと自分。",
      "start": 766579,
      "end": 792259,
      "timestamp": "12:46"
    },
    {
      "speaker": "B",
      "text": "も勇気をもらいましたみんな、りょうさんもそうだと思い。",
      "start": 792259,
      "end": 794780,
      "timestamp": "13:12"
    },
    {
      "speaker": "C",
      "text": "ますよりょうさん結構ドドドって言ってるからな僕どうなっ。",
      "start": 794780,
      "end": 801302,
      "timestamp": "13:14"
    },
    {
      "speaker": "A",
      "text": "たかなぁ僕あんまりなんだろうなんかあんまジョークのこととかはあんまそう考えるんだってちょっと思って聞いてました気にしなかったかもしれないです通じなかったら残念ぐらいであとは多分僕はあんまりインプットとかちゃんと頑張ってコツコツやってたタイプでもなかったんでそこら辺に対してあんまり自信はなかったんですよねだからなんかまぁこんなもんだろう感はありました。だからなんかまぁこんなもんだろう感はありました。僕来る直前になんかあの英語のライズアップみたいな学校があって、それでなんか3ヶ月で教育300点あげるみたいな、それはあの5位をめちゃくちゃ増やしてくれたんでよかったんですけど、なんかそこでちょっとあのパッチ的になんだろ英語頑張った感じで、それ以外はなんかあんまり頑張ってこなかったのかな。で、なんだろ、あんまりそこらへんになんか悔しいみたいなのはなかったですね。Wel,Idin'tfkwasrealyupsetabouti。",
      "start": 801302,
      "end": 858718,
      "timestamp": "13:21"
    },
    {
      "speaker": "B",
      "text": "まぁ、。",
      "start": 858718,
      "end": 859115,
      "timestamp": "14:18"
    },
    {
      "speaker": "A",
      "text": "でも、ちょっと、あんまでもそのあとなんだろ、だから、。",
      "start": 859115,
      "end": 861687,
      "timestamp": "14:19"
    },
    {
      "speaker": "B",
      "text": "Wel,butIdon'kwhathappendafterhat,so。\n。\n。",
      "start": 861687,
      "end": 862458,
      "timestamp": "14:21"
    },
    {
      "speaker": "A",
      "text": "それこそ語彙の足りなさとかでその就職してからとかあの転職したタイミングで全然しゃべる人がガラッと変わってまた通じなくなったとかなんか語彙数こっちの人たちめっちゃ多いぞとかでなんか所々やっぱ悔しい思いみたいなのはしてるけどなんかあんまりその最初の入りはあんまり気にしなかったかもしんないです。",
      "start": 862468,
      "end": 881289,
      "timestamp": "14:22"
    },
    {
      "speaker": "B",
      "text": "ねまぁちょっとタイプによるところはありますよね。",
      "start": 881289,
      "end": 884072,
      "timestamp": "14:41"
    },
    {
      "speaker": "A",
      "text": "タイプによりますね本当になんかなんかやっぱ2人ともなんか聞いててインプットも多いし結構コツコツ頑張ってきたタイプなんでまあそういうふうに最初のところで感じやすいのかなみたいなのはありますねあとねなんか逆になんか度胸だけで来たみたいな人たちはなんか最初俺は来てんじゃねーみたいなところから入って徐々に徐々になんか難しいところとか入っていくとなんか全然ダメだみたいになるのかなって思うんで本当タイプ次第って感じですねそしたら英語のことは結構聞けたかなと思うんで技術について聞いていきたいんですけどウェブの会社にいたときにちょっとhtmlとかは使う機会があったそれとも見るぐらいみたいなそういう人たちが周りにいたぐらいな感じ。",
      "start": 885836,
      "end": 931619,
      "timestamp": "14:45"
    },
    {
      "speaker": "B",
      "text": "なんですか一応書いてはいたんですけど、本当なんか書いたっていうか修正したみたいな、アフィリエイトサイトみたいなあるじゃないですかで、この商品とこの商品の順位を入れ替えてください、そのDIVを入れ替えてくださいみたいな、あとは広告の計測タグをボディのとこに入れといてくださいみたいな、なんかそのレベル、ウェブマーケットの会社に行ったときはもうそれのレベルでしたね、やったのは。",
      "start": 931619,
      "end": 959037,
      "timestamp": "15:31"
    },
    {
      "speaker": "A",
      "text": "そうすると、カナダに来るまでは特に技術力を上げるのは自分ではせずにって感じですか?",
      "start": 959047,
      "end": 967655,
      "timestamp": "15:59"
    },
    {
      "speaker": "B",
      "text": "でも退職をして順序的に言うと出願して退職してちょっと時間があって投稿みたいな流れだったんですけどちょっと時間があっての時にUdemyでHTMLCSJavaScriptとあとAdobe系のフォト書とかいられですねを一通りちょっとやって一通りそのUdemyでやるだけなんで簡単なマークアップとちょっとJavaScriptでロジック組むぐらいのことはできるようにはなってランガラが始まったっていう感じです。",
      "start": 967665,
      "end": 1003047,
      "timestamp": "16:07"
    },
    {
      "speaker": "A",
      "text": "ちょっと補足するとあれですよねランガラは2年間行って2年間のコースでその後3年間のビザがもらえるっていうのがバンクーバーにあるランガラカレッジの流れみたいな感じですよねそうですね。",
      "start": 1003047,
      "end": 1018426,
      "timestamp": "16:43"
    },
    {
      "speaker": "B",
      "text": "一応なんか2年なんですけど厳密に言うとその2年間で全部取り終えてくださいねというプログラムなんで詰めると1年4ヶ月で取れるんですね大体日本人の僕の知り合いは1年4ヶ月で終えている人がほとんどなので実質1年半もないぐらいのカリキュラムで3年のビザが出るという超お得なプランとなっておりますという感じですね今ちょっともしかしたら制度が変わっているかもしれないけど当時はそうでしたね。",
      "start": 1018426,
      "end": 1044454,
      "timestamp": "16:58"
    },
    {
      "speaker": "A",
      "text": "じゃあ基本的には技術力はその学校で1年4ヶ月の間に身につけたって感じ。",
      "start": 1046695,
      "end": 1052161,
      "timestamp": "17:26"
    },
    {
      "speaker": "B",
      "text": "なんですかまあそうですねただあの学校でまぁそこそこ予習してたのでそのランガルのカリキュラムはマージの初心者でも入っていけるカリキュラム構成になってるんですよで、そこでもう授業に全集中するというのとあとまあ課題もしっかり丁寧にやるで、あとはその自分SNとかでですねあの自分の近況とかを発信したりとかしてたのであの学校からちょっと仕事をもらったりとかあとは日本にいた頃の知り合いからちょっと開発系の仕事をもらったりとかっていうのはあったのでそういったところでちょっとした実務経験を積みながら学校のプロジェクトもやりながら技術力を高めていったっていうのがありました。",
      "start": 1052161,
      "end": 1100858,
      "timestamp": "17:32"
    },
    {
      "speaker": "C",
      "text": "かね学校からもらう仕事ってどんなのがあるんですか?よくLinkedIとかでランガラに行ってる方のレジュメとか経歴を見てるとランガラで働いたっていうのが何ヶ月とかあってどういうことなんだろうって私思ってたんですけど。",
      "start": 1100858,
      "end": 1115889,
      "timestamp": "18:20"
    },
    {
      "speaker": "B",
      "text": "なんかいろいろあるらしいんですよねあのランガラには大きく2つぐらいあんのかなあの僕まず一つ目がその学校で例えばなんだろうなそのなんかのショーケースをしますなった時にその専用のホームページウェブページを作るためのプロジェクトチームを作ってランガラの生徒で作ってコントラクト的に働くっていうものが一つと、もう一つが他の生徒の課題をマーキングするっていう仕事があってですね、僕はその校舎の仕事をいただいてましたね。プラス、先生の知り合いの家庭教師をやってくださいみたいな、ワードプレスを勉強している、ワードプレスじゃないかな、HTMLCSを勉強しようとしている知り合いがいるので、その人の家庭教師をやってくださいっていう仕事があってですね、そこの仕事をもらう方ってこともあります。",
      "start": 1117120,
      "end": 1174068,
      "timestamp": "18:37"
    },
    {
      "speaker": "A",
      "text": "なんか大学で言うTAみたいなティーチャーアシスタントみたいな話な。",
      "start": 1174078,
      "end": 1178743,
      "timestamp": "19:34"
    },
    {
      "speaker": "B",
      "text": "のかなまあTAの一個したというかTAはまた別にいるんですけど僕らがマーカーと呼ばれてましたねアサインメントマーカーみたいなこと言われてましたけどデベロップメント系の学部なんで課題っていうとなんかこういうアルゴリズムを持ったウェブページを作ってくださいみたいなそれでコードを見てこれ要件満たしてませんねとかこれちょっと書き方が悪すぎますねとかっていうのを100点満点とか10点満点で回転してやっていくみたいなあの。",
      "start": 1178743,
      "end": 1208430,
      "timestamp": "19:38"
    },
    {
      "speaker": "A",
      "text": "さっき学校の授業に全力投球するってことだったんですけど今までインタビューしてきた人たちはある程度学校のことをサボってちゃんとなんだろうその就職に必要なことをやることで就職ゲットしたぜみたいな人が結構多かった印象なんですけど広志くんは全力投球っていうのは本当もう学校に言われたことをちゃんとやるって感じだったんですかそれとも何だろうその学校でやることはそこそこにやっぱ就職のために最初から準備してきたタイプなのかなってどっちなのか。",
      "start": 1208430,
      "end": 1238966,
      "timestamp": "20:08"
    },
    {
      "speaker": "B",
      "text": "なって思いましたなんか初めどうやってカナダで生きていきましょうかねみたいな話を秀人さんに相談したことがあったんですよね当時のフログのコンサルタント的な立ち位置にしていた人ですけどGitHubとかあとLinkedIのプロフィールはいつ作りましょうかとかそういう話ってあるじゃないですかでその多分乱柄のカリキュラム構成だと後半多分めっちゃ忙しくなりますよみたいなプロジェクトがあるんでなんでそのプロジェクトが本格的に始まる前にそのGitHubとLinkedIを作っておいた方がいいですよっていう話があったんですよねなんでまあ確かに最初のうちはそんなに忙しくなかった全力投球してもまだあの時間は余ってる感じはあったんでその余った時間を使ってその就職に必要なツールのあのなんかなんですかねあの下地を作っておくというかあのプロフィールを作っておくのもそうですしそのユーデミーでですねそのあのなんだろうなKillerLinkedInプロファイルの作り方とかインタビューでなんかどうこうしたらこういうインタビューはダメですよとかこういうレジュメはダメですよみたいなコースを取って注釈活動を始めるための道具を作ってた仕込んでたみたいな感じですね初めのうちは。",
      "start": 1238966,
      "end": 1324125,
      "timestamp": "20:38"
    },
    {
      "speaker": "A",
      "text": "ランガローの中では具体的に何を勉強されるんですかなんかhtmlcsとかから始めると思うんですけど結構なんだろうこっちでよくあるとなんかweb系のえっとジョブポストが多いと思うんですけどなんかリアクトだったりタイプスクリプトだったりとかなんかそこらへんも勉強されるんです。",
      "start": 1325937,
      "end": 1344743,
      "timestamp": "22:05"
    },
    {
      "speaker": "B",
      "text": "かタイプスクリプトは残念ながらあのカリキュラムには入ってませんでしたねでもあのまあよく言われることですけどそのリアクトとかそのjavascriptベースのフレームワークを使う前にhtmlcsでちゃんとマークアップできるようになったかないとちょっと辛い場面がありますよねみたいなあの話がまあちょっとあったりすると思うんですけどランガラもそういうスタンスをとっていてまずは初めの一番ランカラってプロジェクト3回あるんですよで一番初めのやつはフレームワーク使ってはいけませんっていう縛りがあるんですよねでHTMLシリーズJavaScriptだけでやってくださいバックエンドはFirebaseでやってくださいみたいなのがあるんですけど2セメスター目からリアクトの授業が始まってリアクトでウェブアプリを作るっていう実地的な学習が始まっていくって感じでした。",
      "start": 1344743,
      "end": 1396113,
      "timestamp": "22:24"
    },
    {
      "speaker": "A",
      "text": "かねなんかバックエンドとかデータベースについてはどうです。",
      "start": 1396113,
      "end": 1400880,
      "timestamp": "23:16"
    },
    {
      "speaker": "B",
      "text": "かバックエンドはノードJSとJavaがあったんですけどJava…これ結構ね、ランガラも先生の質というとちょっと乱暴な言葉ではあるんですけど運ゲーみたいなところがあるんですよね僕の1個下ぐらいの高等の人たちはバックエンド系の言語の授業がかなり濃密でちゃんとしてましたよって感じなんですけど僕の時はですねノードJSの授業はまあそこそこちゃんとしてたんですけどJavaとデータベースのやつはなんかもうLinkedIラーニング見といてくださいじゃあねみたいなそんな感じの残念なやつだったんでそこまで重点的に。",
      "start": 1400880,
      "end": 1444647,
      "timestamp": "23:20"
    },
    {
      "speaker": "C",
      "text": "はやってなかったCSの知識とかも触れることなくアルゴリズムとかもなく結構実践的なフレームワークとかが多かった。",
      "start": 1444647,
      "end": 1456432,
      "timestamp": "24:04"
    },
    {
      "speaker": "B",
      "text": "そうですねあのまあ言うて1年4ヶ月の授業なのでそのcsのファンダメンタルのところからやるってなるとあのどうしてもやっぱちょっと時間が足りないととにかくそのカリキュラムの中で一旦就職できるレベルにまで持っていくっていうのがおそらくランガラwmdのあの史上名台的にあるような気がするのでまああの当時エンジニアとして働いてた頃まあ僕も今もそうですけれどももうちょっとそのコンピューターサイエンス的なファンダメンタルな知識はつけないとなぁみたいなあのことは思ってたのでちょっとまあそういう系の本を読んだりとってのはありましたけどまああの授業の内容としてはそんな感じここ。",
      "start": 1457312,
      "end": 1496377,
      "timestamp": "24:17"
    },
    {
      "speaker": "A",
      "text": "足りなかったなぁみたいなのありますかなんか先にを自分でやっとけばよかったなぁみたいなのってありまし。",
      "start": 1496377,
      "end": 1501079,
      "timestamp": "24:56"
    },
    {
      "speaker": "B",
      "text": "た自分でやっておけばよかったなっていうのはだいたいやってたような気がするんですよねなんでそのあまりその辺について後悔はないと記憶してます。",
      "start": 1501079,
      "end": 1514947,
      "timestamp": "25:01"
    },
    {
      "speaker": "A",
      "text": "さすがですそしたらえっと就職活動についてちょっと聞いていきたいなぁと思うんですけどなんだろうざっくり就職活動何したんですか。",
      "start": 1517292,
      "end": 1530475,
      "timestamp": "25:17"
    },
    {
      "speaker": "B",
      "text": "就職活動はですね僕ほとんど何もしてなくてあのまあ本当にレジュメをめっちゃアプライするとかいっぱいインタビューに行くっていう意味でのその就職活動ってほとんどしてなくてあのランガラーのプロジェクトする中でですねまあそのマーカーとして働く中でですねまあいろんな人とつながってランガの学内の人とつながってで学校経由でリファラルを3件ぐらいもらうことができたんですよねフルタイムの就職ででそれを3件プラスフロッグであのこういうポスト募集してるんですけどっていうなんか募集みたいなのがあってここに応募してそれが最終面接ぐらいまで進んでたんですよでそれ進んでた段階でここいいなっていうあの就職場所のリファラルがもらえたんでそっちに行きますっていうのであのまあ意思決定をしたっていうのがあります他にはまああのミートアップに行ったりもしてましたけどなんかレジュメを出した件数で言うと10件いかないぐらいでしたね就職活動っていうとえっと。",
      "start": 1530475,
      "end": 1598056,
      "timestamp": "25:30"
    },
    {
      "speaker": "A",
      "text": "なんだろう、それってそのレファレルだったりだとかそのフロックのやつとかって誰でもなんかチャンスが回ってくるわけじゃないじゃないですかそれってなんだろう、どうしてそれが自分に回ってきたなぁと思い。",
      "start": 1599937,
      "end": 1615052,
      "timestamp": "26:39"
    },
    {
      "speaker": "B",
      "text": "ますかなんかフロックのやつは僕はなんかそういう自分が何かコネクションができるとか業務経験を詰めそうだなっていうチャンスがあると0秒で食いつくっていうことを自分にルールとして課してたんですよあのとなんかそれが本当にあの実利があるものかどうかは動き出してから考えればいいみたいな感じだったんでまあそのフログ経由のあの求人応募についてはまああのとにかくあのなんかね0秒ポチっていうのがまあの秘訣だったかなと思うんですけどリファラルについてはですねあのまあ一つはマーカーをしてた時に近くで働いていた日本人の先生だったんですけれどもその人にそのマーカーの仕事のなんか丁寧さを買っていただけたっていうのがありますねっていうふうに言っていただきました個人的に連絡をいただけてその知り合いの会社でこういうポジションがあるんですけど広瀬さんだったらなんか合うかもって思いましたみたいなもう一つがコーディング系の授業ではなかったんですけどランガラでビジネス系の授業があったわけですよなんかビジネスプランを作ってロジカルにプレゼンテーションしましょうみたいなランガラにはそういうのがあったりするんですけどもそこで一緒だったプロジェクトチームが一緒だった女の子から私のハズバンドの会社でデベロッパーを募集してるんだけどみたいなものがあったのとでもう一つはまあこれがそのもう一つ一番最後のやつがあの自分の就職先もなったんですけれども乱柄の授業のプロジェクトでえっと2セメスター3セメスターかな2セメスターあの一緒にプロジェクトチームをやったあの友人からいただいたあのこのリファラルでしたねなんでまあ何をやったかっていうのはもう本当にあの自分に課されたことについてあの常に120%でやるっていうことをやっていたらなんかその姿勢が皆さんに買っていただけてあのそういうことにつながったであとはまあなんだろうな乱柄の授業まあ乱柄に限らずですけれども授業の場とかでなんかもうとにかくめちゃくちゃ発言してたんですよリモートの授業もありましたけどインパーソンの授業であったら一番前に絶対座って質問がなくてもうめっちゃ先生に質問するみたいなでなんかプロジェクトマネージャーやる人とかやったらはいやります0秒でまた手あげるみたいなのをやってたらなんかそのなんかそこそこ有名になっていって技術力としてはまだまだジュニアだけどなんかもうエグい前のめりのやつがおるみたいなので、そういうのにつながったのかなっていうふうに思います確かに、。",
      "start": 1615052,
      "end": 1783313,
      "timestamp": "26:55"
    },
    {
      "speaker": "A",
      "text": "ひろし君はずっとそういう印象ですね最初のそのレファラルとか自分で応募とかは、その就職のための応募とかしてないっていうのだけ聞くと結構この人ラッキーだったのかなってちょっと思いがちなんだけど本当に何事にもマイノメリでなんか前に僕ともう一人の人と広瀬くんでなんかイベントやった時があってそれもなんかどういう話からそれになったのかわかんないけどあのイベントやろうって僕が言ってでこれしなきゃこれしなきゃっていうのが広瀬くんがいるとどんどんどんどん勝手に進んでいくんですよこれがすごい行動力だなぁと思ってあとはなんだろうそのこれ俺やりますっていうのが本当に強くてやっぱなんかそういうなんだろう前のみの姿勢なんですかねやっぱりが変わったのかなってちょっと聞いてて思いましたね。",
      "start": 1783313,
      "end": 1841007,
      "timestamp": "29:43"
    },
    {
      "speaker": "C",
      "text": "見習わないといけないだってなかなか外に外にオポチュニティを求めて手を広げていく人はいっぱいいますけど今もらっている環境で100%やってその中で認めてもらってっていうのってなんかそちら方が意外と手っ取り早かったりしそうですよね。",
      "start": 1841007,
      "end": 1860653,
      "timestamp": "30:41"
    },
    {
      "speaker": "B",
      "text": "結果に深井でも僕が日本国内でデベロッパーとしての就労経験が3年とか4年ありますってなったらちょっとまたアプローチの方は変わってたような気もします僕は実務経験がなくてカナダに来る人ってランガラに通うってなっててももう既にCSの学位持ってますみたいな人もいるわけですよなんでその人たちとそのなんか正面切って戦うってなると技術力ではもう到底立ち打ちできないわけなのでその持たさるものの戦略としてそのソフトスキルでぶった切るみたいなあのことを自分の戦略としようっていうのは渡航前にちょっと決めてたっていうのがあるのでまああの戦略の違いかなとは思いますね。",
      "start": 1860653,
      "end": 1904820,
      "timestamp": "31:00"
    },
    {
      "speaker": "A",
      "text": "まあね技術ある人たちでもやっぱり結構それでもなんだろう難易度こっちで最初に就職するっていうのは難易度高い中で未経験からっていうのも当時すごいなんだろうすごいなって思ったし多分他の人もみんなそう思ってたしでもなんかそれこそコミュニティのフロックのスラックチャンネルとかでも、なんかどこのチャンネル見てもひろしくんいるぐらい、結構いつも発言して、なんかわーわーってか、なんか存在感があふれてたんで、まあなんかそういうところなの。",
      "start": 1907197,
      "end": 1936362,
      "timestamp": "31:47"
    },
    {
      "speaker": "C",
      "text": "かなっていうふうに思いますね。",
      "start": 1936362,
      "end": 1940593,
      "timestamp": "32:16"
    },
    {
      "speaker": "A",
      "text": "そしたら就職活動はそこら辺であと3つのレファラルとフロッグから来たものの1つがあったと思うんですけど面接はどんな。",
      "start": 1946315,
      "end": 1956197,
      "timestamp": "32:26"
    },
    {
      "speaker": "B",
      "text": "感じでしたか?面接でいうとフロッグ経由でやったやつしかなかったんですけどそこでは多分職種的にはワードプレスデベロッパーでデザインエージェンシー的な色が強い会社のポジションだったんですよねでそこで聞かれたのはなんかなんですかねそのキャリアゴールとかなんかじゃあのワークプレイスでこういうトラブルがあったりあなたならどういうふうに解決しますかっていうような質問があった気がしますね僕がまあジュニアレベルだったっていうももちろんあると思うのでそういうソフトスキルの質問が重視されていたってのもあると思うんですけどそのポジションではコーディング面接みたいなのはありませんでしてもう一つは結局就職先のあったところについてはですね社長面談ぐらいしかなくてそれはなぜかというとですねプロジェクトで一番近くで働いていたチームメイトからのリファラルだったんで彼は僕が働いたらどういう働き方をするかっていうのは容易に想像ができたと思うんですよそれを多分社長とか上司に伝えてくれて上司となる方とちょっと電話で話して何話したかわかんない覚えてないほとんど何も話してないんですけどじゃあなんか行ったら働けるみたいな話になって社長とこれも面談ぐらいの感じでしたね一応そのポートフォリオサイトみたいなのを作ってURLを渡してたんですけどなんかなかなかいいデザインだねみたいなことを褒めてもらったっていうのと僕そのまあ電気自動車系の分野にちょっと興味があったっていうのもあってそのこういうふうにキャッチアップしてますあなたの会社のビジネスこういうところがいいですよねどんなきっかけがあったんですか?みたいなことを質問してたらなんか社長もなんかちょっと嬉しそうにしてじゃあこれからよろしくみたいな感じでお仕事が始まったって感じでし。",
      "start": 1956197,
      "end": 2075973,
      "timestamp": "32:36"
    },
    {
      "speaker": "A",
      "text": "た本当になんかソフトスキルでぶった切ってる感じですね全体的にそしたら今まで聞いてこなかったんですけど日本にいた時から具体的にこっちに来てどのぐらいのお金使いました?どのぐらいあったらこっちで就職までお金持ちますかね?",
      "start": 2075973,
      "end": 2096079,
      "timestamp": "34:35"
    },
    {
      "speaker": "B",
      "text": "これ、そう、その質問のリストにあったんで、過去の記録をちょっと辿って思い出してたんですよ、さっき。見たらですね、16ヶ月渡航しました、じゃあカナダに着きました、今からカナダで生活しますってなってから、ランガラ卒業まで16ヶ月で、だいたい生活費で言うと42,000カナダドルぐらいでしたね。",
      "start": 2096089,
      "end": 2118197,
      "timestamp": "34:56"
    },
    {
      "speaker": "A",
      "text": "42,000カナダドル、。",
      "start": 2118197,
      "end": 2120018,
      "timestamp": "35:18"
    },
    {
      "speaker": "B",
      "text": "はい。で、前払いの額費とか、その航空券とかいろいろ含めたら、ミニマム5万カナダドルあったら。",
      "start": 2120018,
      "end": 2129951,
      "timestamp": "35:20"
    },
    {
      "speaker": "A",
      "text": "…ミニマムでだから500万ぐらいってことですかね。",
      "start": 2129951,
      "end": 2131862,
      "timestamp": "35:29"
    },
    {
      "speaker": "B",
      "text": "そうですね。レートはあると思うんですけど、当時ね、僕まだ85円とかのレートだったんで、もうちょっとあれなんですけど。確かに。なんでミニマム5万ドルだと思うんですけど金ドルだと思うんですけどそれだと卒業時にお金がなくなっちゃったっていう状況になると思うんでまあ650万とか700あったらそこそこ余裕を持っていけるのかなと思いますねでうまくいけばその在学中にちょっとパートタイムの仕事やったりとかもあると思うんで600あったら行ってもいいんじゃないかなって僕はちょっと思います1年。",
      "start": 2131862,
      "end": 2170813,
      "timestamp": "35:31"
    },
    {
      "speaker": "C",
      "text": "半くらいですよね。",
      "start": 2170813,
      "end": 2171855,
      "timestamp": "36:10"
    },
    {
      "speaker": "A",
      "text": "あれ?",
      "start": 2171855,
      "end": 2172236,
      "timestamp": "36:11"
    },
    {
      "speaker": "C",
      "text": "2年?",
      "start": 2172236,
      "end": 2173318,
      "timestamp": "36:12"
    },
    {
      "speaker": "A",
      "text": "あ、。",
      "start": 2173318,
      "end": 2173518,
      "timestamp": "36:13"
    },
    {
      "speaker": "B",
      "text": "1年4ヶ月ですね。",
      "start": 2173518,
      "end": 2174760,
      "timestamp": "36:13"
    },
    {
      "speaker": "A",
      "text": "あ、。",
      "start": 2174760,
      "end": 2174921,
      "timestamp": "36:14"
    },
    {
      "speaker": "C",
      "text": "1年4ヶ月。",
      "start": 2174921,
      "end": 2176483,
      "timestamp": "36:14"
    },
    {
      "speaker": "B",
      "text": "はい。",
      "start": 2176483,
      "end": 2177175,
      "timestamp": "36:16"
    },
    {
      "speaker": "A",
      "text": "えろし君は具体的にいくら持って行ったらいいかなか?",
      "start": 2177175,
      "end": 2180312,
      "timestamp": "36:17"
    },
    {
      "speaker": "B",
      "text": "僕は700ぐらいあった気。",
      "start": 2180322,
      "end": 2182543,
      "timestamp": "36:20"
    },
    {
      "speaker": "A",
      "text": "がしますね。",
      "start": 2182543,
      "end": 2183374,
      "timestamp": "36:22"
    },
    {
      "speaker": "B",
      "text": "結構貯めてたんですね。おじいちゃんが残してくれたやつとか、あとはその勤めてた会社がちょうどいいタイミングで上場して、その上場賞与がいいタイミングでもらえたみたいな、ちょっと運ゲー的なとこはあったんですけどね。",
      "start": 2183374,
      "end": 2203347,
      "timestamp": "36:23"
    },
    {
      "speaker": "A",
      "text": "そっか、そうですね、ランガラって確かその1年行って1年のビザもらえるっていう学校に比べるとちょっと高いのかなっていうのとあとはちょっと長いからそもそも頑張っても1年4ヶ月はかかっちゃうんであとは忙しいからパートタイムできる人もいるかもしんないけどちょっと難しいみたいなのを加味したら確かに600万700万ぐらいは必要なのかなって感じですよね僕とか彩香さんが言ったコーナーストーンだとそれも経験者か未経験者にも関わってくると思うけど経験者だと割と結構少ない金額でとりあえず来て学校分と飛行機とか払ってきてあとはリモートで日本の会社の働きながらみたいな人たちもいるからそういう人たちはもっともっと少ないんだけど今回の広志くんのパスで言うと何百万ぐらいあるといいかなって感じですねそうですねそしたら最後にカナダでの会社の年収についてちょっと聞いていっ。",
      "start": 2203357,
      "end": 2266244,
      "timestamp": "36:43"
    },
    {
      "speaker": "B",
      "text": "てもいいですか一番初めオファーをもらった時のスタートの年収は5万5千カナダドルでしたね。",
      "start": 2266244,
      "end": 2275191,
      "timestamp": "37:46"
    },
    {
      "speaker": "A",
      "text": "ということは550万ぐらい。",
      "start": 2275191,
      "end": 2276422,
      "timestamp": "37:55"
    },
    {
      "speaker": "B",
      "text": "550万、はい。で、3年後ぐらいに1回なんか交渉して、それがなんか60…あ、やったじゃん。6万5千になったのか。だから100円と1万ドル上げれたのがありますね。でその上がったぐらいのタイミングで田中雄介さん大下雄也さんの会社でちょっと副業としてお仕事をもらい出したのでそれが年間算すると1万4000ドルぐらいだったんですよねで、プラスフロックのインタビューも2ヶ月に1回ぐらいやらせてもらってたんで、昼食始まりましたっていうタイミングでは55Kの5万5千ドルのスタートだったんですけども、1年後ぐらいには8万ドルぐらいになってたって感じですね。",
      "start": 2276422,
      "end": 2334388,
      "timestamp": "37:56"
    },
    {
      "speaker": "A",
      "text": "おーすごい。なんだろう。働き方とかどうでした?なんか、。",
      "start": 2334388,
      "end": 2337130,
      "timestamp": "38:54"
    },
    {
      "speaker": "B",
      "text": "まあ、。",
      "start": 2337130,
      "end": 2337540,
      "timestamp": "38:57"
    },
    {
      "speaker": "A",
      "text": "練習とかのなんか満足度とかあとはその、なんだろう、結構じゃあ副業やれてたってことは結構ホワイトな感じで時間通りに終わるとかって感じだったんですか?",
      "start": 2337540,
      "end": 2347086,
      "timestamp": "38:57"
    },
    {
      "speaker": "B",
      "text": "なんかそもそも労働時間が全く管理されてなくて、えーなんで、まあ僕はあの8時間ちゃんと働いてそれのアウトプットをするっていうのは自分に課してましたけど残業みたいなのはもうほぼなかったと思いますね一回その同僚と、金曜日ちょっとじゃあ仕事終わりにご飯でも食べようぜみたいな話になった時に、大体5時ぐらいに終わると想定してたんで、じゃあ5時半ぐらいにするみたいな話をしたら、いやいや12時半ぐらいでいいだろみたいな。いやいや仕事どないすんねんみたいな。で、それでそういう感じの空気感だったんで、なんかちょっと緩すぎたっていうのはあるかもしれないですけど、労働時間的にはそんな感じだったんで、十分副業の時間は取れたと。まあなんだかんだそれでもなんかずっと働いてたみたいな気持ちはありますけどね副業もしっかりやっててとそんな感じでしたなんか。",
      "start": 2347086,
      "end": 2401533,
      "timestamp": "39:07"
    },
    {
      "speaker": "A",
      "text": "それこそひよしくんやっぱりその置かれた環境で頑張るみたいな人だから結構ちゃんとその9時5時なのかなって働いてそうだけど確かにその漢字聞くと同僚の漢字聞くと金曜日は午前休みたいな午前で終わりみたいな普通の日も3時4時ぐらいに終わるみたいな空気感が漂ってそうな。",
      "start": 2401533,
      "end": 2420726,
      "timestamp": "40:01"
    },
    {
      "speaker": "B",
      "text": "そうですねということで。",
      "start": 2420726,
      "end": 2422873,
      "timestamp": "40:20"
    },
    {
      "speaker": "A",
      "text": "最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2422873,
      "end": 2440393,
      "timestamp": "40:22"
    }
  ],
  "highlight1": "衝撃のカナダ就職物語！日本で就職できない人に朗報！1年4ヶ月でカナダのIT企業に就職できた驚愕の方法とは？",
  "highlight2": "知らないと損！カナダのランガラカレッジで学位を取るためのコツとは？英会話が不得手でもOK！600万～700万円でカナダで新しい人生を始めよう！",
  "highlight3": "実はカナダでIT企業に就職するための最低限のお金は500万～600万円！1年4ヶ月のカリキュラムを終えれば年収550万～800万円が可能！"
}