{
  "episodeGuid": "a108b0b3-eeca-4412-bb00-991785b4ce77",
  "episodeTitle": "レイオフ後にバカンス！？2度の転職を経てカナダの上場企業LightSpeedへ入社した話（後半）#35",
  "transcribedAt": "2026-02-23T02:26:22.877Z",
  "duration": 2489,
  "fullText": "前回に引き続きしょうこさんに来ていただきました前回はカナダに来る前のキャリアみたいなところとあとは1社目かな今3社目だと思うんですけど1社目のレイオフされるところまで話したんですけどちょっと2社目からかないきたいと思います2社目はじゃあそのIoTの会社でiOSっていうほぼ全く同じステータスでじゃあ割ともうすぐ即戦力みたいな感じで働き始めたんですか?そうですね、はい。その会社がほんと立ち上げたてっていうのもあって、もうそこからガンガン開発していくって形ですね。どのぐらいなんかメンバーみたいな、IT部門というかソフトウェア部門はどのぐらいいたんですか?会社自体が本当に10人ぐらい。で、まあ一応そこにiOSと、あとAndroiの人と、あとQAの人とか、という形の構成でした。なるほどね。じゃあもう本当にドスタートアップというか、もうできたでほやほやみたいな感じに入ったんですね。そうです。ちなみに全然分かんなかったらいいんですけど僕イメージだとスタートアップってiOSアンドロイドって分けるよりリアクトネイティブとか使うイメージあったんですけどそれはIoTだからなのかななんかそういう技術的なあれがあるんですかねそうですね、やっぱりIoTでBluetohとかを結構使う、BLEっていうのを使うんですけど、BluetohLwEnrgyやったかな?なんですけど、やっぱりそこらへんを使うとなると、ネイティブの言語じゃないと結構まあその当時は結構難しいという感じでしたねそうよねなんかリアクトネイティブだとネイティブの一部機能を使えなかった時期って結構長かったですもんねだから多分その時期に当たってっていうことですよね多分そうですね素晴らしい人の紹介でコネクションで入ったってことだったんですけどなんか技術的な面談とかなんかインタビューみたいなのはあったんですかそうですね、本当に軽くっていう形で、そのコネクションで誘ってくれた人も、お仕事で一緒にしたこともあったので、だいたいどんな感じかわかっているという形だったので、そのまま入りました。じゃあ結構強い感じのレファラルというかなんかこの人なんか名前知ってるよぐらいな感じじゃなくてもう一緒に働いててもうこの人だったらもう明日から即戦力だよみたいな感じでじゃあもう紹介されてはいって感じなんですね入ったときももちろんIOSエンジニアとしてっていう形だったと思いますけどチームにジョインするときその10名体制ってその前の会社が数十名体制割と大きい会社だったっていうことだと思いますが結構そのコンバートするにあたって環境の変化にちょっと適応するっていうのは結構大変でしたそうですねただ前の会社も結局はハードウェアの会社だったんですけどソフトウェア部門は新しかったのでの環境だったんですよねなのでそこのトランディションはやっぱ割とスムーズにできたかなという形ですねそこももしかしたらねMitsukroeっていうのでリファラルも出してくれたのかもしれないですよねそうですねあとは何でしょうねスタートアップも本当に始めたてっていう会社もあったのでiOS以外のすることが増えたっていうのはちょっと大変でしたそうか、若干ジェネラル寄りになるというかね、やれることが、やらなくちゃいけないことが増えるタイミングですもんね。そうですね。スタートアップとかだとね、なんでも屋さんとかにはなりがちだから、人数によって結構そういうのは増えてきそうですよね。ちなみに何か、ベネフィット的な面で言うと、前の会社からのほぼ持ち越しみたいな感じだったんですか?そうですね、ほとんどほぼ同じでしたね。じゃあもう全然、1ヶ月バカンスがあったっていうぐらいで、他なんか悪いことは特になくみたいな感じ。特になく、新しい環境で頑張ると。そのレイオフだったら僕もアリだな。まあそれはね間違いないなるほどねいいですねじゃあまあ給与的な部分なんかもまあ全職のこともちゃんと意識してくれての数字だっただろうし働く環境的にもそんなむちゃくちゃコンバートが必要だったわけでもないしっていうので2社目に関してはどのくらいの期間働いてたんですか2社目に関しては、去年の…なんか2年1ヶ月ぐらいで、僕今リンクで見ながら話してる。はい、それぐらいですね。ちなみに、それを何だろう、やめようと思ったのは何か、何かあったんですか?そうですねまぁちょっと環境を変えてみたいっていうのと今までスタートアップでずっと働いていたのでいわゆるなんかまぁねせっかくカナさんに来たのでいわゆる北米のエンジニアみたいな働き方をちょっとやってみたいっていうちなみにその一社名二社名はどこらへんがその北米のエンジニアじゃなかったんですか?めっちゃ気になると思う結構結構、読む内容は忙しかったっていうのはありますね。忙しいっていうのは時間的にですか、それとも気持ち的な?気持ち的には、だいぶ忙しかったなという形で、時間的には確かに日本に比べると、5時、6時で終われるので、そこはすごい満足でしたね。カナダっていうとこですよね。そうですね。ただ、ちゃんとして会社で働いてみたかったっていうのはあります。大学より大規模で。そうですよね。だからカナダっぽいっていうのもそうかもしれないけど、給与面だったりとか時間だったりとか規模だったりとか割とエンジニアといえば一旦こういうキャリアをみたいなところで一旦働いてみたかったみたいなイメージじゃないですかね。そうですね。それが大きかったですね。あとは、もともとすごい小さいスタートアップも最初の時期からやってみたかったっていうのはあってそれでは大体どんな感じかわかって結局自分がどういう環境が働きやすいかっていうのもわかったので次はちょっと違うところに行ってみたいなっていう形ですねそういうことですねじゃあ2社目の就職もして転職活動もそろそろ考え出そうかなの時で多分初めてなわけじゃないですかそういった大きい会社に要するに就職をするための活動っていうふうにすると具体的に在籍在職されている最中に3社目に移動するための準備とかってされていたんですか就職活動っていうのかなそうですね、在籍期間中は特にやってなかったんですよね本当このやり方お勧めしないんですけど、先に辞めてしまって、でまたバカンスを取ってバカンスドリームだバカンスドリームだで、そこから就活したっていう形なので在籍期間中は特に何もやってなかったですねこれまた珍しいですね。だいたい何かトガシリオとかね、他の経産だったりとかっていうのを人見て、僕もそろそろやらなくちゃなっていうので、仕事ついてる期間中に何か準備を始めるって人が多いなっていう中で、じゃあ翔子さんは完全に辞めて、すっぱり辞めてから全部準備を始めるっていうレアなパターンを。それは何か理由あったんですか?何だろう。急が、何か気持ち的に忙しいからとか。そうですね気持ち的にも忙しかったのとあとは本当業務的にも忙しくて仕事の他に就活できるような環境じゃなかったっていうのはありますねあとは単純にちょっとバケーション欲しかったのでちなみにその1社目2社目ではバケーションとかはどんな感じだったんですか1社目、2社目は、えっと、そうですね、普通に撮ってましたね。1ヶ月ぐらい日本に帰ったりとか。そうっすよね。その辺は割といくら忙しいと言われても、やっぱりカナダの会社だったんだなっていう。そうですね。ちなみにその2回目のバケーションはどこに帰った?確かに。2回目のバケーションは、あ、でもあの犬、を買い出したんですよねワンちゃんいいなぁここもトラ仕様のアレね似てますねあなたもずっと飼いたい僕も今犬飼いたくて待ってる今そろそろ引っ越そうかなって思ってますぜひぜひおすすめですなのでそうですねその期間中はどっかに行くっていうよりは犬のトレーニングとか犬をバージョンアップさせようと思ってバージョンアップ?バージョンがあるのかなるほどですねめっちゃなんか幸せに生きてる感じだねえー素晴らしいじゃあまあバケーション期間中使ってちょっとワンちゃんと一緒に過ごしっていうのが1ヶ月くらいありでまあその期間にね当然就職活動の準備っていうのをされるのかなっていうふうに思うんですが転職活動かまあ大きい会社を狙うための転職活動っていうことでなんか特別なことでもやったのかなっていうのは聞いてみたいんですけど一社目二社目と違っててなんか特別に違うことやったとかあります?そうですね特別に違うことは特にないんですけどただ1社目と2社目は割とすんなり決まったのでいわゆる就職活動ってあんまりしてなかったんですよねそうですよね、聞いてるとねなのでどちらかというと今回が本当にちゃんとした就活活動をしたっていう感じですねそういうことですね例えば何でしょうリードコード頑張ったとかシステムデザイン勉強し直したとか割とそういう当たり前な就職活動の準備をされたイメージですかそうですねはいその就職活動をする際にセナさんにちょっと相談させてもらってそれでヒアリングをしたのでそれでいわゆるリードコードとかあとはシステムデザイン系をしてやったりとかあとは本当に面接の対策をしたりとかっていうの就職の準備をしたっていう形ですねそういうことですよねそう話僕が僕が話聞いた時も割ともう就職カーズはなんか準備っぽい準備はもうされてたっぽいイメージが正直あってでなおかつねもう転職もされたこともあるってことだから何の心配もしなかったとありますがあれかあのKさんの確か面接のなんかレッスンみたいなやつありましたよねあれ1回確かやれられたんですよね確かあそうですねはいあのマックインタビューをけいさんのやらせてもらってまあはいそうですねそれはすごい良かったと思います本当ですか良かった良かったはいなんかちょうど面接を初めての面接がなんか次の週かなどこにあったのでなんかそれに向けてなんか面接どんな感じだろうっていうのを空気感が分かってよかったですよかったですね素晴らしいなるほどですねちなみにトータルで就活に使った期間としては何ヶ月くらいだったんですかえっと就活は今回は3、4ヶ月ですね3、4ヶ月かなるほどちなみに3社目の会社名って言っちゃっていいんですかねああはい大丈夫だと思います本当ですかありがとうございますそしたらえっとちょっと待ってねコングラスチャンネル見ないと毎回忘れちゃうんだよなライトスピードですよねライトスピードもうKさんがまさかこの会社に入れるジャパニーズがいたのかみたいなね感じですごいテンション上げ上げになっていましたが僕も実はこの会社あのしょうこさんがねスラックフロックのスラックにあげてくれてから知ったんですがもうカナダというカナダのあのPOSのシステム作ってらっしゃる会社ですよねああそうですね、あのポスを結構あの作ってる会社で、いや私もあの、言われるまでそんなすごい会社なのかっていうのが全く知らずに入ってたんですけど、本当に単純にあのプロジェクトが面白そうやったから決めたっていう形ですね。なるほど素晴らしいちなみにまあまあこのライトスピードも初めて就職活動期間中に知ったっていうことかなと思うんですがなんかトータル何社くらい受けられたとかもしくは応募されたとかって覚えてます?そうですねえっとトータル今回は応募が70件くらいかななんか一社目よりはだいぶ増えたそうですね一社目と比べるとほぼほぼ2倍ぐらいになってその中で面接受けたのが10社ぐらいで10社素晴らしい打率ですねちなみに今何か見られてたと思うんですけど何かにつけてた感じなんですかExcelみたいな感じそうですね一応Excelとかで記録は取ってましたね。素晴らしい。ちゃんとなんか分析してやれてる人は打率がめちゃくちゃいいなっていう人ありますよね。まあ優吾くんとかもそうですし。そうかしさんの、こうへいさんやったかな?の出されてきたなんか企業分析リストみたいなやつも俺かなり関心したけどね。素晴らしい今日は特にセナさんがめっちゃテンション高くて僕のちょっと入り込む隙がごめんね、もっと喋ってじゃあいいですよごめんねどんどん言ってくださいいやそうなんですよだって大きい会社やししかも俺の知らないトロントの話やしっていうのでもう知りたいことが多すぎてさ確かに3、4ヶ月で今の会社見つかったと思うんですけどどういう感じのなんだろうインタビューの流れだったんですか?そうですねインタビューの流れはいわゆる王道で多すぎず少なすぎずって感じなんですけど一応3ラウンドあって最初はHRの人と話してその後一次面接でテックリードの人と喋ってその後が技術面接ですね一応ペアコーディングの面接があってその後にもっと偉い人プロジェクトちょっと名称忘れちゃったんですけどいわゆる偉い人と喋ってそこでオファーをもらうって感じですねマネージャーと話したのは、なんかいわゆる、えっと、ビヘイベラルクエスチョンみたいな感じだったんですか?あ、そうですね。はい。そこは本当にビヘイベラル。1時間ぐらい?あ、そうですね。1時間ぐらい。で、2つ目が、ペアプログラミングみたいだと思うんですけど、それはなんか何系の、なんかリートコード系なのか、それとももう業務系のものを作るなのか、なんかどういう系の問題だったんですか?そこは一応2セッションに分かれていて前半がピアコーディングで後半がどっちかというと技術系のことについて履歴書の中身を追って説明するっていう形だったんですけどピアコーディングはどっちかというと業務に沿った問題を出されましたねそのデッキとかはどんな感じでした?その時のデッキは比較的優しい問題だったかなと思うのでそうですねその時はもうちゃんと最後まで終わらせてあと質問とかされた時にも一応ちゃんと答えられたかなという形です素晴らしいで偉い人と喋ってじゃあそれが一応HR4つ目か、4つ目になるのかな。はい。期間的にはどのぐらいの期間、2、3週間でって感じなんですか?そうですね、期間的には、そうですね、2、3週間ぐらいだったと思います。じゃあ本当に確かに多すぎず、少なすぎずっていう感じですね。はい、そうですね、あの無限ループにはハマらずって感じです。難しい。まあそうか、ちなみにねこれもまあ1社目2社目っていう風に多分給料的な部分だと割とスライドだったのかなというふうに思うんですがなんかやっぱりまあ3社目でしかもこれだけ大きい会社っていう風になると結構給料的にはもうだいぶ上がった感じですか?そうですねえっとはいえっと給料的には上がりましたねまあ1社目2社目が割とあのどっちかというと何でしょうねハードウェア関係の会社だったのでいわゆるエンジニアがいっぱいいるソフトウェアワークサース企業みたいな会社に比べるとちょっと低かったイメージがあったんですけど今回は平均ぐらいのところまでいけたかなと思います素晴らしいポジションはちなみに3社目はもうその大きい会社になるとやっぱりマトリックス結構分かれるじゃないですかあのシニアジュニアインターミニティとみたいなとこだとなんかなんか肩書き的にはどうなったんですかねえっとさんえっと今回はえっとインターメディエイトアイドルだったんですねはい愛用する朝ですね一応就活の時は両方出してましたシニアとインターミディエイト両方応募しててそうですね今回の会社はそのインターミディエイトのポジションだったっていう形ですそういうことですね素晴らしいこれだけ大きい会社のインターミディエイトポジションちょっと今度こそっと言える気いこうしかもあれですよねニューヨークと多分トロントでのどっちもで上場されてる会社なのかなと思うんですけど現金以外のあれもあるんですか?あ、そうですね。もうありました。それはカナダのベースの会社だと、トロントの方でもらえるんですか?それともアメリカのドルでもらえるんですか?あの、恥ずかしながらそこら辺よく分かってないんですよねそっか、まだ1年経ってないのか、そもそもはい、まだ経ってないですねじゃあ、そのうちコソッと教えてもらうことにしますねそれまでにはちゃんと調べた気がするベスティングスケジュールね、多分組まれてると思うから、それで売れる時期きたら、あのね、ちょっと現金一回になったか、コソッと聞こうでもめちゃくちゃ有料企業というかねえ素晴らしい会社ですよねいや素晴らしいまあここまでじゃあもう一つ聞いていいですかあの一社目二社目よりカナダ企業っぽいところで働きたいっていう風に言ってたんですけどそれは今の会社カナダ企業っぽい感じになったんですかそうですね、今回の会社はなったような気がします。一番実感するのはどこですか?働き方、それとも待遇?そうですね、待遇もそうですけど、働き方ですね。働き方が、イメージしてた、カナダで働くエンジニアみたいな働き方になって、あとは、コミュニケーションとかの面でも、すごい、カナダらしいというか、欧米らしいコミュニケーションかなとは思いましたね。ちょっと分かんないなぁ。僕が、僕は割とその1社目2社目がカナダっぽいかったのかなぁって思って、今働き方でいうと、まぁちょっとまぁ大きい会社だから大きい、ごめんなさい、大きいアメリカのSaaSの会社でありがちの働き方を割としてて、ちょっと忙しい、忙しくなったのと、まあなんか、重圧は増えたなみたいな、いろいろ、あの、まあなんかオンコールとかやったりして、あの、呼ばれるだとかっていうのもあるし、なんかアメリカの人たちと一緒に働くと、やっぱりちょっとそれに引きずられてちょっと忙しくなるみたいなのがありつつ、それはなんかアメリカっぽくなったのかなって思いつつ、なんだろう、どこら辺がカナダっぽいんだろう?あんまりまだイメージができてない。なんかきっとあるんでしょうね、頭の中に。これがカナダ企業だ、みたいな。勝手なイメージなんですけど、今までの会社が結構忙しい。あと、プレッシャーも大きかったんですよね。なので今の会社はもう本当にiOSのエンジニアが多分10人、20人ぐらいいって、それを一つのプロジェクトでやってる。みんなで働くっていう感じなので今までは本当に1アプリに3人1人とかも全然あったのでそれに比べるとちょっと分業されてるそうですそうです分業が多くてなんか俺聞いてる感じだとやっぱそのカナダっぽいっていうのってまあ割と規模の大きいチームとしてちゃんとマイクロサービスというかちゃんと分けられていてでその上でねあのなんだろうまあカナダっぽいはもう代名詞としてやっぱりそのライフバークバランスがみたいなね。だからライフバークバランス良くなおかつ希望の大きい会社に入ったのが多分カナダっぽいんだろうなーって勝手に頭の中では。わかってきましたわかってきました。でもそういう大きい会社で入ってしかもライトスピードって調べれば調べるほど非常に規模も大きい売り上げ規模も何十億っていうね40億ドルっていう規模の会社なのでもう面子的にもっていうかキャリア的にも次も見やすいんじゃないかなって正直思うんですがやっぱり大きい会社に入ってみて見えてくる世界観っていうかキャリア的な発展性次例えばグーグル行ってみようかなとか次なんかもっと大きい会社私も行けるんじゃないかなそういう自信の方に繋がったもんですかああそうですねえっと地震特にあまり変わってないはいあの本当にあの本当にライトスピードそんな会社って全然知らずに本当に入ったので、どっちかというと、この間けいさんとちょっとお話ししたのと、あと今、すなさんとりょうさんとお話しして、あ、そうなんだって。なるほどねじゃあこれからもっともっと実感していくのかなと思いますし大丈夫ですか僕多分まあまあ自慢しますよライトスピード入って増えるよって黒くの山で一緒にいたよって君知らないのって言いますよ多分自分も知らなかったのにそこは内緒ですねちなみにオフィスは出社はあるんですかそれともリモートですかえっと、完全リモートですね。へー。はい。っていうのも結構面白いなと思うところが、カナダは拠点は基本的にワントリオール、トロントの人が多いんですけど、それ以外にヨーロッパが多いんですよね。へー、珍しい。はい。なので結構一緒に、本当にヨーロッパの人たちも一緒のチームに入ってやってるので、まあ、そうなので、そういうこともあって、本当にフルリモートですね。ちなみにバンクーバーとかからは働けないんですか今のところ働いてる人はいないんですけどでも多分移りたいですって言ったら移れるんじゃないかなと思います今時ちょっと珍しめの会社ですねそれはショピファイくらいしかパッと思い浮かばないもんね最近だったらあとGitLabとかGitLabとかねもともとでしたっけそうだねもともとだねあそこあと俺も知ってるけどあれもうモントリオールとかだとヨーロッパ近いから働きやすいのかなバンクーバーとかだと結構働きにくくはなりますよね多いねそうですね時差の関係はあるかなと思います午前中にちょうどヨーロッパの人たちと時差が合うのがあってそこでミーティングとかをやるのが多いのでですよねそうなんだよねバンクーバーまで行ってしまうとプラス3、4時間といえどもそれでもまあまあ実際的にずれちゃうからね3キョってやつらいだろうな確かにちなみにどういう感じのなんだろうあのその日のスケジュールというかはどういう感じで働かれてるんですかリモートだと思うんですけどはいスケジュールは一応まあ毎朝スタンドアップでそこに参加してまあ今日は何しますよみたいな感じで言ってから本当その後はえっとほぼほぼ開発に専念できるっていう感じですねえそれが毎日ですか?あそうですそうですミーティングもなんかすごい少ないいいですねスプリントは2週間ごとくらいですか?えっとそれはスプリント一応2週間でするんですけどそれもチームによってなんかスプリントをガッツリやってるところとそうじゃないところは結構あって私のところはそんなに特にガッツリスプリントでやってるわけではないですねじゃあまあ進捗とか報告しなくちゃいけない時があったらその都度やるみたいなそうですよね。なるほどね。自由ですね。めちゃくちゃいいですね。そこら辺も。うちなんかもうミーティングでまみれてるから。そうですよね。なのでそれはすごい思いました。これがカナダっぽい会社なのかっていうのがもう一つ。今までミーティングばっかりで、開発とかほぼほぼ専念できる時間なかったんですけど。ここはもう完全に開発の時間をみんながすごい大切にしてるなっていう空気があって。いや、それはいいですね。素晴らしい。そこで言うとどうなん?東橋さんのところとか若干日本っぽい?ミーティング大量にあるみたいなイメージあるけど。いや、まぁでもポジションとかにもよるんですけど、僕の1日は、水金だと、水曜日と金曜日はそんな感じですね、どっちかというと。インタビューとかが入ってくるとちょっと忙しくなったりするのもあるのと月下木はそもそも出社日でそこは結構ミーティングが詰められるスタンドアップはうちはスラックでやるんでないんですけどなんかスプリントキックオフは2週間に1回月曜日あってそうじゃないその各週にあって逆の各週はなんかハーフスプリントみたいなチェックインみたいなのがあってでスプリントレトロみたいなあのえっとレトロなんて言うんだっけ?レトロスペクティブかな?名前忘れたけどなんか反省会みたいなのがあってとかそうそうとかいろいろあるから、割と月間目はミーティングで埋まりがち、特に昼ぐらい、昼過ぎぐらいまでは。なんとなく聞いてるとそんな感じなのかです。逆にしょうこさんからそういうのなんか質問とかないですか?だいたいファガシリオンみたいなね、アサナみたいな大きい会社で、一応もう2年目ですか?あなたも。今もうすぐ2年ですねもうすぐ2年っていうねシニアのエンジニアさんっていう形でワンチャンもしかしたらねなんかライトスピードみたいな大きい会社の次になるとすればこのくらいの規模の会社になるかもしれないなと思いますがなんか今のうちにこれ聞いとこうかなとかそれっぽいとこないんですかって聞いてみるそんなこと言われても難しいですよねどうなんでしょうね。でもチーム構成とかちょっと気になりますね。セミアの、なんかこの会社に入って初めてスタッフっていうロールの人を初めて見たんですけど、なんかそんな人お手伝いしたいなっていう感じで。確かにあれあるかもしれない。やったんですけど、どうですか?スタッフはチームにいたりいなかったりみたいな感じなんですけど、うちは結構大きめのチームで、エンジニアだけで9人ぐらいいるのかな、10人ぐらいいるのかな。ちょっとごちゃごちゃしてたりはするんですけど、なんかこの機能もらったからエンジニアがついてきたみたいなのとかもあったりするんですけど、うちはそうですねEM1人エンジニアが多分9人か今10人いてデザイナーとあとはPMPD日本風に言うとPDMかなの人がいてあとはチームによりけりでうちはいないけどデータサイエンティストみたいななんか新しい機能出すときにABテストみたいなのこの機能があった方がユーザーが流入されるのかどうかみたいなテストを割ととかそのなんかいいことが起きるかどうかみたいなのを測るみたいなのをなんか専門にやってる人がいてその人がまあなんかいたりするんですけどチーム構成的にはそんな感じですかねでもなんかまあよく言うことなんですけどなんかSaaSの大きい企業を考えるとあんまりカナダっぽくはないかもしれないやっぱりなんか中規模とかある程度の規模の方がやっぱりなんかエンジニアエクスペリエンスみたいなのはすごい良くてさっき言われたみたいにミーティングが少なかったりだとか大きければ大きくなれば大きくなるほどやっぱりそれを管理しようしないといけなくなるからなんかそういうミーティングとかはなんか増えがちなのかなっていうのもありますよね。なるほどね。しょうごさんの言うと、日本っぽいのに近づいてしまうのは。日本っぽい、アメリカっぽいなのか、日本っぽいなのか。アメリカっぽいよね。それもあるんですよね。アメリカの会社か、みたいな。カナダの会社ってのが良かったりするのかもしれない僕も2社目、1社目2社目はカナダの会社で1社目は日本の、あ、1社目はカナダのスタートアップで2社目はそれこそモントリオールの割と似た感じかなえっとフィンテック系の会社だったんですけどえっとそこはめちゃくちゃそういえば確かにカナダっぽいというかなんか金曜日誰も働いてないかなみたいな感じだったしなんか全部あのリモートみんなリモートだしはいはいなんだろうそう人の雰囲気が割と緩いというかなんか全部が緩く進んでいく感じがあったんでなんか難しいよねこうさ待遇を求めていくと絶対アメリカナイズされた会社のがいいに決まっててでもなんかそのでカナダっぽいをやっぱり求める気持ちもすごくよくわかってなんかショピファイもそうだけどさなんか本当になんかライフワークバランスを本当に重視していますあなたたちはファミリーのために生きてるんですみたいな題名していますみたいなさなんかそういう雰囲気ってあるじゃないですかなんか、あの辺をやっぱり求めていくとするんだったら、またちょっと別のベクトルのアンテナを捨てなくちゃいけないだろうなっていうのもあって、なんかどっちを求めるのかってライフステージにもよるんだろうけど、ちょっと考えるんですね。一回大きい会社に行ってそっちに中規模の会社戻るとかだと割とその高い給料帯を維持したままいけたりはするかもしれないですねその代わりもちろんパフォーマンスとかも求められるしレイオフのときに真っ先に結構対象になっちゃうのでいや間違いないレイオフって結構やっぱり同じなんていうのインターミデートの会社の人がいたらその給料高い人から選ばれるじゃないですかだからそういう人の方がまあちょっとレイオフの対象になりやすいみたいなのはありつつもう一ついいところで言うとカナダとアメリカにどっちにもオフィスがある会社だとアメリカの方から切られてくっていうのはカナダ安いんでアメリカの方から切られるからそういう意味ではジョブセキュリティ的な意味では結構あの安心できるっていうのはあるかもしれないいやいろんな種の選択結局はあれですよね、どこらへんの塩梅がいいかっていうところでしたね。間違いない、素晴らしい。じゃあ、最後の方にそろそろなるのかなと思いますが、2個くらい聞いてもいいですか、最後に。一つはいつものね、あのなんか声から来る人たちにのアドバイスのとこなんですけどもう一つちょっと先に聞いておきたいけどなんかしょうこさん的に次のなんかキャリアとかなんか見てんすかさすがに入ったばっかりだから早すぎると思うけどなんかそれとりあえず年収3000万回行こうかなとかなんかそういうざっくりとしたものでもいいんですがなんか次のとか考えてます?企業とか次は、とりあえずは、エンジニアとしてのキャリアアップということで、もともと就活のときにも、狙っていたシニアのポジションには、なりたいなっていうところですね。すばらしい。そのあとは、もう少し経験を積んで、CIポジションかマネージメントのほうかとかはまだちょっと考えてないです。IC、マネージメントをちょっと選べるようになろうかなってイメージってことですね。長期的にはカナダにいようとか、カナダ以外の国に行こうとか、日本に帰ろうみたいなのは考えてるんですか?えっと今のところはカナダですねただそうですねキャリアというか働き方がやっぱりいいっていう部分が捨てがたいっていうのはありますよねそうだよねちなみに早期リタイヤできそうってなったらどうするんですか早期リタイヤできそうってなったらえっと日本住みやすいから日本いいなぁと思いますね。そうっすよね、確かに確かに。ありがとうございます。じゃあ最後に、しょうこさんと同じようなトライをこれからされる方々に何かアドバイスなどあれば、7年前、6年前かなくらいのしょうこさんに向けてでもいいですが。はい、そうですね。これから来る人ですね。とりあえずあんまり考え…私があんまり考える性格ではないのでっていうのもあるんですけどとりあえずあんまり考えすぎず大体の計画をねってこれでいけるんちゃうかなっていうこの大体の三つ筋をできたらもうなんかチャレンジしてみるっていうのは大事かなと思いますねでその後ね何が違うことが起こったとかは本当なんか臨機応変に変えていったらいいと思うのでとりあえずやってみるっていうのが大事かなと思いますいや素晴らしい僕と友達になれそうなぐらい一緒だ多分セナさんには刺さらないんだろうなって思いながら聞いてたけど俺はほら知っちゃってるからさそのしょうこさんがささっきのひでとしきあのほらひでとしきって言ったらわかんないかあのカナダのカナダの会社に入ってアプライしてみてダメだったとしてももう一回ねあの直してから送るとかそうあれをちょっとフログの中だとひでとしき言ってるんですけどとかもそうだし、あとはまあね、あの就活転職するぞっていう時に、俺とか連絡してくれたりとか、まあ経済ね、ちょっとつなぎさせてもらったりとかで、なんか環境もちゃんと利用してるから、割と、あの、そうそう、なんだろう、あの確かになんか無鉄砲というか、あの、考えなしなところもあるのかもしれないけどもしかしたら、まあとはいえでもね、あの、いまいる環境をフル活用するみたいなマインドは、俺はもうめちゃくちゃ安心して見ていたので、ちゃんと僕にも刺さっておりますのでご安心いただければと。確かにそれで言って僕とは違う僕全然環境を活用できないタイプだでもあれなどの時はねまだ環境なかったっていうのは確かにその通りちゃんその通りだからねまあ時って言っても3ヶ月しか違わないんで何とも言えないところですがまあまあまあまあそれもそれでっていうことではいそんなところですかねそうですねはいありがとうございましたはいありがとうございましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうござい",
  "utterances": [
    {
      "speaker": "A",
      "text": "前回に引き続きしょうこさんに来ていただきました前回はカナダに来る前のキャリアみたいなところとあとは1社目かな今3社目だと思うんですけど1社目のレイオフされるところまで話したんですけどちょっと2社目からかないきたいと思います2社目はじゃあそのIoTの会社でiOSっていうほぼ全く同じステータスでじゃあ割ともうすぐ即戦力みたいな感じで働き始めたんですか?",
      "start": 268,
      "end": 30899,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "そうですね、はい。その会社がほんと立ち上げたてっていうのもあって、もうそこからガンガン開発していくって形ですね。",
      "start": 30899,
      "end": 42558,
      "timestamp": "00:30"
    },
    {
      "speaker": "A",
      "text": "どのぐらいなんかメンバーみたいな、IT部門というかソフトウェア部門はどのぐらいいたんですか?",
      "start": 42558,
      "end": 51444,
      "timestamp": "00:42"
    },
    {
      "speaker": "B",
      "text": "会社自体が本当に10人ぐらい。で、まあ一応そこにiOSと、あとAndroiの人と、あとQAの人とか、という形の構成でした。",
      "start": 51444,
      "end": 70536,
      "timestamp": "00:51"
    },
    {
      "speaker": "C",
      "text": "なるほどね。じゃあもう本当にドスタートアップというか、もうできたでほやほやみたいな感じに入ったんですね。",
      "start": 70536,
      "end": 75480,
      "timestamp": "01:10"
    },
    {
      "speaker": "B",
      "text": "そうです。",
      "start": 75480,
      "end": 76677,
      "timestamp": "01:15"
    },
    {
      "speaker": "A",
      "text": "ちなみに全然分かんなかったらいいんですけど僕イメージだとスタートアップってiOSアンドロイドって分けるよりリアクトネイティブとか使うイメージあったんですけどそれはIoTだからなのかななんかそういう技術的なあれがある",
      "start": 76687,
      "end": 94199,
      "timestamp": "01:16"
    },
    {
      "speaker": "B",
      "text": "んですかねそうですね、やっぱりIoTでBluetohとかを結構使う、BLEっていうのを使うんですけど、BluetohLwEnrgyやったかな?なんですけど、やっぱりそこらへんを使うとなると、ネイティブの言語じゃないと結構まあその当時は結構難しいという感じでしたねそう",
      "start": 94199,
      "end": 120267,
      "timestamp": "01:34"
    },
    {
      "speaker": "C",
      "text": "よねなんかリアクトネイティブだとネイティブの一部機能を使えなかった時期って結構長かったですもんねだから多分その時期に当たってっていうことですよね多分そうですね素晴らしい",
      "start": 120267,
      "end": 135691,
      "timestamp": "02:00"
    },
    {
      "speaker": "A",
      "text": "人の紹介でコネクションで入ったってことだったんですけどなんか技術的な面談とかなんかインタビューみたいなのは",
      "start": 135691,
      "end": 142493,
      "timestamp": "02:15"
    },
    {
      "speaker": "B",
      "text": "あったんですかそうですね、本当に軽くっていう形で、そのコネクションで誘ってくれた人も、お仕事で一緒にしたこともあったので、だいたいどんな感じかわかっているという形だったので、そのまま入りました。",
      "start": 142493,
      "end": 165437,
      "timestamp": "02:22"
    },
    {
      "speaker": "A",
      "text": "じゃあ結構強い感じのレファラルというかなんかこの人なんか名前知ってるよぐらいな感じじゃなくてもう一緒に働いててもうこの人だったらもう明日から即戦力だよみたいな感じでじゃあもう紹介されてはいって感じな",
      "start": 165447,
      "end": 180242,
      "timestamp": "02:45"
    },
    {
      "speaker": "C",
      "text": "んですね入ったときももちろんIOSエンジニアとしてっていう形だったと思いますけどチームにジョインするときその10名体制ってその前の会社が数十名体制割と大きい会社だったっていうことだと思いますが結構そのコンバートするにあたって環境の変化にちょっと適応するっていうのは結構大変でしたそう",
      "start": 180242,
      "end": 199942,
      "timestamp": "03:00"
    },
    {
      "speaker": "B",
      "text": "ですねただ前の会社も結局はハードウェアの会社だったんですけどソフトウェア部門は新しかったのでの環境だったんですよねなのでそこのトランディションはやっぱ割とスムーズにできたかなという形ですねそこももしか",
      "start": 199942,
      "end": 222211,
      "timestamp": "03:19"
    },
    {
      "speaker": "C",
      "text": "したらねMitsukroeっていうのでリファラルも出してくれたのかもしれないですよ",
      "start": 222211,
      "end": 225974,
      "timestamp": "03:42"
    },
    {
      "speaker": "B",
      "text": "ねそうですねあとは何でしょうねスタートアップも本当に始めたてっていう会社もあったのでiOS以外のすることが増えたっていうのはちょっと大変でしたそうか、",
      "start": 225974,
      "end": 240645,
      "timestamp": "03:45"
    },
    {
      "speaker": "C",
      "text": "若干ジェネラル寄りになるというかね、やれることが、やらなくちゃいけないことが増えるタイミングですもんね。",
      "start": 240645,
      "end": 245819,
      "timestamp": "04:00"
    },
    {
      "speaker": "B",
      "text": "そうですね。",
      "start": 245819,
      "end": 246609,
      "timestamp": "04:05"
    },
    {
      "speaker": "A",
      "text": "スタートアップとかだとね、なんでも屋さんとかにはなりがちだから、人数によって結構そういうのは増えてきそうですよね。ちなみに何か、ベネフィット的な面で言うと、前の会社からのほぼ持ち越しみたいな感じだったんですか?",
      "start": 246609,
      "end": 260698,
      "timestamp": "04:06"
    },
    {
      "speaker": "B",
      "text": "そうですね、ほとんどほぼ同じでしたね。",
      "start": 260698,
      "end": 265253,
      "timestamp": "04:20"
    },
    {
      "speaker": "A",
      "text": "じゃあもう全然、1ヶ月バカンスがあったっていうぐらいで、他なんか悪いことは特になくみたいな感じ。",
      "start": 265263,
      "end": 271700,
      "timestamp": "04:25"
    },
    {
      "speaker": "B",
      "text": "特になく、新しい環境で頑張ると。",
      "start": 271700,
      "end": 275886,
      "timestamp": "04:31"
    },
    {
      "speaker": "A",
      "text": "そのレイオフだったら僕もアリだな。",
      "start": 275886,
      "end": 278563,
      "timestamp": "04:35"
    },
    {
      "speaker": "C",
      "text": "まあそれはね間違いないなるほどねいいですねじゃあまあ給与的な部分なんかもまあ全職のこともちゃんと意識してくれての数字だっただろうし働く環境的にもそんなむちゃくちゃコンバートが必要だったわけでもないしっていうので2社目に関してはどのくらいの期間",
      "start": 278573,
      "end": 296007,
      "timestamp": "04:38"
    },
    {
      "speaker": "A",
      "text": "働いてたんですか2",
      "start": 296007,
      "end": 298263,
      "timestamp": "04:56"
    },
    {
      "speaker": "B",
      "text": "社目に関しては、",
      "start": 298263,
      "end": 301317,
      "timestamp": "04:58"
    },
    {
      "speaker": "A",
      "text": "去年の…なんか2年1ヶ月ぐらいで、僕今リンクで見ながら話してる。",
      "start": 301317,
      "end": 306604,
      "timestamp": "05:01"
    },
    {
      "speaker": "B",
      "text": "はい、それぐらいです",
      "start": 306604,
      "end": 307515,
      "timestamp": "05:06"
    },
    {
      "speaker": "A",
      "text": "ね。ちなみに、それを何だろう、やめようと思ったのは何か、何かあったんです",
      "start": 307515,
      "end": 314905,
      "timestamp": "05:07"
    },
    {
      "speaker": "B",
      "text": "か?そうですねまぁちょっと環境を変えてみたいっていうのと今までスタートアップでずっと働いていたのでいわゆるなんかまぁねせっかくカナさんに来たのでいわゆる北米のエンジニアみたいな働き方をちょっとやってみたいっていうちなみ",
      "start": 314905,
      "end": 334497,
      "timestamp": "05:14"
    },
    {
      "speaker": "A",
      "text": "にその一社名二社名はどこらへんがその北米のエンジニアじゃなかったんです",
      "start": 334497,
      "end": 338880,
      "timestamp": "05:34"
    },
    {
      "speaker": "B",
      "text": "か?めっちゃ気になると思う結構結構、読む内容は忙しかったっていうのはあります",
      "start": 338880,
      "end": 347930,
      "timestamp": "05:38"
    },
    {
      "speaker": "A",
      "text": "ね。忙しいっていうのは時間的にですか、それとも気持ち的",
      "start": 347930,
      "end": 353013,
      "timestamp": "05:47"
    },
    {
      "speaker": "B",
      "text": "な?気持ち的には、だいぶ忙しかったなという形で、時間的には確かに日本に比べると、5時、6時で終われるので、そこはすごい満足でした",
      "start": 353013,
      "end": 368320,
      "timestamp": "05:53"
    },
    {
      "speaker": "C",
      "text": "ね。カナダっていうとこですよ",
      "start": 368320,
      "end": 370167,
      "timestamp": "06:08"
    },
    {
      "speaker": "B",
      "text": "ね。そうですね。ただ、ちゃんとして会社で働いてみたかったっていうのはあり",
      "start": 370167,
      "end": 375731,
      "timestamp": "06:10"
    },
    {
      "speaker": "A",
      "text": "ます。大学より大規模",
      "start": 375731,
      "end": 377673,
      "timestamp": "06:15"
    },
    {
      "speaker": "C",
      "text": "で。そうですよね。だからカナダっぽいっていうのもそうかもしれないけど、給与面だったりとか時間だったりとか規模だったりとか割とエンジニアといえば一旦こういうキャリアをみたいなところで一旦働いてみたかったみたいなイメージじゃないですか",
      "start": 377673,
      "end": 390843,
      "timestamp": "06:17"
    },
    {
      "speaker": "B",
      "text": "ね。そうですね。それが大きかったですね。あとは、もともとすごい小さいスタートアップも最初の時期からやってみたかったっていうのはあってそれでは大体どんな感じかわかって結局自分がどういう環境が働きやすいかっていうのもわかったので次はちょっと違うところに行ってみたいなっていう形です",
      "start": 390843,
      "end": 415513,
      "timestamp": "06:30"
    },
    {
      "speaker": "C",
      "text": "ねそういうことですねじゃあ2社目の就職もして転職活動もそろそろ考え出そうかなの時で多分初めてなわけじゃないですかそういった大きい会社に要するに就職をするための活動っていうふうにすると具体的に在籍在職されている最中に3社目に移動するための準備とかってされていたんですか",
      "start": 415513,
      "end": 437650,
      "timestamp": "06:55"
    },
    {
      "speaker": "B",
      "text": "就職活動っていうのかなそうですね、在籍期間中は特にやってなかったんですよね本当このやり方お勧めしないんですけど、先に辞めてしまって、でまたバカンスを取ってバカンスドリームだバカンスドリームだで、そこから就活したっていう形なので在籍期間中は特に何もやって",
      "start": 437650,
      "end": 466853,
      "timestamp": "07:17"
    },
    {
      "speaker": "C",
      "text": "なかったですねこれまた珍しいですね。だいたい何かトガシリオとかね、他の経産だったりとかっていうのを人見て、僕もそろそろやらなくちゃなっていうので、仕事ついてる期間中に何か準備を始めるって人が多いなっていう中で、じゃあ翔子さんは完全に辞めて、すっぱり辞めてから全部準備を始めるっていうレアなパターン",
      "start": 466853,
      "end": 486668,
      "timestamp": "07:46"
    },
    {
      "speaker": "A",
      "text": "を。それは何か理由あったんですか?何だろう。急が、何か気持ち的に忙しいからと",
      "start": 486668,
      "end": 493411,
      "timestamp": "08:06"
    },
    {
      "speaker": "B",
      "text": "か。そうですね気持ち的にも忙しかったのとあとは本当業務的にも忙しくて仕事の他に就活できるような環境じゃなかったっていうのはありますねあとは単純にちょっとバケーション欲しかったの",
      "start": 493411,
      "end": 514539,
      "timestamp": "08:13"
    },
    {
      "speaker": "A",
      "text": "でちなみにその1社目2社目ではバケーションとかはどんな感じだったん",
      "start": 514539,
      "end": 519763,
      "timestamp": "08:34"
    },
    {
      "speaker": "B",
      "text": "ですか1社目、2社目は、えっと、そうですね、普通に撮ってましたね。1ヶ月ぐらい日本に帰ったりと",
      "start": 519763,
      "end": 530691,
      "timestamp": "08:39"
    },
    {
      "speaker": "C",
      "text": "か。そうっすよね。その辺は割といくら忙しいと言われても、やっぱりカナダの会社だったんだなっていう。そうです",
      "start": 530691,
      "end": 541577,
      "timestamp": "08:50"
    },
    {
      "speaker": "A",
      "text": "ね。ちなみにその2回目のバケーションはどこに帰った?確か",
      "start": 541577,
      "end": 544479,
      "timestamp": "09:01"
    },
    {
      "speaker": "B",
      "text": "に。2回目のバケーションは、あ、でもあの犬、を買い出したんですよ",
      "start": 544479,
      "end": 552818,
      "timestamp": "09:04"
    },
    {
      "speaker": "A",
      "text": "ねワンちゃんいいなぁここも",
      "start": 552818,
      "end": 554778,
      "timestamp": "09:12"
    },
    {
      "speaker": "C",
      "text": "トラ仕様のアレね似て",
      "start": 554778,
      "end": 556099,
      "timestamp": "09:14"
    },
    {
      "speaker": "A",
      "text": "ますねあなたもずっと飼いたい僕も今犬飼いたくて待ってる今そろそろ引っ越そうかなって",
      "start": 556099,
      "end": 560760,
      "timestamp": "09:16"
    },
    {
      "speaker": "B",
      "text": "思ってますぜひぜひおすすめですなのでそうですねその期間中はどっかに行くっていうよりは犬のトレーニングとか犬をバージョンアップさせようと思ってバージョン",
      "start": 560760,
      "end": 577104,
      "timestamp": "09:20"
    },
    {
      "speaker": "C",
      "text": "アップ?バージョンがあるのかなる",
      "start": 577104,
      "end": 579965,
      "timestamp": "09:37"
    },
    {
      "speaker": "A",
      "text": "ほどですねめっちゃなんか幸せに",
      "start": 579965,
      "end": 581886,
      "timestamp": "09:39"
    },
    {
      "speaker": "C",
      "text": "生きてる感じだねえー素晴らしいじゃあまあバケーション期間中使ってちょっとワンちゃんと一緒に過ごしっていうのが1ヶ月くらいありでまあその期間にね当然就職活動の準備っていうのをされるのかなっていうふうに思うんですが転職活動かまあ大きい会社を狙うための転職活動っていうことでなんか特別なことでもやったのかなっていうのは聞いてみたいんですけど一社目二社目と違っててなんか特別に違うことやったとかあり",
      "start": 581886,
      "end": 606160,
      "timestamp": "09:41"
    },
    {
      "speaker": "B",
      "text": "ます?そうですね特別に違うことは特にないんですけどただ1社目と2社目は割とすんなり決まったのでいわゆる就職活動ってあんまりしてなかったんですよねそうですよね、聞いてるとねなのでどちらかというと今回が本当にちゃんとした就活活動をしたっていう感じ",
      "start": 606160,
      "end": 634262,
      "timestamp": "10:06"
    },
    {
      "speaker": "C",
      "text": "ですねそういうことですね例えば何でしょうリードコード頑張ったとかシステムデザイン勉強し直したとか割とそういう当たり前な就職活動の準備をさ",
      "start": 634262,
      "end": 645484,
      "timestamp": "10:34"
    },
    {
      "speaker": "B",
      "text": "れたイメージですかそうですねはいその就職活動をする際にセナさんにちょっと相談させてもらってそれでヒアリングをしたのでそれでいわゆるリードコードとかあとはシステムデザイン系をしてやったりとかあとは本当に面接の対策をしたりとかっていうの就職の準備をしたっていう形",
      "start": 645484,
      "end": 675485,
      "timestamp": "10:45"
    },
    {
      "speaker": "C",
      "text": "ですねそういうことですよねそう話僕が僕が話聞いた時も割ともう就職カーズはなんか準備っぽい準備はもうされてたっぽいイメージが正直あってでなおかつねもう転職もされたこともあるってことだから何の心配もしなかったとありますがあれかあのKさんの確か面接のなんかレッスンみたいなやつありましたよねあれ1回確かやれられたんですよ",
      "start": 675485,
      "end": 695737,
      "timestamp": "11:15"
    },
    {
      "speaker": "B",
      "text": "ね確かあそうですねはいあのマックインタビューをけいさんのやらせてもらってまあはいそうですねそれはすごい良かった",
      "start": 695737,
      "end": 705598,
      "timestamp": "11:35"
    },
    {
      "speaker": "C",
      "text": "と思います本当ですか良かっ",
      "start": 705598,
      "end": 707099,
      "timestamp": "11:45"
    },
    {
      "speaker": "B",
      "text": "た良かったはいなんかちょうど面接を初めての面接がなんか次の週かなどこにあったのでなんかそれに向けてなんか面接どんな感じだろうっていうのを空気感",
      "start": 707099,
      "end": 724276,
      "timestamp": "11:47"
    },
    {
      "speaker": "C",
      "text": "が分かってよかったですよかったですね素晴らしいなるほどですねちなみにトータルで就活に使った期間としては何ヶ月くらいだったんです",
      "start": 724276,
      "end": 732982,
      "timestamp": "12:04"
    },
    {
      "speaker": "B",
      "text": "かえっと就活は今回は3、4ヶ月ですね",
      "start": 732982,
      "end": 740267,
      "timestamp": "12:12"
    },
    {
      "speaker": "C",
      "text": "3、4ヶ月かなるほどちなみに3社目の会社名って言っちゃっていいんですか",
      "start": 740267,
      "end": 746632,
      "timestamp": "12:20"
    },
    {
      "speaker": "B",
      "text": "ねああはい大丈夫だと思い",
      "start": 746632,
      "end": 751559,
      "timestamp": "12:26"
    },
    {
      "speaker": "C",
      "text": "ます本当ですかありがとうございますそしたらえっとちょっと待ってねコングラスチャンネル見ないと毎回忘れちゃうんだよな",
      "start": 751559,
      "end": 757581,
      "timestamp": "12:31"
    },
    {
      "speaker": "A",
      "text": "ライトスピードですよねライトスピード",
      "start": 757581,
      "end": 760001,
      "timestamp": "12:37"
    },
    {
      "speaker": "C",
      "text": "もうKさんがまさかこの会社に入れるジャパニーズがいたのかみたいなね感じですごいテンション上げ上げになっていましたが僕も実はこの会社あのしょうこさんがねスラックフロックのスラックにあげてくれてから知ったんですがもうカナダというカナダのあのPOSのシステム作ってらっしゃる会社",
      "start": 760001,
      "end": 776306,
      "timestamp": "12:40"
    },
    {
      "speaker": "B",
      "text": "ですよねああそうですね、あのポスを結構あの作ってる会社で、いや私もあの、言われるまでそんなすごい会社なのかっていうのが全く知らずに入ってたんですけど、本当に単純にあのプロジェクトが面白そうやったから決めたっていう形です",
      "start": 776306,
      "end": 796954,
      "timestamp": "12:56"
    },
    {
      "speaker": "C",
      "text": "ね。なるほど素晴らしいちなみにまあまあこのライトスピードも初めて就職活動期間中に知ったっていうことかなと思うんですがなんかトータル何社くらい受けられたとかもしくは応募されたとかって覚えて",
      "start": 796954,
      "end": 810302,
      "timestamp": "13:16"
    },
    {
      "speaker": "B",
      "text": "ます?そうですねえっとトータル今回は応募が70件くらいか",
      "start": 810302,
      "end": 818265,
      "timestamp": "13:30"
    },
    {
      "speaker": "C",
      "text": "ななんか一社目よりは",
      "start": 818265,
      "end": 820221,
      "timestamp": "13:38"
    },
    {
      "speaker": "B",
      "text": "だいぶ増えたそうですね一社目と比べるとほぼほぼ2倍ぐらいになってその中で面接受けたのが",
      "start": 820221,
      "end": 831831,
      "timestamp": "13:40"
    },
    {
      "speaker": "C",
      "text": "10社ぐらいで10社素晴らしい",
      "start": 831831,
      "end": 834653,
      "timestamp": "13:51"
    },
    {
      "speaker": "A",
      "text": "打率ですねちなみに今何か見られてたと思うんですけど何かにつけてた感じなんですか",
      "start": 834653,
      "end": 842019,
      "timestamp": "13:54"
    },
    {
      "speaker": "B",
      "text": "Excelみたいな感じそうですね一応Excelとかで記録は取ってました",
      "start": 842019,
      "end": 850291,
      "timestamp": "14:02"
    },
    {
      "speaker": "C",
      "text": "ね。",
      "start": 850291,
      "end": 850952,
      "timestamp": "14:10"
    },
    {
      "speaker": "A",
      "text": "素晴らしい。ちゃんとなんか分析してやれてる人は打率がめちゃくちゃいいなっていう人ありますよね。まあ優吾くんとかもそうです",
      "start": 850952,
      "end": 857961,
      "timestamp": "14:10"
    },
    {
      "speaker": "C",
      "text": "し。そうかしさんの、こうへいさんやったかな?の出されてきたなんか企業分析リストみたいなやつも俺かなり関心したけど",
      "start": 857961,
      "end": 864950,
      "timestamp": "14:17"
    },
    {
      "speaker": "A",
      "text": "ね。素晴らしい今日は特にセナさんがめっちゃテンション高くて僕のちょっと入り込む隙がごめんね、もっと喋ってじゃあいいですよごめんねどんどん言ってください",
      "start": 864950,
      "end": 879669,
      "timestamp": "14:24"
    },
    {
      "speaker": "C",
      "text": "いやそうなんですよだって大きい会社やししかも俺の知らないトロントの話やしっていうのでもう知り",
      "start": 879669,
      "end": 885331,
      "timestamp": "14:39"
    },
    {
      "speaker": "A",
      "text": "たいことが多すぎてさ確かに3、4ヶ月で今の会社見つかったと思うんですけどどういう感じのなんだろうインタビューの流れだったんです",
      "start": 885331,
      "end": 898859,
      "timestamp": "14:45"
    },
    {
      "speaker": "B",
      "text": "か?そうですねインタビューの流れはいわゆる王道で多すぎず少なすぎずって感じなんですけど一応3ラウンドあって最初はHRの人と話してその後一次面接でテックリードの人と喋ってその後が技術面接ですね一応ペアコーディングの面接があってその後にもっと偉い人プロジェクトちょっと名称忘れちゃったんですけどいわゆる偉い人と喋ってそこでオファーをもらうって感じです",
      "start": 898859,
      "end": 947481,
      "timestamp": "14:58"
    },
    {
      "speaker": "A",
      "text": "ねマネージャーと話したのは、なんかいわゆる、えっと、ビヘイベラルクエスチョンみたいな感じだったんです",
      "start": 947481,
      "end": 956797,
      "timestamp": "15:47"
    },
    {
      "speaker": "C",
      "text": "か?",
      "start": 956797,
      "end": 956827,
      "timestamp": "15:56"
    },
    {
      "speaker": "B",
      "text": "あ、そうですね。はい。そこは本当に",
      "start": 956827,
      "end": 959439,
      "timestamp": "15:56"
    },
    {
      "speaker": "A",
      "text": "ビヘイベラル。1時間",
      "start": 959439,
      "end": 960219,
      "timestamp": "15:59"
    },
    {
      "speaker": "B",
      "text": "ぐらい?あ、そうですね。1時間",
      "start": 960219,
      "end": 962321,
      "timestamp": "16:00"
    },
    {
      "speaker": "A",
      "text": "ぐらい。で、2つ目が、ペアプログラミングみたいだと思うんですけど、それはなんか何系の、なんかリートコード系なのか、それとももう業務系のものを作るなのか、なんかどういう系の",
      "start": 962321,
      "end": 976911,
      "timestamp": "16:02"
    },
    {
      "speaker": "B",
      "text": "問題だったんですか?そこは一応2セッションに分かれていて前半がピアコーディングで後半がどっちかというと技術系のことについて履歴書の中身を追って説明するっていう形だったんですけどピアコーディングはどっちかというと業務に沿った問題を出され",
      "start": 976911,
      "end": 1001262,
      "timestamp": "16:16"
    },
    {
      "speaker": "A",
      "text": "ましたねそのデッキとかはどんな感じでし",
      "start": 1001262,
      "end": 1007226,
      "timestamp": "16:41"
    },
    {
      "speaker": "B",
      "text": "た?その時のデッキは比較的優しい問題だったかなと思うのでそうですねその時はもうちゃんと最後まで終わらせてあと質問とかされた時にも一応ちゃんと答えられたかな",
      "start": 1007226,
      "end": 1025773,
      "timestamp": "16:47"
    },
    {
      "speaker": "A",
      "text": "という形です素晴らしいで偉い人と喋ってじゃあそれが一応HR4つ目か、4つ目になるのか",
      "start": 1025773,
      "end": 1040825,
      "timestamp": "17:05"
    },
    {
      "speaker": "C",
      "text": "な。",
      "start": 1040825,
      "end": 1041065,
      "timestamp": "17:20"
    },
    {
      "speaker": "A",
      "text": "はい。期間的にはどのぐらいの期間、2、3週間でって感じなんです",
      "start": 1041065,
      "end": 1044946,
      "timestamp": "17:21"
    },
    {
      "speaker": "B",
      "text": "か?そうですね、期間的には、そうですね、2、3週間ぐらいだったと思い",
      "start": 1044946,
      "end": 1052290,
      "timestamp": "17:24"
    },
    {
      "speaker": "A",
      "text": "ます。じゃあ本当に確かに多すぎず、少なすぎずっていう感じです",
      "start": 1052290,
      "end": 1058612,
      "timestamp": "17:32"
    },
    {
      "speaker": "B",
      "text": "ね。はい、そうですね、あの無限ループにはハマらずって感じ",
      "start": 1058612,
      "end": 1061734,
      "timestamp": "17:38"
    },
    {
      "speaker": "C",
      "text": "です。難しい。まあそうか、ちなみにねこれもまあ1社目2社目っていう風に多分給料的な部分だと割とスライドだったのかなというふうに思うんですがなんかやっぱりまあ3社目でしかもこれだけ大きい会社っていう風になると結構給料的にはもうだいぶ上がった感じです",
      "start": 1061734,
      "end": 1078826,
      "timestamp": "17:41"
    },
    {
      "speaker": "B",
      "text": "か?そうですねえっとはいえっと給料的には上がりましたねまあ1社目2社目が割とあのどっちかというと何でしょうねハードウェア関係の会社だったのでいわゆるエンジニアがいっぱいいるソフトウェアワークサース企業みたいな会社に比べるとちょっと低かったイメージがあったんですけど今回は平均ぐらいのところまでいけたかなと思い",
      "start": 1078826,
      "end": 1107861,
      "timestamp": "17:58"
    },
    {
      "speaker": "C",
      "text": "ます素晴らしいポジションはちなみに3社目はもうその大きい会社になるとやっぱりマトリックス結構分かれるじゃないですかあのシニアジュニアインターミニティとみたいなとこだとなんかなんか肩書き的にはどうなっ",
      "start": 1107861,
      "end": 1120027,
      "timestamp": "18:27"
    },
    {
      "speaker": "B",
      "text": "たんですかねえっとさんえっと今回はえっとインターメディエイトアイドルだったんですねはい愛用する朝ですね一応就活の時は両方出してましたシニアとインターミディエイト両方応募しててそうですね今回の会社はそのインターミディエイトのポジションだったっていう",
      "start": 1120027,
      "end": 1141126,
      "timestamp": "18:40"
    },
    {
      "speaker": "C",
      "text": "形ですそういうことですね素晴らしいこれだけ大きい会社のインターミディエイトポジションちょっと今度こそっと言える気い",
      "start": 1141126,
      "end": 1148411,
      "timestamp": "19:01"
    },
    {
      "speaker": "A",
      "text": "こうしかもあれですよねニューヨークと多分トロントでのどっちもで上場されてる会社なのかなと思うんですけど現金以外のあれもあるんです",
      "start": 1148411,
      "end": 1160218,
      "timestamp": "19:08"
    },
    {
      "speaker": "B",
      "text": "か?あ、そうですね。もうありまし",
      "start": 1160218,
      "end": 1163980,
      "timestamp": "19:20"
    },
    {
      "speaker": "A",
      "text": "た。それはカナダのベースの会社だと、トロントの方でもらえるんですか?それともアメリカのドル",
      "start": 1163980,
      "end": 1171924,
      "timestamp": "19:23"
    },
    {
      "speaker": "B",
      "text": "でもらえるんですか?あの、恥ずかしながらそこら辺よく分かってないんですよねそっ",
      "start": 1171924,
      "end": 1180239,
      "timestamp": "19:31"
    },
    {
      "speaker": "A",
      "text": "か、まだ1年経ってないのか、そもそもはい、まだ経ってないですねじゃあ、そのうちコソッと教えて",
      "start": 1180239,
      "end": 1186262,
      "timestamp": "19:40"
    },
    {
      "speaker": "B",
      "text": "もらうことにしますねそれ",
      "start": 1186262,
      "end": 1188624,
      "timestamp": "19:46"
    },
    {
      "speaker": "C",
      "text": "までにはちゃんと調べた気がするベスティングスケジュールね、多分組まれてると思うから、それで売れる時期きたら、あのね、ちょっと現金一回になったか、コソッと",
      "start": 1188624,
      "end": 1198650,
      "timestamp": "19:48"
    },
    {
      "speaker": "A",
      "text": "聞こうでもめちゃくちゃ有料企業というかねえ",
      "start": 1198650,
      "end": 1206703,
      "timestamp": "19:58"
    },
    {
      "speaker": "C",
      "text": "素晴らしい会社ですよねいや素晴らしい",
      "start": 1206703,
      "end": 1209584,
      "timestamp": "20:06"
    },
    {
      "speaker": "A",
      "text": "まあここまでじゃあもう一つ聞いていいですかあの一社目二社目よりカナダ企業っぽいところで働きたいっていう風に言ってたんですけどそれは今の会社カナダ企業っぽい感じになっ",
      "start": 1209584,
      "end": 1221650,
      "timestamp": "20:09"
    },
    {
      "speaker": "B",
      "text": "たんですかそうですね、今回の会社はなったような気がし",
      "start": 1221650,
      "end": 1226956,
      "timestamp": "20:21"
    },
    {
      "speaker": "C",
      "text": "ます。一番実感するのはどこですか?働き方、それとも",
      "start": 1226956,
      "end": 1234261,
      "timestamp": "20:26"
    },
    {
      "speaker": "B",
      "text": "待遇?そうですね、待遇もそうですけど、働き方ですね。働き方が、イメージしてた、カナダで働くエンジニアみたいな働き方になって、あとは、コミュニケーションとかの面でも、すごい、カナダらしいというか、欧米らしいコミュニケーションかなとは思いました",
      "start": 1234261,
      "end": 1267327,
      "timestamp": "20:34"
    },
    {
      "speaker": "A",
      "text": "ね。ちょっと分かんない",
      "start": 1267327,
      "end": 1270191,
      "timestamp": "21:07"
    },
    {
      "speaker": "C",
      "text": "なぁ。僕",
      "start": 1270191,
      "end": 1271112,
      "timestamp": "21:10"
    },
    {
      "speaker": "A",
      "text": "が、僕は割とその1社目2社目がカナダっぽいかったのかなぁって思って、今働き方でいうと、まぁちょっとまぁ大きい会社だから大きい、ごめんなさい、大きいアメリカのSaaSの会社でありがちの働き方を割としてて、ちょっと忙しい、忙しくなったのと、まあなんか、重圧は増えたなみたいな、いろいろ、あの、まあなんかオンコールとかやったりして、あの、呼ばれるだとかっていうのもあるし、なんかアメリカの人たちと一緒に働くと、やっぱりちょっとそれに引きずられてちょっと忙しくなるみたいなのがありつつ、それはなんかアメリカっぽくなったのかなって思いつつ、なんだろう、どこら辺がカナダっぽいんだろう?あんまりまだイメージができてない。なんかきっとあるんでしょうね、頭の中に。これがカナダ企業だ、みたい",
      "start": 1271112,
      "end": 1318535,
      "timestamp": "21:11"
    },
    {
      "speaker": "B",
      "text": "な。勝手なイメージなんですけど、今までの会社が結構忙しい。あと、プレッシャーも大きかったんですよね。なので今の会社はもう本当にiOSのエンジニアが多分10",
      "start": 1318535,
      "end": 1338005,
      "timestamp": "21:58"
    },
    {
      "speaker": "C",
      "text": "人、20人ぐらいいっ",
      "start": 1338005,
      "end": 1339808,
      "timestamp": "22:18"
    },
    {
      "speaker": "B",
      "text": "て、それを一つのプロジェクトでやってる。みんなで働くっていう感じなので今までは本当に1アプリに3人1人とかも全然あったのでそれに比べるとちょっと分業されてるそうですそう",
      "start": 1339808,
      "end": 1357705,
      "timestamp": "22:19"
    },
    {
      "speaker": "C",
      "text": "です分業が多くてなんか俺聞いてる感じだとやっぱそのカナダっぽいっていうのってまあ割と規模の大きいチームとしてちゃんとマイクロサービスというかちゃんと分けられていてでその上でねあのなんだろうまあカナダっぽいはもう代名詞としてやっぱりそのライフバークバランスがみたいなね。だからライフバークバランス良くなおかつ希望の大きい会社に入ったのが多分カナダっぽいんだろうなーって勝手に頭の中では。わかってきましたわかってきました。でもそういう大きい会社で入ってしかもライトスピードって調べれば調べるほど非常に規模も大きい売り上げ規模も何十億っていうね40億ドルっていう規模の会社なのでもう面子的にもっていうかキャリア的にも次も見やすいんじゃないかなって正直思うんですがやっぱり大きい会社に入ってみて見えてくる世界観っていうかキャリア的な発展性次例えばグーグル行ってみようかなとか次なんかもっと大きい会社私も行けるんじゃないかなそういう自信の方に繋がったもんです",
      "start": 1357705,
      "end": 1420441,
      "timestamp": "22:37"
    },
    {
      "speaker": "B",
      "text": "かああそうですねえっと地震特にあまり変わってないはいあの本当にあの本当にライトスピードそんな会社って全然知らずに本当に入ったので、どっちかというと、この間けいさんとちょっとお話ししたのと、あと今、すなさんとりょうさんとお話しして、あ、そうなんだ",
      "start": 1420441,
      "end": 1453842,
      "timestamp": "23:40"
    },
    {
      "speaker": "C",
      "text": "って。なるほどねじゃあこれからもっともっと実感していくのかなと思いますし大丈夫ですか僕多分まあまあ自慢しますよライトスピード入って増えるよって黒くの山で一緒にいたよって君知らないのって言いますよ多分自分",
      "start": 1453842,
      "end": 1471219,
      "timestamp": "24:13"
    },
    {
      "speaker": "A",
      "text": "も知らなかったのにそこは内緒ですねちなみにオフィスは出社はあるんですかそれともリモートですか",
      "start": 1471219,
      "end": 1479143,
      "timestamp": "24:31"
    },
    {
      "speaker": "B",
      "text": "えっと、完全リモートですね。へー。はい。っていうのも結構面白いなと思うところが、カナダは拠点は基本的にワントリオール、トロントの人が多いんですけど、それ以外にヨーロッパが多いんですよね。へー、珍しい。はい。なので結構一緒に、本当にヨーロッパの人たちも一緒のチームに入ってやってるので、まあ、そうなので、そういうこともあって、本当にフルリモートです",
      "start": 1479874,
      "end": 1508203,
      "timestamp": "24:39"
    },
    {
      "speaker": "A",
      "text": "ね。ちなみにバンクーバーとかからは働けないんですか今",
      "start": 1508203,
      "end": 1512787,
      "timestamp": "25:08"
    },
    {
      "speaker": "B",
      "text": "のところ働いてる人はいないんですけどでも多分移りたいですって言ったら移れるんじゃないかなと思い",
      "start": 1512787,
      "end": 1524156,
      "timestamp": "25:12"
    },
    {
      "speaker": "A",
      "text": "ます今時ちょっと珍しめの会社ですねそれはショピファイくらいしか",
      "start": 1524156,
      "end": 1531981,
      "timestamp": "25:24"
    },
    {
      "speaker": "C",
      "text": "パッと思い浮かばないもんね最近",
      "start": 1531981,
      "end": 1533583,
      "timestamp": "25:31"
    },
    {
      "speaker": "A",
      "text": "だったらあとGitLabとかGitLabとかねもともとでしたっけ",
      "start": 1533583,
      "end": 1541184,
      "timestamp": "25:33"
    },
    {
      "speaker": "C",
      "text": "そうだねもともとだねあそこあと俺も知ってるけどあれ",
      "start": 1541184,
      "end": 1546047,
      "timestamp": "25:41"
    },
    {
      "speaker": "A",
      "text": "もうモントリオールとかだとヨーロッパ近いから働きやすいのかなバンクーバーとかだと結構働きにくくはなりますよね多い",
      "start": 1546047,
      "end": 1552992,
      "timestamp": "25:46"
    },
    {
      "speaker": "B",
      "text": "ねそうですね時差の関係はあるかなと思います午前中にちょうどヨーロッパの人たちと時差が合うのがあってそこでミーティングとかをやるのが多いので",
      "start": 1552992,
      "end": 1566102,
      "timestamp": "25:52"
    },
    {
      "speaker": "C",
      "text": "ですよねそうなんだよねバンクーバーまで行ってしまうとプラス3、4時間といえどもそれでもまあまあ実際的にずれちゃうからね3キョって",
      "start": 1566102,
      "end": 1576005,
      "timestamp": "26:06"
    },
    {
      "speaker": "A",
      "text": "やつらいだろうな確かにちなみにどういう感じのなんだろうあのその日のスケジュールというかはどういう感じで働かれてるんですかリモート",
      "start": 1576005,
      "end": 1587728,
      "timestamp": "26:16"
    },
    {
      "speaker": "B",
      "text": "だと思うんですけどはいスケジュールは一応まあ毎朝スタンドアップでそこに参加してまあ今日は何しますよみたいな感じで言ってから本当その後はえっとほぼほぼ開発に専念できるっていう感じ",
      "start": 1587728,
      "end": 1609100,
      "timestamp": "26:27"
    },
    {
      "speaker": "A",
      "text": "ですねえそれが毎日です",
      "start": 1609100,
      "end": 1610681,
      "timestamp": "26:49"
    },
    {
      "speaker": "B",
      "text": "か?あそうですそうですミーティングもなんかすごい少ないいいです",
      "start": 1610681,
      "end": 1618608,
      "timestamp": "26:50"
    },
    {
      "speaker": "C",
      "text": "ねスプリントは2週間ごとくらいです",
      "start": 1618608,
      "end": 1621570,
      "timestamp": "26:58"
    },
    {
      "speaker": "B",
      "text": "か?えっとそれはスプリント一応2週間でするんですけどそれもチームによってなんかスプリントをガッツリやってるところとそうじゃないところは結構あって私のところはそんなに特にガッツリスプリントでやってるわけ",
      "start": 1621570,
      "end": 1640594,
      "timestamp": "27:01"
    },
    {
      "speaker": "C",
      "text": "ではないですねじゃあまあ進捗とか報告しなくちゃいけない時があったらその都度やるみたいなそうですよ",
      "start": 1640594,
      "end": 1647342,
      "timestamp": "27:20"
    },
    {
      "speaker": "A",
      "text": "ね。なるほどね。自由ですね。めちゃくちゃいいです",
      "start": 1647342,
      "end": 1651404,
      "timestamp": "27:27"
    },
    {
      "speaker": "B",
      "text": "ね。そこら辺",
      "start": 1651404,
      "end": 1652524,
      "timestamp": "27:31"
    },
    {
      "speaker": "A",
      "text": "も。うちなんかもうミーティングでまみれてる",
      "start": 1652524,
      "end": 1654305,
      "timestamp": "27:32"
    },
    {
      "speaker": "B",
      "text": "から。そうですよね。なのでそれはすごい思いました。これがカナダっぽい会社なのかっていうのがもう一つ。今までミーティングばっかりで、開発とかほぼほぼ専念できる時間なかったんですけど。ここはもう完全に開発の時間をみんながすごい大切にしてるなっていう空気があっ",
      "start": 1654305,
      "end": 1676775,
      "timestamp": "27:34"
    },
    {
      "speaker": "C",
      "text": "て。いや、それはいいですね。素晴らしい。そこで言うとどうなん?東橋さんのところとか若干日本っぽい?ミーティング大量にあるみたいなイメージある",
      "start": 1676775,
      "end": 1684320,
      "timestamp": "27:56"
    },
    {
      "speaker": "A",
      "text": "けど。いや、まぁでもポジションとかにもよるんですけど、僕の1日は、水金だと、水曜日と金曜日はそんな感じですね、どっちかというと。インタビューとかが入ってくるとちょっと忙しくなったりするのもあるのと月下木はそもそも出社日でそこは結構ミーティングが詰められるスタンドアップはうちはスラックでやるんでないんですけどなんかスプリントキックオフは2週間に1回月曜日あってそうじゃないその各週にあって逆の各週はなんかハーフスプリントみたいなチェックインみたいなのがあってでスプリントレトロみたいなあのえっとレトロなんて言うんだっけ?レトロスペクティブかな?名前忘れたけどなんか反省会みたいなのがあってとかそうそうとかいろいろあるから、割と月間目はミーティングで埋まりがち、特に昼ぐらい、昼過ぎぐらいまで",
      "start": 1684320,
      "end": 1751498,
      "timestamp": "28:04"
    },
    {
      "speaker": "C",
      "text": "は。なんとなく聞いてるとそんな感じなのかです。逆にしょうこさんからそういうのなんか質問とかないですか?だいたいファガシリオンみたいなね、アサナみたいな大きい会社で、一応もう2年目です",
      "start": 1751498,
      "end": 1762306,
      "timestamp": "29:11"
    },
    {
      "speaker": "A",
      "text": "か?あなたも。今もうすぐ2年です",
      "start": 1762306,
      "end": 1765289,
      "timestamp": "29:22"
    },
    {
      "speaker": "C",
      "text": "ねもうすぐ2年っていうねシニアのエンジニアさんっていう形でワンチャンもしかしたらねなんかライトスピードみたいな大きい会社の次になるとすればこのくらいの規模の会社になるかもしれないなと思いますがなんか今のうちにこれ聞いとこうかなとかそれっぽいと",
      "start": 1765289,
      "end": 1779279,
      "timestamp": "29:25"
    },
    {
      "speaker": "A",
      "text": "こないんですかって聞い",
      "start": 1779279,
      "end": 1780459,
      "timestamp": "29:39"
    },
    {
      "speaker": "C",
      "text": "てみるそんなこと言われて",
      "start": 1780459,
      "end": 1784062,
      "timestamp": "29:40"
    },
    {
      "speaker": "A",
      "text": "も難しいですよ",
      "start": 1784062,
      "end": 1784783,
      "timestamp": "29:44"
    },
    {
      "speaker": "B",
      "text": "ねどうなんでしょうね。でもチーム構成とかちょっと気になりますね。セミアの、なんかこの会社に入って初めてスタッフっていうロールの人を初めて見たんですけど、なんかそんな人お手伝いしたいなっていう感じ",
      "start": 1784783,
      "end": 1805222,
      "timestamp": "29:44"
    },
    {
      "speaker": "A",
      "text": "で。確かにあれあるかもしれ",
      "start": 1805222,
      "end": 1806563,
      "timestamp": "30:05"
    },
    {
      "speaker": "B",
      "text": "ない。やったんです",
      "start": 1806563,
      "end": 1807983,
      "timestamp": "30:06"
    },
    {
      "speaker": "A",
      "text": "けど、どうですか?スタッフはチームにいたりいなかったりみたいな感じなんですけど、うちは結構大きめのチームで、エンジニアだけで9人ぐらいいるのかな、10人ぐらいいるのかな。ちょっとごちゃごちゃしてたりはするんですけど、なんかこの機能もらったからエンジニアがついてきたみたいなのとかもあったりするんですけど、うちはそうですねEM1人エンジニアが多分9人か今10人いてデザイナーとあとはPMPD日本風に言うとPDMかなの人がいてあとはチームによりけりでうちはいないけどデータサイエンティストみたいななんか新しい機能出すときにABテストみたいなのこの機能があった方がユーザーが流入されるのかどうかみたいなテストを割ととかそのなんかいいことが起きるかどうかみたいなのを測るみたいなのをなんか専門にやってる人がいてその人がまあなんかいたりするんですけどチーム構成的にはそんな感じですかねでもなんかまあよく言うことなんですけどなんかSaaSの大きい企業を考えるとあんまりカナダっぽくはないかもしれないやっぱりなんか中規模とかある程度の規模の方がやっぱりなんかエンジニアエクスペリエンスみたいなのはすごい良くてさっき言われたみたいにミーティングが少なかったりだとか大きければ大きくなれば大きくなるほどやっぱりそれを管理しようしないといけなくなるからなんかそういうミーティングとかはなんか増えがちなのかなっていうのもありますよ",
      "start": 1807983,
      "end": 1911074,
      "timestamp": "30:07"
    },
    {
      "speaker": "C",
      "text": "ね。なるほどね。しょうごさんの言うと、日本っぽいのに近づいてしまうのは。日本",
      "start": 1911074,
      "end": 1916375,
      "timestamp": "31:51"
    },
    {
      "speaker": "A",
      "text": "っぽい、アメリカっぽいなのか、日本っぽいなのか。アメリカっぽいよ",
      "start": 1916375,
      "end": 1924737,
      "timestamp": "31:56"
    },
    {
      "speaker": "C",
      "text": "ね。それもあるんですよね。アメリカの会社",
      "start": 1924737,
      "end": 1926777,
      "timestamp": "32:04"
    },
    {
      "speaker": "B",
      "text": "か、みたい",
      "start": 1926777,
      "end": 1927257,
      "timestamp": "32:06"
    },
    {
      "speaker": "A",
      "text": "な。カナダの会社ってのが良かったりするのかもしれない僕も2社目、1社目2社目はカナダの会社で1社目は日本の、あ、1社目はカナダのスタートアップで2社目はそれこそモントリオールの割と似た感じかなえっとフィンテック系の会社だったんですけどえっとそこはめちゃくちゃそういえば確かにカナダっぽいというかなんか金曜日誰も働いてないかなみたいな感じだったしなんか全部あのリモートみんなリモートだしはいはいなんだろうそう人の雰囲気が割と緩いというかなんか全部が緩く進んでいく感じがあっ",
      "start": 1927257,
      "end": 1966004,
      "timestamp": "32:07"
    },
    {
      "speaker": "C",
      "text": "たんでなんか難しいよねこうさ待遇を求めていくと絶対アメリカナイズされた会社のがいいに決まっててでもなんかそのでカナダっぽいをやっぱり求める気持ちもすごくよくわかってなんかショピファイもそうだけどさなんか本当になんかライフワークバランスを本当に重視していますあなたたちはファミリーのために生きてるんですみたいな題名していますみたいなさなんかそういう雰囲気ってあるじゃないですかなんか、あの辺をやっぱり求めていくとするんだったら、またちょっと別のベクトルのアンテナを捨てなくちゃいけないだろうなっていうのもあって、なんかどっちを求めるのかってライフステージにもよるんだろう",
      "start": 1966004,
      "end": 2000278,
      "timestamp": "32:46"
    },
    {
      "speaker": "A",
      "text": "けど、ちょっと考えるんですね。一回大きい会社に行ってそっちに中規模の会社戻るとかだと割とその高い給料帯を維持したままいけたりはするかもしれないですねその代わりもちろんパフォーマンスとかも求められるしレイオフのときに真っ先に結構対象になっちゃうのでいや間違いないレイオフって結構やっぱり同じなんていうのインターミデートの会社の人がいたらその給料高い人から選ばれるじゃないですかだからそういう人の方がまあちょっとレイオフの対象になりやすいみたいなのはありつつもう一ついいところで言うとカナダとアメリカにどっちにもオフィスがある会社だとアメリカの方から切られてくっていうのはカナダ安いんでアメリカの方から切られるからそういう意味ではジョブセキュリティ的な意味では結構あの安心できるっていうのはあるかもしれない",
      "start": 2000278,
      "end": 2056848,
      "timestamp": "33:20"
    },
    {
      "speaker": "B",
      "text": "いやいろんな種の選択結局はあれですよね、どこらへんの塩梅がいいかっていうところでした",
      "start": 2056848,
      "end": 2066503,
      "timestamp": "34:16"
    },
    {
      "speaker": "C",
      "text": "ね。間違い",
      "start": 2066503,
      "end": 2067545,
      "timestamp": "34:26"
    },
    {
      "speaker": "A",
      "text": "ない、",
      "start": 2067545,
      "end": 2068125,
      "timestamp": "34:27"
    },
    {
      "speaker": "C",
      "text": "素晴らしい。じゃあ、最後の方にそろそろなるのかなと思いますが、2個くらい聞いてもいいです",
      "start": 2068125,
      "end": 2074554,
      "timestamp": "34:28"
    },
    {
      "speaker": "B",
      "text": "か、最後",
      "start": 2074554,
      "end": 2075096,
      "timestamp": "34:34"
    },
    {
      "speaker": "C",
      "text": "に。一つはいつものね、あのなんか声から来る人たちにのアドバイスのとこなんですけどもう一つちょっと先に聞いておきたいけどなんかしょうこさん的に次のなんかキャリアとかなんか見てんすかさすがに入ったばっかりだから早すぎると思うけどなんかそれとりあえず年収3000万回行こうかなとかなんかそういうざっくりとしたものでもいいんですがなんか次のとか考えて",
      "start": 2075096,
      "end": 2094214,
      "timestamp": "34:35"
    },
    {
      "speaker": "B",
      "text": "ます?企業とか次は、とりあえずは、エンジニアとしてのキャリアアップということで、もともと就活のときにも、狙っていたシニアのポジションには、なりたいなっていうところですね。すばらしい。そのあとは、もう少し経験を積んで、CIポジションかマネージメントのほうかとかはまだちょっと考えてない",
      "start": 2094214,
      "end": 2134228,
      "timestamp": "34:54"
    },
    {
      "speaker": "A",
      "text": "です。",
      "start": 2134228,
      "end": 2135614,
      "timestamp": "35:34"
    },
    {
      "speaker": "C",
      "text": "IC、マネージメントをちょっと選べるようになろうかなってイメージってことです",
      "start": 2135614,
      "end": 2140453,
      "timestamp": "35:35"
    },
    {
      "speaker": "A",
      "text": "ね。長期的にはカナダにいようとか、カナダ以外の国に行こうとか、日本に帰ろうみたいなのは考えてるんです",
      "start": 2140453,
      "end": 2147720,
      "timestamp": "35:40"
    },
    {
      "speaker": "B",
      "text": "か?えっと今のところはカナダですねただそうですねキャリアというか働き方がやっぱりいいっていう部分が捨てがたいっていうのはありますよ",
      "start": 2147720,
      "end": 2162243,
      "timestamp": "35:47"
    },
    {
      "speaker": "A",
      "text": "ねそうだよねちなみに早期リタイヤできそうってなったら",
      "start": 2162243,
      "end": 2165685,
      "timestamp": "36:02"
    },
    {
      "speaker": "B",
      "text": "どうするんですか早期リタイヤできそうってなったらえっと日本住みやすいから日本いいなぁと思います",
      "start": 2165685,
      "end": 2176823,
      "timestamp": "36:05"
    },
    {
      "speaker": "C",
      "text": "ね。そうっすよ",
      "start": 2176823,
      "end": 2177603,
      "timestamp": "36:16"
    },
    {
      "speaker": "A",
      "text": "ね、確かに確か",
      "start": 2177603,
      "end": 2178644,
      "timestamp": "36:17"
    },
    {
      "speaker": "C",
      "text": "に。ありがとうございます。じゃあ最後に、しょうこさんと同じようなトライをこれからされる方々に何かアドバイスなどあれば、7年前、6年前かなくらいのしょうこさんに向けてでもいいです",
      "start": 2178644,
      "end": 2191314,
      "timestamp": "36:18"
    },
    {
      "speaker": "B",
      "text": "が。はい、そうですね。これから来る人ですね。とりあえずあんまり考え…私があんまり考える性格ではないのでっていうのもあるんですけどとりあえずあんまり考えすぎず大体の計画をねってこれでいけるんちゃうかなっていうこの大体の三つ筋をできたらもうなんかチャレンジしてみるっていうのは大事かなと思いますねでその後ね何が違うことが起こったとかは本当なんか臨機応変に変えていったらいいと思うのでとりあえずやってみるっていうのが",
      "start": 2191314,
      "end": 2236858,
      "timestamp": "36:31"
    },
    {
      "speaker": "C",
      "text": "大事かなと思いますいや",
      "start": 2236858,
      "end": 2238685,
      "timestamp": "37:16"
    },
    {
      "speaker": "A",
      "text": "素晴らしい僕と友達になれそうなぐらい一緒だ多分セナさんには刺さらないんだろうなって思いながら聞いてたけど",
      "start": 2238685,
      "end": 2244887,
      "timestamp": "37:18"
    },
    {
      "speaker": "C",
      "text": "俺はほら知っちゃってるからさそのしょうこさんがささっきのひでとしきあのほらひでとしきって言ったらわかんないかあのカナダのカナダの会社に入ってアプライしてみてダメだったとしてももう一回ねあの直してから送るとかそうあれをちょっとフログの中だとひでとしき言ってるんですけどとかもそうだし、あとはまあね、あの就活転職するぞっていう時に、俺とか連絡してくれたりとか、まあ経済ね、ちょっとつなぎさせてもらったりとかで、なんか環境もちゃんと利用してるから、割と、あの、そうそう、なんだろう、あの確かになんか無鉄砲というか、あの、考えなしなところもあるのかもしれないけどもしかしたら、まあとはいえでもね、あの、いまいる環境をフル活用するみたいなマインドは、俺はもうめちゃくちゃ安心して見ていたので、ちゃんと僕にも刺さっておりますのでご安心いただけれ",
      "start": 2244887,
      "end": 2290230,
      "timestamp": "37:24"
    },
    {
      "speaker": "A",
      "text": "ばと。確かにそれで言って僕とは違う僕全然環境を活用できないタイプだ",
      "start": 2290230,
      "end": 2294654,
      "timestamp": "38:10"
    },
    {
      "speaker": "C",
      "text": "でもあれなどの時はねまだ環境なかったっていうのは確かにその通りちゃん",
      "start": 2294654,
      "end": 2298077,
      "timestamp": "38:14"
    },
    {
      "speaker": "A",
      "text": "その通りだからねまあ時って言っても3ヶ月しか違わないんで何とも",
      "start": 2298077,
      "end": 2303082,
      "timestamp": "38:18"
    },
    {
      "speaker": "C",
      "text": "言えないところですがまあまあまあまあそれもそれでっていうこと",
      "start": 2303082,
      "end": 2306245,
      "timestamp": "38:23"
    },
    {
      "speaker": "A",
      "text": "ではいそんなところですかねそうですねはいありがとうござい",
      "start": 2306245,
      "end": 2311130,
      "timestamp": "38:26"
    },
    {
      "speaker": "C",
      "text": "ましたはいありがとうございました",
      "start": 2311130,
      "end": 2312071,
      "timestamp": "38:31"
    },
    {
      "speaker": "A",
      "text": "ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうござい",
      "start": 2313597,
      "end": 2331483,
      "timestamp": "38:33"
    }
  ],
  "highlight1": "しょうこさんがカナダの大手企業ライトスピードに入社するまでの就職活動について話しています、詳しくはPodcastで話しています",
  "highlight2": "カナダで就職活動をする際に重要な点は何か、しょうこさんが2社目で感じたことと3社目で感じたことの違いについて知りたいですか、Podcastで話しています",
  "highlight3": "しょうこさんがカナダで働く理由として語っているのは、やはり「ライフワークバランス」ですが、それだけではありません、詳細はPodcastで話しています"
}