{
  "episodeGuid": "a89f22fe-617e-4206-a533-961b662719d8",
  "episodeTitle": "営業からカナダでエンジニアへ！スタババイトで英語力を爆上げし、逆境を乗り越えた就活戦略（前半）#31",
  "transcribedAt": "2026-01-26T01:07:48.227Z",
  "duration": 2459,
  "fullText": "OKですかね。OKですかね。そしたら今回は、今もともとカナダにいて、1年前ぐらいかなに帰国されたYutoさんにインタビューしていくんですけど、今回ちょっと簡単なお知らせで、今回からホストとして、前にインタビューを取ったヒロシ君にも参加してもらうことにしました。簡単になぜかっていうと、日本側の人をもっとフォーカスしていきたいとか、もともと海外にいて日本で今活躍されている人たちも撮っていきたいっていう中で結構今までのメンバーだけだとちょっと日本側を撮るのが時差的にも厳しいしちょっとヨーロッパの方でも撮ってあげてもいいよみたいな人をが何人かいるんですけどそういう人たちのもうちょっとやっぱり時差の関係で厳しくってでちょっとまあ広志くんに日本側だったりまあ取れればヨーロッパ側もこれから取るのにちょっとお手伝いいただこうかなっていう感じで感じですはいそしたらえっと通常のインタビューに戻りたいと思うんですけどまずはじめに経歴を簡単に教えていただいてもいいです。かはいえっとYutoと言います今は株式会社アップサイダーという会社でフルスタックエンジニアとして働いていますその前はバンクーバーに2021年から2024年の間約3年間住んでいました向こうで現地の専門学校に1年間通った後1年間就活して現地企業に就職したという流れですねその後はレイオフにあってそのまま日本に本国したという形です。ありがとうございますそうですね僕はYutoさんのノートも読ましていただきましてですねこの今聞いている方々にもぜひ読んでいただきたいなと思うんですけれどもYutoさんかなりですね苦悩を乗り越えられたというかみんなそうだと思うんですけれども順調な人ってなかなかいないかなと思うんですがYutoさんなかなか熱量のあるノートなんで皆さんぜひ買ってみてくださいあと、。あれですよね。Yutoくんの時代って、ちょうど僕たちみんなフロックっていうコミュニティにカナダで入ってるじゃないですか。そのカナダとか、そのあたりでちょうどATSの対策したほうがいいよねっていう出る前あたりに就活をしてて、結構苦しんでた人たちの最後のほうですよね。何かっていうイメージがあるんですけど多分ちょうどそのトランジション期間だと思ってて僕が就活を始める2021年とか2020年って結構マスアプライといってもきたすら応募しまくるっていうのがあったと思うんですけどもうそれはATSで全然無理ってなってちゃんとカスタマイズしないとそもそもそこを人間が見てくれないっていう風になってそれは知ってる人知らない人でも結果に運転の差があったと思ってて僕は初めは知らなくて後から知った側なんで何これって。すごいなりましたねなんかその今ではね結構K君だったり僕たちも発信したりそのATSについて発信してる人だったりとか結構情報が結構日本語でもあるかなみたいな状況でカナダでは割とこっちでレジュメ書くならまずアプリケーショントラッキングシステムATSに対策をしようっていうのはなんか割とスタンダードになってきたかなって思いつつなんかそのやっぱ最後の苦しんだ組なのかなみたいなそこら辺情報がなくてみたいなって。いうイメージでしたねですねまあそれプラスあのリセッションがちょうど来たので僕が就活を始める瞬間にあのコロナの中ですごく雇ったけどいらなくなった人を大量零布してその結果人が溢れてで企業もハイアリングフリーズしてっていうもういろんな波がよあのどんな身に揉まれてましたやっぱこれ。そういう話を聞いているとやっぱどうしても何ですかね実力だけじゃないというか運とか自由がまあどれぐらいその結果を左右するかっていうのがまあやっぱちょっと痛感させられ。ますよねですね。はい、じゃあYutoさん、はじめは日本で結構トラディショナルな会社で働かれていたと、ノートを見る限りそこでちょっと危機感を覚えてというような話があったかと思うんですが、日本で働かれていてですね、カナダへの渡航を心出したきっかけと言いますか、そのあたりちょっと伺ってもいいですか。日本では営業職としてトラディショナルな会社で働いてました全然パッションはなくて土日を楽しむか長期休暇中の海外旅行をいかに楽しむかみたいなことにしか情熱はなくてこのまま40年間過ごすのかと思いつつでも2020年にコロナが大流行してこの先どうなるかわからない状態になってその辺りから会社を辞めて自分の手に職をつけて働こうかなと思い始めましたもともと海外で働きたいという思いは大学時代からずっとあってその前の会社日本の会社に入ったのも海外駐在の機会が多いからというのがあってそうですねなので海外で働きたいという軸はそこにあってカナダになったのはいろいろ当時の時勢もあると思うんですけどそもそもカナダしか国境が開いてなかったのかもありますし偶然僕の大学の友人がカナダにワーホに行ってたのでワンクーバー面白そうみたいなのも思っ。てましたねありがとうございます。特に海外駐在はどういう国に行く予定だった?もしくは行かれたんですか?もし可能性があるならアメリカはありましたね結構なんかその担当しているクライアント次第ではあるんですけどそのお客さんが海外にブランチを持っていればうちもランチはあるしみたいなちなみに中国もヨーロッパもあればって感じですね。街とかは結構長いんですか?街とかは結構長いんですか?海外駐在行きたいっていう人ってめちゃくちゃいるじゃないですか?その中で行ける人とか行くにしても準備期間があるとかいつ来るかとかがわからないみたいなのがあるあるなのかなみたいな外から分かれると思っ。てるんですけどまさにおっしゃる通りでまず前提としてまず日本で仕事できない人が海外留学行けないよねっていうのはベースにあってかつトラジショナルな会社なんで年交受率もありますし早くても5年から7年ぐらいかな当時は7年ぐらい働いたらじゃあそろそろ海外行ってみようかみたいな流れはあって7年はちょっと長いぞっていうのは正直思っていて。長いですね。長いですね。なんかその日本のその何かをなさなきゃとか何かができなきゃチャレンジできないみたいなのちょっとなんだろう特にその新卒から出てっていうその20代前半のなんかチャレンジしたいぞって思ってる若者にとっては結構つらいですよねなんか7年待つのか10年待たないといけないのかとかなんかそれまでなんか決めることも何も決めることもできないしなんかその下積みみたいなのが絶対あるみたいなのってすごいなんかこの先真っ暗感があるからなんか確かに。そうなんですよねで歯がゆいですしで仮に7年10年必死にあったとしてもいける保証っていうのはないのでいくら希望を出して言うか日本。のトラディショナルな企業だと結構でもスタンダードですよねなんか周りの反対とかなかったですかトラディショナルな会社だとあのそこで言うとしっかりやっていくんだぞみたいなまあ家族とかも含めてですけど。わりと家族から反対はなくて結構なんか僕が若い時から結構僕の意見をリスペクトしてくれてるのでお前がやりたいならそれでやれみたいなでももちろん大人になってたんで責任は取らんしなんていうの一気に実家に帰ってきても面倒見えへんぞみたいなこと言われててもちろん僕もそのつもりだったんでそれはよかったんですけど友人からは結構驚かれましたねまさか辞めるとはみたいな結構なんか僕の印象は堅実だったらしい。んでなるほど確かにそうですよねじゃあそこから会社にまあ辞めると言ってカナダへの渡航準備みたいなのは。どんな感じでしたか渡航準備まずそのカナダの学校CICCCっていう専門学校出たんですけどそこに申し込んだのが2020年の夏7月とかでしかねその1年後ぐらいに投稿するっていうスケジュールだったのでその間はずっと準備をしてました準備っていうのは英語の勉強したりとかちょっとプログラミングの勉強したりとかをしてましたねなんか。あのリンクでいい見せてもらってるんですけどリンクで見ると日本でもえっとエンジニオすでにやられたそれともこれはあのカナダからのリモートでみたいな感じですかあれ。ですカナダからリモートですねなんでカナダに行ったときはもうエンジニア経験全くなしを完全に経験はい風の経験できました。ユウトさんといえばカナダに渡航されてからスタバのバイトを結構されていたとケイさんもスタバじゃなかったと思うんですけどカフェで英語力爆上げしたぜなんでユウトさんも渡航時点ではそんなに英語はお得意じゃなかったと伺っているんですがそもそもスタバのバイトの面接に受かったのも結構すごいなとスタバって結構カスタマイズとかがいろいろ喋らなきゃいけないんでそこのガッツとかが買われたのかなみたいなことを思ってたんですけどそこの辺を伺ってもいいですか。ちなみにその前にその渡航当時英語のレベルはどうだったんですかそのなんかスターバックスに入る以前。英語力は本当に典型的な日本人の義務教育の英語能力でというのもそのグラマーとかリーディングはある程度できるけどリスニングはいまいちスピーキングなんて論外っていう形でで学校入るためにトーイックを受けたんですけどトーイック当時僕790点ここ。でも全然いい方っちゃいい方ですよね日本の平均。に関すると日本の平均より高いぐらいで学校にはなんとか滑り込んでESLなしで入学できたっていう形です。ねそれで来てすぐスタバのバイトに応募するんですか?いや来てすぐではないですね来て4ヶ月後ぐらいから考えだして僕はKさんが出られてたポッドキャストを聞いてスタバでバイトして英語力爆上げしたっていうのを聞いてそういう道があるのかっていうのを思ってちょっとそれ面白そうだからやってみたかったしプラスバンクーバーって生活費すごく高いので収入がないとちょっと厳しいなっていうのも思ってそういった2つの理由で始めましたね。始めるまでの4ヶ月の間はそんなに英語の上達はなかったんですかそれとも結構遊びとかで上達はしてたかなみたいなイメージですか。上達はほとんどなかったと思いますねっていうのも学校の本科が始まってもクラスの3040くらい日本人特にネイティブと関わる機会もなかったので同じフレーズをずっと使ってるとかそもそもこれが正しいフレーズなのかどうかも分からないまま使ってるみたいなのが多くて特に伸びはなかったと思います。ぶっちゃけそれでスタバ行けるんですか?結構怖い今でも今スタバで働けって言われても。ちょっと怖いけどまぁ日本で働け。って言われてもちょっと怖いですよ確かに日本でも。怖い確かに今思うと面接よく通ったなーってすごく思うんですよねだから特に英語が流暢だったわけでもなくただ単になんかパッションで押し切った感はあってで最終的に2つの店舗からオファーをもらってたんですよねで、通わせる方を選んだっていうそうです、スタバです、はいそうなんです、。それはすごいですねなんかゆうとさんも怖くなかったですか?スタバの面接まず受けようとカナダに渡航してカフェバイトをやるっていう人は志す人は多いと思うんですけどだからそこのファーストステップは怖そうなのかなって思ってたんですけどそうです、。怖かったですねそもそも英語で面接をするっていうのが初めてだったのでまずそこで緊張しますしそもそもなんかこの歳になってカフェの面接するとはっていうのもあってだからどんな質問が来るかっていうのもそのあんまりわかってなかったですしなのですごく緊張してたのを覚えてます。あとこれ僕だけなのかもしれないですけど僕はあの出身が新潟であの当時スタバは新潟になかったんですよ多分あったかなわかんないけどで僕東京に出てきて初めてスタバに行って最初の3回ぐらい行って注文できずに帰るっていうのをやってスタバがそもそも怖くないですか?スタバの雰囲気が相談する方もいろんなこと聞かれて怖いし何だろう?そうですね日本のスタバはあまり分からないんですけどカナダのスタバってそのラリーも当たり前にあってカスタマイズなんて3つ4つを平均で来るしこっちもこっちで色々聞くしみたいな感じであれちゃんと覚えられるの?何だろう?全然自分が働いているイメージがつかなすぎて道すぎ。て聞きたかったのは英語力が課題がある中で苦しまれたと思うんですけどスタバのバイトってたくさん痛い思いをしながら上達していったみたいな感じですか。ねそうですね本当に苦しい環境に自分を入れてでも恥もかきながら苦しい思いをしながらあの、必死にやってましたね。やっぱ、英語の勉強はいくらその苦しい思いをできるかみたいなところありますよね。いや、。ありますね。それがすべてと言っても。いや、ほんとに。やっぱレベルアップできるときって、その苦しい経験して、そっからなんだろう、ちくしょうって思ってやれるかみたいなのが結構あるのかなって思う。いや、ほんとそうですよね。ほんとにね。うん。1年と10ヶ月働いてるのかな?なんかどのぐらいで、あ、慣れてきたなみたいな、なんか、まあ、もういけるかなみたいになるんですか?たぶん結構、その、英語しゃべれなくて、これからたぶん、ゆうとくんみたいなパス、あの、いきたいみたいな人結構多いと思うんですけど、どのぐらいしたら、その、あ、まあもう余裕だぜみたいなとかに余裕だぜとはならないかもしれないけどいけるなってなるんですか?だいたい3ヶ月ぐらいですかねその英語に関して言うと僕はあのだいたい週15から20時間その学生として働けるマックスギリギリまで働いててそれで3ヶ月したらだいたい耳が慣れてきてで、多少しゃべれるようになってきてっていうのがあります。ね週に何回ですか?3回とか4回?週3から4ですね。3ヶ月かごめんなさい痛いでも3ヶ月痛い思いで済んでバリスタでちょっと自信持って働けるならアリなんじゃないかしかもなんか結構そのスモールトークの究極みたいなところあるじゃないですかカフェの店員がスモールトークはもう完璧にいけるぜみたいな状態なわけですよねちょっとアリな気が。してきたなお金もらってやるブートキャンプみたいな感じ。ですね確かに確かにほんとその感覚でもお金もらいながらこっちは英語勉強してるんやぐらいのマインドセットでしたね。バイトじゃあ週に20時間マックスまでやりながらってなると学校の勉強との両立も結構難しいというかなかなか時間のやりくりは大変だったのかなと思うんですけれども学校もプログラミングは未経験からのスタートだったということですがその辺の両立とかはどうでした。かすごく苦労しましたスケジュールでほぼなんか英語の勉強壁で働く学校行ってるか都市間で自習してるかの生活をもう1年1年以上続けたのかのがあってでそのスタバは午前中にやってましたで学校には午後から行きで学校終わったら自習するみたいなスケジュールをずっとやってましたねなんで結構なんて言うんでしょう休みなくひたすら取り組んでました。学校のカリキュラムの内容としてはどうでした?CICCCは全くの初心者からでもキャッチアップできるようなカリキュラム構成にはなってるんですかね?そうですねちゃんと勉強してれば初心者でも全然できるカリキュラムでした今は分かんないですけどウェブコースとモバイルコースとあってモバイルコースは結構経験者が行くコースでウェブコースは割と初心者が多いコースだって僕はウェブのコースに行ってたので周りもほぼ全員未経験経験者1人しかいなかったんじゃないかな20何人いてもちろん授業だけだと厳しい部分はあったんですけど自分で復習とか予習とかしてれば特に問題なく進んでいけるカリキュラムでした。ねちなみに予習復習だけで就職できるレベルにはたどり着くんですかそれとも結構自分でプラスアルファこういう例えばソフトエンジニアで言ったらフレームワーク勉強しないといけないとかプラスアルファはわかんないけどリートコードやらないといけないみたいな学校の延長上に仕事をもらえるよみたいなのはある?学校の延長上ではないと思っててもそのプラスアルファをどれだけ大きくできるかが全ての借りだと思ってて結局その学校が僕らのクラスの中から就職できた人って運もあると思うんですけどプラスアルファをすごくやってた人本当にカリキュラムで言ったら3つ4つ先のことをやってるとかそれ以外のリードコードなりアルゴリズムなり別のことを自分の時間さえですごくやってる人とかが出てたイメージなのでその予習復習やって学校行ってれば就職できるぜみたいなことでは全くなかったですね。なんか僕もこれまでやっぱ結構インタビューしてくる中で、どれだけ学校の勉強をしないかが鍵みたいなのを結構僕の中でそうなんだろうなって思ってるんですけど、ゆうとくんの場合はどうでした?結構やっぱ復習、予習、復習はしました?それとも結構サボれるところはサボって、インタビューのためというか会社に入るための勉強に専念。する感じでした?抜けるところは抜いてたと思いますね既にやっててある程度分かってるからここはいいから次のことするってパターンもあれば逆にリアクトとかノードJSやった時は僕としてもそこまで経験なかったのである程度しっかり聞いてた時はありますなので半分半分ですかね事業に取り組む取り組まないの割合は。キャリアじゃないわカリキュラムは1年間ぐらいですよねでそこから収穫を始めるとなるとでLinkedIのプロフィール整備とかGitHubを整備したりとかはもう必要かなと思うんですけれどもそれは在学中に進められてた感じですか?そうですねちょうど1年CRCCCは1年間通って1年間の公募期間があって計2年のカリキュラムで僕は在学期間の1年間のうち多分9ヶ月ぐらいかな9ヶ月経った時からそういう整備を始めましたプロジェクトみたい。なの増えてきますもんね割とフリーな時間も結構増えてくるのかなとちなみに座学の期間に自分でも勉強してるっていうことだったんですけどどういうマテリアルというかどういう教材を使って勉強され。たんですか?マテリアルはほぼUDEMYでしたねUDEMYでリアクトのコース買ってひたすらやるとかそれがたまにYouTbe見てるぐらいでしたね。それはやっぱり英語のクラス取ったんですか?それとも何だろう?結構分かれるのかなと思って、技術の勉強は日本語でやって、英語は英語でやるっていう人と、もう全部、私の頭の中はカナダにいる間は全部英語だみたいな感じで、英語で全部やるっていうタイプがいると思うんですけど、どちらでやってました?ちなみに。それで言うと僕は校舎の人でもう教材もほぼ全部英語でやってて本当に分からなかったらたまに日本語の記事を見るぐらいだってっていうのもそもそも僕エンジニアの経験なしで来てるのでそのエンジニアとしての知識のインパクトが全部基本の英語ベースになってて日本語で勉強しだすと逆に混乱するっていうのがあってそうならもう一旦英語に統一者がその脳の負荷も減るなぁと思って今は英語ですねほとんど。英語環境から僕もその日本語環境に移って苦労したみたいな気持ちはちょっと分かってですねクワネテスってあるじゃないですかあれって英語だとクブネディスって言いますけど日本語だとなんて発音するんだろう。みたいなありますよね僕今一瞬分かんなかったです本当ですか一瞬何の話してるのか分からなくてけど理解できたけど途中で確かに。日本って、二次情報がすごい上手、二次情報の本とか教材がすごい出すのが上手いのかなと思ってて、僕結構二次情報のものを日本語で読んだりとか、その一時情報って、一時情報だから絶対正しいんだけど、例えば何だろう、ドキュメンテーション、リアクターのドキュメンテーションとかみたいな絶対正しいものなんだけど、ほぼほぼ。難しかったりとか情報の羅列がしてある正しくするために情報の羅列がしてあるから噛み砕かれてないとかちょっと業界未経験だったりとかそこのエリアについて詳しくない人にとっては辞書っぽくてちょっと読みにくいみたいなのあるじゃないですかだからそういう時ってすごい日本の教材って二次情報を噛み砕いて人に教えるみたいな能力の高い人たちは多いのかなって思っててそういうの結構僕は日本語で読む派なんだけど確かにそれを読んで理解してもそれを英語では喋れないっていう事象は割と起きるそれわかるぞでも何て言えばいいかわかんないみたいなのがエンジニアとのこっちの会話で結構あるから確かに頭の中混乱してっていうのは確かにそういうタイプの人にはあるかもしれないですね。でじゃあまあちょっと就活の話に戻るんですけれども冒頭でもあった通りユウトさんはかなり谷の世代というか就活の波がかなり厳しかった時代に就活をされたと聞いたところによると丸1年ぐらいはまあ就活に使われたと聞いてますがまあ初めはどんなところから始めましたか就活のユウト。初めはまあでもレジュメを作ってひたすらアプライすることから始めましたねとりあえず応募してみないと何もわからないっていう考えがあったので応募してみてどれぐらい反応くるかなみたいなここから始めてあれ全然こう変ってなってあらあらってなってあれですねよくよく調べてみるとどうやら今はリセッションらしいとわかったとこですね。1個目のインタビューに行くまでがやっぱかなりその一番ハードルが高いってまあよく言われることですけど前レジュメ送信を母数とした場合、打率みたいなところ何社応募して何社面接したかみたいな大体の感覚ってありますか?正確な数までは把握してないんですけど応募者数は多分200や300ぐらいは250くらいですかね、いってると思っててで、その中で面接したのは多分1、2、3、4、4社かな?なので、もう1割、1割以下が1の、。はいそうですねすごいな、。それは確かにその中から一つオファーをいただいてという感じですよねはい中学期間中にボランティアとかその辺のことは何かやられたりしましたか?その1年間の間にはそうですねボランティアはしてました現地のそれこそこの学校の先生が立ち上げたスタートアップのボランティアでしたねボランティアの。経験は結構一応就労経験としてカウントできるっちゃできるんですかね生きた感じはしますか?就職活動に行きたかどうかはわからないですけどレジュメにそのカナダの会社でエンジニアとしてボランティアも何も働きましたって受け入れてかけるのは結構手がかったですねその気持ち的にも確か。になんかボランティアの中でも何かいくつかレベルがあってまあ多分全部のところであのクリアしているのはそのレジュメにかける一つ目で多分その次は何かあのレファラルくれるというかあのその会社からちょっとフェーズが進んできたときに私をレファラルとして使っていいですよみたいなのを言ってくれるともうちょっとよくてでもボランティアだけどちょっとお金払ってくれるみたいなところもいいところだとありますよねでもよくあるのはやっぱりレジュメにかけるっていうのが一番たぶん現地にいてエンジニアとしてやる能力があるよみたいなのを言えるっていうのがめちゃくちゃでかいですよなんかその間結構日本のそのさっき言ってたリモートの仕事もしたと思うんですけどそれはどういうふうに見つけられた。んですかこれはあのウォンテッドリっていうプラットフォームが日本にあるんですけどそこで見つけ。ましたそれは結構なんだろう日本はよく売り手市場?どっち?買い手市場?売り手市場買い手市あのですね応募者が多い方が売り手。市場あそこなんじゃ書いて市場がそう書いて市場だからえっと結構その簡単に仕事見つかるみたいな風に言われているのかなと思うんですけど結構簡単に見つかりましたそれとも結構それ。も苦労しました意外とすぐ見つかってそのちょっと中活開始の始ま話に戻るとまあカナダで応募してみるが全然手応えがなくリセッションがあるのでまぁ結構厳しいなのでまぁ一旦そのエンジニア未経験っていうラベリングを剥がすっていう作戦に入りましてそれなら一体日本の企業でもいいかってなってで、Wantedリードを始めても1週間で決まりましたねおーすげーちょっとびっくりしました確か。にあとはその時期あれですよね日本はその快適市場やべまた忘れちゃった快適市場プラスリモートで働きリモートでの働き方がどんどん馴染んでったというかがあるからそのオフィス出社がないから海外でもいいんじゃね?海外の人でもいいんじゃね?みたいなのが結構あった時期なのかなって思うんで確かにそういうコンテキストでは割と簡単に見つけられたっていうのは確かになっていうのはあります。よね日本での案件はどれぐらい続けられたんですか?えっとその後でほぼ1年間ぐらいやってましたねその会社は途中で1回変わってるんですけどもう丸々1年投資でやってました。それができるとやっぱまあ生活費のこととかもちょっとやっぱ足しちょっとというかあの安心感にもつながりますよ。ねそうですねでもまあプラススタバも笑い続けてたんですよ当時はめちゃめちゃ忙しいですよそれでプラス現地でボランティアしながら就活もしてもうあの1年はもうギノと戻りたくないです。もんちなみにスタバは辞めれたのかなお金をちょっと日本のエンジニアの職の方が給料多分高いですよ。ねちょっとは意外と僕の一つ目のその会社はそうでもなくてジュニアで一番最初はアルバイトみたいな扱いだったんで時給で言ったらスタバより低かったですね。でも英語っていう面で見ると全然辞めてもよかったかなみたいな感じです。か結構迷ってスタバ辞めるか辞めないかでも辞めたら結構英語落ちるなーっていう気がしたのでしたもやめずにシフトの数を半分ぐらいにしてもらいまし。たね確かにスモールトークがしなければしないほどどんどん出たく出てこなくなるイメージあるから確かにその落ちるっていうのは確かにそうかもしれないですねです。ねマットはなんだかんだストレスすごく溜まってたので就活だったりそのエンジンの見慣れないエンジニアの仕事だったりで、そのスタバで働いているその4時間ぐらいが唯一全てから忘れられる時間でもあったので意外といいストレスリリーフでもあったんですよ。ね確かに日本の案件はじゃあこれからまた就活に専念するぞという感じで辞められたとかそういう感じ。ですか日本の案件一つ目のやつは僕から辞めたんじゃなくて向こうから契約終了を言われてそうなんだ向こうも向こうで結構大量に人を雇ってしまったみたいで見直しの時に一気に割と経験が浅いメンバーが切られたって感じですね僕のカナダのCACCCのクラスメイトも何人か働いてたんですけどそのうちの未経験で入った組の人らもみんな切られていたのででそれがあってカナダの就活また再開するかってなりました。でまあ就活再開してでまあようやくオファーをゲットしたということになるかと思うんですけれどもそこの初めの会社はあのどんなところを評価されてオファーに至ったみたいなフィードバックあり。ましたかフィードバックはそうですねまあコミュニケーション問題なく取れていたのとまああとは誠実さ誠実性を評価したってマネージャーから言ってもらいまし。たインタビューはどんな流れだったんですか?インタビューは全部で4回?4回プラスアサイメントがあってまずHRとのフォンスクリーニングから入って15分ぐらい簡単に話して次はチームのマネージャーと話しますそのチームのマネージャーと話した後にアサイメントを受け取ってそれを元に次にテックインタビューをします最後がそのさらに上のマネージャーとデザイナーとのインタビューでオファーという形ですねアサイメントはどういう。形のアサイメントが出たんですか?簡単なウェブページを作るっていうものでフィグマのデザインが渡されてそれを元に作ってきてっていうアサイメント。でしたリアクトか何かですか?ネクスト、リアクトとタイプスクリプトとちなみ。にどんな感じのページなんですか、。それは本当にその会社が旅行会社だったので実際にあるその会社のそのページ、ページの一部分ですかねちゃんとレスポンシブで作ってきてっていう内容でしたねその。後のインタビューはそのアサインメントをベースってことだったと思うんですけどどんなことを聞か。れたんですかまあそのテックスタックで言うとネクストのバージョンで言ったらなんでこのバージョン使ったの?っていう話もあればあとはウェブ制作に近かったのでパフォーマンスについてGogleのCoreWbVitalsの指標がいろいろあると思うんですけどこれについてどう対策したとかそういう内容でしたね結構難しいですね意外とそうです奥深かったですねでその次。のインタビューはえっと全然アサインメントと関係ないテックインタビューみたいな感じ。ですかテックというよりはまあビヘイビアルに近い内容だったんですよねっていうのもその僕の応募者チームがマーケティングチームの中にあるエンジニア軍団みたいなポジションだったんでちょっとの一番上の上司はマーケティングのマネージャーとまたデザイン化のマネージャーがいてね彼らとその簡単なインタビューをしたって。いう形ですね内容的にはどんなことを聞かれるんですか?デザイナーとどういうふうにコミュニケーションを取るだとかあとは本当にビヘビアルに近かったのでコンフリクトがあったらどうするとかそういうものですね。コンフリクトっていうのはその人間的な意味でのってこと。ですよね人間的なコンフリクトですねGitHubではないです。まあでもよくありますよねなんかマネージャーとの意見がコンフリクトしたときどういうふうに解決したかみたいな結構どこでもよく聞かれる。のかなやっぱりエンジニアでもそういう気持ちのいいというか感じのいいコミュニケーションっていうのはやっぱり重視されるんですねやっぱりどこでも。そうですね、うちのカナダの会社は結構それ人間性とか人の良さを評価する会社だったのでいくら言ってしまえばブリリアンドジャークは入れない会社でもありますしいくらすごくてもちょっとなんかパーソナリティに難があると多分難しいのかなとかとはコミュニケーションちゃんと伝えられないと議論ができないとか落ちるのかなと思いましたね。ゆうどさんの営業の経験がそこで生きている可能性はかなり。ありますねあると思いますねなんだかんだその営業する前と結構人としゃべるの苦手だったので営業職でそれがなんとなくできるようになってでスタバのバイトでそれが英語でできるようになってみたいなちょっと段階本できたなぁと思います1年の。1年の就活の後オファーゲットしてかなり嬉しかったと思うんですけれども仕事始まってからの様子はどうでした?仕事内容とか会社のカルチャー。とか仕事内容は本当にアサイメントで想像してたようなことをやってパフォーマンス改善とかあとABテストやったりとかそういうのをデザイナーとかマーケッターとかあとはアナリシスチームと一緒にやったりとかやってましたね会社のカルチャーも面接通してどういう人がいるのかっていうのは分かっていたのでその通りのすごく優しい素晴らしい人たちがいまし。たね海外企業でよく聞くのが残業は全然ないのか本当はどうなのかみたいなところがねやっぱ気になる人も多いと思うんですけれどもゆうとさんのその一社名のワーキングカルチャーみたいなところはどうでし。たか残業はゼロでしたねたまに結構遅くやってた組で5時半ぐらいまで働いてると人事の人からお願いだから帰ってくれって言われるぐらいだったんであとは働き方はハイブリッドだったんですけどみんな基本的に金曜日はオフィスに来ないみたいな感じで金曜日そもそも働いてるかどうかも分からないですしって感じかなり緩かったですね。ハイブリッドで出社の回数も特に指定はなかった感じですか一応週。3っていう風になっていて僕は週3行ってたんですけど多分人によっては週2で週2とか週1とかの人もいた気がします。1年間就活をして予約入った会社ではあると思うんですが伺っている通りそこでちょっとレイオフがあったんですよねそこの伝えられ方と言いますかどんな伝えられ方。でしたかあれは朝のちょうど出社してて朝のミーティング前だったんですけど急に会議室に呼ばれて僕の上司の上司からマーケティング部の上司マネージャー官に会議室に呼ばれて会議室に行くとその人とHRのマネージャーが座っててやけに表情が真剣だったんですよねこれは何かあると思ったらそこでレイオフを言われてそこからもうだいたい20分くらいですかね話をしたの今頃流れとか早い短いですめっちゃ短いです僕の机にあった荷物を全部会議室に持ってきてでその場でラップトップ返却してでそのままもうチームの誰とも会わずにそのまま帰りまし。たチームとは席離れてる。んですかちなみにチームと席が一緒だったんですけどその時僕のマネージャーがちょうどあの違う帰りかなんかでいなかったんですよねでももう一人のメンバーはまだ出社してなくてそれで僕がいつものいつもその僕らのチームのミーティングがある会議室の前で待ってたら呼び出されてそのまま礼を振った感じ。ですねこれは精神的に。ちょっときますね反応の時はだいぶきましたもうどん底でしたね。ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "A",
      "text": "OKですかね。OKですかね。そしたら今回は、今もともとカナダにいて、1年前ぐらいかなに帰国されたYutoさんにインタビューしていくんですけど、今回ちょっと簡単なお知らせで、今回からホストとして、前にインタビューを取ったヒロシ君にも参加してもらうことにしました。簡単になぜかっていうと、日本側の人をもっとフォーカスしていきたいとか、もともと海外にいて日本で今活躍されている人たちも撮っていきたいっていう中で結構今までのメンバーだけだとちょっと日本側を撮るのが時差的にも厳しいしちょっとヨーロッパの方でも撮ってあげてもいいよみたいな人をが何人かいるんですけどそういう人たちのもうちょっとやっぱり時差の関係で厳しくってでちょっとまあ広志くんに日本側だったりまあ取れればヨーロッパ側もこれから取るのにちょっとお手伝いいただこうかなっていう感じで感じですはいそしたらえっと通常のインタビューに戻りたいと思うんですけどまずはじめに経歴を簡単に教えていただいてもいいです。",
      "start": 0,
      "end": 64641,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "かはいえっとYutoと言います今は株式会社アップサイダーという会社でフルスタックエンジニアとして働いていますその前はバンクーバーに2021年から2024年の間約3年間住んでいました向こうで現地の専門学校に1年間通った後1年間就活して現地企業に就職したという流れですねその後はレイオフにあってそのまま日本に本国したという形です。",
      "start": 64641,
      "end": 95031,
      "timestamp": "01:04"
    },
    {
      "speaker": "C",
      "text": "ありがとうございますそうですね僕はYutoさんのノートも読ましていただきましてですねこの今聞いている方々にもぜひ読んでいただきたいなと思うんですけれどもYutoさんかなりですね苦悩を乗り越えられたというかみんなそうだと思うんですけれども順調な人ってなかなかいないかなと思うんですがYutoさんなかなか熱量のあるノートなんで皆さんぜひ買ってみてくださいあと、。",
      "start": 97963,
      "end": 121920,
      "timestamp": "01:37"
    },
    {
      "speaker": "A",
      "text": "あれですよね。Yutoくんの時代って、ちょうど僕たちみんなフロックっていうコミュニティにカナダで入ってるじゃないですか。そのカナダとか、そのあたりでちょうどATSの対策したほうがいいよねっていう出る前あたりに就活をしてて、結構苦しんでた人たちの最後のほうですよね。",
      "start": 121920,
      "end": 146132,
      "timestamp": "02:01"
    },
    {
      "speaker": "B",
      "text": "何かっていうイメージがあるんですけど多分ちょうどそのトランジション期間だと思ってて僕が就活を始める2021年とか2020年って結構マスアプライといってもきたすら応募しまくるっていうのがあったと思うんですけどもうそれはATSで全然無理ってなってちゃんとカスタマイズしないとそもそもそこを人間が見てくれないっていう風になってそれは知ってる人知らない人でも結果に運転の差があったと思ってて僕は初めは知らなくて後から知った側なんで何これって。",
      "start": 146142,
      "end": 182270,
      "timestamp": "02:26"
    },
    {
      "speaker": "A",
      "text": "すごいなりましたねなんかその今ではね結構K君だったり僕たちも発信したりそのATSについて発信してる人だったりとか結構情報が結構日本語でもあるかなみたいな状況でカナダでは割とこっちでレジュメ書くならまずアプリケーショントラッキングシステムATSに対策をしようっていうのはなんか割とスタンダードになってきたかなって思いつつなんかそのやっぱ最後の苦しんだ組なのかなみたいなそこら辺情報がなくてみたいなって。",
      "start": 182270,
      "end": 211668,
      "timestamp": "03:02"
    },
    {
      "speaker": "B",
      "text": "いうイメージでしたねですねまあそれプラスあのリセッションがちょうど来たので僕が就活を始める瞬間にあのコロナの中ですごく雇ったけどいらなくなった人を大量零布してその結果人が溢れてで企業もハイアリングフリーズしてっていうもういろんな波がよあのどんな身に揉まれてましたやっぱこれ。",
      "start": 211668,
      "end": 239524,
      "timestamp": "03:31"
    },
    {
      "speaker": "C",
      "text": "そういう話を聞いているとやっぱどうしても何ですかね実力だけじゃないというか運とか自由がまあどれぐらいその結果を左右するかっていうのがまあやっぱちょっと痛感させられ。",
      "start": 239524,
      "end": 249048,
      "timestamp": "03:59"
    },
    {
      "speaker": "B",
      "text": "ますよねですね。",
      "start": 249048,
      "end": 252669,
      "timestamp": "04:09"
    },
    {
      "speaker": "C",
      "text": "はい、じゃあYutoさん、はじめは日本で結構トラディショナルな会社で働かれていたと、ノートを見る限りそこでちょっと危機感を覚えてというような話があったかと思うんですが、日本で働かれていてですね、カナダへの渡航を心出したきっかけと言いますか、そのあたりちょっと伺ってもいいですか。",
      "start": 255174,
      "end": 276327,
      "timestamp": "04:15"
    },
    {
      "speaker": "B",
      "text": "日本では営業職としてトラディショナルな会社で働いてました全然パッションはなくて土日を楽しむか長期休暇中の海外旅行をいかに楽しむかみたいなことにしか情熱はなくてこのまま40年間過ごすのかと思いつつでも2020年にコロナが大流行してこの先どうなるかわからない状態になってその辺りから会社を辞めて自分の手に職をつけて働こうかなと思い始めましたもともと海外で働きたいという思いは大学時代からずっとあってその前の会社日本の会社に入ったのも海外駐在の機会が多いからというのがあってそうですねなので海外で働きたいという軸はそこにあってカナダになったのはいろいろ当時の時勢もあると思うんですけどそもそもカナダしか国境が開いてなかったのかもありますし偶然僕の大学の友人がカナダにワーホに行ってたのでワンクーバー面白そうみたいなのも思っ。",
      "start": 279233,
      "end": 349937,
      "timestamp": "04:39"
    },
    {
      "speaker": "C",
      "text": "てましたねありがとうございます。",
      "start": 349937,
      "end": 352598,
      "timestamp": "05:49"
    },
    {
      "speaker": "A",
      "text": "特に海外駐在はどういう国に行く予定だった?もしくは行かれたんですか?",
      "start": 352598,
      "end": 358772,
      "timestamp": "05:52"
    },
    {
      "speaker": "B",
      "text": "もし可能性があるならアメリカはありましたね結構なんかその担当しているクライアント次第ではあるんですけどそのお客さんが海外にブランチを持っていればうちもランチはあるしみたいなちなみに中国もヨーロッパもあればって感じですね。",
      "start": 358782,
      "end": 374857,
      "timestamp": "05:58"
    },
    {
      "speaker": "A",
      "text": "街とかは結構長いんですか?街とかは結構長いんですか?海外駐在行きたいっていう人ってめちゃくちゃいるじゃないですか?その中で行ける人とか行くにしても準備期間があるとかいつ来るかとかがわからないみたいなのがあるあるなのかなみたいな外から分かれると思っ。",
      "start": 376841,
      "end": 395640,
      "timestamp": "06:16"
    },
    {
      "speaker": "B",
      "text": "てるんですけどまさにおっしゃる通りでまず前提としてまず日本で仕事できない人が海外留学行けないよねっていうのはベースにあってかつトラジショナルな会社なんで年交受率もありますし早くても5年から7年ぐらいかな当時は7年ぐらい働いたらじゃあそろそろ海外行ってみようかみたいな流れはあって7年はちょっと長いぞっていうのは正直思っていて。",
      "start": 395640,
      "end": 423244,
      "timestamp": "06:35"
    },
    {
      "speaker": "A",
      "text": "長いですね。長いですね。なんかその日本のその何かをなさなきゃとか何かができなきゃチャレンジできないみたいなのちょっとなんだろう特にその新卒から出てっていうその20代前半のなんかチャレンジしたいぞって思ってる若者にとっては結構つらいですよねなんか7年待つのか10年待たないといけないのかとかなんかそれまでなんか決めることも何も決めることもできないしなんかその下積みみたいなのが絶対あるみたいなのってすごいなんかこの先真っ暗感があるからなんか確かに。",
      "start": 425848,
      "end": 456384,
      "timestamp": "07:05"
    },
    {
      "speaker": "B",
      "text": "そうなんですよねで歯がゆいですしで仮に7年10年必死にあったとしてもいける保証っていうのはないのでいくら希望を出して言うか日本。",
      "start": 456384,
      "end": 467872,
      "timestamp": "07:36"
    },
    {
      "speaker": "C",
      "text": "のトラディショナルな企業だと結構でもスタンダードですよねなんか周りの反対とかなかったですかトラディショナルな会社だとあのそこで言うとしっかりやっていくんだぞみたいなまあ家族とかも含めてですけど。",
      "start": 467872,
      "end": 478620,
      "timestamp": "07:47"
    },
    {
      "speaker": "B",
      "text": "わりと家族から反対はなくて結構なんか僕が若い時から結構僕の意見をリスペクトしてくれてるのでお前がやりたいならそれでやれみたいなでももちろん大人になってたんで責任は取らんしなんていうの一気に実家に帰ってきても面倒見えへんぞみたいなこと言われててもちろん僕もそのつもりだったんでそれはよかったんですけど友人からは結構驚かれましたねまさか辞めるとはみたいな結構なんか僕の印象は堅実だったらしい。",
      "start": 480339,
      "end": 514424,
      "timestamp": "08:00"
    },
    {
      "speaker": "C",
      "text": "んでなるほど確かにそうですよねじゃあそこから会社にまあ辞めると言ってカナダへの渡航準備みたいなのは。",
      "start": 514424,
      "end": 527029,
      "timestamp": "08:34"
    },
    {
      "speaker": "B",
      "text": "どんな感じでしたか渡航準備まずそのカナダの学校CICCCっていう専門学校出たんですけどそこに申し込んだのが2020年の夏7月とかでしかねその1年後ぐらいに投稿するっていうスケジュールだったのでその間はずっと準備をしてました準備っていうのは英語の勉強したりとかちょっとプログラミングの勉強したりとかをしてましたねなんか。",
      "start": 527029,
      "end": 555539,
      "timestamp": "08:47"
    },
    {
      "speaker": "A",
      "text": "あのリンクでいい見せてもらってるんですけどリンクで見ると日本でもえっとエンジニオすでにやられたそれともこれはあのカナダからのリモートでみたいな感じですかあれ。",
      "start": 555539,
      "end": 565462,
      "timestamp": "09:15"
    },
    {
      "speaker": "B",
      "text": "ですカナダからリモートですねなんでカナダに行ったときはもうエンジニア経験全くなしを完全に経験はい風の経験できました。",
      "start": 565462,
      "end": 573565,
      "timestamp": "09:25"
    },
    {
      "speaker": "C",
      "text": "ユウトさんといえばカナダに渡航されてからスタバのバイトを結構されていたとケイさんもスタバじゃなかったと思うんですけどカフェで英語力爆上げしたぜなんでユウトさんも渡航時点ではそんなに英語はお得意じゃなかったと伺っているんですがそもそもスタバのバイトの面接に受かったのも結構すごいなとスタバって結構カスタマイズとかがいろいろ喋らなきゃいけないんでそこのガッツとかが買われたのかなみたいなことを思ってたんですけどそこの辺を伺ってもいいですか。",
      "start": 575960,
      "end": 612042,
      "timestamp": "09:35"
    },
    {
      "speaker": "A",
      "text": "ちなみにその前にその渡航当時英語のレベルはどうだったんですかそのなんかスターバックスに入る以前。",
      "start": 612042,
      "end": 619725,
      "timestamp": "10:12"
    },
    {
      "speaker": "B",
      "text": "英語力は本当に典型的な日本人の義務教育の英語能力でというのもそのグラマーとかリーディングはある程度できるけどリスニングはいまいちスピーキングなんて論外っていう形でで学校入るためにトーイックを受けたんですけどトーイック当時僕790点ここ。",
      "start": 623516,
      "end": 644700,
      "timestamp": "10:23"
    },
    {
      "speaker": "A",
      "text": "でも全然いい方っちゃいい方ですよね日本の平均。",
      "start": 644700,
      "end": 648662,
      "timestamp": "10:44"
    },
    {
      "speaker": "B",
      "text": "に関すると日本の平均より高いぐらいで学校にはなんとか滑り込んでESLなしで入学できたっていう形です。",
      "start": 648662,
      "end": 657226,
      "timestamp": "10:48"
    },
    {
      "speaker": "A",
      "text": "ねそれで来てすぐスタバのバイトに応募するんですか?",
      "start": 657226,
      "end": 668651,
      "timestamp": "10:57"
    },
    {
      "speaker": "B",
      "text": "いや来てすぐではないですね来て4ヶ月後ぐらいから考えだして僕はKさんが出られてたポッドキャストを聞いてスタバでバイトして英語力爆上げしたっていうのを聞いてそういう道があるのかっていうのを思ってちょっとそれ面白そうだからやってみたかったしプラスバンクーバーって生活費すごく高いので収入がないとちょっと厳しいなっていうのも思ってそういった2つの理由で始めましたね。",
      "start": 668651,
      "end": 699518,
      "timestamp": "11:08"
    },
    {
      "speaker": "A",
      "text": "始めるまでの4ヶ月の間はそんなに英語の上達はなかったんですかそれとも結構遊びとかで上達はしてたかなみたいなイメージですか。",
      "start": 702340,
      "end": 713363,
      "timestamp": "11:42"
    },
    {
      "speaker": "B",
      "text": "上達はほとんどなかったと思いますねっていうのも学校の本科が始まってもクラスの3040くらい日本人特にネイティブと関わる機会もなかったので同じフレーズをずっと使ってるとかそもそもこれが正しいフレーズなのかどうかも分からないまま使ってるみたいなのが多くて特に伸びはなかったと思います。",
      "start": 713363,
      "end": 741078,
      "timestamp": "11:53"
    },
    {
      "speaker": "A",
      "text": "ぶっちゃけそれでスタバ行けるんですか?結構怖い今でも今スタバで働けって言われても。",
      "start": 743584,
      "end": 749646,
      "timestamp": "12:23"
    },
    {
      "speaker": "C",
      "text": "ちょっと怖いけどまぁ日本で働け。",
      "start": 749646,
      "end": 752187,
      "timestamp": "12:29"
    },
    {
      "speaker": "A",
      "text": "って言われてもちょっと怖いですよ確かに日本でも。",
      "start": 752187,
      "end": 755768,
      "timestamp": "12:32"
    },
    {
      "speaker": "B",
      "text": "怖い確かに今思うと面接よく通ったなーってすごく思うんですよねだから特に英語が流暢だったわけでもなくただ単になんかパッションで押し切った感はあってで最終的に2つの店舗からオファーをもらってたんですよねで、通わせる方を選んだっていうそうです、スタバです、はいそうなんです、。",
      "start": 755768,
      "end": 779751,
      "timestamp": "12:35"
    },
    {
      "speaker": "C",
      "text": "それはすごいですねなんかゆうとさんも怖くなかったですか?スタバの面接まず受けようとカナダに渡航してカフェバイトをやるっていう人は志す人は多いと思うんですけどだからそこのファーストステップは怖そうなのかなって思ってたんですけどそうです、。",
      "start": 779751,
      "end": 797894,
      "timestamp": "12:59"
    },
    {
      "speaker": "B",
      "text": "怖かったですねそもそも英語で面接をするっていうのが初めてだったのでまずそこで緊張しますしそもそもなんかこの歳になってカフェの面接するとはっていうのもあってだからどんな質問が来るかっていうのもそのあんまりわかってなかったですしなのですごく緊張してたのを覚えてます。",
      "start": 797894,
      "end": 820075,
      "timestamp": "13:17"
    },
    {
      "speaker": "A",
      "text": "あとこれ僕だけなのかもしれないですけど僕はあの出身が新潟であの当時スタバは新潟になかったんですよ多分あったかなわかんないけどで僕東京に出てきて初めてスタバに行って最初の3回ぐらい行って注文できずに帰るっていうのをやってスタバがそもそも怖くないですか?スタバの雰囲気が相談する方もいろんなこと聞かれて怖いし何だろう?",
      "start": 820075,
      "end": 855384,
      "timestamp": "13:40"
    },
    {
      "speaker": "B",
      "text": "そうですね日本のスタバはあまり分からないんですけどカナダのスタバってそのラリーも当たり前にあってカスタマイズなんて3つ4つを平均で来るしこっちもこっちで色々聞くしみたいな感じであれちゃんと覚えられるの?",
      "start": 855384,
      "end": 872166,
      "timestamp": "14:15"
    },
    {
      "speaker": "A",
      "text": "何だろう?全然自分が働いているイメージがつかなすぎて道すぎ。",
      "start": 872166,
      "end": 880402,
      "timestamp": "14:32"
    },
    {
      "speaker": "C",
      "text": "て聞きたかったのは英語力が課題がある中で苦しまれたと思うんですけどスタバのバイトってたくさん痛い思いをしながら上達していったみたいな感じですか。",
      "start": 880402,
      "end": 892826,
      "timestamp": "14:40"
    },
    {
      "speaker": "B",
      "text": "ねそうですね本当に苦しい環境に自分を入れてでも恥もかきながら苦しい思いをしながらあの、必死にやってましたね。",
      "start": 892826,
      "end": 908394,
      "timestamp": "14:52"
    },
    {
      "speaker": "A",
      "text": "やっぱ、英語の勉強はいくらその苦しい思いをできるかみたいなところありますよね。",
      "start": 908394,
      "end": 915240,
      "timestamp": "15:08"
    },
    {
      "speaker": "B",
      "text": "いや、。",
      "start": 915240,
      "end": 915440,
      "timestamp": "15:15"
    },
    {
      "speaker": "C",
      "text": "ありますね。",
      "start": 915440,
      "end": 916731,
      "timestamp": "15:15"
    },
    {
      "speaker": "A",
      "text": "それがすべてと言っても。いや、ほんとに。やっぱレベルアップできるときって、その苦しい経験して、そっからなんだろう、ちくしょうって思ってやれるかみたいなのが結構あるのかなって思う。",
      "start": 916731,
      "end": 926779,
      "timestamp": "15:16"
    },
    {
      "speaker": "C",
      "text": "いや、ほんとそうですよね。",
      "start": 926779,
      "end": 927639,
      "timestamp": "15:26"
    },
    {
      "speaker": "B",
      "text": "ほんとにね。",
      "start": 927639,
      "end": 928469,
      "timestamp": "15:27"
    },
    {
      "speaker": "A",
      "text": "うん。1年と10ヶ月働いてるのかな?なんかどのぐらいで、あ、慣れてきたなみたいな、なんか、まあ、もういけるかなみたいになるんですか?たぶん結構、その、英語しゃべれなくて、これからたぶん、ゆうとくんみたいなパス、あの、いきたいみたいな人結構多いと思うんですけど、どのぐらいしたら、その、あ、まあもう余裕だぜみたいなとかに余裕だぜとはならないかもしれないけどいけるなってなるんですか?",
      "start": 928469,
      "end": 949638,
      "timestamp": "15:28"
    },
    {
      "speaker": "B",
      "text": "だいたい3ヶ月ぐらいですかねその英語に関して言うと僕はあのだいたい週15から20時間その学生として働けるマックスギリギリまで働いててそれで3ヶ月したらだいたい耳が慣れてきてで、多少しゃべれるようになってきてっていうのがあります。",
      "start": 949638,
      "end": 968951,
      "timestamp": "15:49"
    },
    {
      "speaker": "A",
      "text": "ね週に何回ですか?3回とか4回?",
      "start": 968951,
      "end": 971972,
      "timestamp": "16:08"
    },
    {
      "speaker": "B",
      "text": "週3から4ですね。",
      "start": 971972,
      "end": 973433,
      "timestamp": "16:11"
    },
    {
      "speaker": "A",
      "text": "3ヶ月かごめんなさい痛いでも3ヶ月痛い思いで済んでバリスタでちょっと自信持って働けるならアリなんじゃないかしかもなんか結構そのスモールトークの究極みたいなところあるじゃないですかカフェの店員がスモールトークはもう完璧にいけるぜみたいな状態なわけですよねちょっとアリな気が。",
      "start": 978151,
      "end": 1003660,
      "timestamp": "16:18"
    },
    {
      "speaker": "C",
      "text": "してきたなお金もらってやるブートキャンプみたいな感じ。",
      "start": 1003660,
      "end": 1007250,
      "timestamp": "16:43"
    },
    {
      "speaker": "B",
      "text": "ですね確かに確かにほんとその感覚でもお金もらいながらこっちは英語勉強してるんやぐらいのマインドセットでしたね。",
      "start": 1007250,
      "end": 1014659,
      "timestamp": "16:47"
    },
    {
      "speaker": "C",
      "text": "バイトじゃあ週に20時間マックスまでやりながらってなると学校の勉強との両立も結構難しいというかなかなか時間のやりくりは大変だったのかなと思うんですけれども学校もプログラミングは未経験からのスタートだったということですがその辺の両立とかはどうでした。",
      "start": 1017145,
      "end": 1035292,
      "timestamp": "16:57"
    },
    {
      "speaker": "B",
      "text": "かすごく苦労しましたスケジュールでほぼなんか英語の勉強壁で働く学校行ってるか都市間で自習してるかの生活をもう1年1年以上続けたのかのがあってでそのスタバは午前中にやってましたで学校には午後から行きで学校終わったら自習するみたいなスケジュールをずっとやってましたねなんで結構なんて言うんでしょう休みなくひたすら取り組んでました。",
      "start": 1035292,
      "end": 1071078,
      "timestamp": "17:15"
    },
    {
      "speaker": "C",
      "text": "学校のカリキュラムの内容としてはどうでした?CICCCは全くの初心者からでもキャッチアップできるようなカリキュラム構成にはなってるんですかね?",
      "start": 1073102,
      "end": 1083580,
      "timestamp": "17:53"
    },
    {
      "speaker": "B",
      "text": "そうですねちゃんと勉強してれば初心者でも全然できるカリキュラムでした今は分かんないですけどウェブコースとモバイルコースとあってモバイルコースは結構経験者が行くコースでウェブコースは割と初心者が多いコースだって僕はウェブのコースに行ってたので周りもほぼ全員未経験経験者1人しかいなかったんじゃないかな20何人いてもちろん授業だけだと厳しい部分はあったんですけど自分で復習とか予習とかしてれば特に問題なく進んでいけるカリキュラムでした。",
      "start": 1083580,
      "end": 1122504,
      "timestamp": "18:03"
    },
    {
      "speaker": "A",
      "text": "ねちなみに予習復習だけで就職できるレベルにはたどり着くんですかそれとも結構自分でプラスアルファこういう例えばソフトエンジニアで言ったらフレームワーク勉強しないといけないとかプラスアルファはわかんないけどリートコードやらないといけないみたいな学校の延長上に仕事をもらえるよみたいなのはある?",
      "start": 1122504,
      "end": 1153295,
      "timestamp": "18:42"
    },
    {
      "speaker": "B",
      "text": "学校の延長上ではないと思っててもそのプラスアルファをどれだけ大きくできるかが全ての借りだと思ってて結局その学校が僕らのクラスの中から就職できた人って運もあると思うんですけどプラスアルファをすごくやってた人本当にカリキュラムで言ったら3つ4つ先のことをやってるとかそれ以外のリードコードなりアルゴリズムなり別のことを自分の時間さえですごくやってる人とかが出てたイメージなのでその予習復習やって学校行ってれば就職できるぜみたいなことでは全くなかったですね。",
      "start": 1153305,
      "end": 1189852,
      "timestamp": "19:13"
    },
    {
      "speaker": "A",
      "text": "なんか僕もこれまでやっぱ結構インタビューしてくる中で、どれだけ学校の勉強をしないかが鍵みたいなのを結構僕の中でそうなんだろうなって思ってるんですけど、ゆうとくんの場合はどうでした?結構やっぱ復習、予習、復習はしました?それとも結構サボれるところはサボって、インタビューのためというか会社に入るための勉強に専念。",
      "start": 1190978,
      "end": 1214365,
      "timestamp": "19:50"
    },
    {
      "speaker": "B",
      "text": "する感じでした?抜けるところは抜いてたと思いますね既にやっててある程度分かってるからここはいいから次のことするってパターンもあれば逆にリアクトとかノードJSやった時は僕としてもそこまで経験なかったのである程度しっかり聞いてた時はありますなので半分半分ですかね事業に取り組む取り組まないの割合は。",
      "start": 1214365,
      "end": 1240337,
      "timestamp": "20:14"
    },
    {
      "speaker": "C",
      "text": "キャリアじゃないわカリキュラムは1年間ぐらいですよねでそこから収穫を始めるとなるとでLinkedIのプロフィール整備とかGitHubを整備したりとかはもう必要かなと思うんですけれどもそれは在学中に進められてた感じですか?",
      "start": 1245857,
      "end": 1263124,
      "timestamp": "20:45"
    },
    {
      "speaker": "B",
      "text": "そうですねちょうど1年CRCCCは1年間通って1年間の公募期間があって計2年のカリキュラムで僕は在学期間の1年間のうち多分9ヶ月ぐらいかな9ヶ月経った時からそういう整備を始めましたプロジェクトみたい。",
      "start": 1263124,
      "end": 1285941,
      "timestamp": "21:03"
    },
    {
      "speaker": "A",
      "text": "なの増えてきますもんね割とフリーな時間も結構増えてくるのかなとちなみに座学の期間に自分でも勉強してるっていうことだったんですけどどういうマテリアルというかどういう教材を使って勉強され。",
      "start": 1285941,
      "end": 1299607,
      "timestamp": "21:25"
    },
    {
      "speaker": "B",
      "text": "たんですか?マテリアルはほぼUDEMYでしたねUDEMYでリアクトのコース買ってひたすらやるとかそれがたまにYouTbe見てるぐらいでしたね。",
      "start": 1299607,
      "end": 1312184,
      "timestamp": "21:39"
    },
    {
      "speaker": "A",
      "text": "それはやっぱり英語のクラス取ったんですか?それとも何だろう?結構分かれるのかなと思って、技術の勉強は日本語でやって、英語は英語でやるっていう人と、もう全部、私の頭の中はカナダにいる間は全部英語だみたいな感じで、英語で全部やるっていうタイプがいると思うんですけど、どちらでやってました?",
      "start": 1312184,
      "end": 1331200,
      "timestamp": "21:52"
    },
    {
      "speaker": "B",
      "text": "ちなみに。それで言うと僕は校舎の人でもう教材もほぼ全部英語でやってて本当に分からなかったらたまに日本語の記事を見るぐらいだってっていうのもそもそも僕エンジニアの経験なしで来てるのでそのエンジニアとしての知識のインパクトが全部基本の英語ベースになってて日本語で勉強しだすと逆に混乱するっていうのがあってそうならもう一旦英語に統一者がその脳の負荷も減るなぁと思って今は英語ですねほとんど。",
      "start": 1331200,
      "end": 1361265,
      "timestamp": "22:11"
    },
    {
      "speaker": "C",
      "text": "英語環境から僕もその日本語環境に移って苦労したみたいな気持ちはちょっと分かってですねクワネテスってあるじゃないですかあれって英語だとクブネディスって言いますけど日本語だとなんて発音するんだろう。",
      "start": 1369248,
      "end": 1382218,
      "timestamp": "22:49"
    },
    {
      "speaker": "A",
      "text": "みたいなありますよね僕今一瞬分かんなかったです本当ですか一瞬何の話してるのか分からなくてけど理解できたけど途中で確かに。日本って、二次情報がすごい上手、二次情報の本とか教材がすごい出すのが上手いのかなと思ってて、僕結構二次情報のものを日本語で読んだりとか、その一時情報って、一時情報だから絶対正しいんだけど、例えば何だろう、ドキュメンテーション、リアクターのドキュメンテーションとかみたいな絶対正しいものなんだけど、ほぼほぼ。難しかったりとか情報の羅列がしてある正しくするために情報の羅列がしてあるから噛み砕かれてないとかちょっと業界未経験だったりとかそこのエリアについて詳しくない人にとっては辞書っぽくてちょっと読みにくいみたいなのあるじゃないですかだからそういう時ってすごい日本の教材って二次情報を噛み砕いて人に教えるみたいな能力の高い人たちは多いのかなって思っててそういうの結構僕は日本語で読む派なんだけど確かにそれを読んで理解してもそれを英語では喋れないっていう事象は割と起きるそれわかるぞでも何て言えばいいかわかんないみたいなのがエンジニアとのこっちの会話で結構あるから確かに頭の中混乱してっていうのは確かにそういうタイプの人にはあるかもしれないですね。",
      "start": 1382218,
      "end": 1467280,
      "timestamp": "23:02"
    },
    {
      "speaker": "C",
      "text": "でじゃあまあちょっと就活の話に戻るんですけれども冒頭でもあった通りユウトさんはかなり谷の世代というか就活の波がかなり厳しかった時代に就活をされたと聞いたところによると丸1年ぐらいはまあ就活に使われたと聞いてますがまあ初めはどんなところから始めましたか就活のユウト。",
      "start": 1470194,
      "end": 1491830,
      "timestamp": "24:30"
    },
    {
      "speaker": "B",
      "text": "初めはまあでもレジュメを作ってひたすらアプライすることから始めましたねとりあえず応募してみないと何もわからないっていう考えがあったので応募してみてどれぐらい反応くるかなみたいなここから始めてあれ全然こう変ってなってあらあらってなってあれですねよくよく調べてみるとどうやら今はリセッションらしいとわかったとこですね。",
      "start": 1491830,
      "end": 1523234,
      "timestamp": "24:51"
    },
    {
      "speaker": "C",
      "text": "1個目のインタビューに行くまでがやっぱかなりその一番ハードルが高いってまあよく言われることですけど前レジュメ送信を母数とした場合、打率みたいなところ何社応募して何社面接したかみたいな大体の感覚ってありますか?",
      "start": 1526262,
      "end": 1546563,
      "timestamp": "25:26"
    },
    {
      "speaker": "B",
      "text": "正確な数までは把握してないんですけど応募者数は多分200や300ぐらいは250くらいですかね、いってると思っててで、その中で面接したのは多分1、2、3、4、4社かな?なので、もう1割、1割以下が1の、。",
      "start": 1546563,
      "end": 1571131,
      "timestamp": "25:46"
    },
    {
      "speaker": "A",
      "text": "はいそうですねすごいな、。",
      "start": 1571131,
      "end": 1574394,
      "timestamp": "26:11"
    },
    {
      "speaker": "C",
      "text": "それは確かにその中から一つオファーをいただいてという感じですよねはい中学期間中にボランティアとかその辺のことは何かやられたりしましたか?",
      "start": 1574394,
      "end": 1588526,
      "timestamp": "26:14"
    },
    {
      "speaker": "B",
      "text": "その1年間の間にはそうですねボランティアはしてました現地のそれこそこの学校の先生が立ち上げたスタートアップのボランティアでしたねボランティアの。",
      "start": 1588526,
      "end": 1602243,
      "timestamp": "26:28"
    },
    {
      "speaker": "C",
      "text": "経験は結構一応就労経験としてカウントできるっちゃできるんですかね生きた感じはしますか?",
      "start": 1602243,
      "end": 1610037,
      "timestamp": "26:42"
    },
    {
      "speaker": "B",
      "text": "就職活動に行きたかどうかはわからないですけどレジュメにそのカナダの会社でエンジニアとしてボランティアも何も働きましたって受け入れてかけるのは結構手がかったですねその気持ち的にも確か。",
      "start": 1610037,
      "end": 1623931,
      "timestamp": "26:50"
    },
    {
      "speaker": "A",
      "text": "になんかボランティアの中でも何かいくつかレベルがあってまあ多分全部のところであのクリアしているのはそのレジュメにかける一つ目で多分その次は何かあのレファラルくれるというかあのその会社からちょっとフェーズが進んできたときに私をレファラルとして使っていいですよみたいなのを言ってくれるともうちょっとよくてでもボランティアだけどちょっとお金払ってくれるみたいなところもいいところだとありますよねでもよくあるのはやっぱりレジュメにかけるっていうのが一番たぶん現地にいてエンジニアとしてやる能力があるよみたいなのを言えるっていうのがめちゃくちゃでかいですよなんかその間結構日本のそのさっき言ってたリモートの仕事もしたと思うんですけどそれはどういうふうに見つけられた。",
      "start": 1623931,
      "end": 1672324,
      "timestamp": "27:03"
    },
    {
      "speaker": "B",
      "text": "んですかこれはあのウォンテッドリっていうプラットフォームが日本にあるんですけどそこで見つけ。",
      "start": 1672324,
      "end": 1679286,
      "timestamp": "27:52"
    },
    {
      "speaker": "A",
      "text": "ましたそれは結構なんだろう日本はよく売り手市場?",
      "start": 1679286,
      "end": 1686118,
      "timestamp": "27:59"
    },
    {
      "speaker": "B",
      "text": "どっち?",
      "start": 1686118,
      "end": 1686378,
      "timestamp": "28:06"
    },
    {
      "speaker": "A",
      "text": "買い手市場?",
      "start": 1686378,
      "end": 1687538,
      "timestamp": "28:06"
    },
    {
      "speaker": "C",
      "text": "売り手市場買い手市あのですね応募者が多い方が売り手。",
      "start": 1687538,
      "end": 1692890,
      "timestamp": "28:07"
    },
    {
      "speaker": "A",
      "text": "市場あそこなんじゃ書いて市場がそう書いて市場だからえっと結構その簡単に仕事見つかるみたいな風に言われているのかなと思うんですけど結構簡単に見つかりましたそれとも結構それ。",
      "start": 1692890,
      "end": 1705409,
      "timestamp": "28:12"
    },
    {
      "speaker": "B",
      "text": "も苦労しました意外とすぐ見つかってそのちょっと中活開始の始ま話に戻るとまあカナダで応募してみるが全然手応えがなくリセッションがあるのでまぁ結構厳しいなのでまぁ一旦そのエンジニア未経験っていうラベリングを剥がすっていう作戦に入りましてそれなら一体日本の企業でもいいかってなってで、Wantedリードを始めても1週間で決まりましたねおーすげーちょっとびっくりしました確か。",
      "start": 1705409,
      "end": 1737943,
      "timestamp": "28:25"
    },
    {
      "speaker": "A",
      "text": "にあとはその時期あれですよね日本はその快適市場やべまた忘れちゃった快適市場プラスリモートで働きリモートでの働き方がどんどん馴染んでったというかがあるからそのオフィス出社がないから海外でもいいんじゃね?海外の人でもいいんじゃね?みたいなのが結構あった時期なのかなって思うんで確かにそういうコンテキストでは割と簡単に見つけられたっていうのは確かになっていうのはあります。",
      "start": 1737943,
      "end": 1766948,
      "timestamp": "28:57"
    },
    {
      "speaker": "C",
      "text": "よね日本での案件はどれぐらい続けられたんですか?",
      "start": 1766948,
      "end": 1774393,
      "timestamp": "29:26"
    },
    {
      "speaker": "B",
      "text": "えっとその後でほぼ1年間ぐらいやってましたねその会社は途中で1回変わってるんですけどもう丸々1年投資でやってました。",
      "start": 1774403,
      "end": 1786273,
      "timestamp": "29:34"
    },
    {
      "speaker": "C",
      "text": "それができるとやっぱまあ生活費のこととかもちょっとやっぱ足しちょっとというかあの安心感にもつながりますよ。",
      "start": 1786273,
      "end": 1793139,
      "timestamp": "29:46"
    },
    {
      "speaker": "B",
      "text": "ねそうですねでもまあプラススタバも笑い続けてたんですよ当時はめちゃめちゃ忙しいですよそれでプラス現地でボランティアしながら就活もしてもうあの1年はもうギノと戻りたくないです。",
      "start": 1793139,
      "end": 1811001,
      "timestamp": "29:53"
    },
    {
      "speaker": "A",
      "text": "もんちなみにスタバは辞めれたのかなお金をちょっと日本のエンジニアの職の方が給料多分高いですよ。",
      "start": 1811001,
      "end": 1826887,
      "timestamp": "30:11"
    },
    {
      "speaker": "B",
      "text": "ねちょっとは意外と僕の一つ目のその会社はそうでもなくてジュニアで一番最初はアルバイトみたいな扱いだったんで時給で言ったらスタバより低かったですね。",
      "start": 1826887,
      "end": 1843167,
      "timestamp": "30:26"
    },
    {
      "speaker": "A",
      "text": "でも英語っていう面で見ると全然辞めてもよかったかなみたいな感じです。",
      "start": 1843167,
      "end": 1848089,
      "timestamp": "30:43"
    },
    {
      "speaker": "B",
      "text": "か結構迷ってスタバ辞めるか辞めないかでも辞めたら結構英語落ちるなーっていう気がしたのでしたもやめずにシフトの数を半分ぐらいにしてもらいまし。",
      "start": 1848089,
      "end": 1860592,
      "timestamp": "30:48"
    },
    {
      "speaker": "A",
      "text": "たね確かにスモールトークがしなければしないほどどんどん出たく出てこなくなるイメージあるから確かにその落ちるっていうのは確かにそうかもしれないですねです。",
      "start": 1860592,
      "end": 1871757,
      "timestamp": "31:00"
    },
    {
      "speaker": "B",
      "text": "ねマットはなんだかんだストレスすごく溜まってたので就活だったりそのエンジンの見慣れないエンジニアの仕事だったりで、そのスタバで働いているその4時間ぐらいが唯一全てから忘れられる時間でもあったので意外といいストレスリリーフでもあったんですよ。",
      "start": 1871757,
      "end": 1888315,
      "timestamp": "31:11"
    },
    {
      "speaker": "C",
      "text": "ね確かに日本の案件はじゃあこれからまた就活に専念するぞという感じで辞められたとかそういう感じ。",
      "start": 1888315,
      "end": 1897663,
      "timestamp": "31:28"
    },
    {
      "speaker": "B",
      "text": "ですか日本の案件一つ目のやつは僕から辞めたんじゃなくて向こうから契約終了を言われてそうなんだ向こうも向こうで結構大量に人を雇ってしまったみたいで見直しの時に一気に割と経験が浅いメンバーが切られたって感じですね僕のカナダのCACCCのクラスメイトも何人か働いてたんですけどそのうちの未経験で入った組の人らもみんな切られていたのででそれがあってカナダの就活また再開するかってなりました。",
      "start": 1897663,
      "end": 1940204,
      "timestamp": "31:37"
    },
    {
      "speaker": "C",
      "text": "でまあ就活再開してでまあようやくオファーをゲットしたということになるかと思うんですけれどもそこの初めの会社はあのどんなところを評価されてオファーに至ったみたいなフィードバックあり。",
      "start": 1940204,
      "end": 1954473,
      "timestamp": "32:20"
    },
    {
      "speaker": "B",
      "text": "ましたかフィードバックはそうですねまあコミュニケーション問題なく取れていたのとまああとは誠実さ誠実性を評価したってマネージャーから言ってもらいまし。",
      "start": 1954473,
      "end": 1966170,
      "timestamp": "32:34"
    },
    {
      "speaker": "A",
      "text": "たインタビューはどんな流れだったんですか?",
      "start": 1966170,
      "end": 1971115,
      "timestamp": "32:46"
    },
    {
      "speaker": "B",
      "text": "インタビューは全部で4回?4回プラスアサイメントがあってまずHRとのフォンスクリーニングから入って15分ぐらい簡単に話して次はチームのマネージャーと話しますそのチームのマネージャーと話した後にアサイメントを受け取ってそれを元に次にテックインタビューをします最後がそのさらに上のマネージャーとデザイナーとのインタビューでオファーという形ですねアサイメントはどういう。",
      "start": 1971115,
      "end": 2003379,
      "timestamp": "32:51"
    },
    {
      "speaker": "A",
      "text": "形のアサイメントが出たんですか?",
      "start": 2003379,
      "end": 2005901,
      "timestamp": "33:23"
    },
    {
      "speaker": "B",
      "text": "簡単なウェブページを作るっていうものでフィグマのデザインが渡されてそれを元に作ってきてっていうアサイメント。",
      "start": 2005901,
      "end": 2012707,
      "timestamp": "33:25"
    },
    {
      "speaker": "A",
      "text": "でしたリアクトか何かですか?",
      "start": 2012707,
      "end": 2016060,
      "timestamp": "33:32"
    },
    {
      "speaker": "B",
      "text": "ネクスト、リアクトとタイプスクリプトとちなみ。",
      "start": 2016070,
      "end": 2021514,
      "timestamp": "33:36"
    },
    {
      "speaker": "A",
      "text": "にどんな感じのページなんですか、。",
      "start": 2021514,
      "end": 2023305,
      "timestamp": "33:41"
    },
    {
      "speaker": "B",
      "text": "それは本当にその会社が旅行会社だったので実際にあるその会社のそのページ、ページの一部分ですかねちゃんとレスポンシブで作ってきてっていう内容でしたねその。",
      "start": 2023305,
      "end": 2038985,
      "timestamp": "33:43"
    },
    {
      "speaker": "A",
      "text": "後のインタビューはそのアサインメントをベースってことだったと思うんですけどどんなことを聞か。",
      "start": 2038985,
      "end": 2043709,
      "timestamp": "33:58"
    },
    {
      "speaker": "B",
      "text": "れたんですかまあそのテックスタックで言うとネクストのバージョンで言ったらなんでこのバージョン使ったの?っていう話もあればあとはウェブ制作に近かったのでパフォーマンスについてGogleのCoreWbVitalsの指標がいろいろあると思うんですけどこれについてどう対策したとかそういう内容でしたね結構難しいですね意外とそうです奥深かったですねでその次。",
      "start": 2043709,
      "end": 2073728,
      "timestamp": "34:03"
    },
    {
      "speaker": "A",
      "text": "のインタビューはえっと全然アサインメントと関係ないテックインタビューみたいな感じ。",
      "start": 2073728,
      "end": 2081206,
      "timestamp": "34:33"
    },
    {
      "speaker": "B",
      "text": "ですかテックというよりはまあビヘイビアルに近い内容だったんですよねっていうのもその僕の応募者チームがマーケティングチームの中にあるエンジニア軍団みたいなポジションだったんでちょっとの一番上の上司はマーケティングのマネージャーとまたデザイン化のマネージャーがいてね彼らとその簡単なインタビューをしたって。",
      "start": 2081206,
      "end": 2106294,
      "timestamp": "34:41"
    },
    {
      "speaker": "A",
      "text": "いう形ですね内容的にはどんなことを聞かれるんですか?",
      "start": 2106294,
      "end": 2113667,
      "timestamp": "35:06"
    },
    {
      "speaker": "B",
      "text": "デザイナーとどういうふうにコミュニケーションを取るだとかあとは本当にビヘビアルに近かったのでコンフリクトがあったらどうするとかそういうものですね。",
      "start": 2113667,
      "end": 2127143,
      "timestamp": "35:13"
    },
    {
      "speaker": "C",
      "text": "コンフリクトっていうのはその人間的な意味でのってこと。",
      "start": 2129308,
      "end": 2133249,
      "timestamp": "35:29"
    },
    {
      "speaker": "B",
      "text": "ですよね人間的なコンフリクトですねGitHubではないです。",
      "start": 2133249,
      "end": 2137031,
      "timestamp": "35:33"
    },
    {
      "speaker": "A",
      "text": "まあでもよくありますよねなんかマネージャーとの意見がコンフリクトしたときどういうふうに解決したかみたいな結構どこでもよく聞かれる。",
      "start": 2137031,
      "end": 2145534,
      "timestamp": "35:37"
    },
    {
      "speaker": "C",
      "text": "のかなやっぱりエンジニアでもそういう気持ちのいいというか感じのいいコミュニケーションっていうのはやっぱり重視されるんですねやっぱりどこでも。",
      "start": 2145534,
      "end": 2154617,
      "timestamp": "35:45"
    },
    {
      "speaker": "B",
      "text": "そうですね、うちのカナダの会社は結構それ人間性とか人の良さを評価する会社だったのでいくら言ってしまえばブリリアンドジャークは入れない会社でもありますしいくらすごくてもちょっとなんかパーソナリティに難があると多分難しいのかなとかとはコミュニケーションちゃんと伝えられないと議論ができないとか落ちるのかなと思いましたね。",
      "start": 2156457,
      "end": 2181775,
      "timestamp": "35:56"
    },
    {
      "speaker": "C",
      "text": "ゆうどさんの営業の経験がそこで生きている可能性はかなり。",
      "start": 2184013,
      "end": 2187196,
      "timestamp": "36:24"
    },
    {
      "speaker": "B",
      "text": "ありますねあると思いますねなんだかんだその営業する前と結構人としゃべるの苦手だったので営業職でそれがなんとなくできるようになってでスタバのバイトでそれが英語でできるようになってみたいなちょっと段階本できたなぁと思います1年の。",
      "start": 2187196,
      "end": 2207271,
      "timestamp": "36:27"
    },
    {
      "speaker": "C",
      "text": "1年の就活の後オファーゲットしてかなり嬉しかったと思うんですけれども仕事始まってからの様子はどうでした?仕事内容とか会社のカルチャー。",
      "start": 2212232,
      "end": 2222435,
      "timestamp": "36:52"
    },
    {
      "speaker": "B",
      "text": "とか仕事内容は本当にアサイメントで想像してたようなことをやってパフォーマンス改善とかあとABテストやったりとかそういうのをデザイナーとかマーケッターとかあとはアナリシスチームと一緒にやったりとかやってましたね会社のカルチャーも面接通してどういう人がいるのかっていうのは分かっていたのでその通りのすごく優しい素晴らしい人たちがいまし。",
      "start": 2222435,
      "end": 2253374,
      "timestamp": "37:02"
    },
    {
      "speaker": "C",
      "text": "たね海外企業でよく聞くのが残業は全然ないのか本当はどうなのかみたいなところがねやっぱ気になる人も多いと思うんですけれどもゆうとさんのその一社名のワーキングカルチャーみたいなところはどうでし。",
      "start": 2253374,
      "end": 2269476,
      "timestamp": "37:33"
    },
    {
      "speaker": "B",
      "text": "たか残業はゼロでしたねたまに結構遅くやってた組で5時半ぐらいまで働いてると人事の人からお願いだから帰ってくれって言われるぐらいだったんであとは働き方はハイブリッドだったんですけどみんな基本的に金曜日はオフィスに来ないみたいな感じで金曜日そもそも働いてるかどうかも分からないですしって感じかなり緩かったですね。",
      "start": 2269476,
      "end": 2298550,
      "timestamp": "37:49"
    },
    {
      "speaker": "C",
      "text": "ハイブリッドで出社の回数も特に指定はなかった感じですか一応週。",
      "start": 2300992,
      "end": 2305435,
      "timestamp": "38:20"
    },
    {
      "speaker": "B",
      "text": "3っていう風になっていて僕は週3行ってたんですけど多分人によっては週2で週2とか週1とかの人もいた気がします。",
      "start": 2305435,
      "end": 2317282,
      "timestamp": "38:25"
    },
    {
      "speaker": "C",
      "text": "1年間就活をして予約入った会社ではあると思うんですが伺っている通りそこでちょっとレイオフがあったんですよねそこの伝えられ方と言いますかどんな伝えられ方。",
      "start": 2319125,
      "end": 2334632,
      "timestamp": "38:39"
    },
    {
      "speaker": "B",
      "text": "でしたかあれは朝のちょうど出社してて朝のミーティング前だったんですけど急に会議室に呼ばれて僕の上司の上司からマーケティング部の上司マネージャー官に会議室に呼ばれて会議室に行くとその人とHRのマネージャーが座っててやけに表情が真剣だったんですよねこれは何かあると思ったらそこでレイオフを言われてそこからもうだいたい20分くらいですかね話をしたの今頃流れとか早い短いですめっちゃ短いです僕の机にあった荷物を全部会議室に持ってきてでその場でラップトップ返却してでそのままもうチームの誰とも会わずにそのまま帰りまし。",
      "start": 2334632,
      "end": 2394423,
      "timestamp": "38:54"
    },
    {
      "speaker": "A",
      "text": "たチームとは席離れてる。",
      "start": 2394423,
      "end": 2398866,
      "timestamp": "39:54"
    },
    {
      "speaker": "B",
      "text": "んですかちなみにチームと席が一緒だったんですけどその時僕のマネージャーがちょうどあの違う帰りかなんかでいなかったんですよねでももう一人のメンバーはまだ出社してなくてそれで僕がいつものいつもその僕らのチームのミーティングがある会議室の前で待ってたら呼び出されてそのまま礼を振った感じ。",
      "start": 2398866,
      "end": 2421420,
      "timestamp": "39:58"
    },
    {
      "speaker": "C",
      "text": "ですねこれは精神的に。",
      "start": 2421420,
      "end": 2426527,
      "timestamp": "40:21"
    },
    {
      "speaker": "B",
      "text": "ちょっときますね反応の時はだいぶきましたもうどん底でしたね。",
      "start": 2426527,
      "end": 2430853,
      "timestamp": "40:26"
    },
    {
      "speaker": "A",
      "text": "ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2435330,
      "end": 2453443,
      "timestamp": "40:35"
    }
  ],
  "highlight1": "Yutoさんはカナダのバンクーバーで3年間生活し、英語力を身に付けながら現地企業に就職するという経験を持っています。",
  "highlight2": "就活で苦しんだYutoさんが、最終的にオファーをもらえた理由とは何だったのか、それが「コミュニケーション問題なく取れていた」ことと「誠実さを評価された」ことだったんです。",
  "highlight3": "Yutoさんは1年間の就活を経て、海外の企業でフルスタックエンジニアとして働く夢を叶えましたが、その後レイオフに遭遇し、日本に帰国することとなりました。"
}