{
  "episodeGuid": "bb8c0bce-32c2-4ee0-ae07-7714885fbd8d",
  "episodeTitle": "文系営業職からカナダでフルリモートエンジニアへ！SaaS企業に海外就職したSuguruさんのキャリア戦略（前半）#21",
  "transcribedAt": "2025-11-03T06:22:51.744Z",
  "duration": 2300,
  "fullText": "今回はすぐるさんに来ていただきましたよろしくお願いし。ますよろしくお願いしますまず。はじめに経歴から簡単に経歴。から教えてくださいはい経歴そうですねなんかどれぐらいのボリュームで話せばいいのかまあ。よくわからないんですけど大学卒業した後とか最初。の就職からとかそんな感じですねはいそうですねもともと大学は文系でして新卒でメーカーに総合職として入社しました4年ぐらいそこで営業として働いてましてその後大体コロナ終わりぐらいですかねエンジニアとして転職して独立系のSIRで3年半ほどエンジニアとして働きましたでえっと2024年の7月ですねカナダのバンクーバーに特効しまして現在はアメリカにあるまあサースの企業ですかねエンジニアとしてフルリモートで働いてますはいなんかマイアミ。に会社あるんですかちょっとリンクでいい見させてもらっ。たんですけどなんか一応マイアミにあるっぽいんですけどなんかあの会社の本部みたいなところあるんですけどなんか多分出社している人はいなくてもう各地からフルリモートでみんな働いている感じですねそうなんだ。じゃああんまり行く機会とかはないんですか?なんかマイアミ行くの良さそうだなとか思ってた。けどいやなんかそうですねたまにというか多分1年に1回ぐらいなんか集まって会議みたいのしてるみたいなんですけどはい僕はまだ行く。機会はないですね結構時差ありますよねマイアミだったら。そうですねなんか結構本当にいろんなタイムゾーンから働いててまあ基本はそのみんなアメリカ基本的にアメリカに住んでる人が多いんですけどまあpsdだったりあるいはまあえっとestだったりそのタイムゾーンがみんな違っててあんまりその時差を意識するタイミングないですねなんかみんな自由に働いてます。ね独立系の日本の会社かなって働いてたと思うんですけど、。それはですね多分あのどっかでフロックの記事を見たんだと思うんですよねなんかいつだったか本当わからないんですけど多分エンジニアに就職転職してすぐぐらいに記事を見てあのあそのカナダでエンジニアとして働くみたいな選択肢もあるんだなぁみたいなのがすごく頭に残っててでなんて言うんでしょうねまあもともと僕はでも営業として働いてたこともあってなんか海外で働くって言ってもその営業だと全然なんか働いてるイメージが持てなかったんですけどだからエンジニアだと結構具体的にまあそのなんて言うんですかねまあ定食じゃないですけどそういうスキルを持って働ける海外でも貼ってやっていけるのかなみたいなそういうイメージがすごくできたんでなんかいつか行ってみようかなぁみたいなその最初の時はすごくあの頭でぼんやりと思ってまし。たねもともとなんか海外で働きたいみたいな思いみたいなのあったんですかは何。かうーんとあんまりなかったんですよねっていうのもなんでしょううーんまあさっきも言ったようにその営業職だったのもあってなんか全然海外で働くイメージが持てなかったのとまあ日本割と好きですしなんかこのまま日本で過ごすのかみたいな感じだったんですけどまあ一方でその学生の時に留学行ってみたかったなぁみたいな気持ちをずっとあってでそのまあ転職エンジニアに転職してこれってもしかして海外で働いてみるのもアリなのかなみたいなそういうのがだんだんちょっとイメージが具体的になってきたって感じだと。思いますそうするとじゃあ特にそれまで英語の準備とかはせずに来たと思うんですけど英語はどういうふうに習得された。んですか元々英語苦手ではなくて割と学校のテストとかそういうレベルですけど得意ではあったんで文法とかそういうところは結構わかってたんですけど喋りのところがどうしても準備必要だなっていうところでオンライン英会話ですねオンライン英会話でしよう準備はしましたで実際準備し始めたのがあのなんか特効の準備とか何もその計画とかする前にちょっとまず英語を勉強しようかなみたいのでとりあえず英語から始めようということであの特効の多分2年ぐらい前ですかねオンライン英会話を始めてそこでカラメソッドっていうのがあるんですけどちょっとご存知かわかりませんけど講師が言った英語をそのままリピートするみたいなとにかく英語に口を慣れさせるレッスンみたいなそういうので結構準備していまし。たねシャドーウィングみたいな感じですか?そうですねシャドーウィングですね。それはクラスみたいなところに行ってやるんですか?それともオンラインみたいな感じなんですか?あのオンラインですねちょっとまあ本当なんて言うんですかね完全なシャドウイングというよりは何か講師が質問をしてそれに対する答えを言うみたいな感じなんですけどその答え自体は何かあのもともと決まっていて難しいなって言ったんですかね講師も同時に答えるんで、それについていくみたいな。詳しくはカラオメソッドで調べたら出てくるんですけど、ちょっと特殊な勉強法ですよね。今、。カナダの学校行くってなると、TOEICだかIELTSだかみたいなの取らないといけないと思うんですけど、そこらへんはどうやって。準備されたんですか?えっとカナダの学校のcicccですけど入った時は確かデュオリンゴのテストであのヨリンゴのスコアが使えるってことでえっとデュオリンゴのテストを受けまして8確か最初に受けた時が100115点だったかなって入学に出したしか120点必要で5点足りないみたいなでちょっとあああの足りないなーってことで一応1ヶ月か2ヶ月準備してもう1回受けたんですけど結果115点のまま変わらずその5点を埋めるためになんかESL1ヶ月だけ通ってくださいってことでCICCのESLですね1ヶ月だけ通いましたね。なんか、経歴のところにちょっと戻っちゃうかもしれないんですけど、日本で営業職されてエンジニアにキャリアシフトした時は、その海外に将来的に行くっていうのを視野に入れて、エンジニアっていう仕事を選んだんですか?いやそれはちょっとなかったですね正直転職した時は全然海外のこととかあまり頭になくてどっちかっていうとそのものづくりが僕もともと好きで音楽作ったりとかあとまぁなんだろうな絵描いたりとかまぁちょっと手を動かしてもの作ったりするのが好きだったんでなんかそういう仕事できないかなーっていうのでエンジニアって結構じゃあ文系からそういうあの新しくスキルを学んで転職ってのは現実的だよねっていうのでエンジニアを選びましたね。で、エンジニアやってる間に海外が主要に入ってきたっていう感じですね。はい、。そうですね。フロックさんの記事を見させてもらってですね。すごいですねたまたまフロックの記事に出会えるって検索しないと。いやどうやって確かに出会ったのかあんまり覚えてないんですよねでも何かトカシさんの記事だったんじゃないかなあれトカシさんって呼んでいいん。ですかねりょうさんもちろんもちろん名前も明かしてるしリンクでいいんとかも多分出てきちゃうんで全然いいんですね僕の記事なんか引っかかる特徴のある単語使ってたかな使ってない気がするけど。最初に出会った記事はどれか覚えてないですけど、ブログの記事でそういうイメージが湧きましたね。カナダって結構未経験で、エンジニア経験なく未経験のまま来る人って多いと思うんですけど、営業職からエンジニアになった時、てどういうふうに何かみもちろん未経験だったわけじゃないですかあの文系の学校行かれたってことだってどういうふうに勉強されてエンジニアになられた。えっと一応なんかその転職する時に色々調べてどういう道がいいのかなっていうそのなんて言うんですかね最短で転職エンジニアとして転職するにはどうしたらいいんだろうみたいなところを調べて結局あのエージェント好きのスクールみたいなところに通ったっていうとちょっとあれですね登録したっていう感じなんですけどで、そのスクールのカリクラムとかあんまりやらず、参考にしつつちょっと独学でいろいろ勉強したっていうのが準備だったかなと思いますね。どんな教材を使われたんですか?いやもうなんかスクール独自のなんかよくわからない教材ですね。それってテッカーアカデミーとかですか?ではないですね。そういう系統の?あそうですそんな感じではいあのお金かからないところだったと思いますねあの。転職…あお金かからないとこ。あるんだそうそうあの転職してその転職先の企業から多分そのエージェントがお金をもらうみたいなそういうビジネスモデルだったと思いますなんか。どういう内容的にはどんな感じのなんていうんだろう言語とかものを勉強してたんですか一応Java。とあとSQLがありましたね本当Javaとかだとなんだろうポーカーを作ってみようみたいなやつとかあとはいわゆるECサイトショッピングサイトを作りましょうとかSQLも一通りセレクト文だったりそういう基本的なことが書いてあるみたいな全然他でも学べそうな内容がありましたね。ウェブなんかウェブの技術を勉強するみたいな感じなんですかそれともなんかiosとか他のなんかモバイルとかあると思うんです。けどあああのウェブですね。はいじゃあバックエンドがjavascriptでフロントエンドはなんか普通にhtmlcsみたいな感じで。そうですねバックエンドはJavaでちょっとどうだったかなどこまでやったかなちょっと僕はカリキュラム全部終える前に就職決まっちゃったんであんまり正確なところ覚えてないんですけどJavaとJavaScriptはそこではやってなかったんで普通にHTMLとかCSだった。のかでもやっぱり日本でも未経験でエンジニアになりたいと思ったらそういうちょっと学校行ってましたとかあのあった方が良かった。ってことですねそうですね僕の場合は良かったかなと思いますねあの多分そのなんて言うんでしょうエンジニアっていうそのキャリアをスタートラインに立つまでが多分早くなったと思いますねあのまあその転職を目指す時にいろいろ調べたんですけどまずその独学でなんかちょっとフリーランスとかで案件を取ってみるとかそういう方法も多分あったと思うんですけどまあちょっとそこよりはなんだろうまずその実務経験をなんとかして早く得るみたいなところでそのエージェント経由での転職が一番早いのかな。って思いました前のその日本での会社会社ではどんな技術使われてたん。ですか前はそうですねあのまあ言語で言うとJavaとあとはフロントは確かAngularを使ってましたね。はいじゃあまあ割とモダンな環境で経験を得ることができたかなって感じですか。そうですねはい最初のまあそのSIAだったんで最初の現場はそんな感じで2つ目の現場ちょっと若干レガシーなところに入りましたけどはいあの一通りいろいろ経験させていただきましたこっちに。来てコーナストーンえっとCICCCかなに行ったってことだったんですけどそこのなんだろう学校での勉強はどうでし。たか学校そうですねあのデータサイエンスのコースだったんですけどそのデータサイエンスのコースが新設されたコースなんですよね確か確か僕らの半年ぐらい僕の半年前ぐらいにあの第一期生がスタートして僕らが多分第二期生なのかなそのコースのですねだから結構なんかあのなんでしょう先生方も学校もあまり慣れてなくていろいろと大変なことありました。けどはいちなみにwebとかモバイルとかなんだろうえっとのコースを選ばずにデータサイエンスっていうちょっとなんだろう変わったというかに行ったのには何か理由あるんですか?安いのとあとはその学校に通う期間が短いことです。かねどのぐらい短くなるんですか?ウェブだと多分1年行って1年のコープビザみたいなのが出ると思うん。ですけどはいデータサイエンスは9ヶ月9ヶ月でしたねおーはいはいはいちょっとあのはいあの最初にフロックに相談した時にあのwebかなwebのコースもいろいろあの教えていただいたんですけどまあ1年なんか早く働きたいなみたいなそういう結構単純なあとはお金の問題とあのまあだからデータサイズすごい安かったと思うんですよね比較的ですけどはいまあで。も経験者ですからねなんかわざわざもう1回戻ってHTMLとかしなくてもねいいやってなりますよね普通。そうですねちょっと英語で学んだらどうなるのかなみたいなところに興味はあったんですけどちょっとそこはやめ。ましたなんか前に撮った前にポッドキャストで出てもらった人でエンジニアでデザインの方に行ったっていう人が何人かなのかなそういうねちょっと代わり金を受けてみたいなデータサイエンスの知識はなんかプロダクトエンジニアみたいなやってる時に生きるのかはわかんないけどまあなんかその人はデザインだったからまあフロントエンドとちょっとまあ互換性もあるしみたいな感じだったんでなんかどういうことが理由だったのかなと思うけどじゃあ9ヶ月ビザでこれここからその9ヶ月後というかそのそのビザが切れた後はどういうふうになんだろうする予定なんです。かあのワーホリに切り替える予定に。はしてますはいじゃあまあワーホリ一応今2年なのかな2年使ってみたいな予定ではいるいや。1年ですねちょっと年齢的に多分2回目が使えないんで正直あんまりこう長期計画というかあのできるだけ長くみたいなところあんまり考えずに来た感じはありましてはいなんてでもそういう。人が多いんじゃないですかね僕も別に2年ぐらいかなって思ってたら、今8年目なんですけど。そういう、。そう、。なんか結局なんかいろいろ状況が変わるんで、なんかあんまり考えてなかったですね。なんかカナダは結構まあ移民政策とかもあって、なんかずっとなんかその時々で結構政策も変わるし、なんか物価もどんどん上がっていくから、ずっと生きていきたい国かはわかんないですからね。あんまりなんか長く考えてもしょうがないのかなみたいな気もするけど、。なんかでもフロックに相談される方ってあの結構なんか永住権を視野に入れている方が多いのかなって勝手なイメージをしてたんですけどそれって。どうなんですかなんかえっとやっぱり2社目とか3社目とか行こうとするとまずまあ2社目1年経験した後にまあちょっとは掘りなのかまあビザの状況がまあビザの残り期間が短くなってきてって言うとやっぱりちょっと転職しづらいっていうのがまあ一つとあとはやっぱりその永住権ある人だと長く働いてもらえるかなみたいな会社もあるしその会社としてビザ出してませんよっていうところだとそういう人たちが取れないじゃないですかそういうので何だろうやっぱり転職を考えるのであればやっぱ永住権あった方がいいよねみたいなあとはなんかやっぱりちょっと給料にも関係してくるのかなだからなんかその永住したいから永住権っていうよりはキャリアのことを考えて永住権みたいな人も多いのか。なっていう印象カナダで年老いてからカナダに住みたいって人は聞いたことがないので多分りょうさんが言ったみたいに本当にツールとして選択肢としてあればいいなっていう人。がほとんどかなって思います。で実際住んでみたらカナダ確かに永住はね厳しそうですよね。そうなんですか?このポッドキャスト聞いている方は今どう思っているのかわからないですけど。違うんだけど。カナダです。なんだろうな、若い人の国なのかなって思います。政治家も若いですし、若い人のための人たちが暮らしている若い人たちの国みたいな。例えば、医療面が弱かったりだとか、やっぱり歳とってくると医療面強くないとちょっと、こっちとしては困っちゃうじゃないですか。がんになった人とかが結構なんだろう診療というかその診察を受けるのに待たされてでその間にぽっくりみたいな話も結構聞くんでこっちだとなるほどなんかそれに対して日本は結構年折りの国って言うとすごい言い方悪くなっ。ちゃう高齢化社会ですかまあまあ。充実してますよね高齢。化社会高齢化社会だからやっぱり高齢方にすごいサービスがいい国ではあるのかなあと政治家もねやっぱ上の人なんでやっぱ年上のその高齢の人が考えることは高齢の人にいい社会になるのかなって僕は思ってるんでなんか若い時はかなりいて年取ったら日本に行くのがいいのかなってちょっと個人的には思ってるんですけどなるほど、。お二方の意見が一致してそうなのがすごく。参考になるかもしれないですね。医療考えたらね、本当に不安しかないですよね、。カナダは。ただなんか、子育て考えると結構、カナダの方がいい、バンクーバーの方がいいっていう人の意見もあるんで。それはなんか、僕も知り合いに聞きましたね。難しいですね。子育てはすごく、カナダはすごくしやすいっていう。具体的にどういうことなのかもわかんないですけど、子育てがしやすいって言ってました。お金の面が一つかな。高校生ぐらいまでまずあんまお金かかんないのと、大学も、公立みたいなところ行けば、あんまりかからないのかな。あと、けっこうその、妊婦さんだったりとか、あと、子供いる人の家庭に対してのけっこう、支援みたいなのがけっこう充実してるんじゃないかな。僕もまあ、子供いないんでわかんないですけど、なんかそういうふうに言われてますよね。なるほど。あとはなんか、なんだろう、日本と違ってあんまりストレス…子供…なんか日本って東京とか特に子供でもなんかストレス社会じゃないですか。なんか一部行かせたりとか、あとその、なんていうの、いい学校に行かなきゃいけないだとか、そういうのこっちあんまりないからとか、あとはなんか、多人種がいるから、まああんまり差別もないですしみたいな、あとはまあね、日本人的にはまあなんか英語喋れる、あの子供が英語喋れるようになるみたいなのも、まあベネフィットのひとつの。なるほどなるほどまあまだまだちょっと先のことはわかんないですけどそこから行きますかで、ちょっと就職について話していきたいなと思うんですけど9ヶ月で座学の期間が終わったと思うんですけどどのぐらい前から就職の準備みたいなのはされ。たんですかえっとですねえっとなんだ8月はESLに通ってたんでデータサイエンスのコースが始まったのは9月からなんですけど割とその9月始まってすぐぐらいからやり始めたんじゃないかなと思いますなんでかっていうと同じコースにフロック経由で来た方が何人かいましてその中の何人かがすごくモチベーション高くですねもうすぐ就職活動始めてて結構影響されたというかやらないとなみたいので始めましたね。その準備っていうのは具体的にはどういうことをされたんですか?具体的にはまずレジュメの整備ですねそこだと思いますね最初にやったの。はもういきなりレジュメを送り始めちゃったんですか?そうですねまず送ってみようっていうところで全然返ってこないんですけどとりあえずそういう感触を確かめるだけでも意味はあったのかな。と思いますねでもめっちゃいいと思います結構ギリギリになって送り始めちゃうとそれでまず絶望してちょっと時間経っちゃってでちょっと直していくかみたいなのに時間かかっちゃうと思うんで。学生始まってすぐにレジュメ送ると学生期間って働けないじゃないですかそういうのって会社側わかっててもう全くなんだろう考慮してくれなくなっちゃうとかあるのか。なとかいやでもわざわざ学校のこと書かないと思うんで書く人もいるのかもしれないけどまあなんかうんだってその人が働いあの学校行ってるかどうかってあんま気にし。なさそうじゃない?返事返ってこなかった理由にはもしかしてそういう現実的に働けないじゃんこの人って思われたのかなとか思ったりしたけど。一応、その学校のことは書かないようにしてたんで、たぶん知らないと思うんですよね。ただ、結局一番難しいのが、なんで帰ってこないのかがわからない。でも、2024年、去年の8月とかだったら、すっごいマーケット悪かったというか、全然ポジションもなかった気がします。はい、なんかその、。はい、。そういう話をずっと聞いて。ましたなんか具体的にはどのぐらい送られて、どのぐらい返信返ってきたとかってわかります?えーと、たしか、はい、たぶん合計、まぁちょっとあの、inkedILのクイックアプリでしたっけ、あの簡単に送れるやつとかも含めると多分70とか80件ぐらい送ったんじゃないかなと思うんですけど2件かな?こうやって来たのあとは別のアプローチとしてLinkedIでリパラルくれってお願いしまくるみたいなそういうこともなんかやりましたね。その2件はどうされたんですかその後は。えっとまあどっちも結局ダメだったんですけどあの1件はレジュメ通ってじゃあ次のステップですっていうことであ違うなごめんなさい2件か2件まあどっちも同じようなプロセスでレジュメ通ったね次のプロセスであのテスト受けてくださいみたいなあのなんて言うんですかウェブテストですかねあの結構技術的な質問とかがあるようなテスト受けてくださいっていうので受けたんですけどちょっとそのテストの結果が悪かったのかどうかまあさておきまあそれでその後連絡が来ずっていうのであとはそのリンクトインで色々メッセージを送ってそこも確か2件かなあのじゃあちょっとうちの会社リファラルしてみるよみたいのでメッセージ返信いただいてその2件のうち1件はトロントのリロケーションが必要ですみたいな言われちゃって学校始まったばっかりだったので、ちょっとこれは残念だけど無理だなって思うので、進まず。リクルーターと話したりはされましたか?電話とかメールとかで。はい、トロントの県はリクルーターの方と電話で話しましたね。それとあれば、学校行き始めてすぐ、結構まだちゃんとした就職活動の前に、レジュメまで準備して電話でのリクルーターのやり取りをするっていうところまでができたのであれば結構意味はあったのかなと思うんですけどどうでした?ちゃんとした就職活動を開始するときにそこら辺が役立ったなみたいなのは。ありましたか?そうですねまあさっきのお話の通りですね最初にちょっとあのこれ難しいんだなっていうのを知っておくってのがまず一番大事だったのかなって思ってましてあのまあ結構あれですよね始める前ってなんとなくこう楽観的な気持ちで始めるんですよね僕の場合だけかもしれないですけどいやみんなそうだと思い。ます特に日本人は行けるん。じゃないかなみたいな感じで始めるんですけど全然帰ってこなくてこれまずいなみたいなそういう、。はい、。最初にそういうのを知っておくのがまず、すごくメンタル的な意味でも、モチベーション的な意味でも大事だったのかなと思います。レジュメが返ってこない以外には、なんか障壁になったこととかありますか?アルゴリズムのテストだったりとか、ペアコーディングだったりとか、インタビューのプロセスで。えっと結局何ですかねちゃんとした技術面接とかに進めてないのでなんかあんまりあの参考なんていうかこれが役に立ったみたいなないんですけどなんかはいリートコードとかであるアルゴリズムの勉強まあ進めてたんですけど結局あれもなんかこれどれぐらいあればいいのかなみたいなちょっとなんかわかんなくなっちゃったりとかしてまああのなんて言うんですかねこれが役に立ったみたいな、ちょっとあまり言えないかもしれないですね。今の仕事にたどり着いた時に、別にそこまでアルゴリズムは必要なかったっていう感じだったんですね。結局そうですね今の仕事も技術面接はあったんですけど確かにそこでアルゴリズムの問題出てなんかあんまりちゃんと緊張もしてたし解けなくてで結局後日あのフォローアップで本当はこうだったこうすればよかったみたいなのを送ってメールでそれでなんかちょっとそれが評価されたかわからないですけどあの雇っていただきました。ちょっとレジュメのパートに戻るんですけどレジュメでその帰ってこないってことを知ったっていうことだったんですけどその後何だろうそれに対するアクションみたいなのはなんかどういうことをされたんですか結構みんなそこ詰まるところでそこに詰まった場合はやっぱり帰っちゃう人っていっぱいいると思うんですけどそこから何だろう返信がまあ帰ってきたというかまあ今はあの会社で働かれてると思うんですけどなんかそこら辺でどういうアクションを起こされた。んですかえっとさっきお話ししたその同じコースにいるフロック経由で特効された方が結構そのなんだろうレジュメの改善トライアンドエラーみたいのを繰り返して結構その企業から返信をもらっていましてでそのそうそうで自分のレジュメとどう違うのかなみたいなところでちょっと見させてもらったりとかまあ単純にその僕のレジュメをその見てもらってちょっとここが良くないよねみたいなアドバイスもらったりとかでまあそういうので少しあのブラッシュアップされたかなと思いますね。レジュメ以外にも何か準備されたこととかはありますか?多分、LinkedIとかGitHubとかいろいろやれることってあると思うんですけどどんなことされましたか?そうですね今のですごく思い出しましたなんかすごい忘れてたんですけどリンクトインでコネクション増やすっていうのはすごくやりましたねあのまずえっと確かリンクトインってコネクションが500以上あるとなんかなんですかリクルーターの検索に引っかかりやすくなるみたいななんかそういう話を聞いててちょっと本当かどうかわかんないですけどそれでとりあえず500人以上まずコネクション作ろうというのをポチポチやって確かに500人超えたぐらいからリクルーターからたまにメッセージくるようになったりとか就職した後だったんですけどそれはそういうのがありましたねあとはGitHubもそうですねちょっとポートフォリオ的なものを作ってみたりとかでなるべく実際に就職するときに見せれるような状態にはしておこうかなというので少しずつ準備というか整理するようにはしてました。今の会社の面接というかインタビューの流れを教えていただいてもいい。ですかはい今の会社はリファラルだったんですけれども結局その面接は1回だけでその面接で採用していただきましたが2時間ぐらいやって1時間そのコーディングちょっと問題解いてくれって言われて解いてで残り1時間ぐらいはその経歴の話ですね一番その面接で聞かれたというか印象に残っているのはスタートアップ企業みたいな感じなので結構その環境とかあのなんていうんですか状況がすごく変わりやすいとそういったそのなんていうんですかねクイックな環境変化についてこれるかみたいなすごいそういうなんていうんですか適応能力をなんか重視されましたね面接。で。レファラルは誰からもらったんですか?それはですね同じデータサイエンスのコースの先にその会社に入った人から頂きましてさっき話してた人とはまた別の人なん。ですけどその人は同じタイミングで学校を始められた人なんですか?それとも前とか?じゃあその人が働き始めてどのどのぐらいとかわかります?えっと多分3ヶ月ぐらい経ってからだと思いますねその。人がはいでその人のレファラルもらってえっとじゃあそのレファラルもらってもうなんだろう1回目で2時間の面接があった感じですねそう。ですね1回目で2。時間でしたねはいリファラルだと普通のえっと面接のフローと変わるんですよねきっと。なんかですねちょっと会社の規模が結構コンパクトなのもあってその辺があんまり定まってないというかなんて言うんでしょう通常のフローみたいなの。があんまりないのでその人の適性とかによってちょっと変わったりするかもみたいな感じなのかななるほど。そうだと思います最初から。技術インタビューがあったということなんですけどどういう立場の人が面接して。くれたんですか今のボスですねその人は今の会社のCTOになります。ねじゃあもうマネージャーの立場の人みたいな感じなんです。ねそうですねCTO出てきたらビビりますよねなんか事前にどの人がインタビューするとかって情報分かってたりしてました私が演説今の会社私が働いてる会社で受けた時はあの面接官の名前みたいなのもEメールでくれてて事前にLinkedIで検索したりとかしてたんですけど。はいあの一応教えてもらってましてで何だろうctoって言っても結構なんて言うんですかねまあ距離が近い感じなのであのまあ結局誰が出てきても緊張するんですけどあんまりそのctoだからみたいなのはなかったかもしれ。ないですねでも僕も一社目結構小さい会社だったんでそれどんな感じだったかなctoというかなんて言うんだっけうんctoだったかな忘れたけどまあ確かにその小さい会社だとあんまりねなんだろうCTOだからと言ってなんかスッてみたいな感じでもないしなんかあんまりまあでも緊張しますよね誰が来てもそこはまあしょうがないのかなはい。リモートだったのもあってすごくなんかやりづらいというか緊張はしましたねで。その後はどんな感じのフロー。だったんですかそうですね結局面接受けて1週間ぐらいえっとまぁなんかなんでしょう多分向こうで検討したのかなわからないですけど1週間ぐらい経ってからあのじゃあちょっとトライアルでまず1ヶ月ぐらいあの働いてくれっていうことであのえっとそうですね契約コントラクトで最初は入りましたで、。そのなんかオファーみたいなのはメール、じゃあその面接1回やって、その後すぐにオファーみたいなのをもらえる、そのコントラクトの1ヶ月のオファーみたいなのをもらえたと。かそうですねで結構なんか割と適当でなんかその給料とかそのなんだろうトライアルの期間とかもあんまりちゃんと教えてもらえなくてなんかとりあえずじゃあいつから働けるんだみたいなメールでもらってこれなんか怪しいなって思って一応その僕の方からあのじゃあ給料はこれであの週何十時間の契約でこれでいいかみたいな一応確認していいよみたいな感じではい割とあのなんて言うんですかねあの緩い感じで働き。始めましたねドキュメントみたいなドキュサインみたいなのがあったわけではなくなかったですえーそうなんだそしたら結構いいところ話したんですけど前半は最後に年収について言える範囲で教えていただきたいと思いますはい。難しいですよね年収言うの。ってなんかUSで払われてるんですよね?あれ?はい、US企業で働いてるんですけど、実体としては何て言うんですかね、EORっていうのを使ってカナダの企業の従業員みたいな感じで働いてます。じゃあ、支払いはカナダドル?支払いはカナダドルに変えられてます。残念ながら。USドルでもらいたいんですけど。一応、レンジで言うと、あー難しいな。なんかジョブポストのレンジとかでもいいですけどね。もしあれはでもまあUSドルでまあ100Kからみたい。な感じですすごいちなみにインターミレートのあれなのかないや。シニアですねシニアねで結局あの最初トライアルで1ヶ月入ってその後6ヶ月半年ぐらいですかねあのコントラクトで働きましてなんか半年ぐらい経ってからちょっとお前あのどうだとあの正社員というかそのパーマネントポジションどうだみたいな急に言われてなんかあんまりそのなんていうか自分の中でそういう準備というかなんかなんて言うんですかねあんまり想定してなくてなんかオッケーオッケーみたいな感じで言ってたらどんどんなんか話が進んじゃって今こういう。感じになってます正社員になったタイミングで金額とか変わったんですか変わり。ましたはい増えるんですかちなみに増えましたそれであのさっきの100系からみたいなポジションになりましたね。いいですねUSでだったらあでもカナダ通りになっ。ちゃうのかコントラクトって僕正社員よりも高いイメージだったんだけどなんか日本だとねそんなことないのかななんかフリーランスって結構高いじゃないですかそんなことはないのかな結構そこらへんもふわーっとした感じなのかなわかんないけどいや。全然そんなことなかったですねあの多分コントラクトだったらもう多分日本のあのフリーランスの方の方がもらっている人は結構いると思いますそし。たらちょっと前半はこのぐらいで切りたいと思いますありがとうござい。ましたありがとうございましたと。いうことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "今回はすぐるさんに来ていただきましたよろしくお願いし。",
      "start": 8,
      "end": 3149,
      "timestamp": "00:00"
    },
    {
      "speaker": "Suguru",
      "text": "ますよろしくお願いしますまず。",
      "start": 3149,
      "end": 6611,
      "timestamp": "00:03"
    },
    {
      "speaker": "Ryo",
      "text": "はじめに経歴から簡単に経歴。",
      "start": 6611,
      "end": 8852,
      "timestamp": "00:06"
    },
    {
      "speaker": "Suguru",
      "text": "から教えてくださいはい経歴そうですねなんかどれぐらいのボリュームで話せばいいのかまあ。",
      "start": 8852,
      "end": 14595,
      "timestamp": "00:08"
    },
    {
      "speaker": "Ryo",
      "text": "よくわからないんですけど大学卒業した後とか最初。",
      "start": 14595,
      "end": 18696,
      "timestamp": "00:14"
    },
    {
      "speaker": "Suguru",
      "text": "の就職からとかそんな感じですねはいそうですねもともと大学は文系でして新卒でメーカーに総合職として入社しました4年ぐらいそこで営業として働いてましてその後大体コロナ終わりぐらいですかねエンジニアとして転職して独立系のSIRで3年半ほどエンジニアとして働きましたでえっと2024年の7月ですねカナダのバンクーバーに特効しまして現在はアメリカにあるまあサースの企業ですかねエンジニアとしてフルリモートで働いてますはいなんかマイアミ。",
      "start": 18696,
      "end": 64494,
      "timestamp": "00:18"
    },
    {
      "speaker": "Ryo",
      "text": "に会社あるんですかちょっとリンクでいい見させてもらっ。",
      "start": 64494,
      "end": 67478,
      "timestamp": "01:04"
    },
    {
      "speaker": "Suguru",
      "text": "たんですけどなんか一応マイアミにあるっぽいんですけどなんかあの会社の本部みたいなところあるんですけどなんか多分出社している人はいなくてもう各地からフルリモートでみんな働いている感じですねそうなんだ。",
      "start": 67478,
      "end": 82106,
      "timestamp": "01:07"
    },
    {
      "speaker": "Ryo",
      "text": "じゃああんまり行く機会とかはないんですか?なんかマイアミ行くの良さそうだなとか思ってた。",
      "start": 82106,
      "end": 87169,
      "timestamp": "01:22"
    },
    {
      "speaker": "Suguru",
      "text": "けどいやなんかそうですねたまにというか多分1年に1回ぐらいなんか集まって会議みたいのしてるみたいなんですけどはい僕はまだ行く。",
      "start": 87169,
      "end": 95994,
      "timestamp": "01:27"
    },
    {
      "speaker": "Senna",
      "text": "機会はないですね結構時差ありますよねマイアミだったら。",
      "start": 95994,
      "end": 101736,
      "timestamp": "01:35"
    },
    {
      "speaker": "Suguru",
      "text": "そうですねなんか結構本当にいろんなタイムゾーンから働いててまあ基本はそのみんなアメリカ基本的にアメリカに住んでる人が多いんですけどまあpsdだったりあるいはまあえっとestだったりそのタイムゾーンがみんな違っててあんまりその時差を意識するタイミングないですねなんかみんな自由に働いてます。",
      "start": 101736,
      "end": 121693,
      "timestamp": "01:41"
    },
    {
      "speaker": "Ryo",
      "text": "ね独立系の日本の会社かなって働いてたと思うんですけど、。",
      "start": 121693,
      "end": 129441,
      "timestamp": "02:01"
    },
    {
      "speaker": "Suguru",
      "text": "それはですね多分あのどっかでフロックの記事を見たんだと思うんですよねなんかいつだったか本当わからないんですけど多分エンジニアに就職転職してすぐぐらいに記事を見てあのあそのカナダでエンジニアとして働くみたいな選択肢もあるんだなぁみたいなのがすごく頭に残っててでなんて言うんでしょうねまあもともと僕はでも営業として働いてたこともあってなんか海外で働くって言ってもその営業だと全然なんか働いてるイメージが持てなかったんですけどだからエンジニアだと結構具体的にまあそのなんて言うんですかねまあ定食じゃないですけどそういうスキルを持って働ける海外でも貼ってやっていけるのかなみたいなそういうイメージがすごくできたんでなんかいつか行ってみようかなぁみたいなその最初の時はすごくあの頭でぼんやりと思ってまし。",
      "start": 131885,
      "end": 189439,
      "timestamp": "02:11"
    },
    {
      "speaker": "Ryo",
      "text": "たねもともとなんか海外で働きたいみたいな思いみたいなのあったんですかは何。",
      "start": 189439,
      "end": 195701,
      "timestamp": "03:09"
    },
    {
      "speaker": "Suguru",
      "text": "かうーんとあんまりなかったんですよねっていうのもなんでしょううーんまあさっきも言ったようにその営業職だったのもあってなんか全然海外で働くイメージが持てなかったのとまあ日本割と好きですしなんかこのまま日本で過ごすのかみたいな感じだったんですけどまあ一方でその学生の時に留学行ってみたかったなぁみたいな気持ちをずっとあってでそのまあ転職エンジニアに転職してこれってもしかして海外で働いてみるのもアリなのかなみたいなそういうのがだんだんちょっとイメージが具体的になってきたって感じだと。",
      "start": 195701,
      "end": 235280,
      "timestamp": "03:15"
    },
    {
      "speaker": "Ryo",
      "text": "思いますそうするとじゃあ特にそれまで英語の準備とかはせずに来たと思うんですけど英語はどういうふうに習得された。",
      "start": 235280,
      "end": 246071,
      "timestamp": "03:55"
    },
    {
      "speaker": "Suguru",
      "text": "んですか元々英語苦手ではなくて割と学校のテストとかそういうレベルですけど得意ではあったんで文法とかそういうところは結構わかってたんですけど喋りのところがどうしても準備必要だなっていうところでオンライン英会話ですねオンライン英会話でしよう準備はしましたで実際準備し始めたのがあのなんか特効の準備とか何もその計画とかする前にちょっとまず英語を勉強しようかなみたいのでとりあえず英語から始めようということであの特効の多分2年ぐらい前ですかねオンライン英会話を始めてそこでカラメソッドっていうのがあるんですけどちょっとご存知かわかりませんけど講師が言った英語をそのままリピートするみたいなとにかく英語に口を慣れさせるレッスンみたいなそういうので結構準備していまし。",
      "start": 246071,
      "end": 300276,
      "timestamp": "04:06"
    },
    {
      "speaker": "Ryo",
      "text": "たねシャドーウィングみたいな感じですか?",
      "start": 300276,
      "end": 303728,
      "timestamp": "05:00"
    },
    {
      "speaker": "Suguru",
      "text": "そうですねシャドーウィングですね。",
      "start": 303728,
      "end": 305619,
      "timestamp": "05:03"
    },
    {
      "speaker": "Ryo",
      "text": "それはクラスみたいなところに行ってやるんですか?それともオンラインみたいな感じなんですか?",
      "start": 305619,
      "end": 313748,
      "timestamp": "05:05"
    },
    {
      "speaker": "Suguru",
      "text": "あのオンラインですねちょっとまあ本当なんて言うんですかね完全なシャドウイングというよりは何か講師が質問をしてそれに対する答えを言うみたいな感じなんですけどその答え自体は何かあのもともと決まっていて難しいなって言ったんですかね講師も同時に答えるんで、それについていくみたいな。詳しくはカラオメソッドで調べたら出てくるんですけど、ちょっと特殊な勉強法ですよね。今、。",
      "start": 313758,
      "end": 347773,
      "timestamp": "05:13"
    },
    {
      "speaker": "Ryo",
      "text": "カナダの学校行くってなると、TOEICだかIELTSだかみたいなの取らないといけないと思うんですけど、そこらへんはどうやって。",
      "start": 347773,
      "end": 358331,
      "timestamp": "05:47"
    },
    {
      "speaker": "Suguru",
      "text": "準備されたんですか?えっとカナダの学校のcicccですけど入った時は確かデュオリンゴのテストであのヨリンゴのスコアが使えるってことでえっとデュオリンゴのテストを受けまして8確か最初に受けた時が100115点だったかなって入学に出したしか120点必要で5点足りないみたいなでちょっとあああの足りないなーってことで一応1ヶ月か2ヶ月準備してもう1回受けたんですけど結果115点のまま変わらずその5点を埋めるためになんかESL1ヶ月だけ通ってくださいってことでCICCのESLですね1ヶ月だけ通いましたね。",
      "start": 358331,
      "end": 404921,
      "timestamp": "05:58"
    },
    {
      "speaker": "Senna",
      "text": "なんか、経歴のところにちょっと戻っちゃうかもしれないんですけど、日本で営業職されてエンジニアにキャリアシフトした時は、その海外に将来的に行くっていうのを視野に入れて、エンジニアっていう仕事を選んだんですか?",
      "start": 407998,
      "end": 426737,
      "timestamp": "06:47"
    },
    {
      "speaker": "Suguru",
      "text": "いやそれはちょっとなかったですね正直転職した時は全然海外のこととかあまり頭になくてどっちかっていうとそのものづくりが僕もともと好きで音楽作ったりとかあとまぁなんだろうな絵描いたりとかまぁちょっと手を動かしてもの作ったりするのが好きだったんでなんかそういう仕事できないかなーっていうのでエンジニアって結構じゃあ文系からそういうあの新しくスキルを学んで転職ってのは現実的だよねっていうのでエンジニアを選びましたね。",
      "start": 426747,
      "end": 455355,
      "timestamp": "07:06"
    },
    {
      "speaker": "Senna",
      "text": "で、エンジニアやってる間に海外が主要に入ってきたっていう感じですね。",
      "start": 457246,
      "end": 461519,
      "timestamp": "07:37"
    },
    {
      "speaker": "Ryo",
      "text": "はい、。",
      "start": 461519,
      "end": 461830,
      "timestamp": "07:41"
    },
    {
      "speaker": "Suguru",
      "text": "そうですね。フロックさんの記事を見させてもらってですね。",
      "start": 461830,
      "end": 465967,
      "timestamp": "07:41"
    },
    {
      "speaker": "Senna",
      "text": "すごいですねたまたまフロックの記事に出会えるって検索しないと。",
      "start": 465977,
      "end": 470500,
      "timestamp": "07:45"
    },
    {
      "speaker": "Suguru",
      "text": "いやどうやって確かに出会ったのかあんまり覚えてないんですよねでも何かトカシさんの記事だったんじゃないかなあれトカシさんって呼んでいいん。",
      "start": 470500,
      "end": 477665,
      "timestamp": "07:50"
    },
    {
      "speaker": "Ryo",
      "text": "ですかねりょうさんもちろんもちろん名前も明かしてるしリンクでいいんとかも多分出てきちゃうんで全然いいんですね僕の記事なんか引っかかる特徴のある単語使ってたかな使ってない気がするけど。",
      "start": 477665,
      "end": 490835,
      "timestamp": "07:57"
    },
    {
      "speaker": "Suguru",
      "text": "最初に出会った記事はどれか覚えてないですけど、ブログの記事でそういうイメージが湧きましたね。",
      "start": 493090,
      "end": 502104,
      "timestamp": "08:13"
    },
    {
      "speaker": "Ryo",
      "text": "カナダって結構未経験で、エンジニア経験なく未経験のまま来る人って多いと思うんですけど、営業職からエンジニアになった時、てどういうふうに何かみもちろん未経験だったわけじゃないですかあの文系の学校行かれたってことだってどういうふうに勉強されてエンジニアになられた。",
      "start": 502104,
      "end": 525154,
      "timestamp": "08:22"
    },
    {
      "speaker": "Suguru",
      "text": "えっと一応なんかその転職する時に色々調べてどういう道がいいのかなっていうそのなんて言うんですかね最短で転職エンジニアとして転職するにはどうしたらいいんだろうみたいなところを調べて結局あのエージェント好きのスクールみたいなところに通ったっていうとちょっとあれですね登録したっていう感じなんですけどで、そのスクールのカリクラムとかあんまりやらず、参考にしつつちょっと独学でいろいろ勉強したっていうのが準備だったかなと思いますね。",
      "start": 526335,
      "end": 561311,
      "timestamp": "08:46"
    },
    {
      "speaker": "Ryo",
      "text": "どんな教材を使われたんですか?",
      "start": 561311,
      "end": 563311,
      "timestamp": "09:21"
    },
    {
      "speaker": "Suguru",
      "text": "いやもうなんかスクール独自のなんかよくわからない教材ですね。",
      "start": 563311,
      "end": 567863,
      "timestamp": "09:23"
    },
    {
      "speaker": "Senna",
      "text": "それってテッカーアカデミーとかですか?",
      "start": 567863,
      "end": 571084,
      "timestamp": "09:27"
    },
    {
      "speaker": "Suguru",
      "text": "ではないですね。",
      "start": 571084,
      "end": 572865,
      "timestamp": "09:31"
    },
    {
      "speaker": "Senna",
      "text": "そういう系統の?",
      "start": 572865,
      "end": 574322,
      "timestamp": "09:32"
    },
    {
      "speaker": "Suguru",
      "text": "あそうですそんな感じではいあのお金かからないところだったと思いますねあの。",
      "start": 574332,
      "end": 579353,
      "timestamp": "09:34"
    },
    {
      "speaker": "Senna",
      "text": "転職…あお金かからないとこ。",
      "start": 579353,
      "end": 581073,
      "timestamp": "09:39"
    },
    {
      "speaker": "Suguru",
      "text": "あるんだそうそうあの転職してその転職先の企業から多分そのエージェントがお金をもらうみたいなそういうビジネスモデルだったと思いますなんか。",
      "start": 581073,
      "end": 590876,
      "timestamp": "09:41"
    },
    {
      "speaker": "Ryo",
      "text": "どういう内容的にはどんな感じのなんていうんだろう言語とかものを勉強してたんですか一応Java。",
      "start": 590876,
      "end": 599988,
      "timestamp": "09:50"
    },
    {
      "speaker": "Suguru",
      "text": "とあとSQLがありましたね本当Javaとかだとなんだろうポーカーを作ってみようみたいなやつとかあとはいわゆるECサイトショッピングサイトを作りましょうとかSQLも一通りセレクト文だったりそういう基本的なことが書いてあるみたいな全然他でも学べそうな内容がありましたね。",
      "start": 599988,
      "end": 624737,
      "timestamp": "09:59"
    },
    {
      "speaker": "Ryo",
      "text": "ウェブなんかウェブの技術を勉強するみたいな感じなんですかそれともなんかiosとか他のなんかモバイルとかあると思うんです。",
      "start": 625933,
      "end": 631838,
      "timestamp": "10:25"
    },
    {
      "speaker": "Suguru",
      "text": "けどあああのウェブですね。",
      "start": 631838,
      "end": 634260,
      "timestamp": "10:31"
    },
    {
      "speaker": "Ryo",
      "text": "はいじゃあバックエンドがjavascriptでフロントエンドはなんか普通にhtmlcsみたいな感じで。",
      "start": 634260,
      "end": 641987,
      "timestamp": "10:34"
    },
    {
      "speaker": "Suguru",
      "text": "そうですねバックエンドはJavaでちょっとどうだったかなどこまでやったかなちょっと僕はカリキュラム全部終える前に就職決まっちゃったんであんまり正確なところ覚えてないんですけどJavaとJavaScriptはそこではやってなかったんで普通にHTMLとかCSだった。",
      "start": 645708,
      "end": 666344,
      "timestamp": "10:45"
    },
    {
      "speaker": "Senna",
      "text": "のかでもやっぱり日本でも未経験でエンジニアになりたいと思ったらそういうちょっと学校行ってましたとかあのあった方が良かった。",
      "start": 666344,
      "end": 676437,
      "timestamp": "11:06"
    },
    {
      "speaker": "Suguru",
      "text": "ってことですねそうですね僕の場合は良かったかなと思いますねあの多分そのなんて言うんでしょうエンジニアっていうそのキャリアをスタートラインに立つまでが多分早くなったと思いますねあのまあその転職を目指す時にいろいろ調べたんですけどまずその独学でなんかちょっとフリーランスとかで案件を取ってみるとかそういう方法も多分あったと思うんですけどまあちょっとそこよりはなんだろうまずその実務経験をなんとかして早く得るみたいなところでそのエージェント経由での転職が一番早いのかな。",
      "start": 676437,
      "end": 713879,
      "timestamp": "11:16"
    },
    {
      "speaker": "Ryo",
      "text": "って思いました前のその日本での会社会社ではどんな技術使われてたん。",
      "start": 713879,
      "end": 720524,
      "timestamp": "11:53"
    },
    {
      "speaker": "Suguru",
      "text": "ですか前はそうですねあのまあ言語で言うとJavaとあとはフロントは確かAngularを使ってましたね。",
      "start": 720524,
      "end": 729670,
      "timestamp": "12:00"
    },
    {
      "speaker": "Ryo",
      "text": "はいじゃあまあ割とモダンな環境で経験を得ることができたかなって感じですか。",
      "start": 729670,
      "end": 737530,
      "timestamp": "12:09"
    },
    {
      "speaker": "Suguru",
      "text": "そうですねはい最初のまあそのSIAだったんで最初の現場はそんな感じで2つ目の現場ちょっと若干レガシーなところに入りましたけどはいあの一通りいろいろ経験させていただきましたこっちに。",
      "start": 737530,
      "end": 751895,
      "timestamp": "12:17"
    },
    {
      "speaker": "Ryo",
      "text": "来てコーナストーンえっとCICCCかなに行ったってことだったんですけどそこのなんだろう学校での勉強はどうでし。",
      "start": 751895,
      "end": 758998,
      "timestamp": "12:31"
    },
    {
      "speaker": "Suguru",
      "text": "たか学校そうですねあのデータサイエンスのコースだったんですけどそのデータサイエンスのコースが新設されたコースなんですよね確か確か僕らの半年ぐらい僕の半年前ぐらいにあの第一期生がスタートして僕らが多分第二期生なのかなそのコースのですねだから結構なんかあのなんでしょう先生方も学校もあまり慣れてなくていろいろと大変なことありました。",
      "start": 758998,
      "end": 793144,
      "timestamp": "12:38"
    },
    {
      "speaker": "Ryo",
      "text": "けどはいちなみにwebとかモバイルとかなんだろうえっとのコースを選ばずにデータサイエンスっていうちょっとなんだろう変わったというかに行ったのには何か理由あるんですか?",
      "start": 793144,
      "end": 807371,
      "timestamp": "13:13"
    },
    {
      "speaker": "Suguru",
      "text": "安いのとあとはその学校に通う期間が短いことです。",
      "start": 807371,
      "end": 811475,
      "timestamp": "13:27"
    },
    {
      "speaker": "Ryo",
      "text": "かねどのぐらい短くなるんですか?ウェブだと多分1年行って1年のコープビザみたいなのが出ると思うん。",
      "start": 811475,
      "end": 821646,
      "timestamp": "13:31"
    },
    {
      "speaker": "Suguru",
      "text": "ですけどはいデータサイエンスは9ヶ月9ヶ月でしたねおーはいはいはいちょっとあのはいあの最初にフロックに相談した時にあのwebかなwebのコースもいろいろあの教えていただいたんですけどまあ1年なんか早く働きたいなみたいなそういう結構単純なあとはお金の問題とあのまあだからデータサイズすごい安かったと思うんですよね比較的ですけどはいまあで。",
      "start": 821646,
      "end": 851005,
      "timestamp": "13:41"
    },
    {
      "speaker": "Senna",
      "text": "も経験者ですからねなんかわざわざもう1回戻ってHTMLとかしなくてもねいいやってなりますよね普通。",
      "start": 851005,
      "end": 861289,
      "timestamp": "14:11"
    },
    {
      "speaker": "Suguru",
      "text": "そうですねちょっと英語で学んだらどうなるのかなみたいなところに興味はあったんですけどちょっとそこはやめ。",
      "start": 861289,
      "end": 867773,
      "timestamp": "14:21"
    },
    {
      "speaker": "Ryo",
      "text": "ましたなんか前に撮った前にポッドキャストで出てもらった人でエンジニアでデザインの方に行ったっていう人が何人かなのかなそういうねちょっと代わり金を受けてみたいなデータサイエンスの知識はなんかプロダクトエンジニアみたいなやってる時に生きるのかはわかんないけどまあなんかその人はデザインだったからまあフロントエンドとちょっとまあ互換性もあるしみたいな感じだったんでなんかどういうことが理由だったのかなと思うけどじゃあ9ヶ月ビザでこれここからその9ヶ月後というかそのそのビザが切れた後はどういうふうになんだろうする予定なんです。",
      "start": 867773,
      "end": 910585,
      "timestamp": "14:27"
    },
    {
      "speaker": "Suguru",
      "text": "かあのワーホリに切り替える予定に。",
      "start": 910585,
      "end": 913185,
      "timestamp": "15:10"
    },
    {
      "speaker": "Ryo",
      "text": "はしてますはいじゃあまあワーホリ一応今2年なのかな2年使ってみたいな予定ではいるいや。",
      "start": 913185,
      "end": 921271,
      "timestamp": "15:13"
    },
    {
      "speaker": "Suguru",
      "text": "1年ですねちょっと年齢的に多分2回目が使えないんで正直あんまりこう長期計画というかあのできるだけ長くみたいなところあんまり考えずに来た感じはありましてはいなんてでもそういう。",
      "start": 921271,
      "end": 936684,
      "timestamp": "15:21"
    },
    {
      "speaker": "Ryo",
      "text": "人が多いんじゃないですかね僕も別に2年ぐらいかなって思ってたら、今8年目なんですけど。",
      "start": 936684,
      "end": 944174,
      "timestamp": "15:36"
    },
    {
      "speaker": "Suguru",
      "text": "そういう、。",
      "start": 944174,
      "end": 944634,
      "timestamp": "15:44"
    },
    {
      "speaker": "Ryo",
      "text": "そう、。",
      "start": 944634,
      "end": 944854,
      "timestamp": "15:44"
    },
    {
      "speaker": "Suguru",
      "text": "なんか結局なんかいろいろ状況が変わるんで、なんかあんまり考えてなかったですね。",
      "start": 944854,
      "end": 950818,
      "timestamp": "15:44"
    },
    {
      "speaker": "Ryo",
      "text": "なんかカナダは結構まあ移民政策とかもあって、なんかずっとなんかその時々で結構政策も変わるし、なんか物価もどんどん上がっていくから、ずっと生きていきたい国かはわかんないですからね。あんまりなんか長く考えてもしょうがないのかなみたいな気もするけど、。",
      "start": 950818,
      "end": 969477,
      "timestamp": "15:50"
    },
    {
      "speaker": "Suguru",
      "text": "なんかでもフロックに相談される方ってあの結構なんか永住権を視野に入れている方が多いのかなって勝手なイメージをしてたんですけどそれって。",
      "start": 969487,
      "end": 977913,
      "timestamp": "16:09"
    },
    {
      "speaker": "Ryo",
      "text": "どうなんですかなんかえっとやっぱり2社目とか3社目とか行こうとするとまずまあ2社目1年経験した後にまあちょっとは掘りなのかまあビザの状況がまあビザの残り期間が短くなってきてって言うとやっぱりちょっと転職しづらいっていうのがまあ一つとあとはやっぱりその永住権ある人だと長く働いてもらえるかなみたいな会社もあるしその会社としてビザ出してませんよっていうところだとそういう人たちが取れないじゃないですかそういうので何だろうやっぱり転職を考えるのであればやっぱ永住権あった方がいいよねみたいなあとはなんかやっぱりちょっと給料にも関係してくるのかなだからなんかその永住したいから永住権っていうよりはキャリアのことを考えて永住権みたいな人も多いのか。",
      "start": 977913,
      "end": 1026286,
      "timestamp": "16:17"
    },
    {
      "speaker": "Senna",
      "text": "なっていう印象カナダで年老いてからカナダに住みたいって人は聞いたことがないので多分りょうさんが言ったみたいに本当にツールとして選択肢としてあればいいなっていう人。",
      "start": 1026286,
      "end": 1038074,
      "timestamp": "17:06"
    },
    {
      "speaker": "Ryo",
      "text": "がほとんどかなって思います。",
      "start": 1038074,
      "end": 1039595,
      "timestamp": "17:18"
    },
    {
      "speaker": "Senna",
      "text": "で実際住んでみたらカナダ確かに永住はね厳しそうですよね。",
      "start": 1039595,
      "end": 1045398,
      "timestamp": "17:19"
    },
    {
      "speaker": "Suguru",
      "text": "そうなんですか?このポッドキャスト聞いている方は今どう思っているのかわからないですけど。",
      "start": 1047492,
      "end": 1052576,
      "timestamp": "17:27"
    },
    {
      "speaker": "Senna",
      "text": "違うんだけど。",
      "start": 1052576,
      "end": 1054217,
      "timestamp": "17:32"
    },
    {
      "speaker": "Suguru",
      "text": "カナダです。",
      "start": 1054217,
      "end": 1056618,
      "timestamp": "17:34"
    },
    {
      "speaker": "Ryo",
      "text": "なんだろうな、若い人の国なのかなって思います。政治家も若いですし、若い人のための人たちが暮らしている若い人たちの国みたいな。例えば、医療面が弱かったりだとか、やっぱり歳とってくると医療面強くないとちょっと、こっちとしては困っちゃうじゃないですか。がんになった人とかが結構なんだろう診療というかその診察を受けるのに待たされてでその間にぽっくりみたいな話も結構聞くんでこっちだとなるほどなんかそれに対して日本は結構年折りの国って言うとすごい言い方悪くなっ。",
      "start": 1056618,
      "end": 1094841,
      "timestamp": "17:36"
    },
    {
      "speaker": "Senna",
      "text": "ちゃう高齢化社会ですかまあまあ。",
      "start": 1094841,
      "end": 1096441,
      "timestamp": "18:14"
    },
    {
      "speaker": "Suguru",
      "text": "充実してますよね高齢。",
      "start": 1096441,
      "end": 1098662,
      "timestamp": "18:16"
    },
    {
      "speaker": "Ryo",
      "text": "化社会高齢化社会だからやっぱり高齢方にすごいサービスがいい国ではあるのかなあと政治家もねやっぱ上の人なんでやっぱ年上のその高齢の人が考えることは高齢の人にいい社会になるのかなって僕は思ってるんでなんか若い時はかなりいて年取ったら日本に行くのがいいのかなってちょっと個人的には思ってるんですけどなるほど、。",
      "start": 1098662,
      "end": 1126257,
      "timestamp": "18:18"
    },
    {
      "speaker": "Suguru",
      "text": "お二方の意見が一致してそうなのがすごく。",
      "start": 1126257,
      "end": 1129461,
      "timestamp": "18:46"
    },
    {
      "speaker": "Senna",
      "text": "参考になるかもしれないですね。医療考えたらね、本当に不安しかないですよね、。",
      "start": 1129461,
      "end": 1132885,
      "timestamp": "18:49"
    },
    {
      "speaker": "Ryo",
      "text": "カナダは。ただなんか、子育て考えると結構、カナダの方がいい、バンクーバーの方がいいっていう人の意見もあるんで。",
      "start": 1132885,
      "end": 1143862,
      "timestamp": "18:52"
    },
    {
      "speaker": "Suguru",
      "text": "それはなんか、僕も知り合いに聞きましたね。難しいですね。子育てはすごく、カナダはすごくしやすいっていう。具体的にどういうことなのかもわかんないですけど、子育てがしやすいって言ってました。",
      "start": 1143862,
      "end": 1156255,
      "timestamp": "19:03"
    },
    {
      "speaker": "Ryo",
      "text": "お金の面が一つかな。高校生ぐらいまでまずあんまお金かかんないのと、大学も、公立みたいなところ行けば、あんまりかからないのかな。あと、けっこうその、妊婦さんだったりとか、あと、子供いる人の家庭に対してのけっこう、支援みたいなのがけっこう充実してるんじゃないかな。僕もまあ、子供いないんでわかんないですけど、なんかそういうふうに言われてますよね。",
      "start": 1156255,
      "end": 1184046,
      "timestamp": "19:16"
    },
    {
      "speaker": "Suguru",
      "text": "なるほど。",
      "start": 1184046,
      "end": 1185917,
      "timestamp": "19:44"
    },
    {
      "speaker": "Ryo",
      "text": "あとはなんか、なんだろう、日本と違ってあんまりストレス…子供…なんか日本って東京とか特に子供でもなんかストレス社会じゃないですか。なんか一部行かせたりとか、あとその、なんていうの、いい学校に行かなきゃいけないだとか、そういうのこっちあんまりないからとか、あとはなんか、多人種がいるから、まああんまり差別もないですしみたいな、あとはまあね、日本人的にはまあなんか英語喋れる、あの子供が英語喋れるようになるみたいなのも、まあベネフィットのひとつの。なるほどなるほどまあまだまだちょっと先のことはわかんないですけどそこから行きますかで、ちょっと就職について話していきたいなと思うんですけど9ヶ月で座学の期間が終わったと思うんですけどどのぐらい前から就職の準備みたいなのはされ。",
      "start": 1185917,
      "end": 1237777,
      "timestamp": "19:45"
    },
    {
      "speaker": "Suguru",
      "text": "たんですかえっとですねえっとなんだ8月はESLに通ってたんでデータサイエンスのコースが始まったのは9月からなんですけど割とその9月始まってすぐぐらいからやり始めたんじゃないかなと思いますなんでかっていうと同じコースにフロック経由で来た方が何人かいましてその中の何人かがすごくモチベーション高くですねもうすぐ就職活動始めてて結構影響されたというかやらないとなみたいので始めましたね。",
      "start": 1237777,
      "end": 1280210,
      "timestamp": "20:37"
    },
    {
      "speaker": "Ryo",
      "text": "その準備っていうのは具体的にはどういうことをされたんですか?",
      "start": 1281912,
      "end": 1285864,
      "timestamp": "21:21"
    },
    {
      "speaker": "Suguru",
      "text": "具体的にはまずレジュメの整備ですねそこだと思いますね最初にやったの。",
      "start": 1285864,
      "end": 1290397,
      "timestamp": "21:25"
    },
    {
      "speaker": "Senna",
      "text": "はもういきなりレジュメを送り始めちゃったんですか?",
      "start": 1290397,
      "end": 1297794,
      "timestamp": "21:30"
    },
    {
      "speaker": "Suguru",
      "text": "そうですねまず送ってみようっていうところで全然返ってこないんですけどとりあえずそういう感触を確かめるだけでも意味はあったのかな。",
      "start": 1297804,
      "end": 1306650,
      "timestamp": "21:37"
    },
    {
      "speaker": "Ryo",
      "text": "と思いますねでもめっちゃいいと思います結構ギリギリになって送り始めちゃうとそれでまず絶望してちょっと時間経っちゃってでちょっと直していくかみたいなのに時間かかっちゃうと思うんで。",
      "start": 1306650,
      "end": 1322319,
      "timestamp": "21:46"
    },
    {
      "speaker": "Senna",
      "text": "学生始まってすぐにレジュメ送ると学生期間って働けないじゃないですかそういうのって会社側わかっててもう全くなんだろう考慮してくれなくなっちゃうとかあるのか。",
      "start": 1325417,
      "end": 1339580,
      "timestamp": "22:05"
    },
    {
      "speaker": "Ryo",
      "text": "なとかいやでもわざわざ学校のこと書かないと思うんで書く人もいるのかもしれないけどまあなんかうんだってその人が働いあの学校行ってるかどうかってあんま気にし。",
      "start": 1339580,
      "end": 1354778,
      "timestamp": "22:19"
    },
    {
      "speaker": "Senna",
      "text": "なさそうじゃない?返事返ってこなかった理由にはもしかしてそういう現実的に働けないじゃんこの人って思われたのかなとか思ったりしたけど。",
      "start": 1354778,
      "end": 1366869,
      "timestamp": "22:34"
    },
    {
      "speaker": "Suguru",
      "text": "一応、その学校のことは書かないようにしてたんで、たぶん知らないと思うんですよね。ただ、結局一番難しいのが、なんで帰ってこないのかがわからない。",
      "start": 1369573,
      "end": 1381503,
      "timestamp": "22:49"
    },
    {
      "speaker": "Senna",
      "text": "でも、2024年、去年の8月とかだったら、すっごいマーケット悪かったというか、全然ポジションもなかった気がします。",
      "start": 1381503,
      "end": 1395267,
      "timestamp": "23:01"
    },
    {
      "speaker": "Suguru",
      "text": "はい、なんかその、。",
      "start": 1395277,
      "end": 1397439,
      "timestamp": "23:15"
    },
    {
      "speaker": "Ryo",
      "text": "はい、。",
      "start": 1397439,
      "end": 1397839,
      "timestamp": "23:17"
    },
    {
      "speaker": "Suguru",
      "text": "そういう話をずっと聞いて。",
      "start": 1397839,
      "end": 1399281,
      "timestamp": "23:17"
    },
    {
      "speaker": "Ryo",
      "text": "ましたなんか具体的にはどのぐらい送られて、どのぐらい返信返ってきたとかってわかります?",
      "start": 1399281,
      "end": 1406627,
      "timestamp": "23:19"
    },
    {
      "speaker": "Suguru",
      "text": "えーと、たしか、はい、たぶん合計、まぁちょっとあの、inkedILのクイックアプリでしたっけ、あの簡単に送れるやつとかも含めると多分70とか80件ぐらい送ったんじゃないかなと思うんですけど2件かな?こうやって来たのあとは別のアプローチとしてLinkedIでリパラルくれってお願いしまくるみたいなそういうこともなんかやりましたね。",
      "start": 1406627,
      "end": 1439389,
      "timestamp": "23:26"
    },
    {
      "speaker": "Ryo",
      "text": "その2件はどうされたんですかその後は。",
      "start": 1439389,
      "end": 1442770,
      "timestamp": "23:59"
    },
    {
      "speaker": "Suguru",
      "text": "えっとまあどっちも結局ダメだったんですけどあの1件はレジュメ通ってじゃあ次のステップですっていうことであ違うなごめんなさい2件か2件まあどっちも同じようなプロセスでレジュメ通ったね次のプロセスであのテスト受けてくださいみたいなあのなんて言うんですかウェブテストですかねあの結構技術的な質問とかがあるようなテスト受けてくださいっていうので受けたんですけどちょっとそのテストの結果が悪かったのかどうかまあさておきまあそれでその後連絡が来ずっていうのであとはそのリンクトインで色々メッセージを送ってそこも確か2件かなあのじゃあちょっとうちの会社リファラルしてみるよみたいのでメッセージ返信いただいてその2件のうち1件はトロントのリロケーションが必要ですみたいな言われちゃって学校始まったばっかりだったので、ちょっとこれは残念だけど無理だなって思うので、進まず。",
      "start": 1443347,
      "end": 1503248,
      "timestamp": "24:03"
    },
    {
      "speaker": "Ryo",
      "text": "リクルーターと話したりはされましたか?電話とかメールとかで。",
      "start": 1503248,
      "end": 1508011,
      "timestamp": "25:03"
    },
    {
      "speaker": "Suguru",
      "text": "はい、トロントの県はリクルーターの方と電話で話しましたね。",
      "start": 1508011,
      "end": 1516266,
      "timestamp": "25:08"
    },
    {
      "speaker": "Ryo",
      "text": "それとあれば、学校行き始めてすぐ、結構まだちゃんとした就職活動の前に、レジュメまで準備して電話でのリクルーターのやり取りをするっていうところまでができたのであれば結構意味はあったのかなと思うんですけどどうでした?ちゃんとした就職活動を開始するときにそこら辺が役立ったなみたいなのは。",
      "start": 1516266,
      "end": 1541840,
      "timestamp": "25:16"
    },
    {
      "speaker": "Suguru",
      "text": "ありましたか?そうですねまあさっきのお話の通りですね最初にちょっとあのこれ難しいんだなっていうのを知っておくってのがまず一番大事だったのかなって思ってましてあのまあ結構あれですよね始める前ってなんとなくこう楽観的な気持ちで始めるんですよね僕の場合だけかもしれないですけどいやみんなそうだと思い。",
      "start": 1541840,
      "end": 1563713,
      "timestamp": "25:41"
    },
    {
      "speaker": "Ryo",
      "text": "ます特に日本人は行けるん。",
      "start": 1563713,
      "end": 1565974,
      "timestamp": "26:03"
    },
    {
      "speaker": "Suguru",
      "text": "じゃないかなみたいな感じで始めるんですけど全然帰ってこなくてこれまずいなみたいなそういう、。",
      "start": 1565974,
      "end": 1573147,
      "timestamp": "26:05"
    },
    {
      "speaker": "Ryo",
      "text": "はい、。",
      "start": 1573147,
      "end": 1573477,
      "timestamp": "26:13"
    },
    {
      "speaker": "Suguru",
      "text": "最初にそういうのを知っておくのがまず、すごくメンタル的な意味でも、モチベーション的な意味でも大事だったのかなと思います。",
      "start": 1573477,
      "end": 1581619,
      "timestamp": "26:13"
    },
    {
      "speaker": "Senna",
      "text": "レジュメが返ってこない以外には、なんか障壁になったこととかありますか?アルゴリズムのテストだったりとか、ペアコーディングだったりとか、インタビューのプロセスで。",
      "start": 1581619,
      "end": 1596492,
      "timestamp": "26:21"
    },
    {
      "speaker": "Suguru",
      "text": "えっと結局何ですかねちゃんとした技術面接とかに進めてないのでなんかあんまりあの参考なんていうかこれが役に立ったみたいなないんですけどなんかはいリートコードとかであるアルゴリズムの勉強まあ進めてたんですけど結局あれもなんかこれどれぐらいあればいいのかなみたいなちょっとなんかわかんなくなっちゃったりとかしてまああのなんて言うんですかねこれが役に立ったみたいな、ちょっとあまり言えないかもしれないですね。",
      "start": 1597324,
      "end": 1624493,
      "timestamp": "26:37"
    },
    {
      "speaker": "Senna",
      "text": "今の仕事にたどり着いた時に、別にそこまでアルゴリズムは必要なかったっていう感じだったんですね。",
      "start": 1624493,
      "end": 1635117,
      "timestamp": "27:04"
    },
    {
      "speaker": "Suguru",
      "text": "結局そうですね今の仕事も技術面接はあったんですけど確かにそこでアルゴリズムの問題出てなんかあんまりちゃんと緊張もしてたし解けなくてで結局後日あのフォローアップで本当はこうだったこうすればよかったみたいなのを送ってメールでそれでなんかちょっとそれが評価されたかわからないですけどあの雇っていただきました。",
      "start": 1635387,
      "end": 1660003,
      "timestamp": "27:15"
    },
    {
      "speaker": "Ryo",
      "text": "ちょっとレジュメのパートに戻るんですけどレジュメでその帰ってこないってことを知ったっていうことだったんですけどその後何だろうそれに対するアクションみたいなのはなんかどういうことをされたんですか結構みんなそこ詰まるところでそこに詰まった場合はやっぱり帰っちゃう人っていっぱいいると思うんですけどそこから何だろう返信がまあ帰ってきたというかまあ今はあの会社で働かれてると思うんですけどなんかそこら辺でどういうアクションを起こされた。",
      "start": 1662405,
      "end": 1690169,
      "timestamp": "27:42"
    },
    {
      "speaker": "Suguru",
      "text": "んですかえっとさっきお話ししたその同じコースにいるフロック経由で特効された方が結構そのなんだろうレジュメの改善トライアンドエラーみたいのを繰り返して結構その企業から返信をもらっていましてでそのそうそうで自分のレジュメとどう違うのかなみたいなところでちょっと見させてもらったりとかまあ単純にその僕のレジュメをその見てもらってちょっとここが良くないよねみたいなアドバイスもらったりとかでまあそういうので少しあのブラッシュアップされたかなと思いますね。",
      "start": 1690169,
      "end": 1727488,
      "timestamp": "28:10"
    },
    {
      "speaker": "Ryo",
      "text": "レジュメ以外にも何か準備されたこととかはありますか?多分、LinkedIとかGitHubとかいろいろやれることってあると思うんですけどどんなことされましたか?",
      "start": 1731072,
      "end": 1741655,
      "timestamp": "28:51"
    },
    {
      "speaker": "Suguru",
      "text": "そうですね今のですごく思い出しましたなんかすごい忘れてたんですけどリンクトインでコネクション増やすっていうのはすごくやりましたねあのまずえっと確かリンクトインってコネクションが500以上あるとなんかなんですかリクルーターの検索に引っかかりやすくなるみたいななんかそういう話を聞いててちょっと本当かどうかわかんないですけどそれでとりあえず500人以上まずコネクション作ろうというのをポチポチやって確かに500人超えたぐらいからリクルーターからたまにメッセージくるようになったりとか就職した後だったんですけどそれはそういうのがありましたねあとはGitHubもそうですねちょっとポートフォリオ的なものを作ってみたりとかでなるべく実際に就職するときに見せれるような状態にはしておこうかなというので少しずつ準備というか整理するようにはしてました。",
      "start": 1741665,
      "end": 1796610,
      "timestamp": "29:01"
    },
    {
      "speaker": "Ryo",
      "text": "今の会社の面接というかインタビューの流れを教えていただいてもいい。",
      "start": 1799695,
      "end": 1804589,
      "timestamp": "29:59"
    },
    {
      "speaker": "Suguru",
      "text": "ですかはい今の会社はリファラルだったんですけれども結局その面接は1回だけでその面接で採用していただきましたが2時間ぐらいやって1時間そのコーディングちょっと問題解いてくれって言われて解いてで残り1時間ぐらいはその経歴の話ですね一番その面接で聞かれたというか印象に残っているのはスタートアップ企業みたいな感じなので結構その環境とかあのなんていうんですか状況がすごく変わりやすいとそういったそのなんていうんですかねクイックな環境変化についてこれるかみたいなすごいそういうなんていうんですか適応能力をなんか重視されましたね面接。",
      "start": 1804589,
      "end": 1854987,
      "timestamp": "30:04"
    },
    {
      "speaker": "Senna",
      "text": "で。",
      "start": 1854987,
      "end": 1855007,
      "timestamp": "30:54"
    },
    {
      "speaker": "Ryo",
      "text": "レファラルは誰からもらったんですか?",
      "start": 1857854,
      "end": 1863867,
      "timestamp": "30:57"
    },
    {
      "speaker": "Suguru",
      "text": "それはですね同じデータサイエンスのコースの先にその会社に入った人から頂きましてさっき話してた人とはまた別の人なん。",
      "start": 1863867,
      "end": 1873021,
      "timestamp": "31:03"
    },
    {
      "speaker": "Ryo",
      "text": "ですけどその人は同じタイミングで学校を始められた人なんですか?それとも前とか?じゃあその人が働き始めてどのどのぐらいとかわかります?",
      "start": 1873021,
      "end": 1890540,
      "timestamp": "31:13"
    },
    {
      "speaker": "Suguru",
      "text": "えっと多分3ヶ月ぐらい経ってからだと思いますねその。",
      "start": 1890540,
      "end": 1893012,
      "timestamp": "31:30"
    },
    {
      "speaker": "Ryo",
      "text": "人がはいでその人のレファラルもらってえっとじゃあそのレファラルもらってもうなんだろう1回目で2時間の面接があった感じですねそう。",
      "start": 1893012,
      "end": 1904239,
      "timestamp": "31:33"
    },
    {
      "speaker": "Suguru",
      "text": "ですね1回目で2。",
      "start": 1904239,
      "end": 1905079,
      "timestamp": "31:44"
    },
    {
      "speaker": "Senna",
      "text": "時間でしたねはいリファラルだと普通のえっと面接のフローと変わるんですよねきっと。",
      "start": 1905079,
      "end": 1915366,
      "timestamp": "31:45"
    },
    {
      "speaker": "Suguru",
      "text": "なんかですねちょっと会社の規模が結構コンパクトなのもあってその辺があんまり定まってないというかなんて言うんでしょう通常のフローみたいなの。",
      "start": 1915366,
      "end": 1926474,
      "timestamp": "31:55"
    },
    {
      "speaker": "Senna",
      "text": "があんまりないのでその人の適性とかによってちょっと変わったりするかもみたいな感じなのかななるほど。",
      "start": 1926474,
      "end": 1933837,
      "timestamp": "32:06"
    },
    {
      "speaker": "Suguru",
      "text": "そうだと思います最初から。",
      "start": 1933837,
      "end": 1936658,
      "timestamp": "32:13"
    },
    {
      "speaker": "Ryo",
      "text": "技術インタビューがあったということなんですけどどういう立場の人が面接して。",
      "start": 1936658,
      "end": 1940160,
      "timestamp": "32:16"
    },
    {
      "speaker": "Suguru",
      "text": "くれたんですか今のボスですねその人は今の会社のCTOになります。",
      "start": 1940160,
      "end": 1948086,
      "timestamp": "32:20"
    },
    {
      "speaker": "Ryo",
      "text": "ねじゃあもうマネージャーの立場の人みたいな感じなんです。",
      "start": 1948086,
      "end": 1951367,
      "timestamp": "32:28"
    },
    {
      "speaker": "Senna",
      "text": "ねそうですねCTO出てきたらビビりますよねなんか事前にどの人がインタビューするとかって情報分かってたりしてました私が演説今の会社私が働いてる会社で受けた時はあの面接官の名前みたいなのもEメールでくれてて事前にLinkedIで検索したりとかしてたんですけど。",
      "start": 1951367,
      "end": 1970135,
      "timestamp": "32:31"
    },
    {
      "speaker": "Suguru",
      "text": "はいあの一応教えてもらってましてで何だろうctoって言っても結構なんて言うんですかねまあ距離が近い感じなのであのまあ結局誰が出てきても緊張するんですけどあんまりそのctoだからみたいなのはなかったかもしれ。",
      "start": 1973499,
      "end": 1990584,
      "timestamp": "32:53"
    },
    {
      "speaker": "Ryo",
      "text": "ないですねでも僕も一社目結構小さい会社だったんでそれどんな感じだったかなctoというかなんて言うんだっけうんctoだったかな忘れたけどまあ確かにその小さい会社だとあんまりねなんだろうCTOだからと言ってなんかスッてみたいな感じでもないしなんかあんまりまあでも緊張しますよね誰が来てもそこはまあしょうがないのかなはい。",
      "start": 1990584,
      "end": 2017652,
      "timestamp": "33:10"
    },
    {
      "speaker": "Suguru",
      "text": "リモートだったのもあってすごくなんかやりづらいというか緊張はしましたねで。",
      "start": 2017652,
      "end": 2023355,
      "timestamp": "33:37"
    },
    {
      "speaker": "Ryo",
      "text": "その後はどんな感じのフロー。",
      "start": 2023355,
      "end": 2026616,
      "timestamp": "33:43"
    },
    {
      "speaker": "Suguru",
      "text": "だったんですかそうですね結局面接受けて1週間ぐらいえっとまぁなんかなんでしょう多分向こうで検討したのかなわからないですけど1週間ぐらい経ってからあのじゃあちょっとトライアルでまず1ヶ月ぐらいあの働いてくれっていうことであのえっとそうですね契約コントラクトで最初は入りましたで、。",
      "start": 2026616,
      "end": 2055281,
      "timestamp": "33:46"
    },
    {
      "speaker": "Ryo",
      "text": "そのなんかオファーみたいなのはメール、じゃあその面接1回やって、その後すぐにオファーみたいなのをもらえる、そのコントラクトの1ヶ月のオファーみたいなのをもらえたと。",
      "start": 2055281,
      "end": 2064101,
      "timestamp": "34:15"
    },
    {
      "speaker": "Suguru",
      "text": "かそうですねで結構なんか割と適当でなんかその給料とかそのなんだろうトライアルの期間とかもあんまりちゃんと教えてもらえなくてなんかとりあえずじゃあいつから働けるんだみたいなメールでもらってこれなんか怪しいなって思って一応その僕の方からあのじゃあ給料はこれであの週何十時間の契約でこれでいいかみたいな一応確認していいよみたいな感じではい割とあのなんて言うんですかねあの緩い感じで働き。",
      "start": 2064101,
      "end": 2095739,
      "timestamp": "34:24"
    },
    {
      "speaker": "Ryo",
      "text": "始めましたねドキュメントみたいなドキュサインみたいなのがあったわけではなくなかったですえーそうなんだそしたら結構いいところ話したんですけど前半は最後に年収について言える範囲で教えていただきたいと思いますはい。",
      "start": 2095739,
      "end": 2118031,
      "timestamp": "34:55"
    },
    {
      "speaker": "Suguru",
      "text": "難しいですよね年収言うの。",
      "start": 2118031,
      "end": 2119992,
      "timestamp": "35:18"
    },
    {
      "speaker": "Senna",
      "text": "ってなんかUSで払われてるんですよね?あれ?",
      "start": 2119992,
      "end": 2128050,
      "timestamp": "35:19"
    },
    {
      "speaker": "Suguru",
      "text": "はい、US企業で働いてるんですけど、実体としては何て言うんですかね、EORっていうのを使ってカナダの企業の従業員みたいな感じで働いてます。",
      "start": 2129537,
      "end": 2144123,
      "timestamp": "35:29"
    },
    {
      "speaker": "Senna",
      "text": "じゃあ、支払いはカナダドル?",
      "start": 2144123,
      "end": 2147945,
      "timestamp": "35:44"
    },
    {
      "speaker": "Suguru",
      "text": "支払いはカナダドルに変えられてます。残念ながら。USドルでもらいたいんですけど。一応、レンジで言うと、あー難しいな。",
      "start": 2147945,
      "end": 2158647,
      "timestamp": "35:47"
    },
    {
      "speaker": "Ryo",
      "text": "なんかジョブポストのレンジとかでもいいですけどね。",
      "start": 2158657,
      "end": 2161318,
      "timestamp": "35:58"
    },
    {
      "speaker": "Suguru",
      "text": "もしあれはでもまあUSドルでまあ100Kからみたい。",
      "start": 2161318,
      "end": 2168620,
      "timestamp": "36:01"
    },
    {
      "speaker": "Ryo",
      "text": "な感じですすごいちなみにインターミレートのあれなのかないや。",
      "start": 2168620,
      "end": 2176402,
      "timestamp": "36:08"
    },
    {
      "speaker": "Suguru",
      "text": "シニアですねシニアねで結局あの最初トライアルで1ヶ月入ってその後6ヶ月半年ぐらいですかねあのコントラクトで働きましてなんか半年ぐらい経ってからちょっとお前あのどうだとあの正社員というかそのパーマネントポジションどうだみたいな急に言われてなんかあんまりそのなんていうか自分の中でそういう準備というかなんかなんて言うんですかねあんまり想定してなくてなんかオッケーオッケーみたいな感じで言ってたらどんどんなんか話が進んじゃって今こういう。",
      "start": 2176402,
      "end": 2216067,
      "timestamp": "36:16"
    },
    {
      "speaker": "Ryo",
      "text": "感じになってます正社員になったタイミングで金額とか変わったんですか変わり。",
      "start": 2216067,
      "end": 2221391,
      "timestamp": "36:56"
    },
    {
      "speaker": "Suguru",
      "text": "ましたはい増えるんですかちなみに増えましたそれであのさっきの100系からみたいなポジションになりましたね。",
      "start": 2221391,
      "end": 2231758,
      "timestamp": "37:01"
    },
    {
      "speaker": "Senna",
      "text": "いいですねUSでだったらあでもカナダ通りになっ。",
      "start": 2231758,
      "end": 2235121,
      "timestamp": "37:11"
    },
    {
      "speaker": "Ryo",
      "text": "ちゃうのかコントラクトって僕正社員よりも高いイメージだったんだけどなんか日本だとねそんなことないのかななんかフリーランスって結構高いじゃないですかそんなことはないのかな結構そこらへんもふわーっとした感じなのかなわかんないけどいや。",
      "start": 2235121,
      "end": 2250667,
      "timestamp": "37:15"
    },
    {
      "speaker": "Suguru",
      "text": "全然そんなことなかったですねあの多分コントラクトだったらもう多分日本のあのフリーランスの方の方がもらっている人は結構いると思いますそし。",
      "start": 2250667,
      "end": 2263611,
      "timestamp": "37:30"
    },
    {
      "speaker": "Ryo",
      "text": "たらちょっと前半はこのぐらいで切りたいと思いますありがとうござい。",
      "start": 2263611,
      "end": 2267872,
      "timestamp": "37:43"
    },
    {
      "speaker": "Suguru",
      "text": "ましたありがとうございましたと。",
      "start": 2267872,
      "end": 2269994,
      "timestamp": "37:47"
    },
    {
      "speaker": "Ryo",
      "text": "いうことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2269994,
      "end": 2288008,
      "timestamp": "37:49"
    }
  ],
  "highlight1": "特効を目指す人はカナダの就労ビザを得ることも目標の一つだが、実際は永住権を目指している人もいるという",
  "highlight2": "未経験からエンジニア転職する時、最初にエージェントを通じた転職が一番早い方法だったという",
  "highlight3": "カナダで年老いてから生活することを考えると、日本と違って高齢者へのサービスの充実度が高くないことを考えなければならない"
}