{
  "episodeGuid": "bcc3d9aa-74a0-4549-b8d6-df622e0e2a2d",
  "episodeTitle": "業界未経験ジュニアエンジニアの初任給は？金融マンがカナダでエンジニアに転向、働き方とキャリア論（後半）#12",
  "transcribedAt": "2025-10-19T20:50:00.269Z",
  "duration": 2628,
  "fullText": "今回も前回に引き続き石さんに来てもらいましたよろしくお願いしますよろしくお願い。しますじゃあ僕からいこうかないいですか前回お話いろいろ聞いてカナダに渡航して就職活動して面接どうやったっていう話をたくさん聞かせていただいてジュニア都市のチャレンジっていうのを聞いてきたかなと思うんですけどやっぱり気になるところとして前職やっぱり金融の業界ずっといらっしゃって資金調達のお手伝いというか仕事をずっとされていてっていう金融のスペシャリストがカナダに来てジュニアの一社目っていうふうになるとぶっちゃけ給料下がるんじゃねっていう風なイメージは正直あるんですけどもどこまでぶっちゃけていただけるかをさておき一山的にはどうですか下がった。上がったって言うと下がりまし。たねやっぱ下がったか最初1社目はそうだよねいや間違いないどの程度。下がったとかって今の給料で言うと80くらいいただいてるんで実は本当に低い給料だと思うので部下側とかあるんでしょうかあの、僕としてはすごくありがたいなと思う。上がったとかは抜きにしてやりたいなと思う。前はまあだいたい金融系なんで1000万ぐらいとか。あーやっぱそうなったんだ。これ自分だけの話で言うと家族がいます僕が日本でやっぱり忙しかったので妻が働けるような環境を作ってあげられないという出産とかあったんでそれもあるんですけどただキャリアを再開する時にどうなのっていうのは日本にいるとあると思うんですけどこっちだとそういうのもあんまりなくて妻を作ってフルタイムで今働いてるんですねそうだった。んですね。僕がもらうのはこれからなんですけど、加えて子ども手当です厚いんで、なんか世帯年収トータルで言うと、なんか実は増えてる気がします。そうなんだ。行かれる金額も日本みたいに社会保障でバコッと行かれたりとかってのもないんで。うん。あの、過剰分所得って言うんですかね。やっぱり残るお金で言うと、まあ、あの、増えてる気がします。ただ値段が高いとか、なんか言い出したら気になるんであれですけど。まあまあまあまあ、ちがうちがうちがう。物価側とかですよね。はい。その中でも注目したのはやっぱりでもジュニアで80Kなんて聞いたことないですよねなかなかカナダで?本当にビッグテックとかだっ。たらあるけど確かに確かに。多分僕しかジュニアがいないので給与水準がよくわからないまま提示してくれたっていうのがあるか。もしれないなるほどねまあそうかなるほどなるほどあんまりやっぱり他。の人と差をつけすぎるとモチベーションに響くっていうのは、僕も前スタートアップを勤めてたときにそういう議論をしたことがあって、逆の立場です。やっぱり同じ仕事同じチームで働くんであんまり差がつかない方がいいってことで、そっちに引っ張られたのかなって、僕の評価がどうとかってうーん、。なるほどですね。いやでも素晴らしい。89だったのか。まあでもそうか、いろいろと聞きたいことはあるんですけど、まず奥さんは働かれてらっしゃったんですね。そうですね、こっちで働いてますね。これもやっぱりカナダに来られる方々あるあるだと正直思うんですがやっぱりご夫婦で来られたりとかお子様いらっしゃったりとかっていう部分で一方の夫婦で来られて一方は働いたりとか学校行ったりとかしてるけどもう一方がずっと専業主婦やっててなかなかコミュニティとか輪が広がらなくて働きもいけなくてみたいな人がやっぱり多くてそれが家庭不安みたいなのにつながって日本を帰国って正直よくある話でっていう部分だと、働くっていう部分だと奥様も意外と英語だったりとかコミュニケーションだったりとかそういうのに特に臆病はしなかったみたいな感じですかね?そうです、あんまり言うと怒られるんですけど英語はあんまりまだ得意じゃなくてコミュニケーションはできるっていうか笑顔でごまかすタイプみたいななるほど、人間力で乗り切るタイプあと日経の会社に今勤めている。のでそうなんですね。求められないっていうのは。そういうことですね。でも働くのはすごいですね。お子様お二人いらっしゃってっていうこともあるから。そうですね。でもやっぱりそこはカナダの社会がうまく回ってるかなって思います。例えば子供の小学校行くとやっぱりみんな送り迎えに父親も母親も関係なく来てるんです。僕も今職場でそうなんですけど、朝子供9時ぐらいに送っていくんで10時から出勤して仕事帰るのは別に5時とか帰っていいよって言われて帰っていいよっていうかもう自分で決めてみたいな感じでなんかそれが前提みたいなそれ僕だけじゃなくて他に一緒に働いている他の人もいる方いるんでその代わりなんか仕事があれば夜ちょっとやってもやらなくてもみたいなで妻の職場もそんな感じですしなんかそこに何か特別余裕があるからとかなんかこう会社だからとかそういうことじゃなくてなんかそういうもんだみたいな前提でああなるほどね気がするのであのそうですね職場との折り合いっていう意味で言うとなんかあのあんまりこう大変じゃないって言ったら日本と違うのはあの子供を特にこう未就学児のでデイケアがめちゃくちゃ高い。っていう間違いない、信じられないくらい高いですよね。あと見つかりにくいっていうのがあって、このフォーメーションを作るのが結構苦労するんですけど、作ってしまえば割と共働きで死にそうになりながらっていうのは、日本よりは起こりにくい。大変は大変なんですけど。そうだったのか。多分家族で海外移住、特にカナダ、バンクーバーに来る人は多分聞きたいなと思うんですけど、会社行く前に9時から学校なんで送ってっていうふうに言ってもらったと思うんですけどなんか1日の流れってどんな感じですか今そのお子さんが2人いて1人は未就学児ってことです。よねそうですねそうする。と2人分送ってから会社に行くみたいな感じになると思うんですけどでまぁなんかその帰りのこともあると思うんですけどどういうふうな流れで生活さ。れてるんですかはいありがとうございますえっと朝8時半から9時ぐらいの間に子供2人デイケアと学校に送って今、オンサイトで僕が働いてるんで、9時10時ぐらい出勤して働いてますと。車、近くにもう学校とか、幼稚園みたいなのがあるんですか?それともなんか車とかで送ってる感じですか?車で送ってるんですけど、車で5分とか10分くらいの距離なんで、大体30分くらいで朝送っていく作業が終わる。大変なんですけど。通勤は車でされてるんですか?通勤は電車で1時間。僕自身は5時に退社してるんですけど、子供をピックアップするのは妻がやってて、妻は逆に言うと9時、4時で働いてるんですね、オフィスで。5時に家に着いて、5時から5時半の時間で子供たちをピックアップする。僕は5時ぐらい、5時から5時半ぐらいの間に会社をやって、絶対家に着くのが6時から6時半なので、そこから一緒にお風呂入ったりご飯作ったりっていうのを2人でやって、みんなで飯食って、子供たちは8時半から9時ぐらいですかね、今だと。そのあと9時、12時ぐらいで、自分が永住権取得に必要なのでフランス語を最近…マジか、。やってるんですね、すごいな。なんかちなみにあのどうしても帰りが遅れそうみたいなまあ今回の場合言うと奥さんになると思うんですけどどういう風なんかそうなった場合はその学校で預かっててくれるみたいな感じなんですかそれなんかどういう風な感じになる。んですかねいやえっと基本的にはそういう仕組みにはなってないのでなんか友達のお母さんに預けるまだそういう事態になったことがないそれは友達の。お母さんでもあっても迎えに行っていいルール。なんですか?同じ施設に預けている友達のお母さんだったらOK。そうなんですね、まあでもそういう事態にもなったことないってことですよね、。とりあえずはそうですね、まあないですね。社会自体が結構、子供の子育てに関してというか、子供の送り迎えは、みんなが、親がするものっていう、日本みたいに子供だけで帰れないみたいなのがあると思うんで、それに対して寛容ってことですかね。だから、そういうことがほぼほぼ起こり得ないみたいな感じの社会になってるのかな。そうですね。安全とかに関わるって意識は。私ばっかり日本みたいに勝手に出てて勝手に帰ってくるのは楽だなって。確かに。日本の治安がなせるバーザンみたいなところもあるなって気がしますが。そういうところが欲しいなって思うこともあるんですけど、まだそうなってないんで、会社の常識が作られてるみたいな。何歳まで送り迎えが必要なんですか?たぶん小学校にいる間はずっとじゃなかった、ちょっとそこは曖昧なんですけど10歳と12歳ぐらいまでかな、送り迎えないといけない逆に。中学校はみんな自分で行く感じなんですかねあまりまあまだ多分経験してないからわかんないかもしれない。ですけどいやでもこれ確かダメでしょ普通に誰かと一緒に同校じゃないとあかんかった気がするけどな。見たことないですもんね。そう見たことないし高校生でもワンチャンあれなの。か高校生なんかモールとかでたまったりしてるんで多分高校生okなはずな。んですよね高校生っぽい人たちは確かにいるねメトロタウンとかも。いますね、なんかちょっと。ちょっとわかんないですけどね、日本人結構見た目幼くて、海外の人って中学生ぐらいから結構大人びて見えるんで、実は僕たちが思っている高校生の人たちが中学生可能性はあるんでわかんないですけど、それはそのうち、後々聞いていきましょう。というわけでまあそうですねあのいろいろとちょっと今のご環境だった今年少の話から随分とあの話し広げさせていただいたなと思うんですがやっぱりまあいっさんがジュニアとして働かれてるっていうところもう1回ちょっと引き込んでいきたいなと思いつつ僕1個だけね先にちょっと聞いておきたいのがあのやっぱりまあ今のご時世そのaiだったりとかなんだろう割とジュニアがやっぱり雇われにくいんじゃない仮説が結構根付いている部分だと思うんですよあの石さんの今の会社さんってジュニアとしての一山を何で受け入れてくれたのかっていうのを前も実はちょっと聞いたんですが改めてちょっともう1回お伺いしてもいいですかね。そうですねまぁあくまで僕の理解でっていう話をえっとまあaiが誕生してコーディングをある程度やってくれるというか正しいプロンプトを前提にやってくれるという時代になってそれ以外の価値が相対的に高まっているというのが入り口にあるかなと思っていてこれは自分が採用された背景の話になるんですけどビジネス理解があるとかコミュニケーションが取れるとかそういうところを比重が高まったというかそれによって採用されたっていうのがあるかなと思ってで、一般的にジュニアの採用にAIのこの今の状況がどうなるかって結構なんか2つの考え方があってどっちかわかんないなっていうのは正直あるかなと思ってる1個はAIによってなんかその簡単なコードはもうAIが書いてくれるからジュニアにやらせる仕事はなくなるんでジュニア取らなくていいっていうともう一個はあの逆にその行動を書いてくれて簡単な仕事をやれるやってくれるようになったんでなんかそのある程度その誰でもコーディングできるようになってきたのでプログラマーにそんなに払わなくてよくないみたいな僕が何も知らない経営者だったらそう思うかもしれないなって思うこともあって僕は逆に仕事の等級を下げるなんて言ったらいいんですかね同じ仕事をさせるのに同じ給料でやらせる必要もはやないみたいな考えがあるあるかなと思ってたぶんあのまだどっちなのかわかんないんですけどあの2つの考え方があって2つの現象が起こってるんじゃないかなっていう気がするますねで僕のあの自分のケースに立ち戻ると割と後者寄りの考えあのなんじゃないかなあとはまあ実験的にとっているとかあのaiの時代においてそれでスキルを高めてきたに会社に入れたらどういうのをやりやってみたいみたいこういうのもあったかもしれんまあそう。いうことですよねまあもしかしたらそのコーディングができるっていう部分におけるコンテキストよりももしかしたらもっと色滝に渡ってコンテキスト広げている人を入れる方がもしかしたら会社にとってプラスになるんじゃないかっていうそういう実験をしている可能性はある。ということですよねそうですね、あとはどういうジュニアかっていうのも変わってくるかなと思っててこれはカナダだから特にそういう人が多いのかもしれないんですけど他の分野の経験を持ってきてこっちにいるっていう人の前提で言うと僕はまさにそのパターンですけどむしろAIによってジュニアですけど目につきやすくなっている部分はあるかもしれないのでなんか大学を出てジュニアっていう人と他の社会人経験があってあのキャリアチェンジでジュニアっていう人当社はその影響を受けにくいとかそういうのはもしかして。あるかもなるほどですねまあこれから多分いろいろ見えてくるね世界からなることと思いますがまぁ言ってあまいしさんはそれをもう先駆者切ってあの社会実験をされている状況っていう対象みたいな間違いないまあ本当にね結果いろいろ知りたいなと思うので引き続きちょっと追いかけさせてもらえばと思いますがそのまま次行ってよろしいそういう背景がみんなと共有できた段階で聞いてみたいのが実際どういう仕事をされていて働いてみてのイメージが今までと持っていたイメージと違ったのか同じなのかっていう部分だ。とどうですかえっとまぁもちろん多少違う部分あるんですけどどういう仕事をしてるかっていうとまずフルスタックであの仕事をしてますであの面接の時はなんかバックエンド難しいから最初の半年フロントエンドやってあのバックエンドはなんかおいおいでいいよみたいな感じで言われて入ったんですけどバックエンドの質問を出されて。おきながらですねそうよねー。入ってみたらなんかあのなんですb2bの会社なんでフロントエンドそんなこだわってなくて現状なんかバックエンドをがっつりやらないとなんか何もできないみたいなあの現場だったんでなんか足崩し的にあのフロンあのフルスタックで今仕事をさせてもらってるっていうですねでえっと何の仕事をしているかっていうとなんかまあスタートアップってまだ若い会社なんでなんか特定の何かこうあのチームがあってカバレッジがしっかり決まっててとかそういうことじゃなくてみんなでわーっと今流行りのことをやるみたいな環境なんでちょっと答えが難しいんですけどえっと僕のオンボーディングっていう最初の90日のプロベーションという意味でいうと1個フィーチャーを渡されて新しいフィーチャーをえっとほぼアイディアしかないみたいな感じでそれをあので企画書を書いて企画書?企画書っていうかノーションでペロペロっとこうなんでこれをやるのかとかどういうのが基準で成功するんだとか書いてどういうデータモデルでやったらできそうか考えて実装してみたいなそれをまずMockで作ってCTOに見せていい感じだったら次この自分たちの実際のアプリに1個フィーチャーフラグみたいなのを作ってページをあなた用に作って実際にみんなとコワークしながらしてそうするとみんなと一緒に働いてるんですけど実質独立してというかみんなの環境を汚さずにでもみんな自分のコードをレビューするんでお互い理解を深めながらどんどん現場でこういうのをやってくれてそれが最初の3ヶ月ぐらいなんでフィーチャーを1個持たされてそれやってたみたいなのがただ実際そのフィーチャー色々ビジネス上の優先順位があってまだローンチしてないんだけど一旦そのプロベーションを乗り越えるっていう意味ではみんなに認めてもらえるだけにはなったかなって。いう素晴らしい結構珍しいタイプですよねジュニアだとやっぱりそこなんていうの早いフェーズのアーリーフェーズというか早いフェーズのところはやらせてもらわずに割と何だろうもうガチガチに仕様が決まったところをどんどん渡してってみたいなのを渡すのが普通っていうやり方が結構普通なのかなって思いつつもでもまあ確かになんか石さんのインタビューの背景とかっていうのはあると確かにそこら辺から任せた方がいいのかなっていうふうに判断したのかなっていう感じもありますねそう。ですね加えて言うとランガラーで自分が前回お話ししたランガラーでプロジェクトを回しててその新しいものを作るみたいな作業を3回ぐらいやってたんでそこがだいぶ助けてくれたその経験がだいぶ生きたかなって思いますねただ足元は。ここ。からはちょっと違うことやってて、みんな会社がインフラ周りというかフィーチャーの開発よりもバグを修正したりとか基盤を整えたりとかそっちにみんな肘を置くようになってて僕も今テストを書きまくってそういうことをしてるんでみんなに埋もれながらというかみんなと一緒に最近仕事をわちゃわちゃやってるって感じちなみになん。かさっきAIの話があったんですけど普段働く中でどういう風にAI使わ。れてますかえっとなんか結構たくさんツールを使ってる感じがしててちょっと聞かなきゃわかんないですけどあのコードエディターはあとカーソルを使ってますねなんか毎週のように新しいツール入れてみたんだけどどうみたいなポスティングが正直キャッチアップみんなしてないみたいな状態なんかそうですねベースそれを使おうって話であとはなんかそのコードレビューとかもAIでやってますねクラウドコードとかそうですねクラウドコードもあるしグラフィットっていう似たような名前のやつがちょっと忘れしましたけどなんかあってそれをこう何個か入れてどれが一番イケてるかちょっとみんなで考えるグラファイトグラフィットコードレビュー系だ。とコードラビットとか俺は最近使ってますけどグラフィット。なんですね使ってますよね他の人のレビューを待たずに次のPRをどんどん作るタックPRみたいな。機能それ多分グラファイトじゃないです。かねグラファイトですかねグラファイト。わかんない発音みんな違うのかもしれないけどうちでもそれ使ってて多分グラファイトなんだなと思うグラファイトな。んだあれって知らなかった。あそこもai入れてるけどもともとはそのまあなんか一つ一つのprをあのコミット単位にしてちっちゃくしてそのprを見てもらってる間にも働き続けようみたいなコンセプトのツールです。ねそう使いやすいですうんそれを入れてやってってでなんかチャットでaiのレビューをさせるやつをこうやってみようとprのレビューとかをレビューレビューはとしてですねあのパッドフェイスでやってみようとあとバグフィックスもAIのアプリみたいなのを入れてエラーが検知された時にAIが考えてバグフィックスのプロポーザルを出すみたいなそれもちょっといろいろ実際使ってみるとあんま使えない部分が結構あったりとかして難しいんですけどそういう試みはたくさんしてるかなっていう。なるほどねいろんな現場で最近聞こえてくるちょっと嫌な話をするんだったらやっぱりAIが行動隠しっていう部分でアウトプットがほぼほぼAIになってジュニアにこれなんでこうなったのって聞いたらAIがこう出力したからですって答えられないみたいなね人が要量産されてるってなりますがイースさんは今のところ。はそういうのないですかそれを言ったらやばいと思ってあーやばいいるんですけどなんかたまにこうちょっと早く出したくて出しちゃう時とか。あーありますよねーでも。なんかそういうそういう捉え。方もできるんですけど逆にAIが言ってたからっていうものの説得力が上がってきてはいます。よねあーまあ確かにこれ。AI使ったんだって言った時にあーそうなんだっていう感じでなんかじゃあレビューが終わったぐらいなんじゃないかなみたいな感じで思っちゃうところあるじゃない。ですか確かに確かになるほどねまあ精度の問題だったらまあ時代が何とかするやろしねっていうある。だろうしななんかあの最近ちょっと思ってるのがAIが書いたって言っても別にでそれが間違ってて説明できなかったとしてもなんかそれをみんな客観視してじゃあAIこんな感じなんだみたいな風にただただ受け止めてくれるっていう現象でしてる気がするなるほどね説明できなかったとしてもなんかまあそれはそれで早く仕事を終わらせようとしたってことである感じ。であーなるほどねーあれ前にフロックでイベントやったときだったっけ会社によってはそもそもパフォーマンスの良し悪しみたいなところにAIのトークン数って判断してるみたいなね会社もあったりとかするらしいし。そうですねそれも面白いなって思いましたむしろお金かかるから利用制限するっていう考え方なのかなと思ったらむしろ使ってないやつは有効活用できてないからみたいな話ですよね。そうというわけで今お仕事の内容やっぱりスタートアップの中でもそういうフィーチャー作ったりとかいろいろしてきたっていうふうに思うんですけど実際どうですか働かれて今どんくらいですかそもそも期間。としては5ヶ月目かな5ヶ月かそうか。そうか具体的に何だろう今からそうするとそろそろプロベーションはとっくに終わっていてチームに今から入っていってもうメインの業務なんかもバンバンやっていくみたいなフェーズなのかなと思うんですけど何をやっていきたいとかあと業務の今の内容だったりとかっていうところって答えられる範囲で教え。ていただいてもいいですかそうですね今の業務の範囲で言うとテストをバンバン書いたりとかそういうところなんですけどやっぱり自分はフィーチャーサイドにもう一回戻りたいなっていうのがあって自分が持たされてたそのフィーチャーってもちろんCTOから来たものだったんで良かったんですけどビジネス上すごい優先順位が高いっていうやつがあったんでやっぱり実装していく中でなんていうんですかねなんでこれをやるのかみたいなすごいこうなかったし周りのエンジニアもそうだしビジネスサイドもそうだしそれはなんかCTOから話が来たからってそれだけをもってみんながこれやるべきだよねって言ってくれるってわけじゃないので日本だとねそういうのあるかもしれない確かにみんなの自由でカオスなんでもうちょっと会社にとって重要なものをやっていきたいなと思っててもう少し長い目で言うと技術的にこういう改善をしたっていうレジュメを書くっていうのも大事なんですけどアクトとしてこういうものを作ったとこういう意義があったっていうのの中でしっかり結果を持って説明できるよう。な仕事をしたいなるほどねそれはまぁやっぱり後の例えば転職だったりとかね次のやっぱりキャリアだったりとかも見据えてアピールできるものを作っておきたいっていうマインドはあるってことですよ。ね多分そうですねあと自分がエンジニアになったその現体験というかやっぱりそういうところにあるのでパフォーマンスを上げたとかそういうのも大事だし学ぶべきなんでやりたいんですけど最終的には何か単位でこういうふうにユーザーが喜んだみたいなちなみにフィーチャー。作ってそこら辺のインパクトとかは測れるようになってたりするんですかいや。そこもちょっとよく分からないっていうのがあってですねただ物によっては測れるかなと思います例えば例を挙げると支払いのオペレーションをマニュアルでやっている業務がとはいえありますみたいなそれを自動化するっていうのがあってそれは時間単位でこれだけ削減できるというのは目に見えてできるかなと思いますしあとその例えば医療系で保険の請求みたいな話があった時に保険の情報が不正確だから請求が正しく行われないみたいなその数字がパーセンテージで表示されてたとしてそれを解決する自動化とか正しい情報を提示するようなものを作ってもしその比率が改善したとしたらそれは成果として言えるんじゃないかな。僕ももともと小さい会社にいて、そこらへんが結構転職するときに、測れたとか、そこらへんを気にしながらもうちょっと働ければよかったなっていうのがあって、測るような仕組みは会社にないだったりとか、日々あんまりそういうふうなことは気をつけないと思うんですけど、もし機会があれば、そこらへんをどういうふうに測ったらいいだろうみたいなのを、考えてみると、考えてみて、まぁ後でメモっとくとかすると、すごいいいなって思ったんで、もしあれだったらやってみてくださいっていう。面白いなよね。素晴らしい。なんか今質問されると思ったんですけど、やっぱりこう今までって自分が生き延びることで精一杯だったんで、。まあ間違いない。今後どうするみたいだってあんまり考える余裕がなくて、そろそろね、やっぱ半年とか自分自身の成果っていうか、なんか転職するとかしないとかもそうで、夢の貢献っていうか、。ちなみになんかもっと長い範囲で言うとなんかこれからもずっとエンジニアやっていきたいなぁみたいな感じなんです。かそうですね、そこはまだ自分でも決めかねてるんですけど5年くらいは少なくともやりたいなって思って結構好きっていうか楽しいなって思いながら今やってるんで単純に好きだっていう理由がまずあってあと実際に自分で作っていってるっていう感覚もありますしその辺は本当にこうなって良かったなって思ってどっかでもし違う道があるとしたら例えばその金融系僕は金融の業界に10年以上いた人間で金融のその会社に戻ってもう少しプロマネっぽいプロダクトマネージャーみたいなそういう道も全然タイミング次第ではあるかなとまだちょっと決めてはないんですけどなる。ほどですねあとは海外っていう、海外だったりカナダっていう背景ではどうですか?ずっとカナダにいようかなって感じですか?子供が教育とかっていう話があったと思うんで、そこら辺はカナダを考えているのかなとは思うんですけど、その後とかまたまた全然違う国気になってきたよみたいなのがあれば教えてください。そうですね、現状カナダやっぱりここになるべく住みたいなって気持ちが今は強いです他の国に行ったりとか考えてないですねやっぱり子供がいるとすごく育てやすいですしあとバンクーバー気候もいいしアジアフードもいっぱい手に入るんで間違いない困ることがあんまり正直ないかなこの生活が結構気に入ってるんでなるべくここにいられるように頑張りたい。なって感じ素晴らしい子育てが終わったら日本に帰ろうみたいなのもないですか?特には。そこまでちょっと考えてないっていうかね。そうですね、。だいぶ長期ですもんね。そうですね、でもやっぱり夫婦でゆっくり旅行したいとか、カナダだったりとかあるんで、僕に今聞かれたらイエスですね。カナダに残ってカナダに帰りたいなって気持ちはありますけど、親が退職して、どっかでいろんな前提が変わっちゃったりとか、。見えないことはまだまだあるでしょうからねどうかどうなるかわからないところも国ごとにもあるかもしれないし。はいはいそうですね素晴らしいちなみ。にこれはちょっと次の話題移る前の部分があるんですがやっぱりご家族で来られる方々ってなんか俺両極端に理解しててなんかむちゃくちゃ苦労してるっていうなんか意見とこんなに住みやすいところがないっていう人と何が差なんだろうなってすげーわかんなくて僕はもう子供もちろんいないからもしかしたら見えない世界があるのかなって思ってたんですけどなんかいっさの周りとかどうですかやっぱお子様いらっしゃる方とかで周りいらっしゃるんでしょうけどなんか楽しんでる人とそうでもない人の差とかみんな楽しんでますか。そもそもいやーえっとまぁどうなんだろうな結構立場によるかなと思う。例えば永住権取ってて、こっちに値下ろしてる人は多分住みやすいと思いながら、日本は旅行で帰る場所だみたいな。まあね、ありますよね。日本人の場合ですけど多いんです。やっぱり一緒に乱殻で始めた人っていうのは結構辛い気持ちになっている人は多いかもしれない。ですけどあのちょっと日本人で周りにいないんで海外の人って言うともうな帰る選択肢がない人が多いであまあそうよねうんにもなんかいるためにどうするかしか書いて。ないそうですよねまあ僕らはほら日本だからって言ってあるかもしれないけどまあいい国なのでかいやなら帰れが通じるかもしれないけどよその国。そうじゃないですからねそうですね。これは子供がいるかどうかに関わらず、カナダをエンジョイできている人かどうかなんですけど、カナダを好きになろうというアクションを取っている人が多い気がします。例えば、いろんなところに旅行に行ったりとか、カナダでカナダのお祝いをするとか、応援するとか。その国のカルチャーだったり、その国の文化をまず好きにならないと、自分が心地よく住めるようにならないって学んだんですね。で、まあそれ結構周り見ててもそうかなと思って。ニワトリ卵ですけど、結構こう、動いてる人はカナダのことが好きになって暮らしやすいみたいな印象を持ってる人。が多いかも。はいいやー素晴らしいありがとうございますずっとちょっと気になってたんでね好きになるじゃあ努力っていうところってことですね。そうですねはい日本人で。言うとやっぱりその日本から出たくて来てる人っていうのとあの海外を楽しみに来てる人っていう違いはあるかもしれないですね。あるね。やっぱり後者の方は来てみると結構絶望すると思うんですよね。日本ってなんでいい国になったんだって言って帰るみたいな帰るというか、あんまりなんかそのネガティブなところから入ってるんで、あれカナダここもダメだしここもダメだしここもダメだしみたいな感じの探し方になっちゃって、ま、石さんが言うようにその、なんか好きになる努力をしている人たちはここはいいなっていう目線にやっぱなってるからっていうのもあるのかもしれないですね。そうですね。やっぱりネガティブな気持ちで来ない方がいいですね。日本が嫌だから来るっていう。そういう気持ちは別にあってもいいと思うんですけど、それだけで来ちゃうと、カナダはその嫌な気持ちを包んでくれる社会になるので。間違いない。そうですね。そこのギャップに耐えきれず、自分の居場所がないような感覚。カナダもダメじゃんみたいな。うーんいやそうなんすよねだからxとか見ててもこの間もなんかyoutbe見てたらもうカナダのなんかあの悪いところ10銭みたいなやつとかやっぱ出てきてそういやーなんかすごい嫌なとこだけを探したなんかたま手箱みたいになってるなぁみたいな牛乳詰めパック嫌なところなんか探しましたみたいな感じになってるそういう出され方するとそうかーって思うしかない。っていうねそうですね、それは何かどこのカルチャーが優れてるとか、そういうことはないんで、何かそれを探して遊べるか。ただ、何かどこが自分に合ってるかっていう。そうですよね。いや、すいません、ちょっとそういうのを見たばっかりだったんで、あの、なんかイッサンみたいにちゃんと楽しんでる方もいるって聞くとちょっと安心するっていう。みんなここにいるからねありがとうございますというわけで俺の感想も含めて話し入っちゃいましたが実際どうですかやっぱり国有に今までいらっしゃった石さんの目線から見てっていう部分ただやっぱり日本最後いらっしゃったのはスタートアップでテック系の会社っていう部分はあったと思うんですけどどの辺がやっぱり日本で働いていた環境と実際こっちで働き出してる環境とってここ違うよねとかここが変わったよねっていう部分あったらぜひ聞いておきたいなって思うんです。がそうですね、スタートアップと比べるか銀行と比べるかによってだいぶ変わっちゃうんで僕の中でも結構混乱が生じてるんですけどちょっと頑張って一般化して言うとやっぱり批判文化じゃないというかそれはいい悪いがあるんですけど褒め合う文化って言うんですかね、こっちは自分の心理的安全を確保して例えば分かんないこと分かんないって聞きながら被害を犯すことを恐れなくなったりとかそれがかえって自分の業務効率とかアウトプットのスピードを上げていくのが結構いいとしてはあるかなと思っています悪い面というか、もちろん代償としてやってって言ったことをちゃんとやってくれないとかありますよねあるんですけど働く個人っていうか僕の気質としてどっちが合ってるかって言われたらやっぱりこっちで働いてた方が自分は気持ちよく働けてるかなって思います逆にそれが嫌だっていう人も嫌っていうかちゃんと決まってないから気持ち悪いっていう人も中にはいると思うんですけど決まってないから自分で決めれるっていう考え方をする。なるほどですねまあそうかそこらへんはまあ良し悪しあるんだろうなぁとは思いつつこれなんか前にも言いましたよね別のゲストの方でやっぱりあのカナダと日本でっていう分で比べた時に出版に対して寛容だっていう部分だったりとかねやっぱお話する人がやっぱ多いのでそこはじゃあもうみんな共通で思うこと。なんだろうなきっとそうですねなんかやっぱりあの確実まあでもこれカナダだけじゃなくて自分の経験で結構そのタイとかも似たような感じうーんなんかその不確実性に対してなんかお前ないみたいな俺はそのまま受け入れて次の勝手にするみたい感じの人が多い気がして日本で働いてる時って銀行ですけど結構その例えば役員会議とかがあるかなり前々から準備するんでその良い面としてはその会議のクオリティは当然上がるんですけど使ってた時間とかあるいはその役員の人が意思決定する材料ってもうすごい完成されたものができてるそしたら役員の人じゃなくてもできるかもしれないあったりするとなんか会社全体のリソースの使い方としてなんか本当にいいんだっけみたいなあるかなと思う会員にいる時って同じ業種で同じように大企業に会員のですけどね会員にいたんですけど百位会議の準備はなんか3日前からし始めるみたいななるほどね3日前までないままあげるんで大体会議があれるんですねでもあのみんなそこであのよくわかってないながらなんか結論は割とあの日本のスタートアップもまあそれに近い感じでしたそれってあの不確実性の中で議論していくようなスタートアップなんで当たり前ですこっちもしっかり感じ。ですねなるほどねありがとうございますまあそれをねさらも環境によるようになっている間違いなくあるんだろうけれども。そうですねまあでも全体。を通してやっぱ人の失敗にも自分の失敗にも寛容っていうのはあります。よねうーんこっちの場合やっぱり。言語からしてそうじゃないですかやっぱりまあ完璧な英語すらみんなあんまり喋ってないよねっていう中でやっぱりやりとりしてるからなんかなおさらそう感じることが多いのかなっていう気も若干するよ。ねまあ完璧な英語ってものがないっていうのをみんなわかってるって感じじゃないですかあー確かに確かに英語の文脈で言うとうん間違い。ないなのでいろんな意味で寛容なんだなっていうところはすごく思うところですねそうですね。そうしたら、最後の質問なんですけど、自分のような、って言うとあれなんですけど、自分のような性質の人に、これから留学とか渡航とか考えてる人、たぶんいっぱいいるんですけど、なんかアドバイスをするとしたら。でも多分アドバイスとしては多分割と今回分かりやすいよねおそらく別業界からエンジニアとしての業界に飛び込みなおかつ国も変えるっていうなんかデンジャラスなというか結構ぶっ飛んでる。小分けにしていきます別業界から来る人に対してちょっとアドバイスをするとしたら。別業界に来る人に対してアドバイスするとしたら別業界の経験を大事にしてくださいですか確かにフロックのインタビューでも答えたんですけど僕自身がそうだったっていう話ですが全く違う業界に来てエンジニアとしてゼロからこっちで学ぶと自分の価値がゼロになったような気がするなんか初学者の錯覚みたいなそれって自分が今まで別業界で別の仕事をしてきたっていう価値の上に乗っけていくものむしろ自分の価値を上げる方向でしかなくてそこはエンジニアとして就職できているかどうかとは別に考えてほしいなってそれは心持ちだけの話じゃなくてそれを利用してエンジニア就職に少しでもつなげる道があったりとかそういうことを考えてみてもいいのかなとは思ってその未経験別業種から来たからこその強みが逆にあるよっていうそれをどうやってプレゼンするかと考えれると確率が上がるパスが。増えるっていうか前半後半を通してすごいそれはなんかもうすでに見えたのかなっていう感じがしますよね話を聞いて未経験の人に対してはどう。ですか未経験の人に対してはAIがあるからといって自分の道が通わされたってわけじゃなくてしっかりなんていうんですかねだからこそ未経験とかそのジニアっていうんですかね対して道が開けるっていう考え方も多分あるだろうし自分が興味を持ってやるんだったらそこは普通に飛び込むと思い。ますねそしたらじゃあ最後に家族でいろんな要素がありすぎて、あれですけど、それもすごい大切だと思うんですよね。今考えてる人多いと思ってて。家族連れの人で、これからどこを考えてる人にアドバイスをお願いします。まず子育て環境がいいかどうかに関してはすごくいいと思います子どもが英語ができないとかそういうのもカナダはそれを前提にしているので英語をしゃべれなくてもこっちでなんとかするから家で日本語教育しといてよちゃんとむしろ学校から行ってくるぐらい文化の人を受け入れる寛容さがあるし子供に何かあった時にちゃんと大人がちゃんと守るような意味というか、そういうことをちゃんとやっていくと安心感があるので、育てに関しては不安はないっていうのが今の実感ただお金をめちゃくちゃ使うよね特に密集学児は現実的になかなか入れるところがなかったりとか見つかっても月1000ドル近く払ったりとかなんで、要は家族で来る人にはお金の準備は現実的にちゃんとしないところですねすごく貯金を持ってこっちに来るか、あるいは日本で稼ぎ口を作ったらこっちに来るかっていう感じですねうちは妻がたまたまこっちで仕事が見つかったんでなんとかなってますそれ自体にあんまり再現性はないと思って確率を高めるって意味では日本で仕事してそれこのこっちへ持ってきて家計を支えるその通ってない方がです学校に行ってない方がなんでこうあの未収入期間を乗り切るって言うランニングを立った上であの来ないと結構やっぱり実際お金を使ったなっていう感覚そこはちょっと現実的にあのお金の計算ちゃんとしたそこら。へんもうちょっと詳しく聞きたいですね僕はあのまあ今回でではなくまたちょっと別の機会にお願いしたいんですけどまあセナさんもそうだと思うんですけどまあ僕うちもまあそのうちうちはまあそのうちなんですけどあの子供を考えているんですけど全然なんだろうイメージが湧かなくて多分それって日本にいる人だともっとイメージつかないと思うんですよねなんでフロックの中でも何人かやっぱりお子さんがいてあの今の話だと石さんは未就学児の人と小学生のあの年の人がいて多分他のちょっと上の人とかもいると思うんでそういう人たちも含めてちょっと僕たちが勉強させてもらうみたいなのをちょっと作ってみてもいいかもしれないですねということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcasyoubetなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "A",
      "text": "今回も前回に引き続き石さんに来てもらいましたよろしくお願いしますよろしくお願い。",
      "start": 228,
      "end": 5376,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "しますじゃあ僕からいこうかないいですか前回お話いろいろ聞いてカナダに渡航して就職活動して面接どうやったっていう話をたくさん聞かせていただいてジュニア都市のチャレンジっていうのを聞いてきたかなと思うんですけどやっぱり気になるところとして前職やっぱり金融の業界ずっといらっしゃって資金調達のお手伝いというか仕事をずっとされていてっていう金融のスペシャリストがカナダに来てジュニアの一社目っていうふうになるとぶっちゃけ給料下がるんじゃねっていう風なイメージは正直あるんですけどもどこまでぶっちゃけていただけるかをさておき一山的にはどうですか下がった。",
      "start": 5376,
      "end": 43607,
      "timestamp": "00:05"
    },
    {
      "speaker": "C",
      "text": "上がったって言うと下がりまし。",
      "start": 43607,
      "end": 45747,
      "timestamp": "00:43"
    },
    {
      "speaker": "B",
      "text": "たねやっぱ下がったか最初1社目はそうだよねいや間違いないどの程度。",
      "start": 45747,
      "end": 52070,
      "timestamp": "00:45"
    },
    {
      "speaker": "C",
      "text": "下がったとかって今の給料で言うと80くらいいただいてるんで実は本当に低い給料だと思うので部下側とかあるんでしょうかあの、僕としてはすごくありがたいなと思う。上がったとかは抜きにしてやりたいなと思う。前はまあだいたい金融系なんで1000万ぐらいとか。あーやっぱそうなったんだ。これ自分だけの話で言うと家族がいます僕が日本でやっぱり忙しかったので妻が働けるような環境を作ってあげられないという出産とかあったんでそれもあるんですけどただキャリアを再開する時にどうなのっていうのは日本にいるとあると思うんですけどこっちだとそういうのもあんまりなくて妻を作ってフルタイムで今働いてるんですねそうだった。",
      "start": 52070,
      "end": 111613,
      "timestamp": "00:52"
    },
    {
      "speaker": "B",
      "text": "んですね。",
      "start": 111613,
      "end": 111834,
      "timestamp": "01:51"
    },
    {
      "speaker": "C",
      "text": "僕がもらうのはこれからなんですけど、加えて子ども手当です厚いんで、なんか世帯年収トータルで言うと、なんか実は増えてる気がします。",
      "start": 114760,
      "end": 127582,
      "timestamp": "01:54"
    },
    {
      "speaker": "B",
      "text": "そうなんだ。",
      "start": 127582,
      "end": 128143,
      "timestamp": "02:07"
    },
    {
      "speaker": "C",
      "text": "行かれる金額も日本みたいに社会保障でバコッと行かれたりとかってのもないんで。うん。あの、過剰分所得って言うんですかね。やっぱり残るお金で言うと、まあ、あの、増えてる気がします。ただ値段が高いとか、なんか言い出したら気になるんであれですけど。",
      "start": 128143,
      "end": 141604,
      "timestamp": "02:08"
    },
    {
      "speaker": "B",
      "text": "まあまあまあまあ、ちがうちがうちがう。物価側とかですよね。",
      "start": 141604,
      "end": 144797,
      "timestamp": "02:21"
    },
    {
      "speaker": "A",
      "text": "はい。その中でも注目したのはやっぱりでもジュニアで80Kなんて聞いたことないですよねなかなかカナダで?本当にビッグテックとかだっ。",
      "start": 144797,
      "end": 158398,
      "timestamp": "02:24"
    },
    {
      "speaker": "B",
      "text": "たらあるけど確かに確かに。",
      "start": 158398,
      "end": 161560,
      "timestamp": "02:38"
    },
    {
      "speaker": "C",
      "text": "多分僕しかジュニアがいないので給与水準がよくわからないまま提示してくれたっていうのがあるか。",
      "start": 161560,
      "end": 169006,
      "timestamp": "02:41"
    },
    {
      "speaker": "B",
      "text": "もしれないなるほどねまあそうかなるほどなるほどあんまりやっぱり他。",
      "start": 169006,
      "end": 175701,
      "timestamp": "02:49"
    },
    {
      "speaker": "C",
      "text": "の人と差をつけすぎるとモチベーションに響くっていうのは、僕も前スタートアップを勤めてたときにそういう議論をしたことがあって、逆の立場です。やっぱり同じ仕事同じチームで働くんであんまり差がつかない方がいいってことで、そっちに引っ張られたのかなって、僕の評価がどうとかってうーん、。",
      "start": 175701,
      "end": 196999,
      "timestamp": "02:55"
    },
    {
      "speaker": "B",
      "text": "なるほどですね。いやでも素晴らしい。89だったのか。まあでもそうか、いろいろと聞きたいことはあるんですけど、まず奥さんは働かれてらっしゃったんですね。",
      "start": 196999,
      "end": 207555,
      "timestamp": "03:16"
    },
    {
      "speaker": "C",
      "text": "そうですね、こっちで働いてますね。",
      "start": 207555,
      "end": 211677,
      "timestamp": "03:27"
    },
    {
      "speaker": "B",
      "text": "これもやっぱりカナダに来られる方々あるあるだと正直思うんですがやっぱりご夫婦で来られたりとかお子様いらっしゃったりとかっていう部分で一方の夫婦で来られて一方は働いたりとか学校行ったりとかしてるけどもう一方がずっと専業主婦やっててなかなかコミュニティとか輪が広がらなくて働きもいけなくてみたいな人がやっぱり多くてそれが家庭不安みたいなのにつながって日本を帰国って正直よくある話でっていう部分だと、働くっていう部分だと奥様も意外と英語だったりとかコミュニケーションだったりとかそういうのに特に臆病はしなかったみたいな感じですかね?",
      "start": 211687,
      "end": 249162,
      "timestamp": "03:31"
    },
    {
      "speaker": "C",
      "text": "そうです、あんまり言うと怒られるんですけど英語はあんまりまだ得意じゃなくてコミュニケーションはできるっていうか笑顔でごまかすタイプみたいななるほど、人間力で乗り切るタイプあと日経の会社に今勤めている。",
      "start": 249162,
      "end": 265284,
      "timestamp": "04:09"
    },
    {
      "speaker": "B",
      "text": "のでそうなんですね。",
      "start": 265284,
      "end": 266224,
      "timestamp": "04:25"
    },
    {
      "speaker": "C",
      "text": "求められないっていうのは。",
      "start": 266224,
      "end": 266985,
      "timestamp": "04:26"
    },
    {
      "speaker": "B",
      "text": "そういうことですね。でも働くのはすごいですね。お子様お二人いらっしゃってっていうこともあるから。",
      "start": 267967,
      "end": 273561,
      "timestamp": "04:27"
    },
    {
      "speaker": "C",
      "text": "そうですね。でもやっぱりそこはカナダの社会がうまく回ってるかなって思います。例えば子供の小学校行くとやっぱりみんな送り迎えに父親も母親も関係なく来てるんです。僕も今職場でそうなんですけど、朝子供9時ぐらいに送っていくんで10時から出勤して仕事帰るのは別に5時とか帰っていいよって言われて帰っていいよっていうかもう自分で決めてみたいな感じでなんかそれが前提みたいなそれ僕だけじゃなくて他に一緒に働いている他の人もいる方いるんでその代わりなんか仕事があれば夜ちょっとやってもやらなくてもみたいなで妻の職場もそんな感じですしなんかそこに何か特別余裕があるからとかなんかこう会社だからとかそういうことじゃなくてなんかそういうもんだみたいな前提でああなるほどね気がするのであのそうですね職場との折り合いっていう意味で言うとなんかあのあんまりこう大変じゃないって言ったら日本と違うのはあの子供を特にこう未就学児のでデイケアがめちゃくちゃ高い。",
      "start": 273561,
      "end": 355330,
      "timestamp": "04:33"
    },
    {
      "speaker": "B",
      "text": "っていう間違いない、信じられないくらい高いですよね。",
      "start": 355330,
      "end": 358705,
      "timestamp": "05:55"
    },
    {
      "speaker": "C",
      "text": "あと見つかりにくいっていうのがあって、このフォーメーションを作るのが結構苦労するんですけど、作ってしまえば割と共働きで死にそうになりながらっていうのは、日本よりは起こりにくい。大変は大変なんですけど。",
      "start": 358705,
      "end": 373822,
      "timestamp": "05:58"
    },
    {
      "speaker": "A",
      "text": "そうだったのか。多分家族で海外移住、特にカナダ、バンクーバーに来る人は多分聞きたいなと思うんですけど、会社行く前に9時から学校なんで送ってっていうふうに言ってもらったと思うんですけどなんか1日の流れってどんな感じですか今そのお子さんが2人いて1人は未就学児ってことです。",
      "start": 373822,
      "end": 395177,
      "timestamp": "06:13"
    },
    {
      "speaker": "C",
      "text": "よねそうですねそうする。",
      "start": 395177,
      "end": 396637,
      "timestamp": "06:35"
    },
    {
      "speaker": "A",
      "text": "と2人分送ってから会社に行くみたいな感じになると思うんですけどでまぁなんかその帰りのこともあると思うんですけどどういうふうな流れで生活さ。",
      "start": 396637,
      "end": 404299,
      "timestamp": "06:36"
    },
    {
      "speaker": "C",
      "text": "れてるんですかはいありがとうございますえっと朝8時半から9時ぐらいの間に子供2人デイケアと学校に送って今、オンサイトで僕が働いてるんで、9時10時ぐらい出勤して働いてますと。",
      "start": 404299,
      "end": 420632,
      "timestamp": "06:44"
    },
    {
      "speaker": "A",
      "text": "車、近くにもう学校とか、幼稚園みたいなのがあるんですか?それともなんか車とかで送ってる感じですか?",
      "start": 420632,
      "end": 426804,
      "timestamp": "07:00"
    },
    {
      "speaker": "C",
      "text": "車で送ってるんですけど、車で5分とか10分くらいの距離なんで、大体30分くらいで朝送っていく作業が終わる。大変なんですけど。",
      "start": 426804,
      "end": 439247,
      "timestamp": "07:06"
    },
    {
      "speaker": "A",
      "text": "通勤は車でされてるんですか?",
      "start": 439247,
      "end": 441783,
      "timestamp": "07:19"
    },
    {
      "speaker": "C",
      "text": "通勤は電車で1時間。僕自身は5時に退社してるんですけど、子供をピックアップするのは妻がやってて、妻は逆に言うと9時、4時で働いてるんですね、オフィスで。5時に家に着いて、5時から5時半の時間で子供たちをピックアップする。僕は5時ぐらい、5時から5時半ぐらいの間に会社をやって、絶対家に着くのが6時から6時半なので、そこから一緒にお風呂入ったりご飯作ったりっていうのを2人でやって、みんなで飯食って、子供たちは8時半から9時ぐらいですかね、今だと。そのあと9時、12時ぐらいで、自分が永住権取得に必要なのでフランス語を最近…マジか、。",
      "start": 441793,
      "end": 492404,
      "timestamp": "07:21"
    },
    {
      "speaker": "B",
      "text": "やってるんですね、すごいな。",
      "start": 492404,
      "end": 495238,
      "timestamp": "08:12"
    },
    {
      "speaker": "A",
      "text": "なんかちなみにあのどうしても帰りが遅れそうみたいなまあ今回の場合言うと奥さんになると思うんですけどどういう風なんかそうなった場合はその学校で預かっててくれるみたいな感じなんですかそれなんかどういう風な感じになる。",
      "start": 495248,
      "end": 509155,
      "timestamp": "08:15"
    },
    {
      "speaker": "C",
      "text": "んですかねいやえっと基本的にはそういう仕組みにはなってないのでなんか友達のお母さんに預けるまだそういう事態になったことがないそれは友達の。",
      "start": 509155,
      "end": 524501,
      "timestamp": "08:29"
    },
    {
      "speaker": "A",
      "text": "お母さんでもあっても迎えに行っていいルール。",
      "start": 524501,
      "end": 527301,
      "timestamp": "08:44"
    },
    {
      "speaker": "C",
      "text": "なんですか?同じ施設に預けている友達のお母さんだったらOK。",
      "start": 527301,
      "end": 535526,
      "timestamp": "08:47"
    },
    {
      "speaker": "B",
      "text": "そうなんですね、まあでもそういう事態にもなったことないってことですよね、。",
      "start": 535526,
      "end": 538965,
      "timestamp": "08:55"
    },
    {
      "speaker": "C",
      "text": "とりあえずはそうですね、まあないですね。",
      "start": 538965,
      "end": 543206,
      "timestamp": "08:58"
    },
    {
      "speaker": "A",
      "text": "社会自体が結構、子供の子育てに関してというか、子供の送り迎えは、みんなが、親がするものっていう、日本みたいに子供だけで帰れないみたいなのがあると思うんで、それに対して寛容ってことですかね。だから、そういうことがほぼほぼ起こり得ないみたいな感じの社会になってるのかな。",
      "start": 546572,
      "end": 565104,
      "timestamp": "09:06"
    },
    {
      "speaker": "C",
      "text": "そうですね。安全とかに関わるって意識は。私ばっかり日本みたいに勝手に出てて勝手に帰ってくるのは楽だなって。",
      "start": 565114,
      "end": 573516,
      "timestamp": "09:25"
    },
    {
      "speaker": "B",
      "text": "確かに。日本の治安がなせるバーザンみたいなところもあるなって気がしますが。",
      "start": 573516,
      "end": 577987,
      "timestamp": "09:33"
    },
    {
      "speaker": "C",
      "text": "そういうところが欲しいなって思うこともあるんですけど、まだそうなってないんで、会社の常識が作られてるみたいな。",
      "start": 577987,
      "end": 587918,
      "timestamp": "09:37"
    },
    {
      "speaker": "A",
      "text": "何歳まで送り迎えが必要なんですか?",
      "start": 587918,
      "end": 591603,
      "timestamp": "09:47"
    },
    {
      "speaker": "C",
      "text": "たぶん小学校にいる間はずっとじゃなかった、ちょっとそこは曖昧なんですけど10歳と12歳ぐらいまでかな、送り迎えないといけない逆に。",
      "start": 591613,
      "end": 602565,
      "timestamp": "09:51"
    },
    {
      "speaker": "A",
      "text": "中学校はみんな自分で行く感じなんですかねあまりまあまだ多分経験してないからわかんないかもしれない。",
      "start": 602565,
      "end": 608226,
      "timestamp": "10:02"
    },
    {
      "speaker": "B",
      "text": "ですけどいやでもこれ確かダメでしょ普通に誰かと一緒に同校じゃないとあかんかった気がするけどな。",
      "start": 608226,
      "end": 616107,
      "timestamp": "10:08"
    },
    {
      "speaker": "A",
      "text": "見たことないですもんね。",
      "start": 616107,
      "end": 617248,
      "timestamp": "10:16"
    },
    {
      "speaker": "B",
      "text": "そう見たことないし高校生でもワンチャンあれなの。",
      "start": 617248,
      "end": 621808,
      "timestamp": "10:17"
    },
    {
      "speaker": "A",
      "text": "か高校生なんかモールとかでたまったりしてるんで多分高校生okなはずな。",
      "start": 621808,
      "end": 627209,
      "timestamp": "10:21"
    },
    {
      "speaker": "B",
      "text": "んですよね高校生っぽい人たちは確かにいるねメトロタウンとかも。",
      "start": 627209,
      "end": 630230,
      "timestamp": "10:27"
    },
    {
      "speaker": "C",
      "text": "いますね、なんかちょっと。",
      "start": 632206,
      "end": 635009,
      "timestamp": "10:32"
    },
    {
      "speaker": "A",
      "text": "ちょっとわかんないですけどね、日本人結構見た目幼くて、海外の人って中学生ぐらいから結構大人びて見えるんで、実は僕たちが思っている高校生の人たちが中学生可能性はあるんでわかんないですけど、それはそのうち、後々聞いていきましょう。",
      "start": 635009,
      "end": 652969,
      "timestamp": "10:35"
    },
    {
      "speaker": "B",
      "text": "というわけでまあそうですねあのいろいろとちょっと今のご環境だった今年少の話から随分とあの話し広げさせていただいたなと思うんですがやっぱりまあいっさんがジュニアとして働かれてるっていうところもう1回ちょっと引き込んでいきたいなと思いつつ僕1個だけね先にちょっと聞いておきたいのがあのやっぱりまあ今のご時世そのaiだったりとかなんだろう割とジュニアがやっぱり雇われにくいんじゃない仮説が結構根付いている部分だと思うんですよあの石さんの今の会社さんってジュニアとしての一山を何で受け入れてくれたのかっていうのを前も実はちょっと聞いたんですが改めてちょっともう1回お伺いしてもいいですかね。",
      "start": 652979,
      "end": 689190,
      "timestamp": "10:52"
    },
    {
      "speaker": "C",
      "text": "そうですねまぁあくまで僕の理解でっていう話をえっとまあaiが誕生してコーディングをある程度やってくれるというか正しいプロンプトを前提にやってくれるという時代になってそれ以外の価値が相対的に高まっているというのが入り口にあるかなと思っていてこれは自分が採用された背景の話になるんですけどビジネス理解があるとかコミュニケーションが取れるとかそういうところを比重が高まったというかそれによって採用されたっていうのがあるかなと思ってで、一般的にジュニアの採用にAIのこの今の状況がどうなるかって結構なんか2つの考え方があってどっちかわかんないなっていうのは正直あるかなと思ってる1個はAIによってなんかその簡単なコードはもうAIが書いてくれるからジュニアにやらせる仕事はなくなるんでジュニア取らなくていいっていうともう一個はあの逆にその行動を書いてくれて簡単な仕事をやれるやってくれるようになったんでなんかそのある程度その誰でもコーディングできるようになってきたのでプログラマーにそんなに払わなくてよくないみたいな僕が何も知らない経営者だったらそう思うかもしれないなって思うこともあって僕は逆に仕事の等級を下げるなんて言ったらいいんですかね同じ仕事をさせるのに同じ給料でやらせる必要もはやないみたいな考えがあるあるかなと思ってたぶんあのまだどっちなのかわかんないんですけどあの2つの考え方があって2つの現象が起こってるんじゃないかなっていう気がするますねで僕のあの自分のケースに立ち戻ると割と後者寄りの考えあのなんじゃないかなあとはまあ実験的にとっているとかあのaiの時代においてそれでスキルを高めてきたに会社に入れたらどういうのをやりやってみたいみたいこういうのもあったかもしれんまあそう。",
      "start": 689190,
      "end": 813795,
      "timestamp": "11:29"
    },
    {
      "speaker": "B",
      "text": "いうことですよねまあもしかしたらそのコーディングができるっていう部分におけるコンテキストよりももしかしたらもっと色滝に渡ってコンテキスト広げている人を入れる方がもしかしたら会社にとってプラスになるんじゃないかっていうそういう実験をしている可能性はある。",
      "start": 813795,
      "end": 826197,
      "timestamp": "13:33"
    },
    {
      "speaker": "C",
      "text": "ということですよねそうですね、あとはどういうジュニアかっていうのも変わってくるかなと思っててこれはカナダだから特にそういう人が多いのかもしれないんですけど他の分野の経験を持ってきてこっちにいるっていう人の前提で言うと僕はまさにそのパターンですけどむしろAIによってジュニアですけど目につきやすくなっている部分はあるかもしれないのでなんか大学を出てジュニアっていう人と他の社会人経験があってあのキャリアチェンジでジュニアっていう人当社はその影響を受けにくいとかそういうのはもしかして。",
      "start": 826197,
      "end": 860639,
      "timestamp": "13:46"
    },
    {
      "speaker": "B",
      "text": "あるかもなるほどですねまあこれから多分いろいろ見えてくるね世界からなることと思いますがまぁ言ってあまいしさんはそれをもう先駆者切ってあの社会実験をされている状況っていう対象みたいな間違いないまあ本当にね結果いろいろ知りたいなと思うので引き続きちょっと追いかけさせてもらえばと思いますがそのまま次行ってよろしいそういう背景がみんなと共有できた段階で聞いてみたいのが実際どういう仕事をされていて働いてみてのイメージが今までと持っていたイメージと違ったのか同じなのかっていう部分だ。",
      "start": 860639,
      "end": 895909,
      "timestamp": "14:20"
    },
    {
      "speaker": "C",
      "text": "とどうですかえっとまぁもちろん多少違う部分あるんですけどどういう仕事をしてるかっていうとまずフルスタックであの仕事をしてますであの面接の時はなんかバックエンド難しいから最初の半年フロントエンドやってあのバックエンドはなんかおいおいでいいよみたいな感じで言われて入ったんですけどバックエンドの質問を出されて。",
      "start": 895909,
      "end": 917231,
      "timestamp": "14:55"
    },
    {
      "speaker": "B",
      "text": "おきながらですねそうよねー。",
      "start": 917231,
      "end": 920674,
      "timestamp": "15:17"
    },
    {
      "speaker": "C",
      "text": "入ってみたらなんかあのなんですb2bの会社なんでフロントエンドそんなこだわってなくて現状なんかバックエンドをがっつりやらないとなんか何もできないみたいなあの現場だったんでなんか足崩し的にあのフロンあのフルスタックで今仕事をさせてもらってるっていうですねでえっと何の仕事をしているかっていうとなんかまあスタートアップってまだ若い会社なんでなんか特定の何かこうあのチームがあってカバレッジがしっかり決まっててとかそういうことじゃなくてみんなでわーっと今流行りのことをやるみたいな環境なんでちょっと答えが難しいんですけどえっと僕のオンボーディングっていう最初の90日のプロベーションという意味でいうと1個フィーチャーを渡されて新しいフィーチャーをえっとほぼアイディアしかないみたいな感じでそれをあので企画書を書いて企画書?企画書っていうかノーションでペロペロっとこうなんでこれをやるのかとかどういうのが基準で成功するんだとか書いてどういうデータモデルでやったらできそうか考えて実装してみたいなそれをまずMockで作ってCTOに見せていい感じだったら次この自分たちの実際のアプリに1個フィーチャーフラグみたいなのを作ってページをあなた用に作って実際にみんなとコワークしながらしてそうするとみんなと一緒に働いてるんですけど実質独立してというかみんなの環境を汚さずにでもみんな自分のコードをレビューするんでお互い理解を深めながらどんどん現場でこういうのをやってくれてそれが最初の3ヶ月ぐらいなんでフィーチャーを1個持たされてそれやってたみたいなのがただ実際そのフィーチャー色々ビジネス上の優先順位があってまだローンチしてないんだけど一旦そのプロベーションを乗り越えるっていう意味ではみんなに認めてもらえるだけにはなったかなって。",
      "start": 920674,
      "end": 1043871,
      "timestamp": "15:20"
    },
    {
      "speaker": "A",
      "text": "いう素晴らしい結構珍しいタイプですよねジュニアだとやっぱりそこなんていうの早いフェーズのアーリーフェーズというか早いフェーズのところはやらせてもらわずに割と何だろうもうガチガチに仕様が決まったところをどんどん渡してってみたいなのを渡すのが普通っていうやり方が結構普通なのかなって思いつつもでもまあ確かになんか石さんのインタビューの背景とかっていうのはあると確かにそこら辺から任せた方がいいのかなっていうふうに判断したのかなっていう感じもありますねそう。",
      "start": 1043871,
      "end": 1080550,
      "timestamp": "17:23"
    },
    {
      "speaker": "C",
      "text": "ですね加えて言うとランガラーで自分が前回お話ししたランガラーでプロジェクトを回しててその新しいものを作るみたいな作業を3回ぐらいやってたんでそこがだいぶ助けてくれたその経験がだいぶ生きたかなって思いますねただ足元は。",
      "start": 1080550,
      "end": 1103997,
      "timestamp": "18:00"
    },
    {
      "speaker": "B",
      "text": "ここ。",
      "start": 1105878,
      "end": 1106038,
      "timestamp": "18:25"
    },
    {
      "speaker": "C",
      "text": "からはちょっと違うことやってて、みんな会社がインフラ周りというかフィーチャーの開発よりもバグを修正したりとか基盤を整えたりとかそっちにみんな肘を置くようになってて僕も今テストを書きまくってそういうことをしてるんでみんなに埋もれながらというかみんなと一緒に最近仕事をわちゃわちゃやってるって感じちなみになん。",
      "start": 1106038,
      "end": 1130567,
      "timestamp": "18:26"
    },
    {
      "speaker": "A",
      "text": "かさっきAIの話があったんですけど普段働く中でどういう風にAI使わ。",
      "start": 1130567,
      "end": 1135268,
      "timestamp": "18:50"
    },
    {
      "speaker": "C",
      "text": "れてますかえっとなんか結構たくさんツールを使ってる感じがしててちょっと聞かなきゃわかんないですけどあのコードエディターはあとカーソルを使ってますねなんか毎週のように新しいツール入れてみたんだけどどうみたいなポスティングが正直キャッチアップみんなしてないみたいな状態なんかそうですねベースそれを使おうって話であとはなんかそのコードレビューとかもAIでやってますねクラウドコードとかそうですねクラウドコードもあるしグラフィットっていう似たような名前のやつがちょっと忘れしましたけどなんかあってそれをこう何個か入れてどれが一番イケてるかちょっとみんなで考えるグラファイトグラフィットコードレビュー系だ。",
      "start": 1135268,
      "end": 1186799,
      "timestamp": "18:55"
    },
    {
      "speaker": "B",
      "text": "とコードラビットとか俺は最近使ってますけどグラフィット。",
      "start": 1186799,
      "end": 1190562,
      "timestamp": "19:46"
    },
    {
      "speaker": "C",
      "text": "なんですね使ってますよね他の人のレビューを待たずに次のPRをどんどん作るタックPRみたいな。",
      "start": 1190562,
      "end": 1200650,
      "timestamp": "19:50"
    },
    {
      "speaker": "A",
      "text": "機能それ多分グラファイトじゃないです。",
      "start": 1200650,
      "end": 1204133,
      "timestamp": "20:00"
    },
    {
      "speaker": "C",
      "text": "かねグラファイトですかねグラファイト。",
      "start": 1204133,
      "end": 1206896,
      "timestamp": "20:04"
    },
    {
      "speaker": "A",
      "text": "わかんない発音みんな違うのかもしれないけどうちでもそれ使ってて多分グラファイトなんだなと思うグラファイトな。",
      "start": 1206896,
      "end": 1212961,
      "timestamp": "20:06"
    },
    {
      "speaker": "B",
      "text": "んだあれって知らなかった。",
      "start": 1212961,
      "end": 1214142,
      "timestamp": "20:12"
    },
    {
      "speaker": "A",
      "text": "あそこもai入れてるけどもともとはそのまあなんか一つ一つのprをあのコミット単位にしてちっちゃくしてそのprを見てもらってる間にも働き続けようみたいなコンセプトのツールです。",
      "start": 1215602,
      "end": 1228545,
      "timestamp": "20:15"
    },
    {
      "speaker": "C",
      "text": "ねそう使いやすいですうんそれを入れてやってってでなんかチャットでaiのレビューをさせるやつをこうやってみようとprのレビューとかをレビューレビューはとしてですねあのパッドフェイスでやってみようとあとバグフィックスもAIのアプリみたいなのを入れてエラーが検知された時にAIが考えてバグフィックスのプロポーザルを出すみたいなそれもちょっといろいろ実際使ってみるとあんま使えない部分が結構あったりとかして難しいんですけどそういう試みはたくさんしてるかなっていう。",
      "start": 1228545,
      "end": 1271088,
      "timestamp": "20:28"
    },
    {
      "speaker": "B",
      "text": "なるほどねいろんな現場で最近聞こえてくるちょっと嫌な話をするんだったらやっぱりAIが行動隠しっていう部分でアウトプットがほぼほぼAIになってジュニアにこれなんでこうなったのって聞いたらAIがこう出力したからですって答えられないみたいなね人が要量産されてるってなりますがイースさんは今のところ。",
      "start": 1272944,
      "end": 1293197,
      "timestamp": "21:12"
    },
    {
      "speaker": "C",
      "text": "はそういうのないですかそれを言ったらやばいと思ってあーやばいいるんですけどなんかたまにこうちょっと早く出したくて出しちゃう時とか。",
      "start": 1293197,
      "end": 1303068,
      "timestamp": "21:33"
    },
    {
      "speaker": "B",
      "text": "あーありますよねーでも。",
      "start": 1303068,
      "end": 1305746,
      "timestamp": "21:43"
    },
    {
      "speaker": "C",
      "text": "なんかそういうそういう捉え。",
      "start": 1305746,
      "end": 1307367,
      "timestamp": "21:45"
    },
    {
      "speaker": "A",
      "text": "方もできるんですけど逆にAIが言ってたからっていうものの説得力が上がってきてはいます。",
      "start": 1307367,
      "end": 1313491,
      "timestamp": "21:47"
    },
    {
      "speaker": "B",
      "text": "よねあーまあ確かにこれ。",
      "start": 1313491,
      "end": 1315452,
      "timestamp": "21:53"
    },
    {
      "speaker": "A",
      "text": "AI使ったんだって言った時にあーそうなんだっていう感じでなんかじゃあレビューが終わったぐらいなんじゃないかなみたいな感じで思っちゃうところあるじゃない。",
      "start": 1315452,
      "end": 1323696,
      "timestamp": "21:55"
    },
    {
      "speaker": "B",
      "text": "ですか確かに確かになるほどねまあ精度の問題だったらまあ時代が何とかするやろしねっていうある。",
      "start": 1323696,
      "end": 1329180,
      "timestamp": "22:03"
    },
    {
      "speaker": "C",
      "text": "だろうしななんかあの最近ちょっと思ってるのがAIが書いたって言っても別にでそれが間違ってて説明できなかったとしてもなんかそれをみんな客観視してじゃあAIこんな感じなんだみたいな風にただただ受け止めてくれるっていう現象でしてる気がするなるほどね説明できなかったとしてもなんかまあそれはそれで早く仕事を終わらせようとしたってことである感じ。",
      "start": 1329180,
      "end": 1353667,
      "timestamp": "22:09"
    },
    {
      "speaker": "B",
      "text": "であーなるほどねーあれ前にフロックでイベントやったときだったっけ会社によってはそもそもパフォーマンスの良し悪しみたいなところにAIのトークン数って判断してるみたいなね会社もあったりとかするらしいし。",
      "start": 1353667,
      "end": 1372786,
      "timestamp": "22:33"
    },
    {
      "speaker": "C",
      "text": "そうですねそれも面白いなって思いましたむしろお金かかるから利用制限するっていう考え方なのかなと思ったらむしろ使ってないやつは有効活用できてないからみたいな話ですよね。",
      "start": 1372786,
      "end": 1387274,
      "timestamp": "22:52"
    },
    {
      "speaker": "B",
      "text": "そうというわけで今お仕事の内容やっぱりスタートアップの中でもそういうフィーチャー作ったりとかいろいろしてきたっていうふうに思うんですけど実際どうですか働かれて今どんくらいですかそもそも期間。",
      "start": 1389630,
      "end": 1401668,
      "timestamp": "23:09"
    },
    {
      "speaker": "C",
      "text": "としては5ヶ月目かな5ヶ月かそうか。",
      "start": 1401668,
      "end": 1406177,
      "timestamp": "23:21"
    },
    {
      "speaker": "B",
      "text": "そうか具体的に何だろう今からそうするとそろそろプロベーションはとっくに終わっていてチームに今から入っていってもうメインの業務なんかもバンバンやっていくみたいなフェーズなのかなと思うんですけど何をやっていきたいとかあと業務の今の内容だったりとかっていうところって答えられる範囲で教え。",
      "start": 1406177,
      "end": 1425591,
      "timestamp": "23:26"
    },
    {
      "speaker": "C",
      "text": "ていただいてもいいですかそうですね今の業務の範囲で言うとテストをバンバン書いたりとかそういうところなんですけどやっぱり自分はフィーチャーサイドにもう一回戻りたいなっていうのがあって自分が持たされてたそのフィーチャーってもちろんCTOから来たものだったんで良かったんですけどビジネス上すごい優先順位が高いっていうやつがあったんでやっぱり実装していく中でなんていうんですかねなんでこれをやるのかみたいなすごいこうなかったし周りのエンジニアもそうだしビジネスサイドもそうだしそれはなんかCTOから話が来たからってそれだけをもってみんながこれやるべきだよねって言ってくれるってわけじゃないので日本だとねそういうのあるかもしれない確かにみんなの自由でカオスなんでもうちょっと会社にとって重要なものをやっていきたいなと思っててもう少し長い目で言うと技術的にこういう改善をしたっていうレジュメを書くっていうのも大事なんですけどアクトとしてこういうものを作ったとこういう意義があったっていうのの中でしっかり結果を持って説明できるよう。",
      "start": 1425591,
      "end": 1505650,
      "timestamp": "23:45"
    },
    {
      "speaker": "B",
      "text": "な仕事をしたいなるほどねそれはまぁやっぱり後の例えば転職だったりとかね次のやっぱりキャリアだったりとかも見据えてアピールできるものを作っておきたいっていうマインドはあるってことですよ。",
      "start": 1505650,
      "end": 1517093,
      "timestamp": "25:05"
    },
    {
      "speaker": "C",
      "text": "ね多分そうですねあと自分がエンジニアになったその現体験というかやっぱりそういうところにあるのでパフォーマンスを上げたとかそういうのも大事だし学ぶべきなんでやりたいんですけど最終的には何か単位でこういうふうにユーザーが喜んだみたいなちなみにフィーチャー。",
      "start": 1517093,
      "end": 1538671,
      "timestamp": "25:17"
    },
    {
      "speaker": "A",
      "text": "作ってそこら辺のインパクトとかは測れるようになってたりするんですかいや。",
      "start": 1538671,
      "end": 1544615,
      "timestamp": "25:38"
    },
    {
      "speaker": "C",
      "text": "そこもちょっとよく分からないっていうのがあってですねただ物によっては測れるかなと思います例えば例を挙げると支払いのオペレーションをマニュアルでやっている業務がとはいえありますみたいなそれを自動化するっていうのがあってそれは時間単位でこれだけ削減できるというのは目に見えてできるかなと思いますしあとその例えば医療系で保険の請求みたいな話があった時に保険の情報が不正確だから請求が正しく行われないみたいなその数字がパーセンテージで表示されてたとしてそれを解決する自動化とか正しい情報を提示するようなものを作ってもしその比率が改善したとしたらそれは成果として言えるんじゃないかな。",
      "start": 1544615,
      "end": 1598422,
      "timestamp": "25:44"
    },
    {
      "speaker": "A",
      "text": "僕ももともと小さい会社にいて、そこらへんが結構転職するときに、測れたとか、そこらへんを気にしながらもうちょっと働ければよかったなっていうのがあって、測るような仕組みは会社にないだったりとか、日々あんまりそういうふうなことは気をつけないと思うんですけど、もし機会があれば、そこらへんをどういうふうに測ったらいいだろうみたいなのを、考えてみると、考えてみて、まぁ後でメモっとくとかすると、すごいいいなって思ったんで、もしあれだったらやってみてくださいっていう。",
      "start": 1601623,
      "end": 1630374,
      "timestamp": "26:41"
    },
    {
      "speaker": "B",
      "text": "面白いなよね。",
      "start": 1630374,
      "end": 1631645,
      "timestamp": "27:10"
    },
    {
      "speaker": "C",
      "text": "素晴らしい。なんか今質問されると思ったんですけど、やっぱりこう今までって自分が生き延びることで精一杯だったんで、。",
      "start": 1631645,
      "end": 1638127,
      "timestamp": "27:11"
    },
    {
      "speaker": "B",
      "text": "まあ間違いない。",
      "start": 1638127,
      "end": 1639058,
      "timestamp": "27:18"
    },
    {
      "speaker": "C",
      "text": "今後どうするみたいだってあんまり考える余裕がなくて、そろそろね、やっぱ半年とか自分自身の成果っていうか、なんか転職するとかしないとかもそうで、夢の貢献っていうか、。",
      "start": 1639058,
      "end": 1650220,
      "timestamp": "27:19"
    },
    {
      "speaker": "A",
      "text": "ちなみになんかもっと長い範囲で言うとなんかこれからもずっとエンジニアやっていきたいなぁみたいな感じなんです。",
      "start": 1650230,
      "end": 1655286,
      "timestamp": "27:30"
    },
    {
      "speaker": "C",
      "text": "かそうですね、そこはまだ自分でも決めかねてるんですけど5年くらいは少なくともやりたいなって思って結構好きっていうか楽しいなって思いながら今やってるんで単純に好きだっていう理由がまずあってあと実際に自分で作っていってるっていう感覚もありますしその辺は本当にこうなって良かったなって思ってどっかでもし違う道があるとしたら例えばその金融系僕は金融の業界に10年以上いた人間で金融のその会社に戻ってもう少しプロマネっぽいプロダクトマネージャーみたいなそういう道も全然タイミング次第ではあるかなとまだちょっと決めてはないんですけどなる。",
      "start": 1655286,
      "end": 1708399,
      "timestamp": "27:35"
    },
    {
      "speaker": "A",
      "text": "ほどですねあとは海外っていう、海外だったりカナダっていう背景ではどうですか?ずっとカナダにいようかなって感じですか?子供が教育とかっていう話があったと思うんで、そこら辺はカナダを考えているのかなとは思うんですけど、その後とかまたまた全然違う国気になってきたよみたいなのがあれば教えてください。",
      "start": 1708399,
      "end": 1729188,
      "timestamp": "28:28"
    },
    {
      "speaker": "C",
      "text": "そうですね、現状カナダやっぱりここになるべく住みたいなって気持ちが今は強いです他の国に行ったりとか考えてないですねやっぱり子供がいるとすごく育てやすいですしあとバンクーバー気候もいいしアジアフードもいっぱい手に入るんで間違いない困ることがあんまり正直ないかなこの生活が結構気に入ってるんでなるべくここにいられるように頑張りたい。",
      "start": 1729188,
      "end": 1755711,
      "timestamp": "28:49"
    },
    {
      "speaker": "A",
      "text": "なって感じ素晴らしい子育てが終わったら日本に帰ろうみたいなのもないですか?",
      "start": 1755711,
      "end": 1761699,
      "timestamp": "29:15"
    },
    {
      "speaker": "C",
      "text": "特には。そこまでちょっと考えてないっていうかね。",
      "start": 1761699,
      "end": 1765631,
      "timestamp": "29:21"
    },
    {
      "speaker": "B",
      "text": "そうですね、。",
      "start": 1765631,
      "end": 1766192,
      "timestamp": "29:25"
    },
    {
      "speaker": "C",
      "text": "だいぶ長期ですもんね。そうですね、でもやっぱり夫婦でゆっくり旅行したいとか、カナダだったりとかあるんで、僕に今聞かれたらイエスですね。カナダに残ってカナダに帰りたいなって気持ちはありますけど、親が退職して、どっかでいろんな前提が変わっちゃったりとか、。",
      "start": 1766192,
      "end": 1789561,
      "timestamp": "29:26"
    },
    {
      "speaker": "B",
      "text": "見えないことはまだまだあるでしょうからねどうかどうなるかわからないところも国ごとにもあるかもしれないし。",
      "start": 1789571,
      "end": 1795553,
      "timestamp": "29:49"
    },
    {
      "speaker": "C",
      "text": "はいはいそうですね素晴らしいちなみ。",
      "start": 1795553,
      "end": 1798974,
      "timestamp": "29:55"
    },
    {
      "speaker": "B",
      "text": "にこれはちょっと次の話題移る前の部分があるんですがやっぱりご家族で来られる方々ってなんか俺両極端に理解しててなんかむちゃくちゃ苦労してるっていうなんか意見とこんなに住みやすいところがないっていう人と何が差なんだろうなってすげーわかんなくて僕はもう子供もちろんいないからもしかしたら見えない世界があるのかなって思ってたんですけどなんかいっさの周りとかどうですかやっぱお子様いらっしゃる方とかで周りいらっしゃるんでしょうけどなんか楽しんでる人とそうでもない人の差とかみんな楽しんでますか。",
      "start": 1798974,
      "end": 1831116,
      "timestamp": "29:58"
    },
    {
      "speaker": "C",
      "text": "そもそもいやーえっとまぁどうなんだろうな結構立場によるかなと思う。例えば永住権取ってて、こっちに値下ろしてる人は多分住みやすいと思いながら、日本は旅行で帰る場所だみたいな。",
      "start": 1831116,
      "end": 1847157,
      "timestamp": "30:31"
    },
    {
      "speaker": "B",
      "text": "まあね、ありますよね。",
      "start": 1847157,
      "end": 1848458,
      "timestamp": "30:47"
    },
    {
      "speaker": "C",
      "text": "日本人の場合ですけど多いんです。やっぱり一緒に乱殻で始めた人っていうのは結構辛い気持ちになっている人は多いかもしれない。ですけどあのちょっと日本人で周りにいないんで海外の人って言うともうな帰る選択肢がない人が多いであまあそうよねうんにもなんかいるためにどうするかしか書いて。",
      "start": 1848458,
      "end": 1870057,
      "timestamp": "30:48"
    },
    {
      "speaker": "B",
      "text": "ないそうですよねまあ僕らはほら日本だからって言ってあるかもしれないけどまあいい国なのでかいやなら帰れが通じるかもしれないけどよその国。",
      "start": 1870057,
      "end": 1879604,
      "timestamp": "31:10"
    },
    {
      "speaker": "C",
      "text": "そうじゃないですからねそうですね。これは子供がいるかどうかに関わらず、カナダをエンジョイできている人かどうかなんですけど、カナダを好きになろうというアクションを取っている人が多い気がします。例えば、いろんなところに旅行に行ったりとか、カナダでカナダのお祝いをするとか、応援するとか。その国のカルチャーだったり、その国の文化をまず好きにならないと、自分が心地よく住めるようにならないって学んだんですね。で、まあそれ結構周り見ててもそうかなと思って。ニワトリ卵ですけど、結構こう、動いてる人はカナダのことが好きになって暮らしやすいみたいな印象を持ってる人。",
      "start": 1879604,
      "end": 1926225,
      "timestamp": "31:19"
    },
    {
      "speaker": "B",
      "text": "が多いかも。はいいやー素晴らしいありがとうございますずっとちょっと気になってたんでね好きになるじゃあ努力っていうところってことですね。",
      "start": 1926225,
      "end": 1935644,
      "timestamp": "32:06"
    },
    {
      "speaker": "C",
      "text": "そうですねはい日本人で。",
      "start": 1935644,
      "end": 1937527,
      "timestamp": "32:15"
    },
    {
      "speaker": "A",
      "text": "言うとやっぱりその日本から出たくて来てる人っていうのとあの海外を楽しみに来てる人っていう違いはあるかもしれないですね。",
      "start": 1937527,
      "end": 1947438,
      "timestamp": "32:17"
    },
    {
      "speaker": "B",
      "text": "あるね。",
      "start": 1947438,
      "end": 1947978,
      "timestamp": "32:27"
    },
    {
      "speaker": "A",
      "text": "やっぱり後者の方は来てみると結構絶望すると思うんですよね。日本ってなんでいい国になったんだって言って帰るみたいな帰るというか、あんまりなんかそのネガティブなところから入ってるんで、あれカナダここもダメだしここもダメだしここもダメだしみたいな感じの探し方になっちゃって、ま、石さんが言うようにその、なんか好きになる努力をしている人たちはここはいいなっていう目線にやっぱなってるからっていうのもあるのかもしれないですね。",
      "start": 1947978,
      "end": 1975331,
      "timestamp": "32:27"
    },
    {
      "speaker": "C",
      "text": "そうですね。やっぱりネガティブな気持ちで来ない方がいいですね。日本が嫌だから来るっていう。そういう気持ちは別にあってもいいと思うんですけど、それだけで来ちゃうと、カナダはその嫌な気持ちを包んでくれる社会になるので。間違いない。そうですね。そこのギャップに耐えきれず、自分の居場所がないような感覚。カナダもダメじゃんみたいな。",
      "start": 1975341,
      "end": 1998868,
      "timestamp": "32:55"
    },
    {
      "speaker": "B",
      "text": "うーんいやそうなんすよねだからxとか見ててもこの間もなんかyoutbe見てたらもうカナダのなんかあの悪いところ10銭みたいなやつとかやっぱ出てきてそういやーなんかすごい嫌なとこだけを探したなんかたま手箱みたいになってるなぁみたいな牛乳詰めパック嫌なところなんか探しましたみたいな感じになってるそういう出され方するとそうかーって思うしかない。",
      "start": 1998878,
      "end": 2024040,
      "timestamp": "33:18"
    },
    {
      "speaker": "C",
      "text": "っていうねそうですね、それは何かどこのカルチャーが優れてるとか、そういうことはないんで、何かそれを探して遊べるか。ただ、何かどこが自分に合ってるかっていう。",
      "start": 2024040,
      "end": 2033734,
      "timestamp": "33:44"
    },
    {
      "speaker": "B",
      "text": "そうですよね。いや、すいません、ちょっとそういうのを見たばっかりだったんで、あの、なんかイッサンみたいにちゃんと楽しんでる方もいるって聞くとちょっと安心するっていう。みんなここにいるからねありがとうございますというわけで俺の感想も含めて話し入っちゃいましたが実際どうですかやっぱり国有に今までいらっしゃった石さんの目線から見てっていう部分ただやっぱり日本最後いらっしゃったのはスタートアップでテック系の会社っていう部分はあったと思うんですけどどの辺がやっぱり日本で働いていた環境と実際こっちで働き出してる環境とってここ違うよねとかここが変わったよねっていう部分あったらぜひ聞いておきたいなって思うんです。",
      "start": 2033734,
      "end": 2070614,
      "timestamp": "33:53"
    },
    {
      "speaker": "C",
      "text": "がそうですね、スタートアップと比べるか銀行と比べるかによってだいぶ変わっちゃうんで僕の中でも結構混乱が生じてるんですけどちょっと頑張って一般化して言うとやっぱり批判文化じゃないというかそれはいい悪いがあるんですけど褒め合う文化って言うんですかね、こっちは自分の心理的安全を確保して例えば分かんないこと分かんないって聞きながら被害を犯すことを恐れなくなったりとかそれがかえって自分の業務効率とかアウトプットのスピードを上げていくのが結構いいとしてはあるかなと思っています悪い面というか、もちろん代償としてやってって言ったことをちゃんとやってくれないとかありますよねあるんですけど働く個人っていうか僕の気質としてどっちが合ってるかって言われたらやっぱりこっちで働いてた方が自分は気持ちよく働けてるかなって思います逆にそれが嫌だっていう人も嫌っていうかちゃんと決まってないから気持ち悪いっていう人も中にはいると思うんですけど決まってないから自分で決めれるっていう考え方をする。",
      "start": 2070614,
      "end": 2147176,
      "timestamp": "34:30"
    },
    {
      "speaker": "B",
      "text": "なるほどですねまあそうかそこらへんはまあ良し悪しあるんだろうなぁとは思いつつこれなんか前にも言いましたよね別のゲストの方でやっぱりあのカナダと日本でっていう分で比べた時に出版に対して寛容だっていう部分だったりとかねやっぱお話する人がやっぱ多いのでそこはじゃあもうみんな共通で思うこと。",
      "start": 2147176,
      "end": 2166252,
      "timestamp": "35:47"
    },
    {
      "speaker": "C",
      "text": "なんだろうなきっとそうですねなんかやっぱりあの確実まあでもこれカナダだけじゃなくて自分の経験で結構そのタイとかも似たような感じうーんなんかその不確実性に対してなんかお前ないみたいな俺はそのまま受け入れて次の勝手にするみたい感じの人が多い気がして日本で働いてる時って銀行ですけど結構その例えば役員会議とかがあるかなり前々から準備するんでその良い面としてはその会議のクオリティは当然上がるんですけど使ってた時間とかあるいはその役員の人が意思決定する材料ってもうすごい完成されたものができてるそしたら役員の人じゃなくてもできるかもしれないあったりするとなんか会社全体のリソースの使い方としてなんか本当にいいんだっけみたいなあるかなと思う会員にいる時って同じ業種で同じように大企業に会員のですけどね会員にいたんですけど百位会議の準備はなんか3日前からし始めるみたいななるほどね3日前までないままあげるんで大体会議があれるんですねでもあのみんなそこであのよくわかってないながらなんか結論は割とあの日本のスタートアップもまあそれに近い感じでしたそれってあの不確実性の中で議論していくようなスタートアップなんで当たり前ですこっちもしっかり感じ。",
      "start": 2166252,
      "end": 2256710,
      "timestamp": "36:06"
    },
    {
      "speaker": "B",
      "text": "ですねなるほどねありがとうございますまあそれをねさらも環境によるようになっている間違いなくあるんだろうけれども。",
      "start": 2256710,
      "end": 2262753,
      "timestamp": "37:36"
    },
    {
      "speaker": "C",
      "text": "そうですねまあでも全体。",
      "start": 2262753,
      "end": 2264872,
      "timestamp": "37:42"
    },
    {
      "speaker": "A",
      "text": "を通してやっぱ人の失敗にも自分の失敗にも寛容っていうのはあります。",
      "start": 2264872,
      "end": 2268834,
      "timestamp": "37:44"
    },
    {
      "speaker": "C",
      "text": "よねうーんこっちの場合やっぱり。",
      "start": 2268834,
      "end": 2271496,
      "timestamp": "37:48"
    },
    {
      "speaker": "B",
      "text": "言語からしてそうじゃないですかやっぱりまあ完璧な英語すらみんなあんまり喋ってないよねっていう中でやっぱりやりとりしてるからなんかなおさらそう感じることが多いのかなっていう気も若干するよ。",
      "start": 2271496,
      "end": 2281761,
      "timestamp": "37:51"
    },
    {
      "speaker": "A",
      "text": "ねまあ完璧な英語ってものがないっていうのをみんなわかってるって感じじゃないですかあー確かに確かに英語の文脈で言うとうん間違い。",
      "start": 2281761,
      "end": 2290466,
      "timestamp": "38:01"
    },
    {
      "speaker": "B",
      "text": "ないなのでいろんな意味で寛容なんだなっていうところはすごく思うところですねそうですね。",
      "start": 2290466,
      "end": 2297171,
      "timestamp": "38:10"
    },
    {
      "speaker": "A",
      "text": "そうしたら、最後の質問なんですけど、自分のような、って言うとあれなんですけど、自分のような性質の人に、これから留学とか渡航とか考えてる人、たぶんいっぱいいるんですけど、なんかアドバイスをするとしたら。",
      "start": 2297171,
      "end": 2314308,
      "timestamp": "38:17"
    },
    {
      "speaker": "B",
      "text": "でも多分アドバイスとしては多分割と今回分かりやすいよねおそらく別業界からエンジニアとしての業界に飛び込みなおかつ国も変えるっていうなんかデンジャラスなというか結構ぶっ飛んでる。",
      "start": 2314774,
      "end": 2329240,
      "timestamp": "38:34"
    },
    {
      "speaker": "A",
      "text": "小分けにしていきます別業界から来る人に対してちょっとアドバイスをするとしたら。",
      "start": 2329240,
      "end": 2334202,
      "timestamp": "38:49"
    },
    {
      "speaker": "C",
      "text": "別業界に来る人に対してアドバイスするとしたら別業界の経験を大事にしてくださいですか確かにフロックのインタビューでも答えたんですけど僕自身がそうだったっていう話ですが全く違う業界に来てエンジニアとしてゼロからこっちで学ぶと自分の価値がゼロになったような気がするなんか初学者の錯覚みたいなそれって自分が今まで別業界で別の仕事をしてきたっていう価値の上に乗っけていくものむしろ自分の価値を上げる方向でしかなくてそこはエンジニアとして就職できているかどうかとは別に考えてほしいなってそれは心持ちだけの話じゃなくてそれを利用してエンジニア就職に少しでもつなげる道があったりとかそういうことを考えてみてもいいのかなとは思ってその未経験別業種から来たからこその強みが逆にあるよっていうそれをどうやってプレゼンするかと考えれると確率が上がるパスが。",
      "start": 2334202,
      "end": 2404934,
      "timestamp": "38:54"
    },
    {
      "speaker": "A",
      "text": "増えるっていうか前半後半を通してすごいそれはなんかもうすでに見えたのかなっていう感じがしますよね話を聞いて未経験の人に対してはどう。",
      "start": 2404934,
      "end": 2414981,
      "timestamp": "40:04"
    },
    {
      "speaker": "C",
      "text": "ですか未経験の人に対してはAIがあるからといって自分の道が通わされたってわけじゃなくてしっかりなんていうんですかねだからこそ未経験とかそのジニアっていうんですかね対して道が開けるっていう考え方も多分あるだろうし自分が興味を持ってやるんだったらそこは普通に飛び込むと思い。",
      "start": 2414981,
      "end": 2441881,
      "timestamp": "40:14"
    },
    {
      "speaker": "A",
      "text": "ますねそしたらじゃあ最後に家族でいろんな要素がありすぎて、あれですけど、それもすごい大切だと思うんですよね。今考えてる人多いと思ってて。家族連れの人で、これからどこを考えてる人にアドバイスをお願いします。",
      "start": 2441881,
      "end": 2464001,
      "timestamp": "40:41"
    },
    {
      "speaker": "C",
      "text": "まず子育て環境がいいかどうかに関してはすごくいいと思います子どもが英語ができないとかそういうのもカナダはそれを前提にしているので英語をしゃべれなくてもこっちでなんとかするから家で日本語教育しといてよちゃんとむしろ学校から行ってくるぐらい文化の人を受け入れる寛容さがあるし子供に何かあった時にちゃんと大人がちゃんと守るような意味というか、そういうことをちゃんとやっていくと安心感があるので、育てに関しては不安はないっていうのが今の実感ただお金をめちゃくちゃ使うよね特に密集学児は現実的になかなか入れるところがなかったりとか見つかっても月1000ドル近く払ったりとかなんで、要は家族で来る人にはお金の準備は現実的にちゃんとしないところですねすごく貯金を持ってこっちに来るか、あるいは日本で稼ぎ口を作ったらこっちに来るかっていう感じですねうちは妻がたまたまこっちで仕事が見つかったんでなんとかなってますそれ自体にあんまり再現性はないと思って確率を高めるって意味では日本で仕事してそれこのこっちへ持ってきて家計を支えるその通ってない方がです学校に行ってない方がなんでこうあの未収入期間を乗り切るって言うランニングを立った上であの来ないと結構やっぱり実際お金を使ったなっていう感覚そこはちょっと現実的にあのお金の計算ちゃんとしたそこら。",
      "start": 2464011,
      "end": 2564767,
      "timestamp": "41:04"
    },
    {
      "speaker": "A",
      "text": "へんもうちょっと詳しく聞きたいですね僕はあのまあ今回でではなくまたちょっと別の機会にお願いしたいんですけどまあセナさんもそうだと思うんですけどまあ僕うちもまあそのうちうちはまあそのうちなんですけどあの子供を考えているんですけど全然なんだろうイメージが湧かなくて多分それって日本にいる人だともっとイメージつかないと思うんですよねなんでフロックの中でも何人かやっぱりお子さんがいてあの今の話だと石さんは未就学児の人と小学生のあの年の人がいて多分他のちょっと上の人とかもいると思うんでそういう人たちも含めてちょっと僕たちが勉強させてもらうみたいなのをちょっと作ってみてもいいかもしれないですねということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcasyoubetなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2564767,
      "end": 2626380,
      "timestamp": "42:44"
    }
  ]
}
