{
  "episodeGuid": "c83faa60-943d-4110-a084-ec0045b4ecc9",
  "episodeTitle": "ShopifyのSREが語る！日本→イギリス→ドイツ→カナダ、4カ国を渡り歩いたエンジニアの軌跡（前半）#25",
  "transcribedAt": "2025-12-05T22:45:26.747Z",
  "duration": 2420,
  "fullText": "今回は雄生さんに来ていただきました雄生さんはカルガリーからカナダのショピファイで今働かれています簡単に経緯というか経歴を教えていただいてもいいです。かはい今はショピファイですね紹介いただいたとおりカルガリーからリモートでショピファイのSREをしていますカナダに来たのがちょっと記憶が曖昧なんですけど3年ぐらい前でそれはショピファイの社内での転席という形でカナダに来てるんですけどその前はベルリンにいてショピファイに入社したのもベルリンで一度入社してそこから社内で移動という形になります時系列的に逆にすると書いてややこしいんですけどそうですねその前はベルリンでサウンドクラウドという会社で働いていてそれが3年その前はスパッドのブリストルというところにある拠点で働いてイギリスのブリストルというところで働いていてそれも2年半3年ぐらいなのでカナダが日本も含めて4カ国目で海外が大体9年10年ぐらいになるというような感じですすいません、なかなかまとめにくい経歴になってきて、自分でもちょっと記憶が曖昧なんで、パッと言えなかったんですけど、そんな感じです。ありがとうございます。ちなみに僕もちょっと聞きたいんですが、ポジション的には最初のCokpadがソフトエンジニアですか?そうですね、それは一社目じゃなくてその前にMTIという会社で働いてそこが新卒で入った会社なんですけどその時から基本的にはモバイル、iOSのアプリの開発をずっとしていてクロパッドもiOSエンジニアとして入社してます。クーパッドにいた時代はもうずっとiOSエンジニアですで、iOSエンジニアとして次のサウンドクラウドベルリンにいた時もiOSエンジニアとして転職して転職サウンドクラウド時代に社内で移動という形でSREになったので社内移動かそうなんですだからSRE自体は結局5年とかうーんぐらいのことかなと思いますねはいその前のソフトiosエンジニアですやることは。結構変わるんですか?なんか今ちょっとLnkedIi見させてもらったんですけどシニアのiOSエンジニアからシニアのSREに移ってるじゃないですかそんな結構簡単になんだろうコンバージョンできるもんなんですか。結構珍しいですよね結局やっぱりもし転職でiOSエンジニアだったんですけどSRE対応してくださいっていうのは基本多分無理だと思うのでどっちかっていうと社内でネットワーキングしたりとか社内のドメイン知識とかがあるっていうこととプラス多少はインフラとかバックエンドのことっていうのはもうちょくちょくは触ってたんで全く知らないってわけではないんですけどそれプラス社内でのネットワークと社内での知識っていうのをレバレチック化してえーやらしてもらったって感じで一回一回もうSREになればSREですって言って転職活動できるんでたしかにそうですね一発一本目がちょっと大変だったんです。けどちなみになんかインタビューみたいなのはあったんですかその時にそうですね。まああのエンジニア組織的には100人とか200人ぐらいの会社だったんでそんなにすごいゴテゴテしたプロセスがあるってわけではないんですけどもちろん向こうのICとかマネージャーとかとは話して軽くインタビューして基本的なことを聞かれて最低限の知識はあるよねっていうところは担保してもらって入ってはいます。なるほどねちょっと今回ね僕があのユーセイさんにどうしてもお話聞きたいっていう実は過程がねあってあのちょっと昔というかもう1週間くらい前かなツイッターでちょっとぼやいちゃったんですよね僕があの最近フロックの方にSREの問い合わせが実は結構多いっていうのがあるんですがフロックの中でもねあのいないよね東海オンエアさんはフロックの周りでSRE。知らないですねまあ特にバンクーバーがあのプロダクトエンジニアが多いというかウェブ系が多いっていう背景があってそうあんまりあとは多分アメリカの企業だとSREとかそのDevOpsとかその少ないポジションって割とそのアメリカでなんだろう最初だっていうのはMVPだったり作る時に多分もうハイヤーしちゃってて、でそこからウェブのプロダクト大きくするとかでバンクーバーに来るとかっていう背景があると思うんで、もうすでにチームがアメリカの方にあるからバンクーバーはウェブだけとかっていうのが割とあるあるなのかなって僕の中では思ってる。んですよねそうよねっていうのもあって僕自身もSREキャリアが番組まで頑張りたいですって言われてもちょっと正直数も少ないし事例も少ないから答えにくかったなっていう部分があっていやちょっと待ってよとそう考えれば雄生さんとかあと我が妻さんだったりとかっていうフロックの中にいる方々でSREいるじゃないかって思ってちょっと今回お声掛けをさせていただいたので今ちょうどお話しいただいたところはかなり興味があってやっぱ社内に最初就職されたときとかサウンドクラウド行かれたときはIOSエンジニアで今お話にあった社内のいろいろな交渉があったりとかっていう分があってSREのポジションにっていう分パッと僕の勝手な印象ですけどやっぱりインフラとかDevOpsとかのキャリアを持ってる方がもっと社内のたくさんのシステムだったりとか開発環境だったりとかに従事するためにSREのポジションに転席みたいなのが普通なのかなって思ってはいて開発側の知識もそれあった方がいいんだろうけれどもっていうのもありつつ割とどうですか優生さんの周りのSREの他のポジションの方々とか見てキャリア的に開発からSREって割とコモンというか普通のことなんですか。えっと。そうですねえモバイルからsruやる人はほぼいないですそれは間違いないと言ったらあのバックエンドのエンジニアとかがインフラに来るっていうのは多分全然あるそうだとは思いますねもちろんそのバックエンドのエンジニアでもそのdbの知識。メッセージMQの知識とかそういうのが結構ある人っていうのがいるのでそういう人の中でもインフラ寄りの作業が好きっていう人がSREになったりってことは全然あり得るんじゃないかなと思いますねたださっきもちょっと軽くお話に多分出たと思うんですけど会社の規模とかでやっぱりやるフェーズによってその全然やることが多分違うし僕はそもそもSREっていう文化ができてってからDevOpsがどうのみたいなSREっていう文脈が出てきて後からこのポジションになってるんで実はそんなに歴史的なことに詳しいわけではないんですけどやっぱり会社のフェーズで全然やることが違うので意味してるものとかっていうのももちろん定義云々みたいなのここである人もいるんですけど現実的には結構会社によってやってるその求めてることが全然違うというか例えば前職だと会社のエンジニング組織の規模がそんなに大きくないんでSREっていうとインフラにめっちゃ詳しい人みたいな全部やる人みたいな感じでデータベースのプロビジョニングしますとかクラウドのネットワーク組みますとかサーバーの構成構築してありますとか何ならデータセンターますみたいなのとかそういうのも何が全部やるような感じの仕事だけど今ショッピファイ来てショッピファイてまあちょっとエンジニアにエンジニアの人数僕知らないんですけどまあ1万人マイおそらく以上のます会社全体ではまあそれぐらいのます数の人がいるんで結局そのそれぞれのインフラのコンポーネントにはそれに特化したチームがいてデータベースならデータベースチームしかもデータベースのテクノロジーごとにチームが違ったりするケースもありますしネットワークはネットワークだけやってる人がいたりとかみたいな感じでそうなってくるとSREってなんかこうかなりこうもっと上のレイヤーっていうかなんかそういうのを特定の技術は触るってよりかはインシデントの対応したりとか社内でリスクを洗い出したりとかあとはその。自動化の部分とかだったりとかグルーワークが結構多くなってくるっていうかこの障害が発生しましたみたいな自分たちが障害対応一時受けをやるし自分たちが原因の特定もできるだけするんですけどじゃあこれデータベースだよねって分かったらデータベースの人を呼んでデータベースの人と一緒に作業するみたいなお。だしょーそのデータベースの人はSREではないんです。か三宅ないですねデータベースエンジニア的な感じなんですよねデータベースの人呼んでそうすると例えばこのクエリが悪いよねみたいな感じになったら今度アプリケーションのエンジニアも呼んできてこれなんとかならないのみたいな感じ話したりみたいな感じになるんで結構そのインフラ周りの障害とかパフォーマンスチューニングとかそういうのをいろんな人をなんかこう寄せ集めてまとめ上げるみたいなタイプの仕事が結構多かったりするので結構抽象度が上がってくるんですねなんか。オンコールみたいな仕事ですね。オンコールは基本的にだからオンコールが一番メインの仕事ではあるんですよねただ幸いそこそこ人数がいるのと一応週末以外は自分の業務時間外でオンコールしないといけないっていうことはなくて他のタイムゾーンにも人がいるんでずっとオンコールってわけじゃないんですけど基本的にはちゃんとプラットフォームレベルのかなり大きな規模の障害をちゃんと一重計として。対処できる原因を特定してエコホルダー集めれるっていうところが一番メインの仕事ではありますすごい。そんな統括的なお仕事だったんですね割とさっきはすみませんありがとうございますあのさっきねやっぱりその会社によるよねっていう部分で割と比較対象になるかわかんないですけど東橋さんとかのそれこそ朝野とかもやっぱりSREのポジションの方ねやっぱりいらっしゃるんじゃないかなと思うんですけどどうですか似てます業務の体制と。かにいやそれこそ今言おうと思ったんですけど僕あの僕自身weboncalっていうwebのサイドのoncalをやっててまあ結構まあ激しめのoncalだけど2か月に1回か3か月に1回ぐらいかなでその一重計が僕たちなんですよね逆にでえっとそのでインフラの方だよねとかでなったらそのインフラのチームまあsreとかそっちのチームを呼ぶみたいなでなんかあのエスカレートするみたいな感じなんでそっからみたいな感じがあるかなでその人たちが何をやってるのかは全然わかんないすごく。あ良かったウェブじゃないみたいな感じで思ってでそのミーティングとかにずっと言いさせられたりもするけど何も言ってる何言ってるか全然わかんないみたいなじゃあ。あれか少なくとも一時受けが東海オンエアさん達っていうことであればSRAがどう統括とって誰かに振るみたいな話ではないって。ことだよねそうですまあでもそっからそういうのが起きてるのかもしんないけどうちはそこまで規模が大きくないので多分SREがもうちょっといろいろやってそうなイメージはあるかなって感じですデータベースエンジニアとかはいないではないかもしんないけどインフラのチームにそのデータベースの担当みたいな人が何人かいるみたいな風なのになってそうかなわかんないですけどねなるほど。ねだからさっきのユーセさんのおっしゃっていたやっぱりその会社によって違うよねの部分もそういったところでやっぱり色は変わってくるってことだよねそうな。んですよねなのでどうすればなれますかっていうタイプの質問は結構正直答えにくい多分ハマるところもあるしハマらないところも同じSREっていうポジションでも全然あって。例えば僕とかだと前職もそんな大きい会社ではないんですけど言うてもそのトラフィックが世界中であるんで。グローバルインフラっていう感じで複数のリージョンにデータベースとかサーバーがあったりみたいなそういう構成を取ったりしてるんでそういう意味では初期化への規模ではないんですけど基本的に複数のリージョンにユーザーがいる場合にどういうインフラを組むべきかみたいなことに関しては多少知見があるみたいなそういう話をしたら入れてもらえたみたいなこともあるんですけどでも多分そういう経験がないけど例えばなんかめちゃくちゃ特定のインフラのコンポーネントに詳しいみたいな人とかだったら多分他にマッチのチームがうちの会社だったらあったりすると思うしなるほどその意味ではなんか結構僕はいつもなんか総合格闘技っぽいなっていうんでいてなんかその別になんかこういう特定のパスがあるっていうよりかはなんか割といろんなバックグラウンドの人がいろんなとこでいろんなことをしているみたいな感じもあってなのでそういうアプリケーションのレイヤーからきてアプリケーションの知識が強いからアプリケーションから発生するインフラの問題を解決するような得意な人とかっていうのもいるんですよね悪いクエリとかがあったらすぐ見つけて直せるみたいな人もいるし逆にめちゃくちゃLinuxに詳しいおじさんみたいなのがいてこれはカーネルのあれだよみたいなそういうことをすぐ。言えるような人とかっていうのもいるし例えばコミュニケーションがめちゃくちゃ強いからあんまり特定の知識はないんだけどめちゃくちゃそのインシデントのハンドリングが上手いみたいな人とかもいたりして本当になんかその職域領域があってそこがはまればなれるみたいな。感じが正直ありますちなみにインタビューはその場合どうなるんですか例えばなんですけど朝菜はSREのエンジニアだろうが多分同じインタビューしてるはずなんですよねでただ普通のソフトエンジニアでもそこらへんのそのリージョンであのサーバー別に持つだとかの知識は絶対みんななんかそのサーフェス的には必要でそこらへんちゃんとなんかなんだろうなえっと。CSのバックグラウンドがありますよっていうのを証明しないとインタビューのうちに証明しないといけなくてそこからみたいな感じになっててチームごとでインタビューを変えてないんですけどじゃあそこら辺はなんだろうSREのインタビューとそのプロダクトエンジニアのインタビューみたいな感じで別々。で分かれてるんですか多分多少はその適正みたいなのを見ると思うんですけど基本的には。多分バックエンドのエンジニアとかがやってるようなのと同じことは多分やらされてると思います普通のコーディングのインタビューもあるしそのいわゆるシステムデザイン的なやつをやってそうなんですかねむしろ開発の人ってシステムデザインとか多分シニアとか以上だとあるんじゃないかなと思うんですけどまあそういうのはあってむしろ多分大きい会社になってくると、なんかもう特定の技術よりかは社内のドメイン知識があった方が結局いろんなものが抽象化されてるんでなんか結局社内のドメイン知識をつけないと使い物にならないみたいなとこがあるんでなるほどねここの勝手なイメージですけど規模が大きく会社が大きくなればなるほどそんなに特定の技術要素についてはあんまり聞いてこないもちろんそのそういうあの特定のポジションに入れば別ですけど例えばsreやりたいってなって大きい結構かなり規模の大きい会社に入るってなったらもうなんかその特定の知識をチクチク聞いてもなんか仕方ないし曲入ってから学ばないといけないことの方が多い。んで朝なはまあ。そんな感じですねcsの知識がまあちゃんとあるかっていうところが一番大事なんじゃないかなと思います。そうですね確かになんかまあ朝もそうですけどフロントエンドの技術とかあんま聞かれないしまあなんかリアクトとかなんか言語固有のものなんてかっても結構まあ入ってから学べばいいよねぐらいのなんか最初のブートキャンプでちょろっと触らせられるぐらいのがあるぐらいでそれ以外はもうなんかほぼ聞かれないしみたいな感じで割とそっちに近めなのかな。なるほどねってするとなおさらあれだな俺も今後ちょっとSREになりたいですってどう言おうかなってすごい頭の中で迷うとこなんだけどとはいえ今の話聞いてる部分だと一般的なシステムデザインだったりとかアルゴリズムだったりとかっていうCSベースのやっぱり知識っていうところが当然あったほうが良くてその上で各企業ごとのドメイン知識を社内に入った後もちゃんとキャッチアップしていくことも当然必要で今の話聞いてる。とそこら辺たぶんだからCSのベースがあればそのキャッチアップはできるよねみたいなそのベースの上に成り立ってるものでしたねこいつのものはだからできるよねみたいなのはあってだからなんか元々その日本でも多分結構難しいとは思うんですけど経験があればプラスかなっていうのはあるのとあとどうしたらなれますかって言うと結構難しくて、やっぱカナダにそもそもポジションが少ないんで、じゃあとりあえずトロント行こうかみたいな話に多分なると思うん。ですよねポジションある方に。行こうねって一番そう一番ポジションあるの多分トロントだと思うんで。そうだよなぁ間違いないなのでまあ目指す方向性としてねSREみたいなポジションにやっぱり憧れ楽というかやっぱりねなりたいって人はそこそこいるなあっていう思うんですがなれるかどうかっていうのはねやっぱりその地域だったり会社だったりによるんだろうしという話になるんだろうからそういう意味だとどうすかねそのやっぱり開発工程にいらっしゃった方がやっぱり周りに多い開発のフェーズをやっぱり知ってる人がね少なくとも多いのかなと思っていてフロックのとこやっぱ多いのってあのやっぱ今までインフラにいましたとかチームとしてはインフラのチームにいましたとかDevOpsチームにいましたとかで次のポジションとして要するにSREなのかなそういったポジションもやっぱりすごく夢があるなっていうのが多いんですけど彼らがやっぱり見てるところってやっぱり開発側のほうに一回いたほうがいいのかどうなのかみたいな話やっぱり多くてその辺でも今お話聞いてる限りだと企業に当然寄るっていうのベースにはなるんでしょうけど雄生さんみたいにIOSならIOSエンジニアとしての開発チームにいたっていう時期は間違いなく生きてるだろうからやっぱないよりはあったほうがいいよねっていう話には落ち着くんすかねそう。ですね開発レイヤーにいる人の中で適性がある人っていうのは自分が例えば接続している先とか依存している先がどうなってるかっていうことに関して完全にシャットダウンしない人なんじゃないかなと思うんです例えばモバイルのエンジニアやってても基本的になんかのAPIに叩くわけじゃないですか。まあどうしてこういう作りになっているんだろうとかなんでこれこんな遅いんだろうとかまあそういうのがあった時にまあその自分でまあ直せないにしてもまあある程度そのこういうことが起きてるんじゃないかなとかっていうことにある程度の考えを巡らせれる人もちろんバックエンドとかフロントエンドの開発をしててもパフォーマンスとか自分がやってることがどういうバックエンドにインフラにどういう影響を与えてるかっていうのを考える機会は全然あると思うんでそこを掘りたい人とかそういうのに興味がある人っていうのは向いてるんじゃないかなと思うし自然に知識がついていくんじゃないかなと思う樋口ちょっと。耳が痛いですねなんか深井言うと思ったわ樋口言うと思ったわでもちなみにその聞いてくる人たちは日本でそういうSREの経験がすでにある人たちなんですか深井いやそういう。わけじゃないねそうまあ傾向なんてだけするんだったら本当にインフラエンジニアいますとかDevOpsチームいますとかでインフラ側だけ今まで見ていたんだけど次のキャリアっていうのを考えるときに最近SREって言葉をよく聞くからみたいな文脈が多く。て。なんかSREってそもそもポジションが少ないからソフトウェアエンジニアとかでやってこの講義でソフトウェアエンジニアになるって言ったときにそのすっ飛ばしてSREに行けるかって言ったら結構難しいですよねそのポジションがまず少ないしその小さい会社だったら一人いるかどうかみたいなのが多分普通だと思うし大きい会社になれば人数はいるけど。プロダクトエンジニアの人の比率でいうとやっぱ少ないからそのソフトエンジニアになってまあ経験積んでさっきユウセイさんが言ってくれたようにそのちょっとずつそのナレッジを広げていくというかもうちょっと深くあのベースの知識の方にもまあなんだろうキャッチアップしていくみたいなのを進めながらやっていくみたいなのはなれるかもしれないけどいきなりあの知識もないのにやってくださいみたいにはならなそうな感じがするし確かになっていうのはだから日本で経験があって例えばねLINEとかその交通量の多いだとかなんか他にどんなあれがそういう大規模システムがあるのかも分かってないですけど日本の中だとそういうところで経験があるのであればすぐ英語がしゃべればすぐこっちでもできるかもしれないけどそもそもやっぱ少ないっていうのがどうしてもあるから。だ。からでもアドバイスの仕方としてワンチャンそれは確かにアリなのかなって思っているのが彼らの僕のやっぱり話聞いてくるところでやっぱりとメガベンチャーのまあインフラちょっとに担当していてラージドラフィックのやっぱりまあ環境に行った経験もあるし海外に行ってもワンチャンSREのポジションとか見えてくるんじゃないかっていう文脈が多くてそう。やったらありそうですねそう。だねそうただやっぱりそれに該当しないとこだよね別にそのまああのあんまり大きい大きなトラフィック扱ったこともないしインフラにどれだけ深くあるのかもあんまりちょっと想像もつかないしみたいな人が開発の経験全くなしにいきなりsreっていうのはさすがにちょっとイメージがわかないんだろうなとも申しまあそうねそういう人に関してはもしかしたら一旦開発にもちゃんとあのちゃんと求人が多いという意味でたくさん求人があるという意味でまあソフトエンジニアを目指しつつ開発側の環境もわかるしインフラにももちろん元からいただく興味もあるしっていう状態でSRみたいなポジションがもしワンチャンあったらトライしてみてもいいんじゃないっていうのがちょっと王道にはなりそうなのかなーって僕の中で思いましたね。そうですねちなみにゆうせいさんはそのiOSエンジニアからそのサウンドクラウドで働いてた時にそのsreに聞かれたと思うんですけどそのなんか心境の変化みたいながあったんですかなんかどういうふうにそのプロダクマiosのエンジニアから移ろうと思ったん。ですかこれはうーんまあ商工技術あると思うんですけど僕はそのエンジニアなと2012年とかなんでiphone多分3とかそういうレベルなんですよねで各社モバイルファーストとかっていってスマホ対応これからしていくぞアプリ対応していくぞみたいなウェブからアプリへみたいなそういう時代だったんでとにかくやることしかないみたいな感じだったんですよねやり始めた時ってそれこそAppleのドキュメントも微妙だし。開発のベストプラクティスもないしエコシステムもいまいちだけどビジネスニーズはめっちゃあるみたいな感じなのでとにかくやった方が良さそうなことが無限にあるみたいなそこから始めてiOSリリースされるたびに全然結構新しいフレームワークが出てきてなんかあったらいいなみたいなレベルじゃなくてめっちゃ大事じゃんみたいなこれビジネスに直結するみたいなのがバンバン出てくるんでそれをどんどん対応していってみたいな感じで始めていくんですけど今だともう明らかにモバイルのテクノロジーの進化ってそんなにもうないじゃないですか極端な話iPhone毎回出て大体同じだよねみたいな感じになって。もちろん僕がモバイル開発を辞めた時期ってまだそこまでではないんですけどとは言ってもやっぱり自分が始めた頃よりはやらないといけなさそうなことっていうのも少なくなっていたような気がしますしどっちかっていうとアプリ内のアーキテクチャーがどうのみたいな話とか結構盛んになってきててモバイル自体が今後すごいビジネスニーズとしてモバイルのエンジニアがこれからもっと必要とされていくっていうイメージがちょっとやや限りを感じたっていうのは正直ありますこういうこと言うと多分全然まだ需要あるよっていう反論もあるしそれはそうなんですけど例えば海外見てみると大手ってリアクトネイティブ使ってるところが多かったりするんでじゃあネイティブ開発者にそんなにアドバンテージがあるかみたいな感じで言うとそうでもなかったりするしこれ多分フロントの人はみんなそうだと思うんですけどiOSもフロント側の技術のめちゃくちゃ大きな変化があっていわゆる前言的なUIの読み方をするようなフレームワークが出てきてなんか1から覚え直しみたいな感じになったりするんでなんか長くやってきたのになんかそういうチャブ大会試験みたいなのがあるとまあ自分が積み重ねてきたものもちょっといきなりなくなったりもするしなんならリアクトネイティブと多分ウェブフロントから来た人とかの方がよかったら分かんないですとかするかもしれないしとかになってくるとなんか積み上げてきたものもなんかそんなにうまく使えそうな感じもしないしビジネス的にもものすごいニーズがあるような感じもしないしみたいなそういう焦りがちょっとあったっていうのがまず一つでそれプラスさっきの話に戻りますけどアプリずっとやっててAPI叩いて返ってきたJSON画面にひたすら表示してるだけだけど何年もやってこの向こう側全然知らないのどうなのかなっていうのを待ってちょっとずつバックエンドとかインフラの知識を受けていってできるだけそのユーザーが。フロントで操作したところからサーバーにリクエストがいて帰ってくるまでの流れっていうのをエンドとエンドで全部理解できるようにはなりたいなっていうのもあったんで自分の技術的な行き詰まりを解消したいっていうのもあって打算的なところと自分の興味を満たしたいっていうのも両方があって結構思い切ってジョブチェンジしたって感じ。ねえちゃんと歴史があっ。たんだ僕もそこなんですよね今多分アサナの場合で言うともうちょっと多分奥まで知らないといけないというかAPI叩いたら帰ってくるとかっていうレベルではないけどバックエンドも僕たちは触るんですけど結構プロダクトエンジニアってやることを新しいフィーチャーとはいえどやることを大体似通ってくるじゃないですか会社移ってもその会社にある技術とかを使ってその会社のドメインの中でページを作ったりだとかであると思うんですけど、なんか、まあ飽きてきたのかな。5、6年以上あって、まあ飽きてきたって言うとあれですけど、なんか、なんか同じことやってるなみたいなのがあって、もうちょっと枠エンドの方行った方がいいのかなーって、今、この頃思ってます。なんかねリードの方行ったりするのかなと勝手に思ってたけどね俺。はトカシさんは僕ですかそっちも別になんかそのそこは別にリード行きながらとかでもできると思うんですけどただそのそうですねまあとかあのエンジニアリングマネージャーとかって道にするとまた全然やることとか違ってくると思うんで確かにでもなんかそのプロダクトエンジニアっていうものである限りやっぱそこらへんでずっと変わらないと思うんで確かにそういうふうに考えるとちょっとその次のステップとしては楽しいのかもしれないですねちなみになんですけどとはいえ僕プロダクトエンジニアの好きなところってそのインパクトがすごいやっぱARだとかお客さんへのインパクトとかって結構やっぱ大きいしその結構ものによっては大々的にそのアピールするじゃないですか外側にその時のやっぱなんか喜びみたいなのってあると思うんですけどSREの場合ってそういうのってあんまりないじゃないですかどういうところになんか楽しみを持ってやらあの仕事されてるのかなみたいないや。僕は逆でそういうのがなんかあんまり感じれなかったんですねこれはでもめっちゃ隣の芝的なことだと思うんですけどフロントやってるとそのおっしゃったみたいにユーザーインパクトっていうのは嬉しいんですけど結構まあ定量化難しい部分もあったりするじゃないですかそのまあ何が効いたかみたいなのを直接こうこれが聞いてこうなったみたいなストーリーが組みにくい時もあるし結構その分かりにくい改善ポイントとかもあったりしてなんかそんなにこうめちゃくちゃ分かりやすく自分の成果を見せれない時とかもあるんだけどそういう時にインフラの人とかを見るとなんかグラフがバンって出てきてなんかレイテンシーが下がりましたみたいなんとかエラーレートが何パーセント改善しましたみたいなのとかをバンバン出しててこれ結構気持ちよさそうだなみたいな。というふうに思ったりって。いうのもあるんですよねもちろんそのユーザーがめちゃくちゃ大事っていうのは僕も今でも変わらないんですけどただそういうなんかめちゃくちゃ低量化された成果みたいなのがバックエンドの方が僕はちょっと出しやすいかなっていうふうに思いますね。確かにただあのそうですね確かになんかそれはあるかもしれないなんかその技術新しいそのサーバー側の人たちとかがその新しいなんだろうプレームワークの変更とかで結構喋ってたりするとやっぱ確かにそういうグラフとかであってうわーそういう時はすごいかっこいいなって思うんですけどまあ確かに。定量化しにくいとあと会社のシステムにもよるのかなとは思うんですけどabテストとかちゃんとしててあのるところでとかだったりするとそのグラフは出してはいるからなんかインパクトっぽいものは見られるけど確かにそれがちょっとこじつけもあるんじゃないかとかその確実にその絶対これが要因でそのインパクトあったよねとかは言えなかったりするからある程度ログとかであの出せるabテストとかで出せるようにはしてるけどそのタイミングがたまたまなんか重なったとか違うページの変更と重なったとかもあったりすると思うんで確実に確かに定量的にとはいかないかもしれないです。ね確かにそのアサナとかショピアイもそうですけど特にビーム系のとことかだとチェンジログとかユーザー向けのそのリリースノートとかっていうのも結構充実してるからこれ俺がやったんだよみたいなそういう話ができる時もある気がしていてまあそういうのは確かにかなり達成感があるかもしれないです。ねなるほどねいや面白いですね。なんかどこに対して快感を覚えるかの話に結局なってくるのかなっていう気もしてきてて。ね確かに出てるしあごめんなさいどうぞどうぞ僕の怖いポイントとしてはそれが移動して。なんかそれがなくなった時になくなったっていうかそのプロダクトとかで出していくみたいなのがなくなってユーザーインパクトみたいなのが見えなくなった時になんかあれつまんねえってなったらやだなみたいなのがあるからちょっと聞いてみたかったっていういや面白いです。ねでも割と俺は雄生さんの話聞いてるとやっぱり需要だったりとかっていうIOSエンジニアの需要が今後どうなっていくかみたいなところやっぱりそっから来る危機感みたいなところも実は結構大きかったのかなっていうふうに思ってはいて最近特にバンクーバー前からっちゃ前からなんですけど特に最近IOSエンジニアの仕事がなくなっててもうトロンと行くしかないんですよね最近はっていうのもあってIoSに限った話はないけれども昨今Lも中心に開発環境もだいぶ変わってきてるしそういうそろそろ僕も動かなくっちゃなっていうその先として今まで興味があったインフラだったりとかAPIのバック今どうなってんだろうなとかっていうそこに興味をちゃんと持てたっていうのがやっぱりキャリア的な転換点なんだろうなって思いながらだとね前回俺優生さんと喋らしてもらったのはもう多分2年前とか3年前とかそのレベルだと思うんですよね最近はどうすかそういう意味でになったら割と開発環境っていう文脈だとだいぶ今最近も変わってきてる段階かなと思います。がそうですねレルエムのやっぱりかなり仕事の感じって変わりましたねどっちかっていうともうだから今自分で何が大事かなみたいなのも1から多分やり直さないといけないようなフェーズには入ってると思うんでそんなにまだ答えは出てないんですけどでもやっぱりそのなんか何かを知ってることの重要性っていうのが結構下がったっていうのは間違いないですよねそれこそだからインフラだとインフラのなんかすごいその知識がないとできないような仕事とかっていうのもあったけどもちろんそういうむちゃくちゃ難しい仕事をしてる人はいっぱいいるんですけどでも基本的に。深掘りすれば誰でもいつかたどり着けるような情報みたいなのっていうのは結構一瞬で具体が出ちゃうっていうのもあるんでそこそこ詳しいみたいなのにはなんかあんま価値はまずなくなってきたような気がするしまたまぁそのLMを積極的に対応している会社だと多分社内のコンテキストとかっていうのもLMフレンドリーにうまく設計していってる気がするんで社内の知識もなんか結構LMに聞けば出てくるみたいなこととかもあったりしてなんかこう横にも縦にも結構そのナレッジ代だけでやっていくっていうのがまあ厳しい感じはしてきたんでまぁもちろんそれをそのどれだけ使いこなすかっていうのはまあもちろん前提としてあってでもその先何が読みになるんかみたいなのは結構もう、そしたら考え直さないといけない映像だなって気がしますね、多分皆さんもそう思われてるんじゃないかと思い。ますけどちなみになんですけど、一つちょっと気になったのが、社内でのその知識、ナレッジをそのAIを使ってその探すみたいな時にそれって結構ショッピファイではうまくいってますかなんか僕とか僕の周りとかで聞いてもやっぱ大きい企業になればなるほど結構まだまだそのAIがちゃんと使えてないみたいなのがあるのかなと思っ。ててそうですねそういうのは多分そういうのをまたやってるチームがあるのでそんなに大そうなことは言えないんですけどまあそれこそこうmcpサーバーみたいなのが大量にあちこちになってますそれ自体はちょっと見つけにくいっていう課題は実際あるんですけどでもよく使われているものは何個かあってまずそういうものを動かすために情報が分散しないように頑張るみたいなそのドキュメントを一箇所に集め出したりとかコードベースを一箇所に集め出したりとかできるだけ多分LMフレンドリーにコードもドキュメントも設計していくっていうのは紹介者は多分まあまあ頑張ってやってる。方だと思うんですよ。ねそういう意味ではその社内のもちろんその完璧な答えではないんですけどでも最近この技術要素どうなってんのみたいなこととかを聞くとその社内のドキュメントとか社内で走ってるプロジェクトとかをちゃんと検索してくれてそれなりの程度のものは帰ってくるような気がしますねすごいです。ねうちはそもそもモノレポなんでそのプロジェクト集めるっていうのが全然あのプロジェクトとかそのモノレポにしていくみたいな動きはまあそもそもないんですけどドキュメントとかはそのMDファイルとかでコードベースに残っているもの以外はやっぱりまだ探しにくくてオーフェンみたいに迷子になっているやつとかもいてそこら辺に結構重要なのがあったりとかGogleドックの情報を今拾えているのかわからないけど僕が観測している範囲だとあんまり拾えていなさそうだなみたいなさっきのうちにもそういうのを設定したりとかそういうのを進めているチームはいるんですけどどうなんだろうあんまりなんか。自分で開発したりするぐらいの良さみたいなのとかエージェントでほぼ全部できちゃうぜみたいなのは全然まだまだかなみたいな思って。て大企業の膨大な情報やデータをどう整理していくのかっていうところですよね本当にドキュメンテーションの数が多すぎてもうカーソルうまく動かねえとかねそんなレベルの話からいろいろ聞こえてはくるので。ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "A",
      "text": "今回は雄生さんに来ていただきました雄生さんはカルガリーからカナダのショピファイで今働かれています簡単に経緯というか経歴を教えていただいてもいいです。",
      "start": 448,
      "end": 14118,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "かはい今はショピファイですね紹介いただいたとおりカルガリーからリモートでショピファイのSREをしていますカナダに来たのがちょっと記憶が曖昧なんですけど3年ぐらい前でそれはショピファイの社内での転席という形でカナダに来てるんですけどその前はベルリンにいてショピファイに入社したのもベルリンで一度入社してそこから社内で移動という形になります時系列的に逆にすると書いてややこしいんですけどそうですねその前はベルリンでサウンドクラウドという会社で働いていてそれが3年その前はスパッドのブリストルというところにある拠点で働いてイギリスのブリストルというところで働いていてそれも2年半3年ぐらいなのでカナダが日本も含めて4カ国目で海外が大体9年10年ぐらいになるというような感じですすいません、なかなかまとめにくい経歴になってきて、自分でもちょっと記憶が曖昧なんで、パッと言えなかったんですけど、そんな感じです。",
      "start": 14118,
      "end": 92834,
      "timestamp": "00:14"
    },
    {
      "speaker": "C",
      "text": "ありがとうございます。ちなみに僕もちょっと聞きたいんですが、ポジション的には最初のCokpadがソフトエンジニアですか?",
      "start": 92834,
      "end": 99141,
      "timestamp": "01:32"
    },
    {
      "speaker": "B",
      "text": "そうですね、それは一社目じゃなくてその前にMTIという会社で働いてそこが新卒で入った会社なんですけどその時から基本的にはモバイル、iOSのアプリの開発をずっとしていてクロパッドもiOSエンジニアとして入社してます。",
      "start": 99151,
      "end": 118468,
      "timestamp": "01:39"
    },
    {
      "speaker": "B",
      "text": "クーパッドにいた時代はもうずっとiOSエンジニアですで、iOSエンジニアとして次のサウンドクラウドベルリンにいた時もiOSエンジニアとして転職して転職サウンドクラウド時代に社内で移動という形でSREになったので社内移動かそうなんですだからSRE自体は結局5年とかうーんぐらいのことかなと思いますねはいその前のソフトiosエンジニアですやることは。",
      "start": 120648,
      "end": 157648,
      "timestamp": "02:00"
    },
    {
      "speaker": "A",
      "text": "結構変わるんですか?なんか今ちょっとLnkedIi見させてもらったんですけどシニアのiOSエンジニアからシニアのSREに移ってるじゃないですかそんな結構簡単になんだろうコンバージョンできるもんなんですか。",
      "start": 157648,
      "end": 170995,
      "timestamp": "02:37"
    },
    {
      "speaker": "B",
      "text": "結構珍しいですよね結局やっぱりもし転職でiOSエンジニアだったんですけどSRE対応してくださいっていうのは基本多分無理だと思うのでどっちかっていうと社内でネットワーキングしたりとか社内のドメイン知識とかがあるっていうこととプラス多少はインフラとかバックエンドのことっていうのはもうちょくちょくは触ってたんで全く知らないってわけではないんですけどそれプラス社内でのネットワークと社内での知識っていうのをレバレチック化してえーやらしてもらったって感じで一回一回もうSREになればSREですって言って転職活動できるんでたしかにそうですね一発一本目がちょっと大変だったんです。",
      "start": 170995,
      "end": 221364,
      "timestamp": "02:50"
    },
    {
      "speaker": "A",
      "text": "けどちなみになんかインタビューみたいなのはあったんですかその時にそうですね。",
      "start": 221364,
      "end": 227046,
      "timestamp": "03:41"
    },
    {
      "speaker": "B",
      "text": "まああのエンジニア組織的には100人とか200人ぐらいの会社だったんでそんなにすごいゴテゴテしたプロセスがあるってわけではないんですけどもちろん向こうのICとかマネージャーとかとは話して軽くインタビューして基本的なことを聞かれて最低限の知識はあるよねっていうところは担保してもらって入ってはいます。",
      "start": 227046,
      "end": 256011,
      "timestamp": "03:47"
    },
    {
      "speaker": "C",
      "text": "なるほどねちょっと今回ね僕があのユーセイさんにどうしてもお話聞きたいっていう実は過程がねあってあのちょっと昔というかもう1週間くらい前かなツイッターでちょっとぼやいちゃったんですよね僕があの最近フロックの方にSREの問い合わせが実は結構多いっていうのがあるんですがフロックの中でもねあのいないよね東海オンエアさんはフロックの周りでSRE。",
      "start": 256011,
      "end": 277076,
      "timestamp": "04:16"
    },
    {
      "speaker": "A",
      "text": "知らないですねまあ特にバンクーバーがあのプロダクトエンジニアが多いというかウェブ系が多いっていう背景があってそうあんまりあとは多分アメリカの企業だとSREとかそのDevOpsとかその少ないポジションって割とそのアメリカでなんだろう最初だっていうのはMVPだったり作る時に多分もうハイヤーしちゃってて、でそこからウェブのプロダクト大きくするとかでバンクーバーに来るとかっていう背景があると思うんで、もうすでにチームがアメリカの方にあるからバンクーバーはウェブだけとかっていうのが割とあるあるなのかなって僕の中では思ってる。",
      "start": 277076,
      "end": 317771,
      "timestamp": "04:37"
    },
    {
      "speaker": "C",
      "text": "んですよねそうよねっていうのもあって僕自身もSREキャリアが番組まで頑張りたいですって言われてもちょっと正直数も少ないし事例も少ないから答えにくかったなっていう部分があっていやちょっと待ってよとそう考えれば雄生さんとかあと我が妻さんだったりとかっていうフロックの中にいる方々でSREいるじゃないかって思ってちょっと今回お声掛けをさせていただいたので今ちょうどお話しいただいたところはかなり興味があってやっぱ社内に最初就職されたときとかサウンドクラウド行かれたときはIOSエンジニアで今お話にあった社内のいろいろな交渉があったりとかっていう分があってSREのポジションにっていう分パッと僕の勝手な印象ですけどやっぱりインフラとかDevOpsとかのキャリアを持ってる方がもっと社内のたくさんのシステムだったりとか開発環境だったりとかに従事するためにSREのポジションに転席みたいなのが普通なのかなって思ってはいて開発側の知識もそれあった方がいいんだろうけれどもっていうのもありつつ割とどうですか優生さんの周りのSREの他のポジションの方々とか見てキャリア的に開発からSREって割とコモンというか普通のことなんですか。",
      "start": 317771,
      "end": 386514,
      "timestamp": "05:17"
    },
    {
      "speaker": "B",
      "text": "えっと。",
      "start": 386514,
      "end": 387054,
      "timestamp": "06:26"
    },
    {
      "speaker": "B",
      "text": "そうですねえモバイルからsruやる人はほぼいないですそれは間違いないと言ったらあのバックエンドのエンジニアとかがインフラに来るっていうのは多分全然あるそうだとは思いますねもちろんそのバックエンドのエンジニアでもそのdbの知識。",
      "start": 388806,
      "end": 407803,
      "timestamp": "06:28"
    },
    {
      "speaker": "B",
      "text": "メッセージMQの知識とかそういうのが結構ある人っていうのがいるのでそういう人の中でもインフラ寄りの作業が好きっていう人がSREになったりってことは全然あり得るんじゃないかなと思いますねたださっきもちょっと軽くお話に多分出たと思うんですけど会社の規模とかでやっぱりやるフェーズによってその全然やることが多分違うし僕はそもそもSREっていう文化ができてってからDevOpsがどうのみたいなSREっていう文脈が出てきて後からこのポジションになってるんで実はそんなに歴史的なことに詳しいわけではないんですけどやっぱり会社のフェーズで全然やることが違うので意味してるものとかっていうのももちろん定義云々みたいなのここである人もいるんですけど現実的には結構会社によってやってるその求めてることが全然違うというか例えば前職だと会社のエンジニング組織の規模がそんなに大きくないんでSREっていうとインフラにめっちゃ詳しい人みたいな全部やる人みたいな感じでデータベースのプロビジョニングしますとかクラウドのネットワーク組みますとかサーバーの構成構築してありますとか何ならデータセンターますみたいなのとかそういうのも何が全部やるような感じの仕事だけど今ショッピファイ来てショッピファイてまあちょっとエンジニアにエンジニアの人数僕知らないんですけどまあ1万人マイおそらく以上のます会社全体ではまあそれぐらいのます数の人がいるんで結局そのそれぞれのインフラのコンポーネントにはそれに特化したチームがいてデータベースならデータベースチームしかもデータベースのテクノロジーごとにチームが違ったりするケースもありますしネットワークはネットワークだけやってる人がいたりとかみたいな感じでそうなってくるとSREってなんかこうかなりこうもっと上のレイヤーっていうかなんかそういうのを特定の技術は触るってよりかはインシデントの対応したりとか社内でリスクを洗い出したりとかあとはその。",
      "start": 409403,
      "end": 556576,
      "timestamp": "06:49"
    },
    {
      "speaker": "B",
      "text": "自動化の部分とかだったりとかグルーワークが結構多くなってくるっていうかこの障害が発生しましたみたいな自分たちが障害対応一時受けをやるし自分たちが原因の特定もできるだけするんですけどじゃあこれデータベースだよねって分かったらデータベースの人を呼んでデータベースの人と一緒に作業するみたいなお。",
      "start": 558424,
      "end": 587840,
      "timestamp": "09:18"
    },
    {
      "speaker": "A",
      "text": "だしょーそのデータベースの人はSREではないんです。",
      "start": 587840,
      "end": 590361,
      "timestamp": "09:47"
    },
    {
      "speaker": "B",
      "text": "か三宅ないですねデータベースエンジニア的な感じなんですよねデータベースの人呼んでそうすると例えばこのクエリが悪いよねみたいな感じになったら今度アプリケーションのエンジニアも呼んできてこれなんとかならないのみたいな感じ話したりみたいな感じになるんで結構そのインフラ周りの障害とかパフォーマンスチューニングとかそういうのをいろんな人をなんかこう寄せ集めてまとめ上げるみたいなタイプの仕事が結構多かったりするので結構抽象度が上がってくるんですねなんか。",
      "start": 590361,
      "end": 628021,
      "timestamp": "09:50"
    },
    {
      "speaker": "A",
      "text": "オンコールみたいな仕事ですね。",
      "start": 628021,
      "end": 630563,
      "timestamp": "10:28"
    },
    {
      "speaker": "B",
      "text": "オンコールは基本的にだからオンコールが一番メインの仕事ではあるんですよねただ幸いそこそこ人数がいるのと一応週末以外は自分の業務時間外でオンコールしないといけないっていうことはなくて他のタイムゾーンにも人がいるんでずっとオンコールってわけじゃないんですけど基本的にはちゃんとプラットフォームレベルのかなり大きな規模の障害をちゃんと一重計として。",
      "start": 630563,
      "end": 659497,
      "timestamp": "10:30"
    },
    {
      "speaker": "B",
      "text": "対処できる原因を特定してエコホルダー集めれるっていうところが一番メインの仕事ではありますすごい。",
      "start": 662159,
      "end": 670309,
      "timestamp": "11:02"
    },
    {
      "speaker": "C",
      "text": "そんな統括的なお仕事だったんですね割とさっきはすみませんありがとうございますあのさっきねやっぱりその会社によるよねっていう部分で割と比較対象になるかわかんないですけど東橋さんとかのそれこそ朝野とかもやっぱりSREのポジションの方ねやっぱりいらっしゃるんじゃないかなと思うんですけどどうですか似てます業務の体制と。",
      "start": 670309,
      "end": 688218,
      "timestamp": "11:10"
    },
    {
      "speaker": "A",
      "text": "かにいやそれこそ今言おうと思ったんですけど僕あの僕自身weboncalっていうwebのサイドのoncalをやっててまあ結構まあ激しめのoncalだけど2か月に1回か3か月に1回ぐらいかなでその一重計が僕たちなんですよね逆にでえっとそのでインフラの方だよねとかでなったらそのインフラのチームまあsreとかそっちのチームを呼ぶみたいなでなんかあのエスカレートするみたいな感じなんでそっからみたいな感じがあるかなでその人たちが何をやってるのかは全然わかんないすごく。",
      "start": 688218,
      "end": 720895,
      "timestamp": "11:28"
    },
    {
      "speaker": "A",
      "text": "あ良かったウェブじゃないみたいな感じで思ってでそのミーティングとかにずっと言いさせられたりもするけど何も言ってる何言ってるか全然わかんないみたいなじゃあ。",
      "start": 722848,
      "end": 733542,
      "timestamp": "12:02"
    },
    {
      "speaker": "C",
      "text": "あれか少なくとも一時受けが東海オンエアさん達っていうことであればSRAがどう統括とって誰かに振るみたいな話ではないって。",
      "start": 733542,
      "end": 740671,
      "timestamp": "12:13"
    },
    {
      "speaker": "A",
      "text": "ことだよねそうですまあでもそっからそういうのが起きてるのかもしんないけどうちはそこまで規模が大きくないので多分SREがもうちょっといろいろやってそうなイメージはあるかなって感じですデータベースエンジニアとかはいないではないかもしんないけどインフラのチームにそのデータベースの担当みたいな人が何人かいるみたいな風なのになってそうかなわかんないですけどねなるほど。",
      "start": 740671,
      "end": 767896,
      "timestamp": "12:20"
    },
    {
      "speaker": "C",
      "text": "ねだからさっきのユーセさんのおっしゃっていたやっぱりその会社によって違うよねの部分もそういったところでやっぱり色は変わってくるってことだよねそうな。",
      "start": 767896,
      "end": 776300,
      "timestamp": "12:47"
    },
    {
      "speaker": "B",
      "text": "んですよねなのでどうすればなれますかっていうタイプの質問は結構正直答えにくい多分ハマるところもあるしハマらないところも同じSREっていうポジションでも全然あって。",
      "start": 776300,
      "end": 792408,
      "timestamp": "12:56"
    },
    {
      "speaker": "B",
      "text": "例えば僕とかだと前職もそんな大きい会社ではないんですけど言うてもそのトラフィックが世界中であるんで。",
      "start": 794425,
      "end": 802649,
      "timestamp": "13:14"
    },
    {
      "speaker": "B",
      "text": "グローバルインフラっていう感じで複数のリージョンにデータベースとかサーバーがあったりみたいなそういう構成を取ったりしてるんでそういう意味では初期化への規模ではないんですけど基本的に複数のリージョンにユーザーがいる場合にどういうインフラを組むべきかみたいなことに関しては多少知見があるみたいなそういう話をしたら入れてもらえたみたいなこともあるんですけどでも多分そういう経験がないけど例えばなんかめちゃくちゃ特定のインフラのコンポーネントに詳しいみたいな人とかだったら多分他にマッチのチームがうちの会社だったらあったりすると思うしなるほどその意味ではなんか結構僕はいつもなんか総合格闘技っぽいなっていうんでいてなんかその別になんかこういう特定のパスがあるっていうよりかはなんか割といろんなバックグラウンドの人がいろんなとこでいろんなことをしているみたいな感じもあってなのでそういうアプリケーションのレイヤーからきてアプリケーションの知識が強いからアプリケーションから発生するインフラの問題を解決するような得意な人とかっていうのもいるんですよね悪いクエリとかがあったらすぐ見つけて直せるみたいな人もいるし逆にめちゃくちゃLinuxに詳しいおじさんみたいなのがいてこれはカーネルのあれだよみたいなそういうことをすぐ。",
      "start": 805437,
      "end": 892198,
      "timestamp": "13:25"
    },
    {
      "speaker": "B",
      "text": "言えるような人とかっていうのもいるし例えばコミュニケーションがめちゃくちゃ強いからあんまり特定の知識はないんだけどめちゃくちゃそのインシデントのハンドリングが上手いみたいな人とかもいたりして本当になんかその職域領域があってそこがはまればなれるみたいな。",
      "start": 893714,
      "end": 917696,
      "timestamp": "14:53"
    },
    {
      "speaker": "A",
      "text": "感じが正直ありますちなみにインタビューはその場合どうなるんですか例えばなんですけど朝菜はSREのエンジニアだろうが多分同じインタビューしてるはずなんですよねでただ普通のソフトエンジニアでもそこらへんのそのリージョンであのサーバー別に持つだとかの知識は絶対みんななんかそのサーフェス的には必要でそこらへんちゃんとなんかなんだろうなえっと。",
      "start": 917696,
      "end": 943463,
      "timestamp": "15:17"
    },
    {
      "speaker": "A",
      "text": "CSのバックグラウンドがありますよっていうのを証明しないとインタビューのうちに証明しないといけなくてそこからみたいな感じになっててチームごとでインタビューを変えてないんですけどじゃあそこら辺はなんだろうSREのインタビューとそのプロダクトエンジニアのインタビューみたいな感じで別々。",
      "start": 945466,
      "end": 963196,
      "timestamp": "15:45"
    },
    {
      "speaker": "B",
      "text": "で分かれてるんですか多分多少はその適正みたいなのを見ると思うんですけど基本的には。",
      "start": 963196,
      "end": 970760,
      "timestamp": "16:03"
    },
    {
      "speaker": "B",
      "text": "多分バックエンドのエンジニアとかがやってるようなのと同じことは多分やらされてると思います普通のコーディングのインタビューもあるしそのいわゆるシステムデザイン的なやつをやってそうなんですかねむしろ開発の人ってシステムデザインとか多分シニアとか以上だとあるんじゃないかなと思うんですけどまあそういうのはあってむしろ多分大きい会社になってくると、なんかもう特定の技術よりかは社内のドメイン知識があった方が結局いろんなものが抽象化されてるんでなんか結局社内のドメイン知識をつけないと使い物にならないみたいなとこがあるんでなるほどねここの勝手なイメージですけど規模が大きく会社が大きくなればなるほどそんなに特定の技術要素についてはあんまり聞いてこないもちろんそのそういうあの特定のポジションに入れば別ですけど例えばsreやりたいってなって大きい結構かなり規模の大きい会社に入るってなったらもうなんかその特定の知識をチクチク聞いてもなんか仕方ないし曲入ってから学ばないといけないことの方が多い。",
      "start": 972335,
      "end": 1041260,
      "timestamp": "16:12"
    },
    {
      "speaker": "A",
      "text": "んで朝なはまあ。",
      "start": 1041260,
      "end": 1043002,
      "timestamp": "17:21"
    },
    {
      "speaker": "B",
      "text": "そんな感じですねcsの知識がまあちゃんとあるかっていうところが一番大事なんじゃないかなと思います。",
      "start": 1043002,
      "end": 1051368,
      "timestamp": "17:23"
    },
    {
      "speaker": "A",
      "text": "そうですね確かになんかまあ朝もそうですけどフロントエンドの技術とかあんま聞かれないしまあなんかリアクトとかなんか言語固有のものなんてかっても結構まあ入ってから学べばいいよねぐらいのなんか最初のブートキャンプでちょろっと触らせられるぐらいのがあるぐらいでそれ以外はもうなんかほぼ聞かれないしみたいな感じで割とそっちに近めなのかな。",
      "start": 1053831,
      "end": 1075576,
      "timestamp": "17:33"
    },
    {
      "speaker": "C",
      "text": "なるほどねってするとなおさらあれだな俺も今後ちょっとSREになりたいですってどう言おうかなってすごい頭の中で迷うとこなんだけどとはいえ今の話聞いてる部分だと一般的なシステムデザインだったりとかアルゴリズムだったりとかっていうCSベースのやっぱり知識っていうところが当然あったほうが良くてその上で各企業ごとのドメイン知識を社内に入った後もちゃんとキャッチアップしていくことも当然必要で今の話聞いてる。",
      "start": 1077533,
      "end": 1103222,
      "timestamp": "17:57"
    },
    {
      "speaker": "A",
      "text": "とそこら辺たぶんだからCSのベースがあればそのキャッチアップはできるよねみたいなそのベースの上に成り立ってるものでしたねこいつのものはだからできるよねみたいなのはあってだからなんか元々その日本でも多分結構難しいとは思うんですけど経験があればプラスかなっていうのはあるのとあとどうしたらなれますかって言うと結構難しくて、やっぱカナダにそもそもポジションが少ないんで、じゃあとりあえずトロント行こうかみたいな話に多分なると思うん。",
      "start": 1103222,
      "end": 1132006,
      "timestamp": "18:23"
    },
    {
      "speaker": "C",
      "text": "ですよねポジションある方に。",
      "start": 1132006,
      "end": 1133867,
      "timestamp": "18:52"
    },
    {
      "speaker": "A",
      "text": "行こうねって一番そう一番ポジションあるの多分トロントだと思うんで。",
      "start": 1133867,
      "end": 1137068,
      "timestamp": "18:53"
    },
    {
      "speaker": "C",
      "text": "そうだよなぁ間違いないなのでまあ目指す方向性としてねSREみたいなポジションにやっぱり憧れ楽というかやっぱりねなりたいって人はそこそこいるなあっていう思うんですがなれるかどうかっていうのはねやっぱりその地域だったり会社だったりによるんだろうしという話になるんだろうからそういう意味だとどうすかねそのやっぱり開発工程にいらっしゃった方がやっぱり周りに多い開発のフェーズをやっぱり知ってる人がね少なくとも多いのかなと思っていてフロックのとこやっぱ多いのってあのやっぱ今までインフラにいましたとかチームとしてはインフラのチームにいましたとかDevOpsチームにいましたとかで次のポジションとして要するにSREなのかなそういったポジションもやっぱりすごく夢があるなっていうのが多いんですけど彼らがやっぱり見てるところってやっぱり開発側のほうに一回いたほうがいいのかどうなのかみたいな話やっぱり多くてその辺でも今お話聞いてる限りだと企業に当然寄るっていうのベースにはなるんでしょうけど雄生さんみたいにIOSならIOSエンジニアとしての開発チームにいたっていう時期は間違いなく生きてるだろうからやっぱないよりはあったほうがいいよねっていう話には落ち着くんすかねそう。",
      "start": 1139429,
      "end": 1194037,
      "timestamp": "18:59"
    },
    {
      "speaker": "B",
      "text": "ですね開発レイヤーにいる人の中で適性がある人っていうのは自分が例えば接続している先とか依存している先がどうなってるかっていうことに関して完全にシャットダウンしない人なんじゃないかなと思うんです例えばモバイルのエンジニアやってても基本的になんかのAPIに叩くわけじゃないですか。",
      "start": 1194037,
      "end": 1220802,
      "timestamp": "19:54"
    },
    {
      "speaker": "B",
      "text": "まあどうしてこういう作りになっているんだろうとかなんでこれこんな遅いんだろうとかまあそういうのがあった時にまあその自分でまあ直せないにしてもまあある程度そのこういうことが起きてるんじゃないかなとかっていうことにある程度の考えを巡らせれる人もちろんバックエンドとかフロントエンドの開発をしててもパフォーマンスとか自分がやってることがどういうバックエンドにインフラにどういう影響を与えてるかっていうのを考える機会は全然あると思うんでそこを掘りたい人とかそういうのに興味がある人っていうのは向いてるんじゃないかなと思うし自然に知識がついていくんじゃないかなと思う樋口ちょっと。",
      "start": 1223887,
      "end": 1268895,
      "timestamp": "20:23"
    },
    {
      "speaker": "A",
      "text": "耳が痛いですねなんか深井言うと思ったわ樋口言うと思ったわでもちなみにその聞いてくる人たちは日本でそういうSREの経験がすでにある人たちなんですか深井いやそういう。",
      "start": 1268895,
      "end": 1281759,
      "timestamp": "21:08"
    },
    {
      "speaker": "C",
      "text": "わけじゃないねそうまあ傾向なんてだけするんだったら本当にインフラエンジニアいますとかDevOpsチームいますとかでインフラ側だけ今まで見ていたんだけど次のキャリアっていうのを考えるときに最近SREって言葉をよく聞くからみたいな文脈が多く。",
      "start": 1281759,
      "end": 1294222,
      "timestamp": "21:21"
    },
    {
      "speaker": "A",
      "text": "て。",
      "start": 1294222,
      "end": 1294242,
      "timestamp": "21:34"
    },
    {
      "speaker": "A",
      "text": "なんかSREってそもそもポジションが少ないからソフトウェアエンジニアとかでやってこの講義でソフトウェアエンジニアになるって言ったときにそのすっ飛ばしてSREに行けるかって言ったら結構難しいですよねそのポジションがまず少ないしその小さい会社だったら一人いるかどうかみたいなのが多分普通だと思うし大きい会社になれば人数はいるけど。",
      "start": 1295841,
      "end": 1319468,
      "timestamp": "21:35"
    },
    {
      "speaker": "A",
      "text": "プロダクトエンジニアの人の比率でいうとやっぱ少ないからそのソフトエンジニアになってまあ経験積んでさっきユウセイさんが言ってくれたようにそのちょっとずつそのナレッジを広げていくというかもうちょっと深くあのベースの知識の方にもまあなんだろうキャッチアップしていくみたいなのを進めながらやっていくみたいなのはなれるかもしれないけどいきなりあの知識もないのにやってくださいみたいにはならなそうな感じがするし確かになっていうのはだから日本で経験があって例えばねLINEとかその交通量の多いだとかなんか他にどんなあれがそういう大規模システムがあるのかも分かってないですけど日本の中だとそういうところで経験があるのであればすぐ英語がしゃべればすぐこっちでもできるかもしれないけどそもそもやっぱ少ないっていうのがどうしてもあるから。",
      "start": 1321429,
      "end": 1377558,
      "timestamp": "22:01"
    },
    {
      "speaker": "B",
      "text": "だ。",
      "start": 1379569,
      "end": 1379709,
      "timestamp": "22:59"
    },
    {
      "speaker": "C",
      "text": "からでもアドバイスの仕方としてワンチャンそれは確かにアリなのかなって思っているのが彼らの僕のやっぱり話聞いてくるところでやっぱりとメガベンチャーのまあインフラちょっとに担当していてラージドラフィックのやっぱりまあ環境に行った経験もあるし海外に行ってもワンチャンSREのポジションとか見えてくるんじゃないかっていう文脈が多くてそう。",
      "start": 1379709,
      "end": 1398402,
      "timestamp": "22:59"
    },
    {
      "speaker": "A",
      "text": "やったらありそうですねそう。",
      "start": 1398402,
      "end": 1400044,
      "timestamp": "23:18"
    },
    {
      "speaker": "C",
      "text": "だねそうただやっぱりそれに該当しないとこだよね別にそのまああのあんまり大きい大きなトラフィック扱ったこともないしインフラにどれだけ深くあるのかもあんまりちょっと想像もつかないしみたいな人が開発の経験全くなしにいきなりsreっていうのはさすがにちょっとイメージがわかないんだろうなとも申しまあそうねそういう人に関してはもしかしたら一旦開発にもちゃんとあのちゃんと求人が多いという意味でたくさん求人があるという意味でまあソフトエンジニアを目指しつつ開発側の環境もわかるしインフラにももちろん元からいただく興味もあるしっていう状態でSRみたいなポジションがもしワンチャンあったらトライしてみてもいいんじゃないっていうのがちょっと王道にはなりそうなのかなーって僕の中で思いましたね。",
      "start": 1400044,
      "end": 1439430,
      "timestamp": "23:20"
    },
    {
      "speaker": "A",
      "text": "そうですねちなみにゆうせいさんはそのiOSエンジニアからそのサウンドクラウドで働いてた時にそのsreに聞かれたと思うんですけどそのなんか心境の変化みたいながあったんですかなんかどういうふうにそのプロダクマiosのエンジニアから移ろうと思ったん。",
      "start": 1439430,
      "end": 1454300,
      "timestamp": "23:59"
    },
    {
      "speaker": "B",
      "text": "ですかこれはうーんまあ商工技術あると思うんですけど僕はそのエンジニアなと2012年とかなんでiphone多分3とかそういうレベルなんですよねで各社モバイルファーストとかっていってスマホ対応これからしていくぞアプリ対応していくぞみたいなウェブからアプリへみたいなそういう時代だったんでとにかくやることしかないみたいな感じだったんですよねやり始めた時ってそれこそAppleのドキュメントも微妙だし。",
      "start": 1454300,
      "end": 1498870,
      "timestamp": "24:14"
    },
    {
      "speaker": "B",
      "text": "開発のベストプラクティスもないしエコシステムもいまいちだけどビジネスニーズはめっちゃあるみたいな感じなのでとにかくやった方が良さそうなことが無限にあるみたいなそこから始めてiOSリリースされるたびに全然結構新しいフレームワークが出てきてなんかあったらいいなみたいなレベルじゃなくてめっちゃ大事じゃんみたいなこれビジネスに直結するみたいなのがバンバン出てくるんでそれをどんどん対応していってみたいな感じで始めていくんですけど今だともう明らかにモバイルのテクノロジーの進化ってそんなにもうないじゃないですか極端な話iPhone毎回出て大体同じだよねみたいな感じになって。",
      "start": 1500998,
      "end": 1557061,
      "timestamp": "25:00"
    },
    {
      "speaker": "B",
      "text": "もちろん僕がモバイル開発を辞めた時期ってまだそこまでではないんですけどとは言ってもやっぱり自分が始めた頃よりはやらないといけなさそうなことっていうのも少なくなっていたような気がしますしどっちかっていうとアプリ内のアーキテクチャーがどうのみたいな話とか結構盛んになってきててモバイル自体が今後すごいビジネスニーズとしてモバイルのエンジニアがこれからもっと必要とされていくっていうイメージがちょっとやや限りを感じたっていうのは正直ありますこういうこと言うと多分全然まだ需要あるよっていう反論もあるしそれはそうなんですけど例えば海外見てみると大手ってリアクトネイティブ使ってるところが多かったりするんでじゃあネイティブ開発者にそんなにアドバンテージがあるかみたいな感じで言うとそうでもなかったりするしこれ多分フロントの人はみんなそうだと思うんですけどiOSもフロント側の技術のめちゃくちゃ大きな変化があっていわゆる前言的なUIの読み方をするようなフレームワークが出てきてなんか1から覚え直しみたいな感じになったりするんでなんか長くやってきたのになんかそういうチャブ大会試験みたいなのがあるとまあ自分が積み重ねてきたものもちょっといきなりなくなったりもするしなんならリアクトネイティブと多分ウェブフロントから来た人とかの方がよかったら分かんないですとかするかもしれないしとかになってくるとなんか積み上げてきたものもなんかそんなにうまく使えそうな感じもしないしビジネス的にもものすごいニーズがあるような感じもしないしみたいなそういう焦りがちょっとあったっていうのがまず一つでそれプラスさっきの話に戻りますけどアプリずっとやっててAPI叩いて返ってきたJSON画面にひたすら表示してるだけだけど何年もやってこの向こう側全然知らないのどうなのかなっていうのを待ってちょっとずつバックエンドとかインフラの知識を受けていってできるだけそのユーザーが。",
      "start": 1558897,
      "end": 1702672,
      "timestamp": "25:58"
    },
    {
      "speaker": "B",
      "text": "フロントで操作したところからサーバーにリクエストがいて帰ってくるまでの流れっていうのをエンドとエンドで全部理解できるようにはなりたいなっていうのもあったんで自分の技術的な行き詰まりを解消したいっていうのもあって打算的なところと自分の興味を満たしたいっていうのも両方があって結構思い切ってジョブチェンジしたって感じ。",
      "start": 1704727,
      "end": 1734415,
      "timestamp": "28:24"
    },
    {
      "speaker": "C",
      "text": "ねえちゃんと歴史があっ。",
      "start": 1737646,
      "end": 1738908,
      "timestamp": "28:57"
    },
    {
      "speaker": "A",
      "text": "たんだ僕もそこなんですよね今多分アサナの場合で言うともうちょっと多分奥まで知らないといけないというかAPI叩いたら帰ってくるとかっていうレベルではないけどバックエンドも僕たちは触るんですけど結構プロダクトエンジニアってやることを新しいフィーチャーとはいえどやることを大体似通ってくるじゃないですか会社移ってもその会社にある技術とかを使ってその会社のドメインの中でページを作ったりだとかであると思うんですけど、なんか、まあ飽きてきたのかな。5、6年以上あって、まあ飽きてきたって言うとあれですけど、なんか、なんか同じことやってるなみたいなのがあって、もうちょっと枠エンドの方行った方がいいのかなーって、今、この頃思ってます。",
      "start": 1738908,
      "end": 1794018,
      "timestamp": "28:58"
    },
    {
      "speaker": "C",
      "text": "なんかねリードの方行ったりするのかなと勝手に思ってたけどね俺。",
      "start": 1794028,
      "end": 1796912,
      "timestamp": "29:54"
    },
    {
      "speaker": "A",
      "text": "はトカシさんは僕ですかそっちも別になんかそのそこは別にリード行きながらとかでもできると思うんですけどただそのそうですねまあとかあのエンジニアリングマネージャーとかって道にするとまた全然やることとか違ってくると思うんで確かにでもなんかそのプロダクトエンジニアっていうものである限りやっぱそこらへんでずっと変わらないと思うんで確かにそういうふうに考えるとちょっとその次のステップとしては楽しいのかもしれないですねちなみになんですけどとはいえ僕プロダクトエンジニアの好きなところってそのインパクトがすごいやっぱARだとかお客さんへのインパクトとかって結構やっぱ大きいしその結構ものによっては大々的にそのアピールするじゃないですか外側にその時のやっぱなんか喜びみたいなのってあると思うんですけどSREの場合ってそういうのってあんまりないじゃないですかどういうところになんか楽しみを持ってやらあの仕事されてるのかなみたいないや。",
      "start": 1796912,
      "end": 1859666,
      "timestamp": "29:56"
    },
    {
      "speaker": "B",
      "text": "僕は逆でそういうのがなんかあんまり感じれなかったんですねこれはでもめっちゃ隣の芝的なことだと思うんですけどフロントやってるとそのおっしゃったみたいにユーザーインパクトっていうのは嬉しいんですけど結構まあ定量化難しい部分もあったりするじゃないですかそのまあ何が効いたかみたいなのを直接こうこれが聞いてこうなったみたいなストーリーが組みにくい時もあるし結構その分かりにくい改善ポイントとかもあったりしてなんかそんなにこうめちゃくちゃ分かりやすく自分の成果を見せれない時とかもあるんだけどそういう時にインフラの人とかを見るとなんかグラフがバンって出てきてなんかレイテンシーが下がりましたみたいなんとかエラーレートが何パーセント改善しましたみたいなのとかをバンバン出しててこれ結構気持ちよさそうだなみたいな。",
      "start": 1859666,
      "end": 1920135,
      "timestamp": "30:59"
    },
    {
      "speaker": "C",
      "text": "というふうに思ったりって。",
      "start": 1920135,
      "end": 1922097,
      "timestamp": "32:00"
    },
    {
      "speaker": "B",
      "text": "いうのもあるんですよねもちろんそのユーザーがめちゃくちゃ大事っていうのは僕も今でも変わらないんですけどただそういうなんかめちゃくちゃ低量化された成果みたいなのがバックエンドの方が僕はちょっと出しやすいかなっていうふうに思いますね。",
      "start": 1922097,
      "end": 1941111,
      "timestamp": "32:02"
    },
    {
      "speaker": "A",
      "text": "確かにただあのそうですね確かになんかそれはあるかもしれないなんかその技術新しいそのサーバー側の人たちとかがその新しいなんだろうプレームワークの変更とかで結構喋ってたりするとやっぱ確かにそういうグラフとかであってうわーそういう時はすごいかっこいいなって思うんですけどまあ確かに。",
      "start": 1941746,
      "end": 1963283,
      "timestamp": "32:21"
    },
    {
      "speaker": "A",
      "text": "定量化しにくいとあと会社のシステムにもよるのかなとは思うんですけどabテストとかちゃんとしててあのるところでとかだったりするとそのグラフは出してはいるからなんかインパクトっぽいものは見られるけど確かにそれがちょっとこじつけもあるんじゃないかとかその確実にその絶対これが要因でそのインパクトあったよねとかは言えなかったりするからある程度ログとかであの出せるabテストとかで出せるようにはしてるけどそのタイミングがたまたまなんか重なったとか違うページの変更と重なったとかもあったりすると思うんで確実に確かに定量的にとはいかないかもしれないです。",
      "start": 1964822,
      "end": 2007369,
      "timestamp": "32:44"
    },
    {
      "speaker": "B",
      "text": "ね確かにそのアサナとかショピアイもそうですけど特にビーム系のとことかだとチェンジログとかユーザー向けのそのリリースノートとかっていうのも結構充実してるからこれ俺がやったんだよみたいなそういう話ができる時もある気がしていてまあそういうのは確かにかなり達成感があるかもしれないです。",
      "start": 2007369,
      "end": 2027507,
      "timestamp": "33:27"
    },
    {
      "speaker": "A",
      "text": "ねなるほどねいや面白いですね。",
      "start": 2027507,
      "end": 2031528,
      "timestamp": "33:47"
    },
    {
      "speaker": "C",
      "text": "なんかどこに対して快感を覚えるかの話に結局なってくるのかなっていう気もしてきてて。",
      "start": 2031528,
      "end": 2036370,
      "timestamp": "33:51"
    },
    {
      "speaker": "A",
      "text": "ね確かに出てるしあごめんなさいどうぞどうぞ僕の怖いポイントとしてはそれが移動して。",
      "start": 2036370,
      "end": 2044513,
      "timestamp": "33:56"
    },
    {
      "speaker": "A",
      "text": "なんかそれがなくなった時になくなったっていうかそのプロダクトとかで出していくみたいなのがなくなってユーザーインパクトみたいなのが見えなくなった時になんかあれつまんねえってなったらやだなみたいなのがあるからちょっと聞いてみたかったっていういや面白いです。",
      "start": 2046033,
      "end": 2062335,
      "timestamp": "34:06"
    },
    {
      "speaker": "C",
      "text": "ねでも割と俺は雄生さんの話聞いてるとやっぱり需要だったりとかっていうIOSエンジニアの需要が今後どうなっていくかみたいなところやっぱりそっから来る危機感みたいなところも実は結構大きかったのかなっていうふうに思ってはいて最近特にバンクーバー前からっちゃ前からなんですけど特に最近IOSエンジニアの仕事がなくなっててもうトロンと行くしかないんですよね最近はっていうのもあってIoSに限った話はないけれども昨今Lも中心に開発環境もだいぶ変わってきてるしそういうそろそろ僕も動かなくっちゃなっていうその先として今まで興味があったインフラだったりとかAPIのバック今どうなってんだろうなとかっていうそこに興味をちゃんと持てたっていうのがやっぱりキャリア的な転換点なんだろうなって思いながらだとね前回俺優生さんと喋らしてもらったのはもう多分2年前とか3年前とかそのレベルだと思うんですよね最近はどうすかそういう意味でになったら割と開発環境っていう文脈だとだいぶ今最近も変わってきてる段階かなと思います。",
      "start": 2062335,
      "end": 2117543,
      "timestamp": "34:22"
    },
    {
      "speaker": "B",
      "text": "がそうですねレルエムのやっぱりかなり仕事の感じって変わりましたねどっちかっていうともうだから今自分で何が大事かなみたいなのも1から多分やり直さないといけないようなフェーズには入ってると思うんでそんなにまだ答えは出てないんですけどでもやっぱりそのなんか何かを知ってることの重要性っていうのが結構下がったっていうのは間違いないですよねそれこそだからインフラだとインフラのなんかすごいその知識がないとできないような仕事とかっていうのもあったけどもちろんそういうむちゃくちゃ難しい仕事をしてる人はいっぱいいるんですけどでも基本的に。",
      "start": 2117543,
      "end": 2163185,
      "timestamp": "35:17"
    },
    {
      "speaker": "B",
      "text": "深掘りすれば誰でもいつかたどり着けるような情報みたいなのっていうのは結構一瞬で具体が出ちゃうっていうのもあるんでそこそこ詳しいみたいなのにはなんかあんま価値はまずなくなってきたような気がするしまたまぁそのLMを積極的に対応している会社だと多分社内のコンテキストとかっていうのもLMフレンドリーにうまく設計していってる気がするんで社内の知識もなんか結構LMに聞けば出てくるみたいなこととかもあったりしてなんかこう横にも縦にも結構そのナレッジ代だけでやっていくっていうのがまあ厳しい感じはしてきたんでまぁもちろんそれをそのどれだけ使いこなすかっていうのはまあもちろん前提としてあってでもその先何が読みになるんかみたいなのは結構もう、そしたら考え直さないといけない映像だなって気がしますね、多分皆さんもそう思われてるんじゃないかと思い。",
      "start": 2164732,
      "end": 2228023,
      "timestamp": "36:04"
    },
    {
      "speaker": "A",
      "text": "ますけどちなみになんですけど、一つちょっと気になったのが、社内でのその知識、ナレッジをそのAIを使ってその探すみたいな時にそれって結構ショッピファイではうまくいってますかなんか僕とか僕の周りとかで聞いてもやっぱ大きい企業になればなるほど結構まだまだそのAIがちゃんと使えてないみたいなのがあるのかなと思っ。",
      "start": 2228023,
      "end": 2253456,
      "timestamp": "37:08"
    },
    {
      "speaker": "B",
      "text": "ててそうですねそういうのは多分そういうのをまたやってるチームがあるのでそんなに大そうなことは言えないんですけどまあそれこそこうmcpサーバーみたいなのが大量にあちこちになってますそれ自体はちょっと見つけにくいっていう課題は実際あるんですけどでもよく使われているものは何個かあってまずそういうものを動かすために情報が分散しないように頑張るみたいなそのドキュメントを一箇所に集め出したりとかコードベースを一箇所に集め出したりとかできるだけ多分LMフレンドリーにコードもドキュメントも設計していくっていうのは紹介者は多分まあまあ頑張ってやってる。",
      "start": 2253456,
      "end": 2302681,
      "timestamp": "37:33"
    },
    {
      "speaker": "A",
      "text": "方だと思うんですよ。",
      "start": 2302681,
      "end": 2305362,
      "timestamp": "38:22"
    },
    {
      "speaker": "B",
      "text": "ねそういう意味ではその社内のもちろんその完璧な答えではないんですけどでも最近この技術要素どうなってんのみたいなこととかを聞くとその社内のドキュメントとか社内で走ってるプロジェクトとかをちゃんと検索してくれてそれなりの程度のものは帰ってくるような気がしますねすごいです。",
      "start": 2305362,
      "end": 2329204,
      "timestamp": "38:25"
    },
    {
      "speaker": "A",
      "text": "ねうちはそもそもモノレポなんでそのプロジェクト集めるっていうのが全然あのプロジェクトとかそのモノレポにしていくみたいな動きはまあそもそもないんですけどドキュメントとかはそのMDファイルとかでコードベースに残っているもの以外はやっぱりまだ探しにくくてオーフェンみたいに迷子になっているやつとかもいてそこら辺に結構重要なのがあったりとかGogleドックの情報を今拾えているのかわからないけど僕が観測している範囲だとあんまり拾えていなさそうだなみたいなさっきのうちにもそういうのを設定したりとかそういうのを進めているチームはいるんですけどどうなんだろうあんまりなんか。",
      "start": 2329204,
      "end": 2366298,
      "timestamp": "38:49"
    },
    {
      "speaker": "A",
      "text": "自分で開発したりするぐらいの良さみたいなのとかエージェントでほぼ全部できちゃうぜみたいなのは全然まだまだかなみたいな思って。",
      "start": 2372767,
      "end": 2381115,
      "timestamp": "39:32"
    },
    {
      "speaker": "C",
      "text": "て大企業の膨大な情報やデータをどう整理していくのかっていうところですよね本当にドキュメンテーションの数が多すぎてもうカーソルうまく動かねえとかねそんなレベルの話からいろいろ聞こえてはくるので。",
      "start": 2381115,
      "end": 2394067,
      "timestamp": "39:41"
    },
    {
      "speaker": "A",
      "text": "ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2396082,
      "end": 2414182,
      "timestamp": "39:56"
    }
  ],
  "highlight1": "SREのポジションに就くために必要なスキルや経験について、雄生さんの経歴から見えるのは、インフラやDevOpsの知識が重要になるということです。",
  "highlight2": "どうすればSREになれるのか、という質問に対して、雄生さんは「社内のドメイン知識が重要」って話をしましたよね。",
  "highlight3": "雄生さんは、iOSエンジニアからSREに転身した理由について「モバイル開発では新しい技術の登場しなくなってしまった」、「APIを叩いた後のサーバー側の処理が気になった」と説明しています。"
}