{
  "episodeGuid": "cc15a703-73c7-406b-8abc-ad7d0a192d05",
  "episodeTitle": "【特別回】なぜ海外就職では日本の常識が通用しない？北米一流企業で働くエンジニア達がレジュメと面接戦略を徹底解説（後半）",
  "transcribedAt": "2025-10-15T07:09:34.777Z",
  "duration": 3041,
  "fullText": "はい始めていきましょうそしたら今回も前回に引き続きゆっくりどうやったら海外就職できるのっていうのをおなじみのセナさんとまた何回かこのポッドキャストにも出てきてもらってるんですけど優吾君に来てもらって喋っていこうかと思いますまた簡単に自己紹介から.いきましょうかはいカナダでエンジニアをやりつつitトリオというポッドキャストをやっている小倉君こと優吾ですよろしくお.願いしますお願いしますそしたら前回は結構英語とか結構トピックが多かったんで準備段階みたいな話をしてたんですけど今回からはちょっと求人の探し方あとはレジュメ面接プロセスみたいなところを主にしていきたくて、どんなところで日本との違いがあるのか。前回の話だと、一回エンジニア海外でなってしまえば、英語力を除けば結構スムーズにいけるよ、みたいな。もちろん英語が大変なのは絶対あると思うんですけど、そういう話をしてきたんですけど、結構、就職活動については違いがめちゃくちゃあって、そこが特に大変なんじゃないの?って思ってるんですけど、.どうでしょう?もうおっしゃる通りじゃございませんかまあそもそもだってあれだよねあの英語系になってくるとやっぱりまあキャンディレートというかねもう候補者の数がそもそもボリュームゾーンが全然違うから日本で日本語だけでやっぱりね就職活動してっていう風になってヒューまあわかんないけど100件とかのやっぱりキャンディレートがいる中で英語系になってくると全世界からだからね数千人とかぶっちゃけザラだしっていう中でやっぱり就活方法を言ったら対策ゲーム必要でしょということをもうこの辺はねお二人のあのレジュメ説明会でも話いっぱいしていただきましたが具体的にどの辺が違うか確かにpodcastで喋ってなかったので改めて聞いてみようか何し.た二人ともなんかあのまず違いとしてあの売り手市場買い手市場さっきもちょっと出たんですけどっていうのが違ってその日本は売り手市場だけどこっちは買い手市場なんで僕たちが選んでもらう立場だからやっぱ多分今のそのセナさんの質問の何したっていうのに繋がると思うんですよねなんか日本の就職の話エンジニアの就職の話を聞くといや別にあっちから来るもんだし.みたいな間違いない本当にある.のかなってルールが違い.すぎるからなんかまずそこの違いを体感することが必要だなという感じがしててこそ僕日本で転職活動しましたけど日本の転職活動ってまあ今でもそういうサイトに登録すれば日本で有名どころだとファインディーとかラプラスとかいろいろあると思うんですけどそういうところに登録して経歴ちょろっと書いておくとちょろっと書いておいただけで経験年数3年とか5年ぐらいあればまあ企業側からいいねとかが来てもうこっちが選び放題みたいなそうだよねなんか言葉を選ばずに言ってしまうとヌルゲーみたいな感じがちょっとあると思うんですけどこっちだともうさっきセナさんがおっしゃったように真逆でポジションを応募したら1日で100件来るとか応募が来るとかは当たり前だしまあそれが何日もずっと空いているわけなので300人400人500人とか一つのポジションに応募が来ることも当たり前でその中から勝ち上がっていかないといけないって感じなのでもうそもそもなんか全然ルールが違くてこっちに来る前はまあ主力活動難しいって聞いてたけど多分日本と同じような感じで技術力がちゃんとあれば言うて他の人よりは楽にいけるでしょとか僕は思っていたし多分そう思ってくる人多いと思うんですけどそういうのはもうもう全然ないこういう希望をいかに早く打ち砕けるかという絶望をいかに早く味わえるかみたいなところがあったなと思いました.僕あのこれちょっと面白いなと思ったのがやっぱその売りと市場買い手市場っていう違いから来るそのサービスとかの違いがあるなと思ってその日本で売りと市場だからこそあの応募者に対して手厚いサービスとかシステムがあるんですよねもちろんそのファインディーとかもそうだしそういう系のサイトってめちゃくちゃあるじゃないですかとにかく応募する人に登録してもらってその人たちは集めようっていうでその人たちのサポートをしてその人たちに楽して転職してもらうっていうサービスが多くて海外はちょっとこれから話していきたいんですけどATSアプリケーショントラッキングシステムみたいな会社側に対するサポートサービスがあってその会社が楽をするためにその売る側のなんていうのをどれだけ先に絞ってあげるかみたいなのがあるのかなって思ってて.確かに会社が楽になるためのサービスがいろいろあるこっちと就職側が楽に転職する側が楽になるためのサービスがいろいろある日本だとも何もかも違い.ますよねそうだからなんかその違いから来るやっぱり大変さっていうのは特に自分その日本のエンジニアをやってた人たちは逆側から来てるっていうことを意識して結構その両極端に逆に行かないといけないんで大変だよっていうのはやっぱそのまあちょっと優吾くんが言ったことの繰り返しにはなるんですけど強調しておきたいなあっていう頃ですよねそれをさ、.なんか日本にいる人たちにどれだけ言っても響かないね、俺らみたいなのが言ってた。いや、僕もだって響いてなかったから、.無理ですよ、そんなの。全然想像がつかないですもん。人生でそんなこと経験したことないんだから。いや、そうなんだよね。だからもう、.こればっかりはもう体験するしかないでしょとしか言えなくて。まあ、そうですね。それはなんか、体験して、そうなんだなぐらいで思ってもらえればいいのかなって思っててなんか今回この後半で特に僕がなんか喋りたいなって思ってたのがそのとはいえやっぱその日本人が体験したことのないものだから、びっくりはします。それはそれでいいです。ただその後にくる、その情報量の少なさから日本人がその戦えなくなってるとか、つまりやすくなってるみたいなのを解消していきたいなっていうのを、ちょっとこの後半の目標に僕と僕としてはちょっと置いてるんですけどまず優吾くんまあ僕でもいいんですけどどうやって探せばいいんですかねまず求人はそのファインディーみたいなサービスがあるんですかそれともなんだろう自分で会社のなんていうのホームページみたいな一件一件行かないといけないんですか僕.は有名どころのサービスがあればそれを使えばいいかなって感じで僕がメインで使ったのはLdIiをnke使いましたねLdIiでnke職を検索できる機能があるのでそれで職を検索して僕の場合はバンクーバーでまず地域を絞り職種的には一番最初の一社目探したときはWebのフロントエンドかフルスタックかリアクトネイティブを使ったソフトウェアディベロッパーみたいな感じで調べてまあそこでできたところを順番に応募していくみたいなざっくり言うと感じでありました.ねなんかもう一つあのよくあるのがインディードってある.と思うんですけどそれはダメですかいやいいと思いますね僕は一番最初に就職活動をしている時最初本当は両方使おうかなと思ってたんですけどまあ多分後で話すと思うんですけど会社ごとの対策をするってなると一社応募するために時間がかかってしまうのでそもそも時間が足りなくてリンクドインで手一杯だったっていうのとあといろいろ見てみるとまあその大手系の会社の求人サイトっていうんですかね求人の機能を見てオープンしている求人に見比べてみると結構かぶってるのが多いのでこのサイトにしか求人が出てないみたいなのは結構レアケースなんじゃないかなと思ったのでまあリングドイン大きいサービスだしそこを使っておけばいいかなという感じでそこに集中してた感じではありましたね.僕も大体同じ感じなんですけどセナさんなんかあの結構そのカナダでいろんなところいろんなところとかいろんな人たちが就職活動していると思うんですけど他になんかサイトとかなんかサービスとかって聞きます?いやもう有名どころいろいろありますよあのフロッグというよりもそれこそモンスターCAとかあと今だと今名前変わったのかあのエンジェルリスト?ウェルファウンドかあとクレグスリストだったりとかっていうのは王道ですけどぶっちゃけ今優吾さんが言った通り乗ってる休日だいたい一緒なんですよねおまけに正直モンスターCAとクレイグスに関してはビザとかこっちで就労ビザをサポートするときに求人を絶対載せなさいよってカナダ政府言われちゃうんですよそん時にしゃーなしに載せる媒体がモンスターかクレイグスリストかみたいな雰囲気はちょっとあるから本気で使わせるとこってもはやねインディードとリンクドインとあってもまぁちっちゃいとこがクレイグスリストに載せるくらいの部分しかないのであんまりどこもかしこも見るっていうのは俺もどうなんだかなっていう気がする.けど.うーんでもはウェルファウンドだけはちょっと俺少し経緯と違って見てるかな若干まあ少しスタートアップによっているまあスタートアップジョブの強い会社さん探すっていう時になるんだったら割とウェルファウンド中心でもいいのかなとは思う時はある確かに.僕最初の方それ使っていくつか応募しかけたことがあるんですけどまあやっぱりんぐとかに比べると新しくオープンする求人が少なかったのでなんか途中から見なくなったっていうの.ありますでもそれで全然いいと思いますけどなリンクなんかインディーとかであとは.なんか現地イベントみたいなのもあると思うんですけどそこら辺はどうですか.なんかまぁ現地のイベントミートアップたくさんあるのでまぁ行きたい人は行ったらいいと思うし僕もよく行ってたんですけどまぁ僕が来てからの状況だとミートアップに行ってたからすぐに就職につながったっていうのはなんかあんまりなかったかなっていう気がしていて結構なんかミートアップに行ってリファレルもらって就職しましたみたいなのをたまに聞いてたのでそういうもんかなとか思って行ってみたりもしたんですけどもう僕がカナダに来た頃ぐらいはもう結構そういうミートアップでリファレルもらって就職したいみたいな半分学生みたいな人が結構たくさんいるのでなんかあんまりその中で明確に自分がこう他の人たちよりも目立ってリファレルもらえるみたいな状況はなんか方法はあんまりなかったかなっていう気がするので普通のミートアップに行ったからといって就職がそれですぐ進むかというとまあなんか結構そういうケースもあるかもしれないけどまあ多いケースではなくなってきているかなっていう感じがありますねあとはまあなんか就職活動している人向けのイベントは何回か行ったことがあってまあそれでちょっとリファレルをもらえそうになったとかはリファレル1件もらったかなとかはありますけど無駄ではないと思いますけど、目的をどこに置くかによって行った方がいい、行かなくてもいいみたいなのはいろいろ変わってくるかなとか思ったりしました。僕はミートアップに行ったから、いろんな人と英語で話す機会ができて、英語を使うハードルがまたさらに下がったみたいなところがあるから、僕としてはもうミートアップは無料英会話レッスンということで捉えていっていたので、それはそれで良かったかなと思いました。僕はあんまりここについて喋ることないんですけど、あんまり行かないし、なんか、わざわざ喋るとかもしないんで、まあ、あんまりないんですけど、一つ言えるのは、ちょっと前にインタビューさせてもらったヒロシ君とかみたいななんかソフト好き彼はもう俺はソフトスキルでぶった切っていくみたいなあのあれで言ったと思うんだ言ってたんで本当それぐらいもうその彼はあのなんだろうその登壇者の一番目のつく一番前に座って質問ありますかって言った時になくてもとりあえず手を挙げて一番最初にその質問権をもらうじゃないけどその目立つ子とかその人たちに気に入られることに善振りするみたいな人がいてその人はうまくいってたなみたいなそれであとは医師さんっていうその方もインタビューさせてもらってちょっと前に出したんですけど彼もなんかうまいことちゃんと戦略を立ててちゃんと人に喋りに行ったりしてあのレファラルとかをゲットしてたりはしたのでそういうのが得意な方上手な方は多分したらいいのかな確かにとはいえそのそれをやってるから他のこと頑張らなくていいかっていうとそれはなくてそっちにゼンブリしちゃうのは結構厳しいと思うかなっていうのはあります全振りは厳しいです.ねいやそうこればっかりもうキャラによりは本当にだって前あの全く同じリクリティングイベントにKさんが行った時あのこのpodcastで出てくれたが出てでその全く同じイベントに出ていた別のエンジニアの人たちからのレビューも聞いててで一方は行ってマジ意味なかったとあのあんなミートアップに行くだけ無駄だと給食しかしてはいないし人と繋がることもできないしということを言っていたのに対してKさんはあのイベントは絶対行った方が.いいって言ってるんだけど.リクルーターとの喋る機会も少なからずあるし自分のアプリポイントの練習にもなるし少なくとも僕はそこからレビュー面接の機会をもらうことができたから行ってめちゃくちゃ良かったっていう人もいてそれこそさっきの石さんとかヒロシさんみたいなタイプも含めだけども小魅力オーバーキーみたいなやつはああいうの得意だよねとは思うよね俺もできないから言わないと分かんないけど人によってキャラクターを自分とちゃんと会話をして自分に合ってると思うんだったらやったらいいしあってないと思うんだったら、やるだけ無駄な人も確かにいるよねって思うので。あとはなんか、さっきも言ったように、やっぱり売り手市場で大変なんで、基本的には長期戦になると思うんですよね。なんで、いろんな人たちがいて、すげー言い方悪くすると、転職、まあ職探しをしている人たちがいっぱいいるんで、その人たちと喋って傷を舐め合うっていうのも別に悪くはないんじゃないかなって個人的には思います。そうだね、面白いね。いっぱいいるんですよ、そういう人たち本当に。これフロッグメンバーじゃないから真似しろとは言わなかったけど、あのものすごいド派手なレジュメ作ったやつがいて、あの本当写真と等身大の自分のなんか姿かなんかをレジュメになんかボーンって載せるやつがいて、ATS対策の絵の字もないようなやつ。なんだけどそれをねなんかレジュメ上で配るとむちゃくちゃ売り上がったらしいのよあのなんだこのクソふざけたレジュメがみたいななんかそういうキャラクターで売るみたいなところって確かに人に覚えられはするからみんながやってないことをやるって人もたまにいるよねとは思う会ってる人もいるんだろうなと。次ちょっとそのレジュメについて喋りたいんですけど、それで言うと僕、実は1社目はレジュメには書かなかったんですけど、レジュメではやらなかったんですけど、カバーレターで僕はポートポリオとかの画像みたいなのを載っけてましたけどね。その時から僕ATSっていうあれではないけどそのフォーマットがあってそれに合わせた方がいいっていうのは分かってたけどあれってやっぱり今でもそう本当にそう思うんですけどあのやっぱ大きい企業が使うんですよで小さい企業はやっぱりそういうシステムとかにお金をかけたくないんであの基本的には一枚一枚見るみたいなあのまあ本当に短い時間かもしれないけど一枚一枚見るっていうのがをやっていてそういう人たちにはやっぱりあの画像なんでビジュアルで見れるんで刺さるのかなっていうちょっと手を止めやすくはなるかなって思ってて僕は1社目はそれ1社目を探す時はそれやってて割と感触良かったなって思うんであとは僕その時小さい時に小さい企業によくいっぱい出してたんでそれはアリなのかなって思います.けどねそうですね間違いない.僕も2社目とか応募していた時はカバーレターつけてて僕も画像載せてましたね個人開発でやったものの画像を載せてて、僕は個人開発しているものの一つにコラ画像を作るサービスがあって、それを使ってその会社のことを事前に調べた上で、その会社の事業ドメインに沿ったコラ画像を作って貼っておくみたいな。あとから2社名入った後、スラックのメッセージのやり取り見てみると、こんなレジュメあったよ、こんなカバーレターついてておもろ、みたいな会話がされてたので、それは確実に引っかかってたなっていうのがありました。うんうん、確かに確かに。キャラ付けのなんか重要性は割とあるよね、そういう意味だと。全く同じレジュメをそりゃ何千枚何百枚見る人たちだからさ、どうやって自分を覚えてもらおうかって、その手法は一人一人とか考えてほしいとこあって。今まで割と俺この人確かに良い線行ったなーというかまあすごいたくさん面接まで行ってるなーっていう人いたんだけどまあ前も喋ったかもしれないけどさ毎週金曜日に絶対面接のセットアップをしてリールを絶対持っていくっていうことも欠かさずやってた人とかいてまあまあどういう手段でもいいけどやっぱりキャラクターとして自分を覚えてもらう手段ってねやっぱりみんな考えてやってる方多いよねーとは思いますよ.そうですね、本当に何だろう、会社によるとしか言えないけど、それが通用する会社もあれば、しない会社もあるんで、会社によってそこをちゃんと使い分けられたら強いかなとは思いますよね。そう、東大さんのさっき言ってた、ATSを使わない会社確かにちっちゃいとこ多いよねっていうところも最近のさ、就労ビザが出なくなった昨今においてはちっちゃい会社でも正直数百件来るらしいから若干ちょっと入れてるところ増えちゃったかなとは思うとかいや、.それでもですよやっぱりスタートアップって資金繰り結構大変なんでキャッシュフローめちゃくちゃ大変なんでとはいえもちろん投資されてる会社は違いますよただ投資されてても奨学だったりだとかやっぱしてないスタートアップあのカナダ人が本当10人未満でやってるとかエンジニアチームに3人ですみたいなところって絶対入れてないんですよそうね、.そのチームだったら確かにそれはねで、.やっぱそういうチーム、そういう会社に狙いを定めるのは、カナダのバンクーバーにおいては結構正しいじゃないですか。1社目としては。最初の1社目っていうね。確かにね。だからそれを考えると、やっぱり別に全然ATS対策をしてないレジュメで目を引くものがあっても、僕はまあありかなってとは思いますね。なるほどね。そしたら、ちょっと喋ってたんですけど、レジュメについて、本格的に結構、トピックがレジュメっていうだけでも大きいんですけど、まずは何が違うの?っていうのをちょっと、優吾くんに聞いてみようかな。えー、僕?素晴らしい、.お願いします。プロでしょ?レジュメ。単なる自分の履歴を書いた履歴書とは違って、自分のこれまでの経歴をいかによくアピールするかが必要な、いわばちょっと誤解を恐れずに言えば一種の営業資料になるかなという気もしていて。うまいですねうん単純にこれをやりましたやりましたこれをこうしましたこういう技術使いましたって書いておくだけで日本の時は多分十分だった気がするんですけどこっちだとそれだけじゃもう絶対足りずにこれをこうしたのでビジネス上こういう活躍埋もりましたっていう視点を持ってちゃんと書いていかないといけないものがレジュメかなとその上でさっき言っていたATSのような機械的なフィルターで振り受けられてしまうっていうのもあるのでそれを考慮した上で機械のフィルタリングを通っていかに人事に届けるかみたいな視点を持って攻略していくのがこっちのレジュメかなと思ってい.ますめちゃくちゃうまくまとめてもらったんですけどわかりやすいようにこれから日本のスタイルのものを履歴書でこっちのものをレジュメっていう風に呼んでいきたいなとここから思うんですけど、めちゃくちゃ近いんですけど、僕もよく言うのは、事実の羅列をするのが履歴書、で、プレゼンをするのがレジュメ。履歴書は、誰が同じ経歴を持ってたら、誰が書いても一緒になる。ものが日本の履歴書で、レジュメは事実をどういうふうにプレゼンするかなんで本当にその人の分だけなんか種類があるみたいな僕はイメージかなって思います。さっき優吾くんもちょっと言ってくれたんですけどATS対策っていうのをした方がいい会社みたいなのがあってそういうのを入れている会社に対してはそのATSっていうアプリケーショントラッキングシステムがそのレジュメを選びやすいフォーマットだったりだとかなんかワーディング文字の選び方みたいなのが関わってくるよっていうのがレジュメなのかなとだからほとんど回答的には優吾くんと僕も一緒かなっていう感じですねまずはそしたらじゃあ具体的にどういうふうにそのプレゼンしていけばいいのか具体的に何だろう本当にどういうふうに経験とかを書いていけばいいんですかおお.じゃっくりよく言われるのはちゃんとビジネス上のインパクトをレジュメの中に組み込みましょうみたいなことはよく言われるなと思っていてだから例えて言うならば単なる機能を実装しましたというかReactでこういう機能を実装しましたっていうのを書きたい場合は多分単なる事実の羅列とかだとリアクトを使ってこういうAPIを使ってこのような機能を作りました終わりぐらいな気がするんですけどこっちのレジュメでそれを書きたい場合はさっき言ったATSの観点でそもそもリアクトで書いた方がいいのか書かなくてもいいのかっていう観点はありつつも個々こういう機能を実装したのでこういうインパクトがプロダクトに生まれてその結果ビジネスの数字がこう上がりましたとかユーザーのなんか滞在時間が上がりましたとか何でもいいと思うんですけどそういうビジネス上の価値につながりましたっていうのをちゃんと一つ一つの項目全部に書かなくてはいいと思うんですけどというのに書く必要があるなと思いました具体的なんですかねこれ.はいやいいと思います僕これあのさっきの僕あの前半で言ったことなのかなに繋がってくると思うんですけど日本のエンジニアの強さっていうのとこっちのエンジニアの強さってなんかレジュメにも現れてるなぁと思っててそこらへんのなんかビジネス視点を持っててそのどういうインパクトがあってあのまあそこまでは詳しく書かないかもしれないけどでまぁなんかこういうインパクトがあるからAとBというオプションがあったらAの方が妥当な判断でしたよみたいなのが裏にあってそのレジュメにその内容を書くじゃないですかなんかそこがなんかこっちでのエンジニアの強さがただ技術力だけじゃないみたいなのにも現れているのかなみたいなのをちょっと思ってましたね確かにあと言おうとしたこと忘れちゃっ.たまあでもちなみに俺もじゃあ聞きたいことを聞い.ていいのであればなん.だけど前にねあの2人にやっていただいたレジュメ会あったと思うんですねでまぁ俺もやっぱりそのレジュメってやっぱ大事なんですかって言う聞かれるんですけどみんな頭ん中の多分ね1日くらい多分レジュメ履歴書をレジュメに変換すれば多分十分な時間でしょうというふうに思ってると思うなんだけどさぁ前にレジュメ会やっていただいて大事なにあげていただいた方はどんだけかかったっけ半年はいそうかなちゃんと送れるようになったの多分4ヶ月5ヶ月だと思うんだよなおそらくそう、ていうので、なんでそんな時間かかるん?っていうのは、あの、要は聞かれることではあるんですが、お二人的には、そんな時間かける必要ある?僕もそれくらい時間かかった気がしますね、最初に電話した時。分かった?ほんと。そもそも、僕はそういう観点でこれまでの職歴をまとめてなかったので、そもそもなんか何があったとか思い出したり、棚下ろしする、自分の経歴を棚下ろしして整理するっていうのが、まず必要だし、何やったか思い出したところで、多分それが実際のビジネス上のインパクトに見せついてあまり考えてこなかったので、あれあの時ってどういう課題をプロタクトで抱えてどういう結果が生まれたんだっけっていうのを情報収集して思い出すっていうのが、なんか一つ一つすごい大変。過剰が気にすると一つの項目が結果的にできるとしても、それを思い出すために、まずそもそも何やったか思い出して、どういう背景だったか思い出して、どういう結果があったか思い出して、必要だったら人に聞いてみたいなことをやってると、まあなんかそれだけで時間かかるし、結構疲れるのでそれを1日で全部やるとかほぼほぼ不可能なんで、一つ一つやっていくけど、めちゃくちゃ面白い作業かと言われると面白い作業でもない気がするので自分のやる気との相談をしているとまあなんか数ヶ月かかって.しまうみたいしかもそれをさあ面接でやっぱり語れるレベルにしなくちゃいけないわけでしょあまりかしなんかデータだけあったらできるでしょって話でもないんじゃないかなっていうのは.あって確かに確かにあの僕これももう一つよく言うんですけどあのレジュメってあの使われ方が何パターンかあって一つはそのまあさっき言うようにあのATSとかまあ人の見てこの人と面接しようっていう風に選ばれる段階とあともう一つはあのそのエンジニアとその喋るときあの面接の中で喋るときにそれをなんていうのそこの中からやっぱ喋っていくなんていうのその題材にするのをそのインタビューしてくれる人が選ぶっていう使われ方がもう一個側面としてあってそこのだからそこに書いてあることについて結構なボリュームでちゃんと喋れないといけないみたいなのがあるんでただただそのレジュメに書ければいいっていうわけではなくてそのやっぱり優吾くんが今言ってくれたように棚卸しをしてどういうものだったのかみたいなのをなんかできるなら文章にまとめてそれを英語で喋れるようにもした方がいいんでそれのことを後々のことを考えるとプロジェクトの目標って何だったっけ?プロジェクトでどういうことをしたんだっけ?で、結果どうだったんだっけ?それから反省どうだったんだっけ?っていうようなフォーマットでちゃんとタノオロシ思い出して、それを文章にして、で、もしかしたらそのまま英語で文章にすることもできるかもしれないし、日本語でもともとたぶん仕事してたと思うんで、それを英語に直すみたいな作業をしないといけないと思うんで、そこに結構やっぱ時間がかかるんじゃないのかなみたいな。確かに面接に受かるまでにそこまでのプロセスがあるんだよっていう話ですね.あと僕さっき聞こうと思って忘れちゃったっていうの思い出したんですけどこっちって結構働き方がすでにそういう働き方になってるじゃないですかOKRみたいなのがエンジニアに見えやすくKPIOKRみたいなのがそもそもエンジニアに見えやすくてプロジェクトエンジニアリードみたいなエンジニアがプロジェクトをリードするときにこういう目標がありますよでこういうビジネス要件に対してどうしましょうみたいなそこら辺から結構エンジニアが渡されることが多くてじゃあこういうふうにしてた方がいいよねっていうのを考えエンジニアのリードが考えてでそれをまあなんていうのプレゼンみたいなのをしたりブラッシュブラッシュアップみたいなのをチームメイトとしてプロジェクトやりますで反省しますプロジェクトの反省会しますみたいなのがあってすでにこっちってそのフォーマットのレジュメに書きやすいフォーマットにすでになってるのかなって僕は思うよね日本で僕そのそのサースのエンジニアの経験がないんですけど日本はそうなってないんですかいや、.SaaSとかを開発してる会社だったらそれに結構近いとは思いますね僕はなんか割とそこら辺は今までの会社思い出してみてもまあチームのOKRとかそういうKPIの目標はあって何かの機能を実装する時にどれに紐づいてるかっていうのを結構整理したりとかをしてたのでそれは多分結構会社によるかなっていう感じではありますけど日本でよくあるようなSIRとかそう言われるような方々にとっては多分結構遠い話なのか.なっていう気はそうですねなんか、僕は、他の人はわかんないですけど、SIRにいて、お客さんが作ってほしいって言ったから作るんだ、みたいな、なんか、もうほとんどそんな感じだったんで、なんだろう、やっぱ、そことはほど遠い。あとはよく聞く話だとまあさっきのあのセナさんが出してくれたレジュメの回みたいなのを僕たちがやった時にその題材としてあの一人選んでその人のレジュメをまあその人が直すんだけどそのサポートしていくみたいなのを何ヶ月かかけてやってそのサポートしていった経緯をそのまあなんかブロックのイベントで発表するみたいなのをやった時にその彼を見てて思ったのはまあサースで働いてはいたんだけどまあそのエンジニアとしてはまあ多分その流れには沿ってるけどあんまり意識してなかったかなきっとなんでまあそのプロジェクトの人に聞いたりだとかみたいなのに時間かかったみたいなのが.あったのかな全体的にそういうもんだよねさっきも言った通りやっぱり売り手市場だしさ別にそんな数字とか意識しなくっても歴史上に増してはまとめなくったって絶対に受かるしみたいなのがあるんでまあ普段からやっぱ意識してるっていうねまあトガシさんはよくね月日転職する時も今だったら全然時間かかんないと思いますよってやっぱそこにあるじゃないですか普段からそういうKPIにしろOKRにしろそういった部分をどうレジュメに書くかっていうイメージがやっぱ湧いてる人.はそりゃいいよっていうとこで確かにそういう経験を積んでたとしてもそういうイメージが湧いてないのでそれまで経歴今まで何もまとめてませんでした思い出してませんでしたとかだともうその過去の4年5年の経歴を遡って全て棚下ろしすることになるのでなかなか大変.な作業なんかこの頃はあの結構僕以外でも話聞くんですけどその逆にレジュメに書きたいことをその仕事にしていくみたいなのがあってあのその働き方に慣れてくるとなんかそのやったことをレジュメに移すっていうよりはレジュメにこういう経験入れたいからこういうやつやりたいですっていうのをマネージャーによってでその形に持っていくみたいなのを結構僕もするんですけどもうだから慣れてくるとそういうふうにはやってこれますよねそれを考えるとやっぱ日本で今ソフトエンジニアとしてすでに働いていて海外で就職を考えるのであればちょっとそのビジネス要件は何だったのかそれに対するどういうオプションがあってどういうトレードオフがあってどういうオプションを取ったのかでその結果どうなったのかで反省はどうだったのかみたいなフォーマットでそのプロジェクトを整理しながら働けたらいいですよね.難しいんだけどさ、ここでさ、せっかくこのポッドキャストを聞いてる人達いて、いずれ海外行きたい人が多いだろうからさ、もうちょっとどうしようもないケースの話だけさせていただけるんだったら、どうしようもないとは言わないよ。やっぱりワーホリがさ、最近2年になったじゃないですか。なのでワーホリだけやっぱり渡航するって人たち結構増えたんですよ。少なくとも2025年入ってからね、もう8ヶ月、9ヶ月経ってるけどさ。でまぁフログ使ってない人も当然いてで途中からフログにまあジョインしようっていう風になる人も結構増えてでその特徴として話しとくとやっぱりそのレジュメだったりとかカバーレターだったりとかも含めてこっちの就活なんかノウハウを知らずに渡航するとで日本ではSIやってましたとかエンジニアの方だけありますよとでまぁとりあえず技術力には割と自信もあったし個人開発なんかもしてたから結構技術は楽しいしっていうのでこっちに来るとで、えっと日本でね、やっぱりまあそれなりに、あのー、SIRかもしれないけど働けていたしっていうのでこっちに来てワーホイ使ってます。で、レジュメ送りまくります。1ヶ月、2ヶ月、3ヶ月経って、まあ全然返事が返ってこない。これはもうどうしようもねえっていうことで、一旦フログに連絡きます。で、俺らの方がレジュメって多分そういうもんじゃないっていう風にこの間レジュメ界の人たちが言ってたよって話をしえ、じゃあこういう努力を今からしなくちゃいけないんですねって言って一行一行ワークエクスペリエンスを洗い出して過去の人たちの話を聞いてっていうのでやりだし気がついてみたらそれもやっぱり4ヶ月5ヶ月かかっていて自分の言葉に落とせるようになったら1年目のワーホイが終わってるっていう割とそうはならないんだよねって言いたいケースは結構最近多くてですねこれが学生期間とかだったら別いいよあの別にさまあ学生期間中に気づいてよかったねーでコープだったりワンホリだったりの期間にちゃんとまあフリに行かせるんだったらいいじゃんっていうところだけどワンホリのみで最近来る人たちにやっぱり人との繋がりが急須な状態で来てるとそれ気づかないからこういうポッドキャストとかちゃんと聞いて知っておいてほしいよねっていうのはちょっと.あるよねなんかそれってでもあのなんだろうトレードオフなのかなと思っててそういう人たちの強みって行動力にあるんですよねだから準備とかせずともう来てしまうんですよそういう人たちはでもそういう人たちは行動力あるからイベントにも行きまくって誰かに喋りまくってそういう人たちのその強みを生かしたことができるかもしれないんでまあなんかその後でも途中で気づけんだったらそれはそれでいいのかなって僕は思っててなんだろう学校とか行ってその滞在期間を伸ばすみたいな方法はお金さえあればいくらでも続けることはできるんでまあ諦めなければ多分その人たちもまあ1年経っちゃってるかもしんないけどそこから何とかすることはできてで逆にそのそういう人たちがちゃんと準備そういう人たちがというよりはちゃんと準備してこれ来る人たちって行動力ってかその突拍子もない動きをしないからまあ行動力がないって言うと嘘になるかもしれないけど準備をしすぎていつ来たらいいかわからないみたいな状態になってで気づいたら30歳過ぎててワーホリ使いませんでしたみたいなとかワーホリだけじゃなくて永住権とかビザまあビザはないかもしれないけど永住権の要件ってやっぱり若いくて未来のある人たちが国は欲しいんで基本的にはそういう人いうのに間に合わなかったみたいなのってあるんでだからなんだろうまあ一見来た来れてしまったらそのいや準備しとけばよかったよねって言えるけど来れないそれで来れなくて時すでに遅しみたいな人たちもいるんでそれはそれでまあなんだろうしょうがないしょうがないっていうかまあ本当にストレートオフなのかなって確か.に確かに両方いるだからどっちも極端になったら多分あかんくて本当に何に準備せずにもうなんかもうぺっぷのままで来たみたいな感じだってもそれはそれでちょっと言いたいことあるしかといって準備しまくりで日本でも何十人も何年も過ごしちゃいましたっていう人はもう行く気ないんだねで終わるしそこはね確かにまあどっちも両極端だとあかんなっていう気が.します何せ僕情報収集はちゃんとしなきゃいけないよなというふうに思ってて最初にも話していたような、もう日本の市場とこっちの市場で全然ルールが違うので日本で頑張ったらうまくいってたからといってこっちでガムシャルに頑張ればうまくいくみたいな世界線ではないから頑張るにしてもどういう方向で頑張ったらいいかみたいな情報収集は別にこっちに来てからでもいいのでなんかちゃんとやった方がいいなという感じがあってなんかたまにそういう半年ぐらい頑張ってるんですけど結果出ないですみたいな人の話を聞いたりレジを見てみたりするとこのレジュメで半年応募し続けたんですが、大変ですね、みたいな。たぶん。間違いない。それはめちゃくちゃいますね。そういうのはすごいよく聞いたり見たりすると、なんかもったいないなっていう感じはするので、.そうなんですよ。なんで、今回僕この内容を日本で撮ってるんですけど、撮りたかったのも、それがめちゃくちゃ多いんですよね。めちゃくちゃ多い。めちゃくちゃ多いんですよ。なんか僕たち的には、やっぱり僕も優吾くんも、もちろんセナさんなんてコミュニティやってるわけだからそうだと思うんですけど、日本のエンジニアに活躍したいと思ってるじゃないですか。なんで結構この情報ってできるだけ出したりだとかまあ他の人たちもあのどういうふうに就職しましたよみたいなのって記事とかで出してたりするんですけど本当にあの伝わってないこの情報が反映されてないなっていうのが自分の周りでもいっぱいいるんで本当そこはまあもちろん情報感度は高くあってほしいけど、まあとはいえなんかその行動力だけで来れちゃう人たちみたいなのにその制限しちゃうのも違うかなって、っていうのも自分もそうだし僕は何も考えずに来て、もちろん運が良かったっていうのももちろんあるんだけどもそうだし、まあケイ君にしろなんだろうそれできて逆にそれだけで成功するうまくいっちゃう人たちっているじゃないですかそのコミュニケーションがめちゃくちゃ強くて行動力あってあのイベント全部行きましたよみたいなで別にレジュメの回復とかぐちゃぐちゃだけどもなんかその場であってうわぁこいつを仕事したいって思われれば逆にレファラル出してくれて勝ちみたいなの多分あるんでだからなんかもちろん情報があるに越したことはないけどなんかまあ知り込みを準備を完璧にまとめる必要もないのかなとは思うんで難しいところではありますよねでも情報.収集のその優吾さんの話にちょっともしかしたら起因するかもしれないけど最近実はちょっと傾向として多いのがさなんかフロックみたいなコミュニティを最後の砦と考えてる人たちが多くてなんか最初は自分で要するに試してみようっていうノリで多分カナダ来てるのよあの人たちって気持ちめっちゃ分かってしまうが半年とか9ヶ月とか経ったタイミングで俺らのところに連絡くんのよでもさぁ申し訳ないけど玉数はやっぱり限られちゃうわけでそれはこれはもうねーしあのやっぱり中にはね31とかって言ってるからラストホリディー違うギリホリかでね来てとかでやっぱりさっき東橋さんも言った通りカレッジに行けば確かにお金があればいけるっていうのはあの滞在期間伸ばせるっていうのはあるけどとはいえね100万200万っていう金額がポンポン飛んでいくわけでやっぱり出せない人も多くてなんかそういうのってなんか情報収集のためにフロックやこのポッドキャストも含めだけどそういうのを使うっていうことに対してなんか変なボーダーでもあんのかな?そうへん分かんないけど日本人に手借りたくないっていう気持ちはなんかあるんじゃないですか?僕もあったしなるんだよね何なんだろうねっていうのがあってでも分かんないけど俺は少なくとも他のアジア圏の人たちとかそれ見たことなくてでもなんか.この頃なんか日本人特有なのかなと思いつつこの頃ってかなんかその若い世代には薄れていっているのかなみたいなそういう人たちなんかそういうのに使うことに抵抗のない人たちが多くなっているのかなみたいなのはちょっと感じているまあ優吾くんとかもそうじゃないですか僕なんか本当に全くそれであの就職するまで別にセナさんとほぼ喋ったことないみたいな1回最初の1回ね相談行ってでその次は多分就職しましたこれからのあのビザとか永住権の流れ相談したいんでお願いしますぐらいじゃったじゃないですか僕.も最初フロックのことを調べる前まではコミュニティとかに頼らず一人で海外に行って一人で就職成功させた方がなんか強そうだしかっこいいじゃんみたいな.そうなんだよね美学っすね美学なのかなこれって日本の日本の何だろう努力を隠したい美学みたい.なあるのかなぁだから最近本当にそれが多くてでも9ヶ月経っててあと3ヶ月しかありませんって俺言われたところでさで学校行きたくないですって言われたらさ知らんってなっでレジュメはって言ったらもうなんか本当になんかもうすかすかのワークエクスペンスの部分なんかに2ブレッドポイントくらいしかないみたいなもうそんなんしかなくてっていうの持ってこられてもどうしたらいい.のっていうねまあもう本当になんかその人たちでもやっぱりリーチできるようなあのように発信していくっていうのがまあ優吾くんもね自分でポッドキャストやられてるしあのまあセナさんはいくつかチャンネルがあると思うし僕もまあこうやってポッドキャストやってるんでこういうのは効くじゃないですか結構この頃僕面白いなと思ったのが結構まあブロックとか日本人のコミュニティで新しい人に会ってあのすごい初めましてみたいな感じで喋るんだけど、よくよく話してると、めっちゃ聞いてくれてて、聞いてるのかみたいなだから多分そういう人たちでもその直接的に話に行くのは嫌だけど情報があれば取りに行きたいとは思った自分の手の届く範囲では情報を取りに行ってるんでこういう情報を増やしていくっていうのは一つの解決策というかその人たちがじゃあフロックに早めに声かけに行こうとかイベント出て誰かに話しかけてみようみたいなのはあるのかな.といやシンプルにだからさそういう情報を取りに行く癖がついてる人はさっきの優吾さんなんて言うとこのね情報の感度が高い人やろうから別にいいかなって思うんだけどこういうのすら取りに行かない人っていうのやっぱりいるからなんか変わんのかなーって.ちょっと的に思った本当、読まないですね。情報収集で言うと、英語で海外で就職したい、特に北米とかで就職したい場合は、英語で情報収集できたほうがいいなっていうのもある。それはそうですね。なんか日本人が就職成功したことをまとめてる記事、僕も書きましたけど、そういうのたくさんあると思うんですけど、とはいえやっぱレジュメの書き方とかって英語で調べてた方が結構リソースが多いので、そうした方が結構有益な情報にたどり着ける確率が結構上がるなというのが僕は調べてても思ったので、英語圏で就職したい場合は英語で調べれた方が情報収集の能力が上がるなという感じはありました。いやそれこそ僕たちがそのやったそのレジュメのイベントので僕僕が一番最初にその彼にお願いしたのはそのまず記事を読みまくることでなんか何だろう、英語の記事を読みまくることだったんですけど、それってすごい大切だな。僕も、僕自身もほぼほぼなんかそのレジュメの書き方、そのエンジニアのそのレジュメの書き方みたいなの、記事はなんか、世に出てるもの全部とは言わないけど、ほんとめちゃくちゃいっぱい読んでて、でも日本でそれって何も出てこないじゃないですか、ほぼ。まあ今はね。あるかもしれないけどあの本当情報の量が全然違うんでやっぱそこを見に行ける人たちはめちゃくちゃ強いです.よねうーん本当僕も最初めちゃくちゃ調べていろいろなこうそもそもatsとは何か見たいとかも調べましたしどういうレジュメがいいとされるのか人事に受けがいいのかとかも英語で調べましたし僕は結構いろんな人にお勧めしているリソースがあってテックインタビューハンドブックっていうんですけど結構オーブンソースで管理されているこっちでのレジュメの書き方からどんなレジュメがいいかからどんな面接があるかとかリードコード的なクエスチョンどんなのがあるかとかも結構その就職するまでに必要な情報をまとめたサイトというか情報源とかがあってそれは僕は結構重宝しましたね放送の概要欄に貼っといて.くださいはい貼っときます多分僕も読んでそうなんかその流れで言うと、ATSって言葉自体もそのフロックのコミュニティで流れ始めたのって僕とK君が言い始めてからで、なんでやっぱなんかそこらへん英語でリーチしてるっていう人が少ないんだろうなっていう印象を受けるんで、だから多分結構な人がレジュメはまず履歴書を英訳したものだみたいな多分固定概念というか、のまま進んじゃってるっていう人たちが多くて、ここらへん、英語で調べられるようになるといいですね。めちゃくちゃ時間使っちゃったんですけど、面接のプロセス、いく?なんかこれも小さい、なんていうの、小さい会社と大きい会社で全然.違ってそうだよね、まあ間違いない、まあ別の機会でもいいんじゃない?結構これが一個のプロジェクトとして大きいしさ、.そもそもどうしよう、さらっと流すかまあでも.いいかいいんじゃない?プロセスで言うんだったらさ、正直ゲストの人たち相当喋ってくれてるのもあるしね、.正直まあ確かにプロセスで言ったらそうですね、まあなんかプロセスはざっくり、レジュメのなんか思うのは、日本なんかフロックの僕が観測している範囲で言うと、レジュメを受かり始めて、5件とか10件とか面接受けている人たちって、どっかには引っかかっているイメージあるんですよね。もちろん英語が大変なのはあるけど、基本的にカナダに来てる人たちは英語をちょっとできるっていう状態にはなってて、日本人の努力をちゃんとする心だったりとか、技術力の高さから、あんまりそこで足踏みしてる人って少ないのかなっていうのは、僕はちょっと思ってるんですけど、どうですか?まあいや両極端じゃないいやそれはもう本当にトガシさんの言う通り全然そこで足踏みしてる人はちょっと少ないだろうなと言いつつそもそものコミュ力っていう部分でやっぱりちょっとね日本語であったとしても正直ちょっとこの人はもうちょっと強く言おうかとかちょっと人に対してちゃんとコミュニケーション取る努力しようかとかってなんか生まれながらと言ったらちょっと言い方悪いけど英語依存の問題だよねって人は正直いないと言えば嘘になるよねっていうのはあるよねうーん.まあ確かにそれはそうです.ねシンプルに技術力がとか面接まで行ってしかもレジュメでちゃんと取るねあのまあ情報のまとめ方もできていて情報収集もできていてっていう方がまあ確かにね面接まで行けてっていうとこでなんか待ったっていう話ってそんなめちゃくちゃ聞くわけじゃないけどうーん怖いえーなんだろうな面接でちょっとうまくいかなかった人の話とか聞いてるとそもそもアピールポイント何も喋ってなかったりとかあのレジュメには確かにかけているんだけれどもここをちゃんとアピールするべきだよねっていうところがいやでもみたいな感じでちょっと終わってたりとかそれちょっともったいないなっていう瞬間は正直多いな.確かにまあそういう人は確かに一定数いますよねでもそういう人たちってそのレジュメのところにも引っかかってるなってイメージはあるまあまあ確かにねそこなんかそのPDCAじゃないけどその改善のサイクルを回せてないじゃないですかなんで結構やっぱあの誰でもやっぱレジュメのパートで引っかかって何ヶ月か過ごすんでそこでなんていうのオーバー乗りそこで乗り越えてら乗り越えられる人はその次のプロセスでもあの乗り越える力があるのかなと思うんでっていうのもありそこのプロセスではあんまり引っかかってる人は少ないのかなっていうのがなんかあんのかなで.も確かにねただpdcaのそのサイクルの中で人に聞くっていうことだったり誰かに頼るっていうことを早いタイミングで生きている人は俺は結構あのそのサイクル回すのが早いなと思う確かにレジュメであろうが面接であろうが何であろうが全部自分の一人だけで完結をしようと悩んでる人が.もうむちゃくちゃ多いいやー確かにレジュメにせよ何にせよ人にレジュメだったら人に1回見てもらうのが一番早いですもんねなんかそれを100%人に見てもらうことだけでやったらそれはそれでちょっとうーんって感じではありますけどとはいえ、なんか一人で全部いろんな記事を読み漁って、一人で完璧を求めてずっと一人で黙々やっていても、なんかちょっとイマイチみたいなパターンは結構あったりするから、.そうなんだよ。人の上手い頼り方って必要ですよね。あるある。で、.しかも多分英語の話と多分一緒で、完璧な英語じゃないと人の前で喋っちゃダメっていうのもあるように、思う人はいるように、完璧なレジュメ、完璧な面接対策を自分の中で結論を出さないと人に聞いちゃダメって多分思ってる人が多くて、うーんそうなってしまうとpdcaのサイクロンを回せないしトライアンドレーラーもできないし自分の頭の中だけですべて完結違ったらもう大ショックって話だからそのタイプの人は少しね英語も多分踏まえても失敗してもいいし変な奴見られてもいいから一旦誰かに頼ろうかっていうのはちょっと言いたいところではあるかなそのためフログみたいのもあるし.ねっていうまあそうですねなんかまあでもそれって仕事でも言えることでこっちってやっぱその日本での完璧さ日本みたいに完璧さ求めるよりもまあ壊れててもいいちょっとちょっとくらい壊れててもいいからメインのmvpできてるんだったら出しちゃおうぜ出しちゃおうぜっていう文化なんでで仕事の中でもあのみんなでなおあの壊れてるところはみんなで直していけばいいじゃんとりあえずmvp早めに作ってあの車内に出そうぜみたいなのっていう文化があるんでそういうふうな働き方をできる人を求められてるんでちょっとそうじゃない人たちはそういうのに慣れ慣れる意味を慣れる練習としてちょっとそこらへんを捉えられるといいのかもしれないですねそれ.が評価としてやっぱりマイナスになると思い込んでんだろう.ねおそらくうーんそうですねそれはあるかもしれない98.%くらいの完成度のものを出さないと多分評価マイナス.みたいな面接のプロセスはちょっとどっかでまたそのうちいうことにしましょうかね結構これだけでも結構長い間になっちゃったんではいということで今回はちょっとまあいつものセナさんとユゴ君に来てもらって就職海外就職するならどうやったらいいみたいなのを話していきましたありがとうござい.ましたありがとうございましたと.いうことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspoifytapplepodcasubetなyoどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました.",
  "utterances": [
    {
      "speaker": "A",
      "text": "はい 始め て いき ましょ うそ し たら 今回 も 前回 に 引き続き ゆっくり どう やっ たら 海外 就職 できる の って いう の を お なじみ の セナ さん と また 何 回 か この ポッド キャスト に も 出 て き て もらっ てる ん です けど 優 吾 君 に 来 て もらっ て 喋っ て いこう か と 思い ます また 簡単 に 自己 紹介 から.",
      "start": 28,
      "end": 16238,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "いき ましょう か はい カナダ で エンジニア を やり つつ it トリオ と いう ポッド キャスト を やっ て いる 小倉 君 こと 優 吾 です よろしく お.",
      "start": 16238,
      "end": 23022,
      "timestamp": "00:16"
    },
    {
      "speaker": "A",
      "text": "願い し ます お 願い し ます そ し たら 前回 は 結構 英語 と か 結構 トピック が 多かっ た ん で 準備 段階 みたい な 話 を し て た ん です けど 今回 から は ちょっと 求人 の 探し 方 あと は レジュメ 面接 プロセス みたい な ところ を 主に し て いき たく て、 どんな ところ で 日本 と の 違い が ある の か。 前回 の 話 だ と、 一 回 エンジニア 海外 で なっ て しまえ ば、 英語 力 を 除け ば 結構 スムーズ に いける よ、 みたい な。 もちろん 英語 が 大変 な の は 絶対 ある と 思う ん です けど、 そう いう 話 を し て き た ん です けど、 結構、 就職 活動 に つい て は 違い が めちゃくちゃ あっ て、 そこ が 特に 大変 な ん じゃ ない の? って 思っ てる ん です けど、.",
      "start": 23022,
      "end": 67766,
      "timestamp": "00:23"
    },
    {
      "speaker": "B",
      "text": "どう でしょう?",
      "start": 67766,
      "end": 71179,
      "timestamp": "01:07"
    },
    {
      "speaker": "C",
      "text": "もう おっしゃる 通り じゃ ござい ませ ん か ま あ そもそも だ って あれ だ よ ね あの 英語 系 に なっ て くる と やっぱり ま あ キャンディ レート と いう か ね もう 候補 者 の 数 が そもそも ボリューム ゾーン が 全然 違う から 日本 で 日本 語 だけ で やっぱり ね 就職 活動 し て って いう 風 に なっ て ヒュー まあ わかん ない けど 100 件 と か の やっぱり キャンディ レート が いる 中 で 英語 系 に なっ て くる と 全 世界 から だ から ね 数千 人 と か ぶっちゃけ ザラ だ し って いう 中 で やっぱり 就活 方法 を 言っ たら 対策 ゲーム 必要 でしょ と いう こと を もう この 辺 は ね お 二人 の あの レジュメ 説明 会 で も 話 いっぱい し て いただき まし た が 具体 的 に どの 辺 が 違う か 確か に podcast で 喋っ て なかっ た の で 改めて 聞い て みよう か 何 し.",
      "start": 71189,
      "end": 103850,
      "timestamp": "01:11"
    },
    {
      "speaker": "A",
      "text": "た 二人 とも なんか あの まず 違い と し て あの 売り手 市場 買い手 市場 さっき も ちょっと 出 た ん です けど って いう の が 違っ て その 日本 は 売り手 市場 だ けど こっち は 買い手 市場 な ん で 僕 たち が 選ん で もらう 立場 だ から やっぱ 多分 今 の その セナ さん の 質問 の 何 し た って いう の に 繋がる と 思う ん です よ ね なんか 日本 の 就職 の 話 エンジニア の 就職 の 話 を 聞く と いや 別 に あっち から 来る もん だし.",
      "start": 103850,
      "end": 132524,
      "timestamp": "01:43"
    },
    {
      "speaker": "C",
      "text": "みたい な 間違い ない 本当 に ある.",
      "start": 132524,
      "end": 135585,
      "timestamp": "02:12"
    },
    {
      "speaker": "A",
      "text": "の か な って ルール が 違い.",
      "start": 135585,
      "end": 139206,
      "timestamp": "02:15"
    },
    {
      "speaker": "B",
      "text": "すぎる から なん か まず そこ の 違い を 体感 する こと が 必要 だ な と いう 感じ が し て て こそ 僕 日本 で 転職 活動 し まし た けど 日本 の 転職 活動 って まあ 今 で も そう いう サイト に 登録 すれ ば 日本 で 有名 どころ だ と ファインディー と か ラプラス と か いろいろ ある と 思う ん です けど そう いう ところ に 登録 し て 経歴 ちょろっ と 書い て おく と ちょろっ と 書い て おい た だけ で 経験 年数 3 年 と か 5 年 ぐらい あれ ば まあ 企業 側 から いい ね と か が 来 て もう こっち が 選び 放題 みたい な そう だ よ ね なんか 言葉 を 選ば ず に 言っ て しまう と ヌル ゲー みたい な 感じ が ちょっと ある と 思う ん です けど こっち だ と もう さっき セナ さん が おっしゃっ た よう に 真逆 で ポジション を 応募 し たら 1 日 で 100 件 来る と か 応募 が 来る と か は 当たり前 だ し ま あ それ が 何 日 も ずっと 空い て いる わけ な の で 300 人 400 人 500 人 と か 一 つ の ポジション に 応募 が 来る こと も 当たり前 で その 中 から 勝ち上がっ て いか ない と いけ ない って 感じ な の で もう そもそも なんか 全然 ルール が 違 く て こっち に 来る 前 は まあ 主力 活動 難しい って 聞い て た けど 多分 日本 と 同じ よう な 感じ で 技術 力 が ちゃんと あれ ば 言う て 他 の 人 より は 楽 に いける でしょ と か 僕 は 思っ て い た し 多分 そう 思っ て くる 人 多い と 思う ん です けど そう いう の は もう もう 全然 ない こう いう 希望 を いかに 早く 打ち砕ける か と いう 絶望 を いかに 早く 味わえる か みたい な ところ が あっ た な と 思い まし た.",
      "start": 139206,
      "end": 221910,
      "timestamp": "02:19"
    },
    {
      "speaker": "A",
      "text": "僕 あの これ ちょっと 面白い な と 思っ た の が やっぱ その 売り と 市場 買い手 市場 って いう 違い から 来る その サービス と か の 違い が ある な と 思っ て その 日本 で 売り と 市場 だ から こそ あの 応募 者 に 対し て 手厚い サービス と か システム が ある ん です よ ね もちろん その ファインディー と か も そう だ し そう いう 系 の サイト って めちゃくちゃ ある じゃ ない です か とにかく 応募 する 人 に 登録 し て もらっ て その 人 たち は 集めよう って いう で その 人 たち の サポート を し て その 人 たち に 楽 し て 転職 し て もらう って いう サービス が 多く て 海外 は ちょっと これ から 話し て いき たい ん です けど ATS アプリケーション トラッキング システム みたい な 会社 側 に 対する サポート サービス が あっ て その 会社 が 楽 を する ため に その 売る 側 の なん て いう の を どれ だけ 先 に 絞っ て あげる か みたい な の が ある の か な って 思っ て て.",
      "start": 223530,
      "end": 278462,
      "timestamp": "03:43"
    },
    {
      "speaker": "B",
      "text": "確か に 会社 が 楽 に なる ため の サービス が いろいろ ある こっち と 就職 側 が 楽 に 転職 する 側 が 楽 に なる ため の サービス が いろいろ ある 日本 だ と も 何 も か も 違い.",
      "start": 278462,
      "end": 288169,
      "timestamp": "04:38"
    },
    {
      "speaker": "A",
      "text": "ます よ ね そう だ から なん か その 違い から 来る やっぱり 大変 さ って いう の は 特に 自分 その 日本 の エンジニア を やっ て た 人 たち は 逆側 から 来 てる って いう こと を 意識 し て 結構 その 両 極端 に 逆 に 行か ない と いけ ない ん で 大変 だ よ って いう の は やっぱ その まあ ちょっと 優 吾 くん が 言っ た こと の 繰り返し に は なる ん です けど 強調 し て おき たい なあ って いう 頃 です よ ね それ を さ、.",
      "start": 288169,
      "end": 309384,
      "timestamp": "04:48"
    },
    {
      "speaker": "C",
      "text": "なん か 日本 に いる 人 たち に どれ だけ 言っ て も 響か ない ね、 俺 ら みたい な の が 言っ て た。",
      "start": 309384,
      "end": 313975,
      "timestamp": "05:09"
    },
    {
      "speaker": "B",
      "text": "いや、 僕 も だ って 響い て なかっ た から、.",
      "start": 313975,
      "end": 316086,
      "timestamp": "05:13"
    },
    {
      "speaker": "C",
      "text": "無理 です よ、 そんな の。",
      "start": 316086,
      "end": 317576,
      "timestamp": "05:16"
    },
    {
      "speaker": "B",
      "text": "全然 想像 が つか ない です もん。 人生 で そんな こと 経験 し た こと ない ん だ から。",
      "start": 317576,
      "end": 320937,
      "timestamp": "05:17"
    },
    {
      "speaker": "C",
      "text": "いや、 そう な ん だ よ ね。",
      "start": 320937,
      "end": 322867,
      "timestamp": "05:20"
    },
    {
      "speaker": "A",
      "text": "だ から もう、.",
      "start": 322867,
      "end": 323457,
      "timestamp": "05:22"
    },
    {
      "speaker": "C",
      "text": "これ ばっかり は もう 体験 する しか ない でしょ と しか 言え なく て。",
      "start": 323457,
      "end": 327958,
      "timestamp": "05:23"
    },
    {
      "speaker": "A",
      "text": "まあ、 そう です ね。 それ は なん か、 体験 し て、 そう な ん だ な ぐらい で 思っ て もらえれ ば いい の か な って 思っ て て なん か 今回 この 後半 で 特に 僕 が なん か 喋り たい な って 思っ て た の が その と は いえ やっぱ その 日本 人 が 体験 し た こと の ない もの だ から、 びっくり は し ます。 それ は それ で いい です。 ただ その 後 に くる、 その 情報 量 の 少な さ から 日本 人 が その 戦え なく なっ てる と か、 つまり やすく なっ てる みたい な の を 解消 し て いき たい な って いう の を、 ちょっと この 後半 の 目標 に 僕 と 僕 と し て は ちょっと 置い てる ん です けど まず 優 吾 くん まあ 僕 で も いい ん です けど どう やっ て 探せ ば いい ん です か ね まず 求人 は その ファインディー みたい な サービス が ある ん です か それ と も なん だろう 自分 で 会社 の なん て いう の ホーム ページ みたい な 一 件 一 件 行か ない と いけ ない ん です か 僕.",
      "start": 327958,
      "end": 383861,
      "timestamp": "05:27"
    },
    {
      "speaker": "B",
      "text": "は 有名 どころ の サービス が あれ ば それ を 使え ば いい か な って 感じ で 僕 が メイン で 使っ た の は LdIi を nke 使い まし た ね LdIi で nke 職 を 検索 できる 機能 が ある の で それ で 職 を 検索 し て 僕 の 場合 は バンクーバー で まず 地域 を 絞り 職種 的 に は 一番 最初 の 一 社 目 探し た とき は Web の フロント エンド か フル スタック か リアクトネイティブ を 使っ た ソフトウェア ディベロッパー みたい な 感じ で 調べ て ま あそこ で でき た ところ を 順番 に 応募 し て いく みたい な ざっくり 言う と 感じ で あり まし た.",
      "start": 383861,
      "end": 415091,
      "timestamp": "06:23"
    },
    {
      "speaker": "A",
      "text": "ね なんか もう 一 つ あの よく ある の が イン ディード って ある.",
      "start": 415091,
      "end": 419679,
      "timestamp": "06:55"
    },
    {
      "speaker": "B",
      "text": "と 思う ん です けど それ は ダメ です か いや いい と 思い ます ね 僕 は 一番 最初 に 就職 活動 を し て いる 時 最初 本当 は 両方 使おう か な と 思っ て た ん です けど ま あ 多分 後 で 話す と 思う ん です けど 会社 ごと の 対策 を する って なる と 一 社 応募 する ため に 時間 が かかっ て しまう の で そもそも 時間 が 足り なく て リンクドイン で 手 一杯 だっ た って いう の と あと いろいろ 見 て みる と ま あ その 大手 系 の 会社 の 求人 サイト って いう ん です か ね 求人 の 機能 を 見 て オープン し て いる 求人 に 見比べ て みる と 結構 かぶっ てる の が 多い の で この サイト に しか 求人 が 出 て ない みたい な の は 結構 レア ケース な ん じゃ ない か な と 思っ た の で まあ リングドイン 大きい サービス だ し そこ を 使っ て おけ ば いい か な と いう 感じ で そこ に 集中 し て た 感じ で は あり まし た ね.",
      "start": 419679,
      "end": 464381,
      "timestamp": "06:59"
    },
    {
      "speaker": "A",
      "text": "僕 も 大体 同じ 感じ な ん です けど セナ さん なんか あの 結構 その カナダ で いろんな ところ いろんな ところ と か いろんな 人 たち が 就職 活動 し て いる と 思う ん です けど 他 に なん か サイト と か なんか サービス と か って 聞き ます?",
      "start": 464381,
      "end": 480082,
      "timestamp": "07:44"
    },
    {
      "speaker": "C",
      "text": "いや もう 有名 どころ いろいろ あり ます よ あの フロッグ と いう より も それ こそ モンスター CA と か あと 今 だ と 今 名前 変わっ た の か あの エンジェル リスト? ウェル ファウンド か あと クレグスリスト だっ たり と か って いう の は 王道 です けど ぶっちゃけ 今 優 吾 さん が 言っ た 通り 乗っ てる 休日 だいたい 一緒 な ん です よ ね おまけ に 正直 モンスター CA と クレイグス に 関し て は ビザ と か こっち で 就労 ビザ を サポート する とき に 求人 を 絶対 載せ なさい よ って カナダ 政府 言わ れ ちゃう ん です よ そん 時 に しゃ ー なし に 載せる 媒体 が モンスター か クレイグスリスト か みたい な 雰囲気 は ちょっと ある から 本気 で 使わ せる とこ って もはや ね イン ディード と リンクドイン と あっ て も まぁ ちっちゃい とこ が クレイグスリスト に 載せる くらい の 部分 しか ない の で あんまり どこ も かしこ も 見る って いう の は 俺 も どう な ん だ か な って いう 気 が する.",
      "start": 480082,
      "end": 527182,
      "timestamp": "08:00"
    },
    {
      "speaker": "A",
      "text": "けど.",
      "start": 527182,
      "end": 527262,
      "timestamp": "08:47"
    },
    {
      "speaker": "C",
      "text": "うーん で も は ウェル ファウンド だけ は ちょっと 俺 少し 経緯 と 違っ て 見 てる か な 若干 まあ 少し スタートアップ に よっ て いる ま あ スタートアップ ジョブ の 強い 会社 さん 探す って いう 時 に なる ん だっ たら 割と ウェル ファウンド 中心 で も いい の か な と は 思う 時 は ある 確か に.",
      "start": 530814,
      "end": 543264,
      "timestamp": "08:50"
    },
    {
      "speaker": "B",
      "text": "僕 最初 の 方 それ 使っ て いく つ か 応募 し かけ た こと が ある ん です けど ま あ やっぱり ん ぐ と か に 比べる と 新しく オープン する 求人 が 少なかっ た の で なんか 途中 から 見 なく なっ た って いう の.",
      "start": 543264,
      "end": 554613,
      "timestamp": "09:03"
    },
    {
      "speaker": "C",
      "text": "あり ます で も それ で 全然 いい と 思い ます けど な リンク なんか インディー と か で あと は.",
      "start": 554613,
      "end": 562141,
      "timestamp": "09:14"
    },
    {
      "speaker": "A",
      "text": "なん か 現地 イベント みたい な の も ある と 思う ん です けど そこ ら 辺 は どう です か.",
      "start": 562141,
      "end": 567282,
      "timestamp": "09:22"
    },
    {
      "speaker": "B",
      "text": "なんか まぁ 現地 の イベント ミート アップ たくさん ある の で まぁ 行き たい 人 は 行っ たら いい と 思う し 僕 も よく 行っ て た ん です けど まぁ 僕 が 来 て から の 状況 だ と ミート アップ に 行っ て た から すぐ に 就職 に つながっ た って いう の は なん か あんまり なかっ た か な って いう 気 が し て い て 結構 なん か ミート アップ に 行っ て リファレル もらっ て 就職 し まし た みたい な の を たまに 聞い て た の で そう いう もん か な と か 思っ て 行っ て み たり も し た ん です けど もう 僕 が カナダ に 来 た 頃 ぐらい は もう 結構 そう いう ミート アップ で リファレル もらっ て 就職 し たい みたい な 半分 学生 みたい な 人 が 結構 たくさん いる の で なんか あんまり その 中 で 明確 に 自分 が こう 他 の 人 たち より も 目立っ て リファレル もらえる みたい な 状況 は なん か 方法 は あんまり なかっ た か な って いう 気 が する の で 普通 の ミート アップ に 行っ た から と いっ て 就職 が それ で すぐ 進む か と いう と まあ なんか 結構 そう いう ケース も ある か も しれ ない けど ま あ 多い ケース で は なくなっ て き て いる か な って いう 感じ が あり ます ね あと は まあ なんか 就職 活動 し て いる 人 向け の イベント は 何 回 か 行っ た こと が あっ て まあ それ で ちょっと リファレル を もらえ そう に なっ た と か は リファレル 1 件 もらっ た か な と か は あり ます けど 無駄 で は ない と 思い ます けど、 目的 を どこ に 置く か に よっ て 行っ た 方 が いい、 行か なく て も いい みたい な の は いろいろ 変わっ て くる か な と か 思っ たり し まし た。 僕 は ミート アップ に 行っ た から、 いろんな 人 と 英語 で 話す 機会 が でき て、 英語 を 使う ハードル が また さらに 下がっ た みたい な ところ が ある から、 僕 と し て は もう ミート アップ は 無料 英 会話 レッスン と いう こと で 捉え て いっ て い た の で、 それ は それ で 良かっ た か な と 思い まし た。",
      "start": 567282,
      "end": 664815,
      "timestamp": "09:27"
    },
    {
      "speaker": "A",
      "text": "僕 は あんまり ここ に つい て 喋る こと ない ん です けど、 あんまり 行か ない し、 なん か、 わざわざ 喋る と か も し ない ん で、 まあ、 あんまり ない ん です けど、 一 つ 言える の は、 ちょっと 前 に インタビュー さ せ て もらっ た ヒロシ 君 と か みたい な なんか ソフト 好き 彼 は もう 俺 は ソフト スキル で ぶった切っ て いく みたい な あの あれ で 言っ た と 思う ん だ 言っ て た ん で 本当 それ ぐらい もう その 彼 は あの な ん だろう その 登壇 者 の 一 番 目 の つく 一番 前 に 座っ て 質問 あり ます か って 言っ た 時 に なく て も とりあえず 手 を 挙げ て 一番 最初 に その 質問 権 を もらう じゃ ない けど その 目立つ 子 と か その 人 たち に 気 に 入ら れる こと に 善 振り する みたい な 人 が い て その 人 は うまく いっ て たな みたい な それ で あと は 医師 さん って いう その 方 も インタビュー さ せ て もらっ て ちょっと 前 に 出し た ん です けど 彼 も なん か うまい こと ちゃん と 戦略 を 立て て ちゃんと 人 に 喋り に 行っ たり し て あの レファラル と か を ゲット し て たり は し た の で そう いう の が 得意 な 方 上手 な 方 は 多分 し たら いい の か な 確か に と は いえ その それ を やっ てる から 他 の こと 頑張ら なく て いい か って いう と それ は なく て そっち に ゼンブリ し ちゃう の は 結構 厳しい と 思う か な って いう の は あり ます 全 振り は 厳しい です.",
      "start": 664825,
      "end": 754770,
      "timestamp": "11:04"
    },
    {
      "speaker": "C",
      "text": "ね いや そう これ ばっかり もう キャラ に より は 本当 に だ って 前 あの 全く 同じ リクリティングイベント に K さん が 行っ た 時 あの この podcast で 出 て くれ た が 出 て で その 全く 同じ イベント に 出 て い た 別 の エンジニア の 人 たち から の レビュー も 聞い て て で 一方 は 行っ て マジ 意味 なかっ た と あの あんな ミート アップ に 行く だけ 無駄 だ と 給食 しか し て は い ない し 人 と 繋がる こと も でき ない し と いう こと を 言っ て い た の に 対し て K さん は あの イベント は 絶対 行っ た 方 が.",
      "start": 754770,
      "end": 781498,
      "timestamp": "12:34"
    },
    {
      "speaker": "B",
      "text": "いい って 言っ てる ん だ けど.",
      "start": 781498,
      "end": 781838,
      "timestamp": "13:01"
    },
    {
      "speaker": "C",
      "text": "リクルーター と の 喋る 機会 も 少なから ず ある し 自分 の アプリ ポイント の 練習 に も なる し 少なく とも 僕 は そこ から レビュー 面接 の 機会 を もらう こと が でき た から 行っ て めちゃくちゃ 良かっ た って いう 人 も い て それ こそ さっき の 石 さん と か ヒロシ さん みたい な タイプ も 含め だ けど も 小 魅力 オーバー キー みたい な やつ は ああ いう の 得意 だ よ ね と は 思う よ ね 俺 も でき ない から 言わ ない と 分かん ない けど 人 に よっ て キャラクター を 自分 と ちゃんと 会話 を し て 自分 に 合っ てる と 思う ん だっ たら やっ たら いい し あっ て ない と 思う ん だっ たら、 やる だけ 無駄 な 人 も 確か に いる よ ね って 思う の で。",
      "start": 783297,
      "end": 816400,
      "timestamp": "13:03"
    },
    {
      "speaker": "A",
      "text": "あと は なん か、 さっき も 言っ た よう に、 やっぱり 売り手 市場 で 大変 な ん で、 基本 的 に は 長期 戦 に なる と 思う ん です よ ね。 なん で、 いろんな 人 たち が い て、 すげー 言い 方 悪く する と、 転職、 まあ 職探し を し て いる 人 たち が いっぱい いる ん で、 その 人 たち と 喋っ て 傷 を 舐め合う って いう の も 別 に 悪く は ない ん じゃ ない か な って 個人 的 に は 思い ます。",
      "start": 816400,
      "end": 843547,
      "timestamp": "13:36"
    },
    {
      "speaker": "C",
      "text": "そう だ ね、 面白い ね。",
      "start": 843547,
      "end": 845418,
      "timestamp": "14:03"
    },
    {
      "speaker": "A",
      "text": "いっぱい いる ん です よ、 そう いう 人 たち 本当 に。",
      "start": 845418,
      "end": 848579,
      "timestamp": "14:05"
    },
    {
      "speaker": "C",
      "text": "これ フロッグ メンバー じゃ ない から 真似 しろ と は 言わ なかっ た けど、 あの ものすごい ド 派手 な レジュメ 作っ た やつ が い て、 あの 本当 写真 と 等身 大 の 自分 の なん か 姿 か なんか を レジュメ に なん か ボーン って 載せる やつ が い て、 ATS 対策 の 絵 の 字 も ない よう な やつ。 なん だ けど それ を ね なんか レジュメ 上 で 配る と むちゃくちゃ 売り 上がっ た らしい の よ あの なん だ この クソ ふざけ た レジュメ が みたい な なんか そう いう キャラクター で 売る みたい な ところ って 確か に 人 に 覚え られ は する から みんな が やっ て ない こと を やる って 人 も たまに いる よ ね と は 思う 会っ てる 人 も いる ん だろう な と。",
      "start": 848579,
      "end": 878878,
      "timestamp": "14:08"
    },
    {
      "speaker": "A",
      "text": "次 ちょっと その レジュメ に つい て 喋り たい ん です けど、 それ で 言う と 僕、 実 は 1 社 目 は レジュメ に は 書か なかっ た ん です けど、 レジュメ で は やら なかっ た ん です けど、 カバー レター で 僕 は ポート ポリオ と か の 画像 みたい な の を 載っけ て まし た けど ね。 その 時 から 僕 ATS って いう あれ で は ない けど その フォーマット が あっ て それ に 合わせ た 方 が いい って いう の は 分かっ て た けど あれ って やっぱり 今 で も そう 本当 に そう 思う ん です けど あの やっぱ 大きい 企業 が 使う ん です よ で 小さい 企業 は やっぱり そう いう システム と か に お 金 を かけ たく ない ん で あの 基本 的 に は 一 枚 一 枚 見る みたい な あの ま あ 本当 に 短い 時間 か も しれ ない けど 一 枚 一 枚 見る って いう の が を やっ て い て そう いう 人 たち に は やっぱり あの 画像 な ん で ビジュアル で 見れる ん で 刺さる の か な って いう ちょっと 手 を 止め やすく は なる か な って 思っ て て 僕 は 1 社 目 は それ 1 社 目 を 探す 時 は それ やっ て て 割と 感触 良かっ た な って 思う ん で あと は 僕 その 時 小さい 時 に 小さい 企業 に よく いっぱい 出し て た ん で それ は アリ な の か な って 思い ます.",
      "start": 878878,
      "end": 943258,
      "timestamp": "14:38"
    },
    {
      "speaker": "C",
      "text": "けど ね そう です ね 間違い ない.",
      "start": 943258,
      "end": 945960,
      "timestamp": "15:43"
    },
    {
      "speaker": "B",
      "text": "僕 も 2 社 目 と か 応募 し て い た 時 は カバー レター つけ て て 僕 も 画像 載せ て まし た ね 個人 開発 で やっ た もの の 画像 を 載せ て て、 僕 は 個人 開発 し て いる もの の 一 つ に コラ 画像 を 作る サービス が あっ て、 それ を 使っ て その 会社 の こと を 事前 に 調べ た 上 で、 その 会社 の 事業 ドメイン に 沿っ た コラ 画像 を 作っ て 貼っ て お くみ たい な。 あと から 2 社 名 入っ た 後、 スラック の メッセージ の やり取り 見 て みる と、 こんな レジュメ あっ た よ、 こんな カバー レター つい て て おもろ、 みたい な 会話 が さ れ て た の で、 それ は 確実 に 引っかかっ て た な って いう の が あり まし た。",
      "start": 945960,
      "end": 977767,
      "timestamp": "15:45"
    },
    {
      "speaker": "C",
      "text": "うん うん、 確か に 確か に。 キャラ 付け の なん か 重要 性 は 割と ある よ ね、 そう いう 意味 だ と。 全く 同じ レジュメ を そりゃ 何千 枚 何百 枚 見る 人 たち だ から さ、 どう やっ て 自分 を 覚え て もらおう か って、 その 手法 は 一人一人 と か 考え て ほしい とこ あっ て。 今 まで 割と 俺 この 人確 か に 良い 線 行っ た なー と いう か ま あ すごい たくさん 面接 まで 行っ てる なー って いう 人 い た ん だ けど ま あ 前 も 喋っ た か も しれ ない けど さ 毎週 金曜 日 に 絶対 面接 の セットアップ を し て リール を 絶対 持っ て いく って いう こと も 欠かさ ず やっ て た 人 と かい て まあまあ どう いう 手段 で も いい けど やっぱり キャラクター と し て 自分 を 覚え て もらう 手段 って ね やっぱり みんな 考え て やっ てる 方 多い よ ねー と は 思い ます よ.",
      "start": 977767,
      "end": 1012353,
      "timestamp": "16:17"
    },
    {
      "speaker": "A",
      "text": "そう です ね、 本当 に 何 だろう、 会社 に よる と しか 言え ない けど、 それ が 通用 する 会社 も あれ ば、 し ない 会社 も ある ん で、 会社 に よっ て そこ を ちゃんと 使い分け られ たら 強い か な と は 思い ます よ ね。",
      "start": 1014117,
      "end": 1028492,
      "timestamp": "16:54"
    },
    {
      "speaker": "C",
      "text": "そう、 東大 さん の さっき 言っ て た、 ATS を 使わ ない 会社 確か に ちっちゃい とこ 多い よ ね って いう ところ も 最近 の さ、 就労 ビザ が 出 なく なっ た 昨今 に おい て は ちっちゃい 会社 で も 正直 数百 件 来る らしい から 若干 ちょっと 入れ てる ところ 増え ちゃっ た か な と は 思う と か いや、.",
      "start": 1028502,
      "end": 1044171,
      "timestamp": "17:08"
    },
    {
      "speaker": "A",
      "text": "それ で も です よ やっぱり スタートアップ って 資金 繰り 結構 大変 な ん で キャッシュ フロー めちゃくちゃ 大変 な ん で と は いえ もちろん 投資 さ れ てる 会社 は 違い ます よ ただ 投資 さ れ て て も 奨学 だっ たり だ と か やっぱ し て ない スタートアップ あの カナダ 人 が 本当 10 人 未満 で やっ てる と か エンジニア チーム に 3 人 です みたい な ところ って 絶対 入れ て ない ん です よ そう ね、.",
      "start": 1044171,
      "end": 1072080,
      "timestamp": "17:24"
    },
    {
      "speaker": "C",
      "text": "その チーム だっ たら 確か に それ は ね で、.",
      "start": 1072080,
      "end": 1074794,
      "timestamp": "17:52"
    },
    {
      "speaker": "A",
      "text": "やっぱ そう いう チーム、 そう いう 会社 に 狙い を 定める の は、 カナダ の バンクーバー に おい て は 結構 正しい じゃ ない です か。 1 社 目 と し て は。",
      "start": 1074794,
      "end": 1081591,
      "timestamp": "17:54"
    },
    {
      "speaker": "C",
      "text": "最初 の 1 社 目 って いう ね。 確か に ね。",
      "start": 1081591,
      "end": 1083823,
      "timestamp": "18:01"
    },
    {
      "speaker": "A",
      "text": "だ から それ を 考える と、 やっぱり 別 に 全然 ATS 対策 を し て ない レジュメ で 目 を 引く もの が あっ て も、 僕 は まあ あり か な って と は 思い ます ね。 なるほど ね。 そ し たら、 ちょっと 喋っ て た ん です けど、 レジュメ に つい て、 本格 的 に 結構、 トピック が レジュメ って いう だけ で も 大きい ん です けど、 まず は 何 が 違う の? って いう の を ちょっと、 優 吾 くん に 聞い て みよう か な。",
      "start": 1083823,
      "end": 1114300,
      "timestamp": "18:03"
    },
    {
      "speaker": "B",
      "text": "えー、 僕?",
      "start": 1114300,
      "end": 1114821,
      "timestamp": "18:34"
    },
    {
      "speaker": "C",
      "text": "素晴らしい、.",
      "start": 1114821,
      "end": 1115621,
      "timestamp": "18:34"
    },
    {
      "speaker": "A",
      "text": "お 願い し ます。",
      "start": 1115621,
      "end": 1116632,
      "timestamp": "18:35"
    },
    {
      "speaker": "C",
      "text": "プロ でしょ?",
      "start": 1116632,
      "end": 1117542,
      "timestamp": "18:36"
    },
    {
      "speaker": "B",
      "text": "レジュメ。 単なる 自分 の 履歴 を 書い た 履歴 書 と は 違っ て、 自分 の これ まで の 経歴 を いかに よく アピール する か が 必要 な、 いわば ちょっと 誤解 を 恐れ ず に 言え ば 一種 の 営業 資料 に なる か な と いう 気 も し て い て。 うまい です ね うん 単純 に これ を やり まし た やり まし た これ を こう し まし た こう いう 技術 使い まし た って 書い て おく だけ で 日本 の 時 は 多分 十分 だっ た 気 が する ん です けど こっち だ と それ だけ じゃ もう 絶対 足り ず に これ を こう し た の で ビジネス 上 こう いう 活躍 埋 もり まし た って いう 視点 を 持っ て ちゃんと 書い て いか ない と いけ ない もの が レジュメ か な と その 上 で さっき 言っ て い た ATS の よう な 機械 的 な フィルター で 振り 受け られ て しまう って いう の も ある の で それ を 考慮 し た 上 で 機械 の フィルタリング を 通っ て いかに 人事 に 届ける か みたい な 視点 を 持っ て 攻略 し て いく の が こっち の レジュメ か な と 思っ て い.",
      "start": 1117542,
      "end": 1169806,
      "timestamp": "18:37"
    },
    {
      "speaker": "A",
      "text": "ます めちゃくちゃ うまく まとめ て もらっ た ん です けど わかり やすい よう に これ から 日本 の スタイル の もの を 履歴 書 で こっち の もの を レジュメ って いう 風 に 呼ん で いき たい な と ここ から 思う ん です けど、 めちゃくちゃ 近い ん です けど、 僕 も よく 言う の は、 事実 の 羅列 を する の が 履歴 書、 で、 プレゼン を する の が レジュメ。 履歴 書 は、 誰 が 同じ 経歴 を 持っ て たら、 誰 が 書い て も 一緒 に なる。 もの が 日本 の 履歴 書 で、 レジュメ は 事実 を どう いう ふう に プレゼン する か なん で 本当 に その 人 の 分 だけ なんか 種類 が ある みたい な 僕 は イメージ か な って 思い ます。 さっき 優 吾 くん も ちょっと 言っ て くれ た ん です けど ATS 対策 って いう の を し た 方 が いい 会社 みたい な の が あっ て そう いう の を 入れ て いる 会社 に 対し て は その ATS って いう アプリケーション トラッキング システム が その レジュメ を 選び やすい フォーマット だっ たり だ と か なん か ワーディング 文字 の 選び 方 みたい な の が 関わっ て くる よ って いう の が レジュメ な の か な と だ から ほとんど 回答 的 に は 優 吾 くん と 僕 も 一緒 か な って いう 感じ です ね まず は そ し たら じゃあ 具体 的 に どう いう ふう に その プレゼン し て いけ ば いい の か 具体 的 に 何 だろう 本当 に どう いう ふう に 経験 と か を 書い て いけ ば いい ん です か おお.",
      "start": 1169806,
      "end": 1266680,
      "timestamp": "19:29"
    },
    {
      "speaker": "B",
      "text": "じゃ っ くり よく 言わ れる の は ちゃんと ビジネス 上 の インパクト を レジュメ の 中 に 組み込み ましょう みたい な こと は よく 言わ れる な と 思っ て い て だ から 例え て 言う なら ば 単なる 機能 を 実装 し まし た と いう か React で こう いう 機能 を 実装 し まし た って いう の を 書き たい 場合 は 多分 単なる 事実 の 羅列 と か だ と リ アクト を 使っ て こう いう API を 使っ て この よう な 機能 を 作り まし た 終わり ぐらい な 気 が する ん です けど こっち の レジュメ で それ を 書き たい 場合 は さっき 言っ た ATS の 観点 で そもそも リ アクト で 書い た 方 が いい の か 書か なく て も いい の か って いう 観点 は あり つつ も 個々 こう いう 機能 を 実装 し た の で こう いう インパクト が プロダクト に 生まれ て その 結果 ビジネス の 数字 が こう 上がり まし た と か ユーザー の なん か 滞在 時間 が 上がり まし た と か 何 で も いい と 思う ん です けど そう いう ビジネス 上 の 価値 に つながり まし た って いう の を ちゃんと 一 つ 一 つ の 項目 全部 に 書か なく て は いい と 思う ん です けど と いう の に 書く 必要 が ある な と 思い まし た 具体 的 な ん です か ね これ.",
      "start": 1266680,
      "end": 1327925,
      "timestamp": "21:06"
    },
    {
      "speaker": "A",
      "text": "は いや いい と 思い ます 僕 これ あの さっき の 僕 あの 前半 で 言っ た こと な の か な に 繋がっ て くる と 思う ん です けど 日本 の エンジニア の 強 さ って いう の と こっち の エンジニア の 強 さ って なん か レジュメ に も 現れ てる なぁ と 思っ て て そこ ら へん の なん か ビジネス 視点 を 持っ て て その どう いう インパクト が あっ て あの ま あそこ まで は 詳しく 書か ない か も しれ ない けど で まぁ なんか こう いう インパクト が ある から A と B と いう オプション が あっ たら A の 方 が 妥当 な 判断 でし た よ みたい な の が 裏 に あっ て その レジュメ に その 内容 を 書く じゃ ない です か なんか そこ が なん か こっち で の エンジニア の 強 さ が ただ 技術 力 だけ じゃ ない みたい な の に も 現れ て いる の か な みたい な の を ちょっと 思っ て まし た ね 確か に あと 言おう と し た こと 忘れ ちゃっ.",
      "start": 1327925,
      "end": 1384313,
      "timestamp": "22:07"
    },
    {
      "speaker": "C",
      "text": "た まあ で も ちなみ に 俺 も じゃあ 聞き たい こと を 聞い.",
      "start": 1384313,
      "end": 1388093,
      "timestamp": "23:04"
    },
    {
      "speaker": "A",
      "text": "て いい の で あれ ば なん.",
      "start": 1388093,
      "end": 1388913,
      "timestamp": "23:08"
    },
    {
      "speaker": "C",
      "text": "だ けど 前 に ね あの 2 人 に やっ て いただい た レジュメ 会 あっ た と 思う ん です ね で まぁ 俺 も やっぱり その レジュメ って やっぱ 大事 な ん です か って 言う 聞か れる ん です けど みんな 頭 ん 中 の 多分 ね 1 日 くらい 多分 レジュメ 履歴 書 を レジュメ に 変換 すれ ば 多分 十分 な 時間 でしょう と いう ふう に 思っ てる と 思う な ん だ けど さぁ 前 に レジュメ 会 やっ て いただい て 大事 な に あげ て いただい た 方 は どん だけ かかっ た っけ 半年 はい そう か な ちゃんと 送れる よう に なっ た の 多分 4 ヶ月 5 ヶ月 だ と 思う ん だ よ な おそらく そう、 て いう の で、 なん で そんな 時間 かかる ん? って いう の は、 あの、 要 は 聞か れる こと で は ある ん です が、 お 二人 的 に は、 そんな 時間 かける 必要 ある?",
      "start": 1388913,
      "end": 1423562,
      "timestamp": "23:08"
    },
    {
      "speaker": "B",
      "text": "僕 も それ くらい 時間 かかっ た 気 が し ます ね、 最初 に 電話 し た 時。",
      "start": 1423562,
      "end": 1426414,
      "timestamp": "23:43"
    },
    {
      "speaker": "A",
      "text": "分かっ た?",
      "start": 1426414,
      "end": 1426844,
      "timestamp": "23:46"
    },
    {
      "speaker": "C",
      "text": "ほんと。",
      "start": 1426844,
      "end": 1428045,
      "timestamp": "23:46"
    },
    {
      "speaker": "B",
      "text": "そもそも、 僕 は そう いう 観点 で これ まで の 職歴 を まとめ て なかっ た の で、 そもそも なんか 何 が あっ た と か 思い出し たり、 棚 下ろし する、 自分 の 経歴 を 棚 下ろし し て 整理 する って いう の が、 まず 必要 だ し、 何 やっ た か 思い出し た ところ で、 多分 それ が 実際 の ビジネス 上 の インパクト に 見せ つい て あまり 考え て こ なかっ た の で、 あれ あの 時 って どう いう 課題 を プロ タクト で 抱え て どう いう 結果 が 生まれ た ん だ っけ って いう の を 情報 収集 し て 思い出す って いう の が、 なん か 一 つ 一 つ すごい 大変。 過剰 が 気 に する と 一 つ の 項目 が 結果 的 に できる と し て も、 それ を 思い出す ため に、 まず そもそも 何 やっ た か 思い出し て、 どう いう 背景 だっ た か 思い出し て、 どう いう 結果 が あっ た か 思い出し て、 必要 だっ たら 人 に 聞い て みたい な こと を やっ てる と、 まあ なんか それ だけ で 時間 かかる し、 結構 疲れる の で それ を 1 日 で 全部 やる と か ほぼ ほぼ 不 可能 な ん で、 一 つ 一 つ やっ て いく けど、 めちゃくちゃ 面白い 作業 か と 言わ れる と 面白い 作業 で も ない 気 が する の で 自分 の やる気 と の 相談 を し て いる と まあ なんか 数 ヶ月 かかっ て.",
      "start": 1428045,
      "end": 1487315,
      "timestamp": "23:48"
    },
    {
      "speaker": "C",
      "text": "しまう みたい しかも それ を さあ 面接 で やっぱり 語れる レベル に し なく ちゃ いけ ない わけ でしょ あまり かし なんか データ だけ あっ たら できる でしょ って 話 で も ない ん じゃ ない か な って いう の は.",
      "start": 1487315,
      "end": 1495882,
      "timestamp": "24:47"
    },
    {
      "speaker": "A",
      "text": "あっ て 確か に 確か に あの 僕 これ も もう 一 つ よく 言う ん です けど あの レジュメ って あの 使わ れ 方 が 何 パターン か あっ て 一 つ は その ま あ さっき 言う よう に あの ATS と か まあ 人 の 見 て この 人 と 面接 しよう って いう 風 に 選ば れる 段階 と あと もう 一 つ は あの その エンジニア と その 喋る とき あの 面接 の 中 で 喋る とき に それ を なんて いう の そこ の 中 から やっぱ 喋っ て いく なんて いう の その 題材 に する の を その インタビュー し て くれる 人 が 選ぶ って いう 使わ れ 方 が もう 一 個 側面 と し て あっ て そこ の だ から そこ に 書い て ある こと に つい て 結構 な ボリューム で ちゃんと 喋れ ない と いけ ない みたい な の が ある ん で ただただ その レジュメ に 書けれ ば いい って いう わけ で は なく て その やっぱり 優 吾 くん が 今 言っ て くれ た よう に 棚卸し を し て どう いう もの だっ た の か みたい な の を なんか できる なら 文章 に まとめ て それ を 英語 で 喋れる よう に も し た 方 が いい ん で それ の こと を 後々 の こと を 考える と プロジェクト の 目標 って 何 だっ た っけ? プロジェクト で どう いう こと を し た ん だ っけ? で、 結果 どう だっ た ん だ っけ? それ から 反省 どう だっ た ん だ っけ? って いう よう な フォーマット で ちゃんと タノ オロシ 思い出し て、 それ を 文章 に し て、 で、 もし か し たら その まま 英語 で 文章 に する こと も できる か も しれ ない し、 日本 語 で もともと たぶん 仕事 し て た と 思う ん で、 それ を 英語 に 直す みたい な 作業 を し ない と いけ ない と 思う ん で、 そこ に 結構 やっぱ 時間 が かかる ん じゃ ない の か な みたい な。",
      "start": 1495882,
      "end": 1588650,
      "timestamp": "24:55"
    },
    {
      "speaker": "C",
      "text": "確か に 面接 に 受かる まで に そこ まで の プロセス が ある ん だ よ って いう 話 です ね.",
      "start": 1588660,
      "end": 1593963,
      "timestamp": "26:28"
    },
    {
      "speaker": "A",
      "text": "あと 僕 さっき 聞こう と 思っ て 忘れ ちゃっ た って いう の 思い出し た ん です けど こっち って 結構 働き 方 が すでに そう いう 働き 方 に なっ てる じゃ ない です か OKR みたい な の が エンジニア に 見え やすく KPIOKR みたい な の が そもそも エンジニア に 見え やすく て プロジェクト エンジニア リード みたい な エンジニア が プロジェクト を リード する とき に こう いう 目標 が あり ます よ で こう いう ビジネス 要件 に 対し て どう し ましょう みたい な そこ ら 辺 から 結構 エンジニア が 渡さ れる こと が 多く て じゃあ こう いう ふう に し て た 方 が いい よ ね って いう の を 考え エンジニア の リード が 考え て で それ を まあ なんて いう の プレゼン みたい な の を し たり ブラッシュ ブラッシュ アップ みたい な の を チームメイト と し て プロジェクト やり ます で 反省 し ます プロジェクト の 反省 会 し ます みたい な の が あっ て すでに こっち って その フォーマット の レジュメ に 書き やすい フォーマット に すでに なっ てる の か な って 僕 は 思う よ ね 日本 で 僕 その その サース の エンジニア の 経験 が ない ん です けど 日本 は そう なっ て ない ん です か いや、.",
      "start": 1593963,
      "end": 1663668,
      "timestamp": "26:33"
    },
    {
      "speaker": "B",
      "text": "SaaS と か を 開発 し てる 会社 だっ たら それ に 結構 近い と は 思い ます ね 僕 は なん か 割と そこ ら 辺 は 今 まで の 会社 思い出し て み て も ま あ チーム の OKR と か そう いう KPI の 目標 は あっ て 何 か の 機能 を 実装 する 時 に どれ に 紐 づい てる か って いう の を 結構 整理 し たり と か を し て た の で それ は 多分 結構 会社 に よる か な って いう 感じ で は あり ます けど 日本 で よく ある よう な SIR と か そう 言わ れる よう な 方々 に とっ て は 多分 結構 遠い 話 な の か.",
      "start": 1663668,
      "end": 1692951,
      "timestamp": "27:43"
    },
    {
      "speaker": "A",
      "text": "な って いう 気 は そう です ね なんか、 僕 は、 他 の 人 は わかん ない です けど、 SIR に い て、 お 客 さん が 作っ て ほしい って 言っ た から 作る ん だ、 みたい な、 なん か、 もう ほとんど そんな 感じ だっ た ん で、 なん だろう、 やっぱ、 そこ と は ほど遠い。 あと は よく 聞く 話 だ と まあ さっき の あの セナ さん が 出し て くれ た レジュメ の 回 みたい な の を 僕 たち が やっ た 時 に その 題材 と し て あの 一人 選ん で その 人 の レジュメ を まあ その 人 が 直す ん だ けど その サポート し て いく みたい な の を 何 ヶ月 か かけ て やっ て その サポート し て いっ た 経緯 を その まあ なんか ブロック の イベント で 発表 する みたい な の を やっ た 時 に その 彼 を 見 て て 思っ た の は まあ サース で 働い て は い た ん だ けど ま あ その エンジニア と し て は まあ 多分 その 流れ に は 沿っ てる けど あんまり 意識 し て なかっ た か な きっと な ん で ま あ その プロジェクト の 人 に 聞い たり だ と か みたい な の に 時間 かかっ た みたい な の が.",
      "start": 1692951,
      "end": 1756829,
      "timestamp": "28:12"
    },
    {
      "speaker": "C",
      "text": "あっ た の か な 全体 的 に そう いう もん だ よ ね さっき も 言っ た 通り やっぱり 売り手 市場 だ し さ 別 に そんな 数字 と か 意識 し なくっ て も 歴史 上 に 増し て は まとめ なくっ たって 絶対 に 受かる し みたい な の が ある ん で ま あ 普段 から やっぱ 意識 し てる って いう ね まあ トガシ さん は よく ね 月日 転職 する 時 も 今 だっ たら 全然 時間 かかん ない と 思い ます よっ て やっぱ そこ に ある じゃ ない です か 普段 から そう いう KPI に しろ OKR に しろ そう いっ た 部分 を どう レジュメ に 書く か って いう イメージ が やっぱ 湧い てる 人.",
      "start": 1756829,
      "end": 1782668,
      "timestamp": "29:16"
    },
    {
      "speaker": "B",
      "text": "は そりゃ いい よ って いう とこ で 確か に そう いう 経験 を 積ん で た と し て も そう いう イメージ が 湧い て ない の で それ まで 経歴 今 まで 何 も まとめ て ませ ん でし た 思い出し て ませ ん でし た と か だ と もう その 過去 の 4 年 5 年 の 経歴 を 遡っ て 全て 棚 下ろし する こと に なる の で なかなか 大変.",
      "start": 1782668,
      "end": 1801889,
      "timestamp": "29:42"
    },
    {
      "speaker": "A",
      "text": "な 作業 なんか この頃 は あの 結構 僕 以外 で も 話 聞く ん です けど その 逆 に レジュメ に 書き たい こと を その 仕事 に し て いく みたい な の が あっ て あの その 働き 方 に 慣れ て くる と なんか その やっ た こと を レジュメ に 移す って いう より は レジュメ に こう いう 経験 入れ たい から こう いう やつ やり たい です って いう の を マネージャー に よっ て で その 形 に 持っ て いく みたい な の を 結構 僕 も する ん です けど もう だ から 慣れ て くる と そう いう ふう に はやっ て これ ます よ ね それ を 考える と やっぱ 日本 で 今 ソフト エンジニア と し て すでに 働い て い て 海外 で 就職 を 考える の で あれ ば ちょっと その ビジネス 要件 は 何 だっ た の か それ に 対する どう いう オプション が あっ て どう いう トレード オフ が あっ て どう いう オプション を 取っ た の か で その 結果 どう なっ た の か で 反省 は どう だっ た の か みたい な フォーマット で その プロジェクト を 整理 し ながら 働け たら いい です よ ね.",
      "start": 1801889,
      "end": 1865178,
      "timestamp": "30:01"
    },
    {
      "speaker": "C",
      "text": "難しい ん だ けど さ、 ここ で さ、 せっかく この ポッド キャスト を 聞い てる 人 達 い て、 いずれ 海外 行き たい 人 が 多い だろう から さ、 もう ちょっと どう しよう も ない ケース の 話 だけ さ せ て いただける ん だっ たら、 どう しよう も ない と は 言わ ない よ。 やっぱり ワーホリ が さ、 最近 2 年 に なっ た じゃ ない です か。 な の で ワーホリ だけ やっぱり 渡航 する って 人 たち 結構 増え た ん です よ。 少なく とも 2025 年 入っ て から ね、 もう 8 ヶ月、 9 ヶ月 経っ てる けど さ。 で まぁ フログ 使っ て ない 人 も 当然 い て で 途中 から フ ログ に まあ ジョイン しよう って いう 風 に なる 人 も 結構 増え て で その 特徴 と し て 話し とくと やっぱり その レジュメ だっ たり と か カバー レター だっ たり と か も 含め て こっち の 就活 なんか ノウハウ を 知ら ず に 渡航 する と で 日本 で は SI やっ て まし た と か エンジニア の 方 だけ あり ます よ と で まぁ とりあえず 技術 力 に は 割と 自信 も あっ た し 個人 開発 なんか も し て た から 結構 技術 は 楽しい し って いう の で こっち に 来る と で、 えっと 日本 で ね、 やっぱり まあ それ なり に、 あのー、 SIR か も しれ ない けど 働け て い た し って いう の で こっち に 来 て ワーホイ 使っ て ます。 で、 レジュメ 送り まくり ます。 1 ヶ月、 2 ヶ月、 3 ヶ月 経っ て、 まあ 全然 返事 が 返っ て こ ない。 これ は もう どう しよう も ねえ って いう こと で、 一旦 フログ に 連絡 き ます。 で、 俺 ら の 方 が レジュメ って 多分 そう いう もん じゃ ない って いう 風 に この 間 レジュメ 界 の 人 たち が 言っ て た よ って 話 を し え、 じゃあ こう いう 努力 を 今 から し なく ちゃ いけ ない ん です ね って 言っ て 一 行 一行 ワーク エクスペリエンス を 洗い出し て 過去 の 人 たち の 話 を 聞い て って いう の で やり だし 気 が つい て み たら それ も やっぱり 4 ヶ月 5 ヶ月 かかっ て い て 自分 の 言葉 に 落とせる よう に なっ たら 1 年 目 の ワーホイ が 終わっ てる って いう 割 と そう は なら ない ん だ よ ね って 言い たい ケース は 結構 最近 多く て です ね これ が 学生 期間 と か だっ たら 別 いい よ あの 別 に さまあ 学生 期間 中 に 気づい て よかっ た ねー で コープ だっ たり ワン ホリ だっ たり の 期間 に ちゃんと まあ フリ に 行か せる ん だっ たら いい じゃん って いう ところ だ けど ワン ホリ のみ で 最近 来る 人 たち に やっぱり 人 と の 繋がり が 急須 な 状態 で 来 てる と それ 気づか ない から こう いう ポッド キャスト と か ちゃんと 聞い て 知っ て おい て ほしい よ ね って いう の は ちょっと.",
      "start": 1869568,
      "end": 1978935,
      "timestamp": "31:09"
    },
    {
      "speaker": "A",
      "text": "ある よ ね なんか それ って で も あの な ん だろう トレード オフ な の か な と 思っ て て そう いう 人 たち の 強み って 行動 力 に ある ん です よ ね だ から 準備 と か せ ず と もう 来 て しまう ん です よ そう いう 人 たち は で も そう いう 人 たち は 行動 力 ある から イベント に も 行き まくっ て 誰 か に 喋り まくっ て そう いう 人 たち の その 強み を 生かし た こと が できる か も しれ ない ん で まあ なんか その 後 で も 途中 で 気づけん だっ たら それ は それ で いい の か な って 僕 は 思っ て て な ん だろう 学校 と か 行っ て その 滞在 期間 を 伸ばす みたい な 方法 は お 金 さえ あれ ば いくら で も 続ける こと は できる ん で まあ 諦め なけれ ば 多分 その 人 たち も まあ 1 年 経っ ちゃっ てる か も しん ない けど そこ から 何 と か する こと は でき て で 逆 に その そう いう 人 たち が ちゃんと 準備 そう いう 人 たち が と いう より は ちゃんと 準備 し て これ 来る 人 たち って 行動 力 って か その 突 拍子 も ない 動き を し ない から まあ 行動 力 が ない って 言う と 嘘 に なる か も しれ ない けど 準備 を し すぎ て いつ 来 たら いい か わから ない みたい な 状態 に なっ て で 気づい たら 30 歳 過ぎ て て ワーホリ 使い ませ ん でし た みたい な と か ワーホリ だけ じゃ なく て 永住 権 と か ビザ ま あ ビザ は ない か も しれ ない けど 永住 権 の 要件 って やっぱり 若 いく て 未来 の ある 人 たち が 国 は 欲しい ん で 基本 的 に は そう いう 人 いう の に 間に合わ なかっ た みたい な の って ある ん で だ から な ん だろう まあ 一見 来 た 来れ て しまっ たら その いや 準備 し とけ ば よかっ た よ ね って 言える けど 来れ ない それ で 来れ なく て 時 すでに 遅し みたい な 人 たち も いる ん で それ は それ で まあ な ん だろう しょう が ない しょう が ない って いう か ま あ 本当 に ストレート オフ な の か な って 確か.",
      "start": 1978935,
      "end": 2085123,
      "timestamp": "32:58"
    },
    {
      "speaker": "C",
      "text": "に 確か に 両方 いる だ から どっち も 極端 に なっ たら 多分 あ かん く て 本当 に 何 に 準備 せ ず に もう なんか もう ぺっ ぷ の まま で 来 た みたい な 感じ だ って も それ は それ で ちょっと 言い たい こと ある しか と いっ て 準備 し まくり で 日本 で も 何十 人 も 何 年 も 過ごし ちゃい まし た って いう 人 は もう 行く 気 ない ん だ ね で 終わる し そこ は ね 確か に ま あ どっち も 両 極端 だ と あ かんな って いう 気 が.",
      "start": 2085123,
      "end": 2104217,
      "timestamp": "34:45"
    },
    {
      "speaker": "B",
      "text": "し ます 何せ 僕 情報 収集 は ちゃんと し なきゃ いけ ない よ な と いう ふう に 思っ て て 最初 に も 話し て い た よう な、 もう 日本 の 市場 と こっち の 市場 で 全然 ルール が 違う の で 日本 で 頑張っ たら うまく いっ て た から と いっ て こっち で ガム シャル に 頑張れ ば うまく いく みたい な 世界 線 で は ない から 頑張る に し て も どう いう 方向 で 頑張っ たら いい か みたい な 情報 収集 は 別 に こっち に 来 て から で も いい の で なんか ちゃんと やっ た 方 が いい な と いう 感じ が あっ て なん か たまに そう いう 半年 ぐらい 頑張っ てる ん です けど 結果 出 ない です みたい な 人 の 話 を 聞い たり レジ を 見 て み たり する と この レジュメ で 半年 応募 し 続け た ん です が、 大変 です ね、 みたい な。",
      "start": 2104217,
      "end": 2143713,
      "timestamp": "35:04"
    },
    {
      "speaker": "C",
      "text": "たぶん。",
      "start": 2143713,
      "end": 2144364,
      "timestamp": "35:43"
    },
    {
      "speaker": "B",
      "text": "間違い ない。",
      "start": 2144364,
      "end": 2145445,
      "timestamp": "35:44"
    },
    {
      "speaker": "A",
      "text": "それ は めちゃくちゃ い ます ね。",
      "start": 2145445,
      "end": 2148289,
      "timestamp": "35:45"
    },
    {
      "speaker": "B",
      "text": "そう いう の は すごい よく 聞い たり 見 たり する と、 なん か もったい ない な って いう 感じ は する の で、.",
      "start": 2148289,
      "end": 2154063,
      "timestamp": "35:48"
    },
    {
      "speaker": "A",
      "text": "そう な ん です よ。 なん で、 今回 僕 この 内容 を 日本 で 撮っ てる ん です けど、 撮り たかっ た の も、 それ が めちゃくちゃ 多い ん です よ ね。",
      "start": 2154073,
      "end": 2163679,
      "timestamp": "35:54"
    },
    {
      "speaker": "C",
      "text": "めちゃくちゃ 多い。",
      "start": 2163679,
      "end": 2164690,
      "timestamp": "36:03"
    },
    {
      "speaker": "A",
      "text": "めちゃくちゃ 多い ん です よ。 なん か 僕 たち 的 に は、 やっぱり 僕 も 優 吾 くん も、 もちろん セナ さん なんて コミュニティ やっ てる わけ だ から そう だ と 思う ん です けど、 日本 の エンジニア に 活躍 し たい と 思っ てる じゃ ない です か。 なん で 結構 この 情報 って できる だけ 出し たり だ と か ま あ 他 の 人 たち も あの どう いう ふう に 就職 し まし た よ みたい な の って 記事 と か で 出し て たり する ん です けど 本当 に あの 伝わっ て ない この 情報 が 反映 さ れ て ない な って いう の が 自分 の 周り で も いっぱい いる ん で 本当 そこ は まあ もちろん 情報 感度 は 高く あっ て ほしい けど、 まあ と は いえ なんか その 行動 力 だけ で 来れ ちゃう 人 たち みたい な の に その 制限 し ちゃう の も 違う か な って、 って いう の も 自分 も そう だ し 僕 は 何 も 考え ず に 来 て、 もちろん 運 が 良かっ た って いう の も もちろん ある ん だ けど も そう だ し、 まあ ケイ 君 に しろ な ん だろう それ でき て 逆 に それ だけ で 成功 する うまく いっ ちゃう 人 たち って いる じゃ ない です か その コミュニケーション が めちゃくちゃ 強く て 行動 力 あっ て あの イベント 全部 行き まし た よ みたい な で 別 に レジュメ の 回復 と か ぐちゃぐちゃ だ けど も なん か その 場 で あっ て うわぁ こいつ を 仕事 し たい って 思わ れれ ば 逆 に レファラル 出し て くれ て 勝ち みたい な の 多分 ある ん で だ から なん か もちろん 情報 が ある に 越し た こと は ない けど なん か まあ 知り 込み を 準備 を 完璧 に まとめる 必要 も ない の か な と は 思う ん で 難しい ところ で は あり ます よ ね で も 情報.",
      "start": 2164690,
      "end": 2257950,
      "timestamp": "36:04"
    },
    {
      "speaker": "C",
      "text": "収集 の その 優 吾 さん の 話 に ちょっと もし か し たら 起因 する か も しれ ない けど 最近 実 は ちょっと 傾向 と し て 多い の が さ なんか フロック みたい な コミュニティ を 最後 の 砦 と 考え てる 人 たち が 多く て なん か 最初 は 自分 で 要する に 試し て みよう って いう ノリ で 多分 カナダ 来 てる の よ あの 人 たち って 気持ち めっちゃ 分かっ て しまう が 半年 と か 9 ヶ月 と か 経っ た タイミング で 俺 ら の ところ に 連絡 くん の よ で も さぁ 申し訳 ない けど 玉 数 は やっぱり 限ら れ ちゃう わけ で それ は これ は もう ねー し あの やっぱり 中 に は ね 31 と か って 言っ てる から ラストホリディー 違う ギリホリ か で ね 来 て と か で やっぱり さっき 東橋 さん も 言っ た 通り カレッジ に 行け ば 確か に お 金 が あれ ば いける って いう の は あの 滞在 期間 伸ばせる って いう の は ある けど と は いえ ね 100 万 200 万 って いう 金額 が ポンポン 飛ん で いく わけ で やっぱり 出せ ない 人 も 多く て なん か そう いう の って なん か 情報 収集 の ため に フロック や この ポッド キャスト も 含め だ けど そう いう の を 使う って いう こと に 対し て なん か 変 な ボーダー で も あん の か な?",
      "start": 2257950,
      "end": 2320512,
      "timestamp": "37:37"
    },
    {
      "speaker": "A",
      "text": "そう へん 分かん ない けど 日本 人 に 手 借り たく ない って いう 気持ち は なん か ある ん じゃ ない です か?",
      "start": 2320512,
      "end": 2326276,
      "timestamp": "38:40"
    },
    {
      "speaker": "C",
      "text": "僕 も あっ た し なる ん だ よ ね 何 な ん だろう ね って いう の が あっ て で も 分かん ない けど 俺 は 少なく とも 他 の アジア 圏 の 人 たち と か それ 見 た こと なく て で も なん か.",
      "start": 2326276,
      "end": 2338386,
      "timestamp": "38:46"
    },
    {
      "speaker": "A",
      "text": "この頃 なんか 日本 人 特有 な の か な と 思い つつ この頃 って か なんか その 若い 世代 に は 薄れ て いっ て いる の か な みたい な そう いう 人 たち なんか そう いう の に 使う こと に 抵抗 の ない 人 たち が 多く なっ て いる の か な みたい な の は ちょっと 感じ て いる ま あ 優 吾 くん と か も そう じゃ ない です か 僕 なんか 本当 に 全く それ で あの 就職 する まで 別 に セナ さん と ほぼ 喋っ た こと ない みたい な 1 回 最初 の 1 回 ね 相談 行っ て で その 次 は 多分 就職 し まし た これ から の あの ビザ と か 永住 権 の 流れ 相談 し たい ん で お 願い し ます ぐらい じゃっ た じゃ ない です か 僕.",
      "start": 2338386,
      "end": 2376184,
      "timestamp": "38:58"
    },
    {
      "speaker": "B",
      "text": "も 最初 フロック の こと を 調べる 前 まで は コミュニティ と か に 頼ら ず 一人 で 海外 に 行っ て 一人 で 就職 成功 さ せ た 方 が なん か 強 そう だ し かっこ いい じゃん みたい な.",
      "start": 2376184,
      "end": 2389310,
      "timestamp": "39:36"
    },
    {
      "speaker": "A",
      "text": "そう な ん だ よ ね 美学 っす ね 美学 な の か な これ って 日本 の 日本 の 何 だろう 努力 を 隠し たい 美学 みたい.",
      "start": 2389310,
      "end": 2399254,
      "timestamp": "39:49"
    },
    {
      "speaker": "C",
      "text": "な ある の か なぁ だ から 最近 本当 に それ が 多く て で も 9 ヶ月 経っ て て あと 3 ヶ月 しか あり ませ ん って 俺 言わ れ た ところ で さで 学校 行き たく ない です って 言わ れ たら さ 知ら ん って なっ で レジュメ は って 言っ たら もう なんか 本当 に なん か もう すかすか の ワーク エクスペンス の 部分 なんか に 2 ブレッド ポイント くらい しか ない みたい な もう そんな ん しか なく て って いう の 持っ て こ られ て も どう し たら いい.",
      "start": 2399254,
      "end": 2425923,
      "timestamp": "39:59"
    },
    {
      "speaker": "A",
      "text": "の って いう ね まあ もう 本当 に なん か その 人 たち で も やっぱり リーチ できる よう な あの よう に 発信 し て いく って いう の が ま あ 優 吾 くん も ね 自分 で ポッド キャスト やら れ てる し あの ま あ セナ さん は いく つ か チャンネル が ある と 思う し 僕 も まあ こう やっ て ポッド キャスト やっ てる ん で こう いう の は 効く じゃ ない です か 結構 この頃 僕 面白い な と 思っ た の が 結構 ま あ ブロック と か 日本 人 の コミュニティ で 新しい 人 に 会っ て あの すごい 初めまして みたい な 感じ で 喋る ん だ けど、 よくよく 話し てる と、 めっちゃ 聞い て くれ て て、 聞い てる の か みたい な だ から 多分 そう いう 人 たち で も その 直接 的 に 話 に 行く の は 嫌 だ けど 情報 が あれ ば 取り に 行き たい と は 思っ た 自分 の 手 の 届く 範囲 で は 情報 を 取り に 行っ てる ん で こう いう 情報 を 増やし て いく って いう の は 一 つ の 解決 策 と いう か その 人 たち が じゃあ フロック に 早め に 声かけ に 行こう と か イベント 出 て 誰 か に 話しかけ て みよう みたい な の は ある の か な.",
      "start": 2425923,
      "end": 2488248,
      "timestamp": "40:25"
    },
    {
      "speaker": "C",
      "text": "と いや シンプル に だ から さ そう いう 情報 を 取り に 行く 癖 が つい てる 人 は さっき の 優 吾 さん なんて 言う と この ね 情報 の 感度 が 高い 人 やろう から 別 に いい か な って 思う ん だ けど こう いう の すら 取り に 行か ない 人 って いう の やっぱり いる から なん か 変わん の か なー って.",
      "start": 2488248,
      "end": 2503116,
      "timestamp": "41:28"
    },
    {
      "speaker": "A",
      "text": "ちょっと 的 に 思っ た 本当、 読ま ない です ね。",
      "start": 2503116,
      "end": 2508125,
      "timestamp": "41:43"
    },
    {
      "speaker": "B",
      "text": "情報 収集 で 言う と、 英語 で 海外 で 就職 し たい、 特に 北米 と か で 就職 し たい 場合 は、 英語 で 情報 収集 でき た ほう が いい な って いう の も ある。",
      "start": 2508125,
      "end": 2519312,
      "timestamp": "41:48"
    },
    {
      "speaker": "A",
      "text": "それ は そう です ね。",
      "start": 2519312,
      "end": 2520323,
      "timestamp": "41:59"
    },
    {
      "speaker": "B",
      "text": "なん か 日本 人 が 就職 成功 し た こと を まとめ てる 記事、 僕 も 書き まし た けど、 そう いう の たくさん ある と 思う ん です けど、 と は いえ やっぱ レジュメ の 書き 方 と か って 英語 で 調べ て た 方 が 結構 リソース が 多い の で、 そう し た 方 が 結構 有益 な 情報 に たどり着ける 確率 が 結構 上がる な と いう の が 僕 は 調べ て て も 思っ た の で、 英語 圏 で 就職 し たい 場合 は 英語 で 調べれ た 方 が 情報 収集 の 能力 が 上がる な と いう 感じ は あり まし た。",
      "start": 2520333,
      "end": 2545018,
      "timestamp": "42:00"
    },
    {
      "speaker": "A",
      "text": "いや それ こそ 僕 たち が その やっ た その レジュメ の イベント の で 僕 僕 が 一番 最初 に その 彼 に お 願い し た の は その まず 記事 を 読み まくる こと で なんか 何 だろう、 英語 の 記事 を 読み まくる こと だっ た ん です けど、 それ って すごい 大切 だ な。 僕 も、 僕 自身 も ほぼ ほぼ なんか その レジュメ の 書き 方、 その エンジニア の その レジュメ の 書き 方 みたい な の、 記事 は なん か、 世 に 出 てる もの 全部 と は 言わ ない けど、 ほんと めちゃくちゃ いっぱい 読ん で て、 で も 日本 で それ って 何 も 出 て こ ない じゃ ない です か、 ほぼ。 まあ 今 は ね。 ある か も しれ ない けど あの 本当 情報 の 量 が 全然 違う ん で やっぱ そこ を 見 に 行ける 人 たち は めちゃくちゃ 強い です.",
      "start": 2545028,
      "end": 2589170,
      "timestamp": "42:25"
    },
    {
      "speaker": "B",
      "text": "よ ね うーん 本当 僕 も 最初 めちゃくちゃ 調べ て いろいろ な こう そもそも ats と は 何 か 見 たい と か も 調べ まし た し どう いう レジュメ が いい と さ れる の か 人事 に 受け が いい の か と か も 英語 で 調べ まし た し 僕 は 結構 いろんな 人 に お 勧め し て いる リソース が あっ て テック インタビュー ハンドブック って いう ん です けど 結構 オーブン ソース で 管理 さ れ て いる こっち で の レジュメ の 書き 方 から どんな レジュメ が いい か から どんな 面接 が ある か と か リード コード 的 な クエスチョン どんな の が ある か と か も 結構 その 就職 する まで に 必要 な 情報 を まとめ た サイト と いう か 情報 源 と か が あっ て それ は 僕 は 結構 重宝 し まし た ね 放送 の 概要 欄 に 貼っ とい て.",
      "start": 2589170,
      "end": 2625926,
      "timestamp": "43:09"
    },
    {
      "speaker": "A",
      "text": "ください はい 貼っ とき ます 多分 僕 も 読ん で そう なんか その 流れ で 言う と、 ATS って 言葉 自体 も その フロック の コミュニティ で 流れ 始め た の って 僕 と K 君 が 言い 始め て から で、 なん で やっぱ なんか そこ ら へん 英語 で リーチ し てる って いう 人 が 少ない ん だろう な って いう 印象 を 受ける ん で、 だ から 多分 結構 な 人 が レジュメ は まず 履歴 書 を 英訳 し た もの だ みたい な 多分 固定 概念 と いう か、 の まま 進ん じゃっ てる って いう 人 たち が 多く て、 ここ ら へん、 英語 で 調べ られる よう に なる と いい です ね。 めちゃくちゃ 時間 使っ ちゃっ た ん です けど、 面接 の プロセス、 いく? なん か これ も 小さい、 なんて いう の、 小さい 会社 と 大きい 会社 で 全然.",
      "start": 2625926,
      "end": 2682830,
      "timestamp": "43:45"
    },
    {
      "speaker": "C",
      "text": "違っ て そう だ よ ね、 まあ 間違い ない、 まあ 別 の 機会 で も いい ん じゃ ない? 結構 これ が 一 個 の プロジェクト と し て 大きい し さ、.",
      "start": 2682830,
      "end": 2689816,
      "timestamp": "44:42"
    },
    {
      "speaker": "A",
      "text": "そもそも どう しよう、 さらっ と 流す か まあ で も.",
      "start": 2689816,
      "end": 2695880,
      "timestamp": "44:49"
    },
    {
      "speaker": "C",
      "text": "いい か いい ん じゃ ない? プロセス で 言う ん だっ たら さ、 正直 ゲスト の 人 たち 相当 喋っ て くれ てる の も ある し ね、.",
      "start": 2695880,
      "end": 2701605,
      "timestamp": "44:55"
    },
    {
      "speaker": "A",
      "text": "正直 まあ 確か に プロセス で 言っ たら そう です ね、 まあ なんか プロセス は ざっくり、 レジュメ の なん か 思う の は、 日本 なんか フロック の 僕 が 観測 し て いる 範囲 で 言う と、 レジュメ を 受かり 始め て、 5 件 と か 10 件 と か 面接 受け て いる 人 たち って、 どっ か に は 引っかかっ て いる イメージ ある ん です よ ね。 もちろん 英語 が 大変 な の は ある けど、 基本 的 に カナダ に 来 てる 人 たち は 英語 を ちょっと できる って いう 状態 に は なっ て て、 日本 人 の 努力 を ちゃんと する 心 だっ たり と か、 技術 力 の 高 さ から、 あんまり そこ で 足踏み し てる 人 って 少ない の か な って いう の は、 僕 は ちょっと 思っ てる ん です けど、 どう です か?",
      "start": 2701605,
      "end": 2750970,
      "timestamp": "45:01"
    },
    {
      "speaker": "C",
      "text": "まあ いや 両 極端 じゃ ない いや それ は もう 本当 に トガシ さん の 言う 通り 全然 そこ で 足踏み し てる 人 は ちょっと 少ない だろう な と 言い つつ そもそも の コミュ 力 って いう 部分 で やっぱり ちょっと ね 日本 語 で あっ た と し て も 正直 ちょっと この 人 は もう ちょっと 強く 言おう か と か ちょっと 人 に 対し て ちゃんと コミュニケーション 取る 努力 しよう か と か って なん か 生まれ ながら と 言っ たら ちょっと 言い 方 悪い けど 英語 依存 の 問題 だ よ ね って 人 は 正直 い ない と 言え ば 嘘 に なる よ ね って いう の は ある よ ね うーん.",
      "start": 2750980,
      "end": 2776751,
      "timestamp": "45:50"
    },
    {
      "speaker": "A",
      "text": "まあ 確か に それ は そう です.",
      "start": 2776751,
      "end": 2778552,
      "timestamp": "46:16"
    },
    {
      "speaker": "C",
      "text": "ね シンプル に 技術 力 が と か 面接 まで 行っ て しかも レジュメ で ちゃんと 取る ね あの ま あ 情報 の まとめ 方 も でき て い て 情報 収集 も でき て い て って いう 方 が まあ 確か に ね 面接 まで 行け て って いう とこ で なんか 待っ た って いう 話 って そんな めちゃくちゃ 聞く わけ じゃ ない けど うーん 怖い えー な ん だろう な 面接 で ちょっと うまく いか なかっ た 人 の 話 と か 聞い てる と そもそも アピール ポイント 何 も 喋っ て なかっ たり と か あの レジュメ に は 確か に かけ て いる ん だ けれど も ここ を ちゃんと アピール する べき だ よ ね って いう ところ が いや で も みたい な 感じ で ちょっと 終わっ て たり と か それ ちょっと もったい ない な って いう 瞬間 は 正直 多い な.",
      "start": 2778552,
      "end": 2812658,
      "timestamp": "46:18"
    },
    {
      "speaker": "A",
      "text": "確か に ま あ そう いう 人 は 確か に 一定 数 い ます よ ね で も そう いう 人 たち って その レジュメ の ところ に も 引っかかっ てる な って イメージ は ある まあまあ 確か に ね そこ なんか その PDCA じゃ ない けど その 改善 の サイクル を 回せ て ない じゃ ない です か な んで 結構 やっぱ あの 誰 で も やっぱ レジュメ の パート で 引っかかっ て 何 ヶ月 か 過ごす ん で そこ で なんて いう の オーバー 乗り そこ で 乗り越え てら 乗り越え られる 人 は その 次 の プロセス で も あの 乗り越える 力 が ある の か な と 思う ん で って いう の も あり そこ の プロセス で は あんまり 引っかかっ てる 人 は 少ない の か な って いう の が なん か あん の か な で.",
      "start": 2815457,
      "end": 2857063,
      "timestamp": "46:55"
    },
    {
      "speaker": "C",
      "text": "も 確か に ね ただ pdca の その サイクル の 中 で 人 に 聞く って いう こと だっ たり 誰 か に 頼る って いう こと を 早い タイミング で 生き て いる 人 は 俺 は 結構 あの その サイクル 回す の が 早い な と 思う 確か に レジュメ で あろう が 面接 で あろう が 何 で あろう が 全部 自分 の 一人 だけ で 完結 を しよう と 悩ん でる 人 が.",
      "start": 2857063,
      "end": 2873790,
      "timestamp": "47:37"
    },
    {
      "speaker": "B",
      "text": "もう むちゃくちゃ 多い いやー 確か に レジュメ に せよ 何 に せよ 人 に レジュメ だっ たら 人 に 1 回 見 て もらう の が 一番 早い です もん ね なんか それ を 100 % 人 に 見 て もらう こと だけ で やっ たら それ は それ で ちょっと うーん って 感じ で は あり ます けど と は いえ、 なん か 一人 で 全部 いろんな 記事 を 読み漁っ て、 一人 で 完璧 を 求め て ずっと 一人 で 黙々 やっ て い て も、 なん か ちょっと イマイチ みたい な パターン は 結構 あっ たり する から、.",
      "start": 2873790,
      "end": 2899542,
      "timestamp": "47:53"
    },
    {
      "speaker": "C",
      "text": "そう な ん だ よ。",
      "start": 2899542,
      "end": 2900522,
      "timestamp": "48:19"
    },
    {
      "speaker": "B",
      "text": "人 の 上手い 頼り 方 って 必要 です よ ね。",
      "start": 2900522,
      "end": 2902803,
      "timestamp": "48:20"
    },
    {
      "speaker": "C",
      "text": "ある ある。",
      "start": 2902803,
      "end": 2903303,
      "timestamp": "48:22"
    },
    {
      "speaker": "B",
      "text": "で、.",
      "start": 2903303,
      "end": 2903434,
      "timestamp": "48:23"
    },
    {
      "speaker": "C",
      "text": "しかも 多分 英語 の 話 と 多分 一緒 で、 完璧 な 英語 じゃ ない と 人 の 前 で 喋っ ちゃ ダメ って いう の も ある よう に、 思う 人 は いる よう に、 完璧 な レジュメ、 完璧 な 面接 対策 を 自分 の 中 で 結論 を 出さ ない と 人 に 聞い ちゃ ダメ って 多分 思っ てる 人 が 多く て、 うーん そう なっ て しまう と pdca の サイクロン を 回せ ない し トライアンドレーラー も でき ない し 自分 の 頭 の 中 だけ で すべて 完結 違っ たら もう 大 ショック って 話 だ から その タイプ の 人 は 少し ね 英語 も 多分 踏まえ て も 失敗 し て も いい し 変 な 奴 見 られ て も いい から 一旦 誰 か に 頼ろう か って いう の は ちょっと 言い たい ところ で は ある か な その ため フログ みたい の も ある し.",
      "start": 2903434,
      "end": 2938730,
      "timestamp": "48:23"
    },
    {
      "speaker": "A",
      "text": "ね って いう ま あ そう です ね なんか まあ で も それ って 仕事 で も 言える こと で こっち って やっぱ その 日本 で の 完璧 さ 日本 みたい に 完璧 さ 求める より も まあ 壊れ て て も いい ちょっと ちょっと くらい 壊れ て て も いい から メイン の mvp でき てる ん だっ たら 出し ちゃおう ぜ 出し ちゃおう ぜ って いう 文化 な ん で で 仕事 の 中 で も あの みんな で なお あの 壊れ てる ところ は みんな で 直し て いけ ば いい じゃん とりあえず mvp 早め に 作っ て あの 車内 に 出そう ぜ みたい な の って いう 文化 が ある ん で そう いう ふう な 働き 方 を できる 人 を 求め られ てる ん で ちょっと そう じゃ ない 人 たち は そう いう の に 慣れ 慣れる 意味 を 慣れる 練習 と し て ちょっと そこ ら へん を 捉え られる と いい の か も しれ ない です ね それ.",
      "start": 2938730,
      "end": 2983856,
      "timestamp": "48:58"
    },
    {
      "speaker": "C",
      "text": "が 評価 と し て やっぱり マイナス に なる と 思い込ん で ん だろう.",
      "start": 2983856,
      "end": 2986297,
      "timestamp": "49:43"
    },
    {
      "speaker": "A",
      "text": "ね おそらく うーん そう です ね それ は ある か も しれ ない 98.",
      "start": 2986297,
      "end": 2992099,
      "timestamp": "49:46"
    },
    {
      "speaker": "C",
      "text": "% くらい の 完成 度 の もの を 出さ ない と 多分 評価 マイナス.",
      "start": 2992099,
      "end": 2994880,
      "timestamp": "49:52"
    },
    {
      "speaker": "A",
      "text": "みたい な 面接 の プロセス は ちょっと どっ か で また その うち いう こと に し ましょう か ね 結構 これ だけ で も 結構 長い 間 に なっ ちゃっ た ん で は い と いう こと で 今回 は ちょっと ま あいつ も の セナ さん と ユゴ 君 に 来 て もらっ て 就職 海外 就職 する なら どう やっ たら いい みたい な の を 話し て いき まし た ありがとう ござい.",
      "start": 2994880,
      "end": 3015316,
      "timestamp": "49:54"
    },
    {
      "speaker": "B",
      "text": "まし た ありがとう ござい まし た と.",
      "start": 3015316,
      "end": 3017418,
      "timestamp": "50:15"
    },
    {
      "speaker": "A",
      "text": "いう こと で 最後 まで 聞い て くださり ありがとう ござい まし た 海外 キャリア ログ は 毎週 月曜 日 に 更新 さ れ ます spoifytapplepodcasubet な yo ど で 番組 の フォロー を ぜひ お 願い し ます また x で つぶやき が ある と とても 嬉しい です ハッシュ タグ 海外 キャリア ログ で お 待ち し て おり ます ありがとう ござい まし た.",
      "start": 3017418,
      "end": 3035441,
      "timestamp": "50:17"
    }
  ]
}