{
  "episodeGuid": "ccfb6b6f-fb3d-45f3-8173-6983a5ecd6aa",
  "episodeTitle": "英語苦手なWebディレクターが未経験からカナダでエンジニアに！ボランティア4件で実務経験を積んだ就活戦略（前半）#17",
  "transcribedAt": "2025-10-19T00:53:10.578Z",
  "duration": 3197,
  "fullText": "はいそれでは今回はさとみさんに来ていただきましたまず最初に簡単に経歴を。教えてくださいはい東京のデジタルマーケティングの会社でウェブディレクターとして5年間働いてました具体的にはお客さんのクライアントのウェブサイトを運用更新するような部署で政策のそのデザイナーさんやコーダーさんのとそのクライアントの間に立ってコミュニケーションしたりその成果物の確認だったりスケジュール管理身長確認ないしはいただいた案件の要件定義ってものをする立場で働いておりました。でこっちに来られたのはどういうふうななんだろうえっと学校とかなんかどういうふうに来られたん。ですかはいカナダに来たのは2年前の2023年の8月ですねで初めはその今もなんですけどもコーナーストーンに通っていてコーナーストーンのウェブデベロップメントコースに1年座学1年コープのコースに通ってい。ます元々ウェブディレクターってことだったんですけどウェブディレクターも結構リモートで働けたりとかしてフレキシブルに働けるし割と業界的にはすごい近いのかなと思うんですけど今回ソフトエンジニアになろうと思ったきっかけみたいなのってあるんですか。私が働いていた会社というのは、主にクライアントさんが大企業なことが多くて、基本的にはお客さんの会社の中に常駐として、常駐ディレクターとして働いていたので、割かし気を使う立場で働いていました。エンジニアに転職した理由としてはまずカナダに来たかったっていう理由が大きかったのとその中でディレクターとなると英語力そのコミュニケーションがネイティブ並みにできなきゃいけないっていうところでハードルが非常に高いので極端な話一個だというかエンジニアであればプラグラミングでコミュニケーション取れれば大丈夫っていうようなものもあると思ったのでキャリアチェンジにしてき。ましたウェブマーケターになるっていうのは大学の時からウェブ系の仕事がしたくて考えてたんですか?大学時代は全くどういった職場に就くかは考えていなくて就活その4年のタイミングですね大学4年生のタイミングで就活をしていた中で自分の就職先としては何か作るものを仕事としたい何かクリエイティブな仕事をしたいというのでいろいろと仕事を受けていった結果デジタルマーケティングのウェブディレクターとして就職することを決め。ましたなんか会社によっても違うとは思うんですけどなんかちょっと似てるとはいえ結構そのウェブディレクターさんがいる業界とそのSaaSというかソフトウェアエンジニアのエンジニアリングの業界って結構違うじゃないですか僕あんまり認識がないんですけど結構忙しいんですかそれとも結構ソフトウェアエンジニアリングの業界と似てる感じなん。ですかそうですねそもそもそのソフトエンジニアリングの世界をあまり知らないのでちょっと比較が難しいところではあるんですけどもあの本当に私の会社はもうお客さんごとにそのお客さんの風土によって忙しさが変わるというような状況でしたねで1個経験した中だと松木割っかしこうこう足したないようにちょっと自分たちで業務量を調整したりといった結構残業がかさみがちな部署を経験したりでその時は忙しかった。と思いますねじゃあちょっとなんかSIOとかに近いのかななんか多分ソフトエンジニアリングのなんかSaaSとかの業界はまああのちょっともうちょっと忙しいとはいえまあなんか日本の文化があるとはいえこっちのなんかエンジニアリングそのSaaSの会社とまあそんなに違いはないのかなと思うそうですねそしたらじゃあどっちかといったらSaaSじゃなくてSIRとかに近いのか。なと思いますそうですね昔お客さんが持っているウェブサイトを自宅案件としてその代わりに例えばキャンペーンページを制作したり何か商品の商品の更新があればそれに合わせてそのページの掲載内容を更新したりといったことをしてい。ましたちょっと戻すんですけど、もともと大学の時から、子供の頃から海外で働きたいみたいなのあったんですか?英語とかってどういうふうに勉強されてたのかな?そうですね、海外に憧れは子供の頃からありましたね。とはいえ、英語が好きとかっていうわけでもなく、どちらかというとちょっと苦手意識があったぐらいで、大学時代も留学なんかも考えたりはしたんですけど、実際に行動も移すことはなかったですね。そしたら何かきっかけとかあったんですか?その就職した後に。そうですねきっかけについてはもともと就職した後もやっぱりその海外で暮らすって言ったことに関してこうなかなか夢を捨てきれない気持ちがあってたまにあの青年海外協力隊といったものを調べて海外に出るチャンスは何かあるものかっていうのは下がったことはいつかありましたで自分の中で大きくきっかけとなったのはあの働いてた部署の中で先輩が会社を辞められる際に私カナダ行くんだよねっていう話を聞いてえっどういうことですかっていうのでも実際に話を聞いて連絡先などをいただいていてで一緒にご飯なんかもしたりしてそのバンクーバーで行くってことを聞いたんですけども自分の中でまだまだすぐには渡航する気持ちはなかったんですけども、2022年のゴールデンウィークに、突然自分の中で海外行きたいってすごい衝動的に思って、その時に先輩に連絡して、いかがお過ごしですか?カナダの生活はどうですかって聞いて、その中でフロックさんを紹介いただいて、すぐにフロックの説明会に参加して、カナダ渡航について徐々に具体化していきましたね。カナダで働いてた、カナダに留学した先輩がいたっておっしゃってたんですけどいい話ばっかり聞けたんですか?それともなんでカナダがピンポイントで行きたいって思った理由になったのかな。と思ってその時はまずカナダじゃないですね海外に居住する選択肢が自分の中でどれだけ持てるのかっていうのが全くわからない状態の中から具体的にエンジニアとしてキャリアその先輩もウェブディレクターと同じ職で働いてた方がそういうキャリアチェンジをして実際にそのカナダに過ごして過ごしてみて快適だっていう良い印象も受けましたしその先輩からもフロックの説明会でされるようなあのもしあの予算少なめであればコーナーストーンの通うのが一番早い1年座学1年コープっていうその2年で2年でかかってプラスは掘りを追加したければ働くっていう3年のコースでかつ予算的にも学費自体が200万生活費も含めてだいたい400万ぐらいあればいけるよっていった話も教えいただいて自分の中でそれであれば自分も挑戦できるかもしれないっていうもう他の国は全く考慮することなく、とりあえずカナダ行こうと思って決めました。確かに先に行ってて、具体的に生活史とか教えてくれる人がいたら、行きやすいですよね。イメージしやすいです。そうですね。英語はそこから勉強されたんですか?それとも何だろう?大学受験とか、なんかその時から、あとは大学に在学中とか、なんかどういうところで勉強は学習されました?そうですね。英語は、大学受験とかで勉強して、文法の基礎といったものはあったと思いますし、大学の中も私、学科が国際関係学科といったところだったので、英語について専門的に学ぶ機会もあったので、比較的ベースはあったというところですね。私がコーナーストーンに入るときは、スコア英語の入学するために必要な英語力として例えばTOEICで言えば850点あればESLとかなしにそのままコースを始められるしもし800点以上であればESL1ヶ月通えば入学ができるといった条件だったのでとりあえず特効時にはTOEICは845点あったといった状況ですねとはいえアウトプット、スピーキングだとかライティングだとかに関しては全く自信がなくて今でももう本当基本的には喋りたくないっていう消極的な気持ち。ですちなみに国際関係の何だろう学科とかだともうなんかそこらへん学校の中でもトイックとか受けたりするんですかあ、。そうですね。私の場合はそういった機会はなかったんですけども、代わりにあのTOEFLの受験のための勉強コースっていうのが追加で、あの受けられたりっていうのがあって、勉強はしたんですけども、まああんまり伸びた感じはしないかったですね。じゃあTOEICはもう本当にこっちに来るって決めてから勉強し始めたんですか?そうですね、あのもうその説明会を受けてからまたちょっと熱が下がってしまって1年ぐらいあの特攻の準備をおろさかにしてしまったんですけども急いでこの計画的にはそのコープとワンホリを使った特攻計画にしたかったのでそれまでに年齢的に思うと2023年の8月のタイミングで入学しないとちょっとキツキツになるぞっていうのがで、急いで勉強をしてっていう感じで、そうですね、3ヶ月ぐらいで頑張って取った記憶があります。ちなみに何回受けられたんですか?多分3回ぐらいですかね。3、4回ぐらい。1回目はちなみに何点だったんですか?1回目めちゃめちゃ低かったですよ。自分で模擬でやった時かな560とか、もう全然600点いったかなぐらいの頃で何か回をうごとに上げて。いけましたでもそれでも何ヶ月かで850までいけるのすごいねそしたら技術の面について聞いていきたいんですけど一応未経験で投稿ってことになると思うんですけど来る前は何か学習されたりとかしましたか。そうですねまず前提としてその仕事の中でウェブサイトがどういうふうに作られているのかだとかそのウェブ制作をする中でどういった流れがあるのかその要件定義をして設計をして開発テストローンチっていった流れは知っていたっていうことがまず基礎知識を持っていたってことがありましたでその渡航の前に一応自分でその学校は行くといえどもカナダで学校に行くとはいえども、自分で勉強しようと思って、あのオンラインのテックスクール、オンラインのテックスクールに、それは何ヶ月ぐらいのコースだったかな、確か3ヶ月ぐらいのコースを受講した覚えがあります。それはなんか完全オンラインなんかゆうでみみたいなのではなくて、なんかオンラインで先生が。いるタイプの学校なんですか?私としてはメンターの方がついてくれるようなシステムで受講した理由としては会社で10万円までは授業料を免除してくれるといった教育支援システムがあったので利用して、せっかくならば、DEMYUといった選択肢もあったと思うんですけども、せっかくならば、そういった教育システムも使ってスクールに始めようというのでやりました。それは何を勉強されたんですか?具体的には、なんか技術的な意味ではない?フロントエンドのフロントエンドコースで内容としてはhtmlcsjavascriptといった基本的なところからjquery最終的にはVue。\njsを使って何かプロジェクトを作ってみようといった。コースでしたそれを来るまでにとりあえず終わらせて来てからは学校で勉強するみたい。な感じそうですねちょっとあのそのスクールでの余談にはなってしまうんですけどもあの当時スクール主催のコンテストがあってそのプログラミング部門であのコンテストに応募したら最優秀賞を取ったりってところでちょっとあのでも応募者も多分そこまでも私の回が最終回だったので多分応募者自体とかも少ない結構小牙なコンテストがあったんですけどもそういったものもあってでそうですね実際にカナダに来てからは学校のその授業とユーデミでリアクトとかを勉強したりそれに加えてクラスメイトでチームプロジェクトをやろうというふうに決めてテック業界で働いたことのあるメンバー私含めて4人プラス学生さんなんですけども結構プログラミングオタク軍で知識も豊富すごい学習意欲も旺盛たチームでチームプロジェクトをやってその中でビットの扱い方とかチームでどう動くべきかといった開発の進め方を学べたのは大きかったですね。学校に行ってた時ってなんかアルバイトすべきか生活に足りないからアルバイトする人もいっぱいいると思うんですけどアルバイトをすべきかしないべきかみたいな議論あると思うんですけどさとみさんはして。ましたか私は実はコープに入ってからなかなか仕事先見つからないぞっていうのでちょっと貯金的な体力が尽きてきたのでもう始めざるを得なくて始めた。っていう状況ですねアルバイト何してたんですか私。はあのカナダのローカルのカフェのブレカでサンドイッチ職人としてサンドイッチを作りまくってました。でもなんかそこで英語力練習できたり英語のコミュニケーション練習できたりできるからいいかもみたいな最近はそうやって別のバイトで英語はやって技術とはまた別に英語のスキルを養ってっていう人も結構聞くから良かったですか?その点では。そうですね、やっぱり仕事っていうそのお金をもらって責任がある状態でコミュニケーションを取らなきゃいけないしかも英語でってなるとやっぱり話さなきゃとかってなって責任感も生まれますしミスがあっちゃいけないのでそこで英語力が失われるっていうのはもう私も納得でそこの英語力を伸ばすために実際に仕事をしてみるっていうのはバイトでもいいから仕事してみるっていうのは私。も賛成ですちょっと戻って、座学の期間について質問なんですけど、座学の期間はすごい、なんだろう、学校で言われていることに取り組み続けたんですか、それとも結構自分で、なんかさっきユデミとか、学校の人と勉強したっていうふうに言われてたんですけど、クラスの内容は結構フォローされてましたか、それとも結構なんだろう、やっぱり学校の中でやれることって限られてて、就職するには結構足りないと思うんですけど、そこらへんはどうやって。キャッチアップされましたか?授業をベースとしてそこから自分の中で身につけられてないなっていうところに関してものにするためにUDEMYだとかそういったチームプロジェクトの中で実際に自分で手を動かしてみて理解を深めていくことをしていました。なんかあのインタビューしていてこれまでの方たちは結構あの学校でなんだやることは結構できるだけサボってあの自分のやらないといけないことを勉強したって人が多かったんですけどどうでしたか結構なん。だろう確かに私は割りかしサボり気味な方だったと思いますあの課題もあの必須なものであればもちろん提出してちゃんと卒業に向けてやるってのことはしたんですけれどもあの毎回毎回というかその授業のに終わりに授業によっては授業の後に宿題が出されたりしたんですけど基本的に先生のさんとしてはスタンスとしては人それぞれの予定があって忙しい人もいるだろうからできたらペースで良いよこの課題はって言ったその幅を持たせてくれたのでもちろん自分の中でやれるやりたい時はやっていってでもちょっとそのチームプロジェクトの方を専念したいとか別のことに注力したいときはちょっとやらなかったりいったことを挑戦してました。なんか先生だったりとか友達とかもちろん日本人も少しはいると思うんですけど英語が基本的にコミュニケーションなんだろう英語でコミュニケーションを基本的に取ると思うんですけど英語力は学校の中での座学期間で伸びたなと思いますか?いやー学校の中で伸びた感じはしないですね。どちらかというと英語のみだなって思うきっかけ、理由ですね。私、こっちで出会った彼がいて、お互いカナダ人ではなく、お互いの非英語圏の国から来ているので、コミュニケーション英語、大人言語として英語を話すという状況なので、日常的に話すことでスピーキングへの抵抗感というか、多少文法的に間違っていても、コミュニケーション、英語っていうのは結局コミュニケーションだから伝わるもんだなっていうのは自信を持って、英語を話すことへの抵抗感はなくなったと思います。時期的には、その時期には英語力が上がったなと思うけど、それは学校ではなかったって感じですかね。もう1個聞きたいんですけど、これりょうさんにも聞きたいんですけど、なんか未経験、未経験というか、あのウェブの勉強し始めた時って英語で勉強しました?それとも日本語のその教材とかも見たりして、まあ学校は英語だと思うんですけど、なんか自分で勉強するときゆうねみとか、英語でしたか日本語でしたかってどっちですか?日本にいたときは、スクールが日本語だったので、日本語。でも、こっちに来たときは、極力教材も英語で買って、できるだけ英語の字幕をつけたとしても、英語で見る。ただし、理解が難しいとき、概念的でもうつかめないってときは、日本語にして、なるほど、こういうことかって理解を深めるってことをしてました。極力英語を使うようにした方がよかろうという意識でやってましたね。僕たぶん今も昔も変わらないんですけど、なんか日本語って結構いい教材があると思うんで、なんか日本人ってやっぱりもの、なんか本だったりとかプロダクトをわかりやすく作るみたいなのはすごい上手だなと思ってて、だからこの本読みたいとか、この内容について知りたいと思ったときに、なんかいい教材があったら英語でも日本語でもそのいい方を選ぶみたいなのを僕はよくやってるかなって思います。例えばだけどこっちでよく使われるリードコードの面接対策とかってこっちの方がやっぱり教材がいっぱいあるんでそれは基本的に僕は英語でやるしただこの言語について理解するみたいな本とか教材を探した時に日本で結構いいのがあったりするんでそういう時はそういう日本語のものを使ってるかなっていうふうに思いますあとは英語から日本語になって英語の本が出て、それがなんか翻訳されて日本に来たものは英語の方が読みやすいんで、英語の本を読むかなって感じです。逆にどうですか、。さやかさんは?私も最近その技術書とか読むときは、まず英語の現象がないか調べてあるんだったらそっち読んでて、で、私も基本ゆうでみとか全部英語で勉強したんで、なんか英語の方が分かってるけど、頭の中は難しいな、説明が。日本語で考えるときもあるから、互換性がちょっとないときがあって、日本語で説明したいときに全く日本語で説明できなくて、でも英語も別にネイティブじゃないから困るときもあるっていうので、情報の日本語と英語の互換するのに苦労したなっていうのが働き始めてから気づいた。だから、。最近は英語ばかりでやることの方が多いかもしれないです。私は。日本語で学んでた時の問題点としては、やっぱりその専門的な単語で、これ、なんかどういうものか知ってるけれども、英語でどういう単語で言うのか、どういう名前なのかわかんないみたいな時に、結局、今仕事で働いてる時も、それ知ってるけど英語で言えないって時は逆にあったりするので、できるだけ英語ってした方が、私は自分のためだなと思ってます。確かに、説明を考えるとそうかもしれないですね。そしたら、就職活動について聞いていきたいなと思うんですけど、就職活動はどういうふうにされましたか?そうですね、まず学校でキャリアサポートのシステムがあって実際にエンジニアとしても働いたことのある人がレジュメを添削してくれるといったサービスがあったのでそこにお願いしてレジュメのベースを作りましたこのポッドキャストにも出られたことがある石さんが一緒にボランティアをやっていましてそのボランティアをやっていたってことから実際に医師さんが就職された際に自分がどうやって今の職を得るまで何をやったかっていったことをすごい根絶丁寧に週末2回に分けて説明してくださってでもそのやり方に則って応募をしてました具体的には医師さんがやられた方法としてはリンクドインに1日に3件ぐらい応募するっていうのを目標にしてレジュメットカバーレターも毎回カスタマイズして出すと大変になるので基本的にテンプレートを用意してあまり興味がないとりあえず出してみるかっていう時には名前だけ変えて出す結構この会社覚悟が高いジョブマッチ率が高いぜひ働いてみたいってところはカスタマイズするっていうふうなやり方を取られていたのでそれにのっとって同じように応募していまし。た名前を変えるっていうのはどこの何の名前を変えてたんですか会社。の名前ですねその応募先の会社の名前をマッチ率を高めるためにキーワードを散りばめるといったそういったカスタマイズをするかどうかって。いうところですねどのくらい前から準備し始めたんです。かそこに関してはちょっとあまり胸を張っているような感じではなくて実はその座学も終わってコープが本当始まったタイミングでレジュメとかを整え始めましたそのレジュメに書く内容自体はもう座学期間中からできるだけ書く内容を増やすようにしていて例えばポートフォリオだったりその個人のプロジェクトチームプロジェクトだったりを作ったりあとはボランティアの経験を積んであのカナダの現地での就労経験を積むって言ったことを座学期間中はしていまし。たボランティアってどうやって見つけたんですか。今に至るまで4件受けてるんですけども1個目はミートアップで主催している方があのウェブサイトを作りたいってところで募集されてたのに応募したのこと2件目はフロックのこれが医師さんと同じボランティアなんですけどもフロックのポストでボランティアの募集があってそこに応募したこと3件目はそこのボランティアしていたところのプロジェクトマネージャーの方からクライメットテックのイベントを主催するからそのイベントLPを作ってくれって言ったことでやったのと4件目は学校のジョブ。ポストですねすごいなんかボランティアでも見つけるの大変って結構聞いたことあるのでいっぱい機会があったんですねそう。ですねそういった意味だと私は多分ラッキーだった。と思いますボランティアって完全無休でした?そうですねうち3つは完全無休でイベントLPだけ優勝。でしたラッキーですボランティアの時の経験とか面接に行きたなぁとか思います聞かれました?どんな内容のことをやったんですかとか面接の。中でそうですね就活には確実に行きたと思いますやっぱりそのどういった経験をしたかというのでボランティアの経験を主に話しましたしやっぱりそのレジュメを取った理由実は言うとあのレジュメあのセナさんにあのフロックのセナさんにデビューしたいもらったんですけどもその時は結構めちゃめちゃ赤が入りまくっていったようなあまり何でしょうもう本当に完璧なレジュメではなかったんですけれどもそれでも通ったのはやっぱりカナダのそのボランティアの経験があったからかなぁなんて推測してます。セナさんでレジュメレビューしてるんだすいません。ちなみにどのくらいの期間探して最終的に今の職に就いたんですか?レジュメ準備されたのが本当にもう座学期間が終わってさっきの話だと結構長い間決まらなかったのかな?で、アルバイトを始めたってことだったんですけどどのくらいの。期間間があったのか?応募を始めたのが今年の1月の末、2月くらいで実際にその就職決まったのが7月末なのでざっくり6ヶ月ぐらいですかね結構辛いですよね辛かったんですけれどもあまり辛いとこう被害者ずらすることもできずであんまりこうバイトが始まって忙しくなっちゃったりとかで自分であの何でしょうその6ヶ月間も毎日張り付いて頑張って応募してたかというとそうではなくてもどちらかというともう就職できないだろうっていうマイナスな気持ち周りも友達、クラスメイトも日本に日本帰国しちゃって日本でキャリアを積むっていった雰囲気だったりだとかやっぱり就職難しいよねっていうのがもう周りでみんな言ってるので応募しても通らないだろうっていう後ろ向きな気持ちになってちゃったので本当にもう頑張って気が向いてお尻叩いて感じでやっていたので、実はいうとトータルは30件いくかいかないかぐらいの応募件数だったんですね。いやでもそれでもなんかあんまり日本でエンジニアしている人たちはイメージできないと思うけど、結構なんか送っても返信もないしなんか自分何やってんだろうとかって思っちゃうからやっぱり辛いのかなあとまあねお金のこととかもあるしその間ってやっぱりその働いてたり勉強をしたりとかっていうのもなんかやっぱストップしちゃうからなんか自分の人生何も動いてないなぁみたいになってちょっと辛いかなとまあなんかその中でもまあ自分でお尻叩いてできたすごいのかな。確かにあのメンタル的にはめちゃめちゃ辛くて本当彼がいなかったら絶対に日本帰ってただろうなって確信して。ますそういうなんだろう人がいて息抜きに息抜きができるってのは確かにいいかもそしたら今の会社の面接について聞いていきたいんですけどどんな感じの流れであのレジュメの出した後はどんな感じの流れで面接まあ合格するまでに合格するに至ったん。ですか面接自体は2回ありまして、むしろ逆に2回だけで、1回目はHRの方、2回目はテックの人を含めてHRの方と合計4人、あとHRの方とテックの方から2人出て、その3人の方と面接していました。具体的な流れで言うと1回目のHRの方については、よくあるビヘイビアルインタビューという感じで、なんで応募したのといった死亡動機から具体的な経歴を話したり、でも1個質問としてもあったのが、実際に開発を終えて公開した後、どんな作業をするって言われて、どんな作業?一応デバイスとかタップトップ携帯とかを使って確認したりしますみたいな質問を一応そういったやり取りをしたりっていったことがあり。ましたそれは電話ですかそれともZomみたいな感じ?2回ともビデオ会議でした。GgleMtoを使ってそれはもう慣れていましたかすでにボランティアとかもやってたって言ったからちょっとそれに似た状況みたいなのはあったのかなと思う。んですけどそうですね。実はそういった面接対策は、英語を話すこと自体については日常会話であればできるようになっていたんですけども、具体的な面接の対策って言ったことは実はギリギリまでしてなくて日付が決まって急いであの学校のそのキャリアアポートの人にモック面接をお願いしてやったりでもモック面接の時も結構ボロボロで途中で何も話せなくなっちゃったりたことを経験したのでなのでもう彼にお願いしても4,5時間ぐらいその面接の前日に4,5時間ぐらい練習したりたこともしてました。2つ目の面接は技術者との面接でエンジニアとの面接だったと思うんですけどどんな感じの流れでどんなことをやられたのか技術。者の方たちの面談の時も基本的には質疑応答という形でテックに関する質問具体的に言えばテストツール使ったことあるかとかプロジェクト管理ツール使ったことあるリアクトについてどう思うって言ったらどうだったり新しいライブを学ぶ時にどういう風に学ぶのっていうような質問があってそれに対しても必死になって返していたって感じだったんですけどもなので何か実現するのか行動を書いたり実現することだったりだとか課題を出されることはなかったんですねただその面接が終わったタイミングは実は正直英語がボロボロに自分でも感じていてその理由としてはHRの人はやっぱり何かしらコメントを返してくれてあの伝わってるなっていう感覚があったもののテックのやっぱりエンジニアの方々はすごいもう表情が硬くてあのこれは響いているのかどうなのかって言ったらもう不安になってしまってもどんどんどんどん緊張でなんか話せなくなるっていう悪循環が生まれてなったhrの方も正直この子大丈夫かなーってなんか不安ないそう不安そうな顔をしていたりで辛かったのと極めつけはあのテストツールについてあの授業で学んだだけで実際のプロジェクトで使ったことがなくてストレートそのテストツールについては使ったことがないって正直に答えたんですねただ逆質問のタイミングでテストツールについて勉強するので実際にあの音者で使っているツールについて教えてくださいともしてでもあのテックスタック教えてもらってそれが幸いのことに金曜日だったのでもう土日に急いでプロジェクトをあの作り上げてなんか簡単なそのトゥールリストのプロジェクトを作り上げてテストツールも実装してあのあの時答えられなかったけれども月曜日にあの時答えられなかったけれども実際にあのプロジェクトを使って勉強してみたからよかったら見てみてくださいってメールを送りましてその翌日の火曜日に実際にその日の火曜日にHRの方からすごい参考になるよありがとう助かるっていうふうなメールいただけてその合格通知というかその結果通知については木曜日に来る予定だったんですけども木金と梢めちゃめちゃソワソワしてたら月曜日の朝に今日時間あるっていうふうにメールが来てビデオ会議でオファーをいただくっていうような流れでした。フォローアップ結構こっちでは評価高く見てもらえたりしますよね後からなんかできなかった問題をもう一回解きましたと。かもうまさしくその話をちょうどフロックの動画だどういう媒体かだったか忘れちゃったんですけどもフロックで実際に就労された方々の経験談としてフォローアップで挽回したって言った話を聞いていたのでそれを活かしてそういったフォローアップでもやりきるって言ったら精神大事ってのが知っていてやりきります。あとはなんか金曜日にやったっていうのも良かったかもしれないですね。なんか土日に時間を稼げたっていうのと、あとなんか金曜日の午後って結構みんなゆるっとしてたりするからなんかインタビューするなら狙い目とかって言うけど。もしかしたらいやもうあの全く同意で私さらにラッキーだったのは金曜日だったせいかその面接のビデオを録画してくれててしかもその面接が終わった後にAIの議事録が私にも共有されて実際になんかテックスタックとかも何を使ってるっていうのを再確認できたのでめちゃめちゃ私は金曜日狙い目だ。なって思いましたもちろんフォローアップできたのはすごい良かったのかなと思うんですけど他にもなんかこれが良かったなみたいなのはありますか。ありがとうございます。ぜひお話ししたかったのが1点ありまして一時面接の時にHRの方と実際一時面接の時はこれ通っただろ絶対っていうのを確信というかいい終わり方をできたんですけども何をしたかというとその逆質問のタイミングで事前に会社のビジョンだとか価値観競合他社とかのその上を逆質問でしたらばHRの方がすごい反応よく返してくれていっぱい調べてくれてありがとう嬉しいよって形もすごい一番の笑顔をその場で見せてくれてそこから他の質問した時もフルリモートの仕事だったのでどうやってコミュニケーションとっているのって時もすごい初めで話した時以上にニコニコ明るく話してくれたのでやっぱりその企業についてちゃんと下調べをしてあの面接に臨むって大事だなって思い。ましたありがとうねえっとオファーの何だろう連絡についてはどんな感じでしたかそれとその後の流れについて。教えてくださいえっとオファーについてはそのさっきの月曜日にメールいただいてあのビデオ会議実際にGgleMtoも他の面接同じようにGgleMtoに入って初めにちょっとあのスモールトークをしてその後にオファーが決まりましたのでおめでとうというふうに結果通知をいただいてその中から実際に改めてその契約書をどういったドキュメントを送るよといったことを説明してくれてその後に実際にそのメールでミーティングで話していただいたとおりにドキュメントを確認してサインをしてでその中で1個ちょっと話に聞いてなかった話聞いてないぞっていうのが1個だけあっていろいろと面接が終わってオファーもらった後にちなみにだけどこうプロフェッショナルのプロフェッショナルな経験のリファラル2件送ってねみたいな風に言われて面接が終わった後にそんなリファラルがいるのかというのは私はちょっとびっくりだったんですけども幸いそのボランティアでやっていたりだとか元の会社でよくしてくれた上司の方がいたので実はその医師さんと元いた会社の上司とそのボランティアのプロジェクトマネージャーの方2件って言われたんですけど一応3件お願いして送りました。前の上司っていうのは日本からのことですか?そうです日本で一番長くいた時にお世話になった上司の方にお願いしました。それはメールでされたんですか?そうですねメールでそのHRの方からそのオファーのリファラル先の方にメールが行ってその方たちにもちろん英語でいろいろと質問項目質問について回答してもらっていったことがありました。なんか結構電話とかズームだったりすることも多いから日本の会社でもいいのかと思ったらじゃあそれは何だろう文章でのやり取りだと。かそうですね、メールで送るよっていうのが言ってもらえてたので、メールだったら文章でしかないだろうっていうふうに思ったので、お願いしました。確かに、。自社も大丈夫だし。はい。そしたら最後にちょっと公開してもらえるってことだったんで、言える範囲で年収について教えてください。はい。年収については、私あのインディードで応募しましてインディードのジョブポストにまあえっと55型から70型の間っていう風な書かれ方をしていてそのジョブオファーもらった時にHRの方からそのレンジの間ぐらいでどうだいっていう風に言われたので私としてはもう仕事もらえるだけで万々歳だったのであもうぜひともよろしくお願いしますの。で決まりました日本とくらべて、なんだろう、ちがいとか、どうだなと思いました?そのオファーをもらって。いや、もう、日本からくらべたら、私としてはもう、めっちゃ上がったっていうぐらいに、嬉しくて、実はその日本で働いたときも、めちゃめちゃ残業しても、450ぐらいだったかな、450万円ぐらいだったと思うので、もう、私としてはめちゃめちゃ上がりましたし、未経験からのジュニアのポジションで、こっちでも経験はあれといえど、その無給のボランティアがベースだったので、そもそも実を言うと私だったら、当初思ってたのは、もう55件の、550万の一番下で来るかなって思ってたぐらいだったので、上げてくれてありがとうっていう気持ち。最初はあれですよね、仕事もらえただけで、とりあえずありがとうございますって感じ。そうですね。残業を結構経験したこともあったので、残業なしでジュニアでいろいろと教えてもらえる立場で、1社目としては満足だなと。ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcasyoubetなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "A",
      "text": "はいそれでは今回はさとみさんに来ていただきましたまず最初に簡単に経歴を。",
      "start": 8,
      "end": 6234,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "教えてくださいはい東京のデジタルマーケティングの会社でウェブディレクターとして5年間働いてました具体的にはお客さんのクライアントのウェブサイトを運用更新するような部署で政策のそのデザイナーさんやコーダーさんのとそのクライアントの間に立ってコミュニケーションしたりその成果物の確認だったりスケジュール管理身長確認ないしはいただいた案件の要件定義ってものをする立場で働いておりました。",
      "start": 6234,
      "end": 36514,
      "timestamp": "00:06"
    },
    {
      "speaker": "A",
      "text": "でこっちに来られたのはどういうふうななんだろうえっと学校とかなんかどういうふうに来られたん。",
      "start": 36514,
      "end": 42419,
      "timestamp": "00:36"
    },
    {
      "speaker": "B",
      "text": "ですかはいカナダに来たのは2年前の2023年の8月ですねで初めはその今もなんですけどもコーナーストーンに通っていてコーナーストーンのウェブデベロップメントコースに1年座学1年コープのコースに通ってい。",
      "start": 42419,
      "end": 60424,
      "timestamp": "00:42"
    },
    {
      "speaker": "A",
      "text": "ます元々ウェブディレクターってことだったんですけどウェブディレクターも結構リモートで働けたりとかしてフレキシブルに働けるし割と業界的にはすごい近いのかなと思うんですけど今回ソフトエンジニアになろうと思ったきっかけみたいなのってあるんですか。",
      "start": 60424,
      "end": 77822,
      "timestamp": "01:00"
    },
    {
      "speaker": "B",
      "text": "私が働いていた会社というのは、主にクライアントさんが大企業なことが多くて、基本的にはお客さんの会社の中に常駐として、常駐ディレクターとして働いていたので、割かし気を使う立場で働いていました。エンジニアに転職した理由としてはまずカナダに来たかったっていう理由が大きかったのとその中でディレクターとなると英語力そのコミュニケーションがネイティブ並みにできなきゃいけないっていうところでハードルが非常に高いので極端な話一個だというかエンジニアであればプラグラミングでコミュニケーション取れれば大丈夫っていうようなものもあると思ったのでキャリアチェンジにしてき。",
      "start": 80361,
      "end": 119370,
      "timestamp": "01:20"
    },
    {
      "speaker": "C",
      "text": "ましたウェブマーケターになるっていうのは大学の時からウェブ系の仕事がしたくて考えてたんですか?",
      "start": 119370,
      "end": 128125,
      "timestamp": "01:59"
    },
    {
      "speaker": "B",
      "text": "大学時代は全くどういった職場に就くかは考えていなくて就活その4年のタイミングですね大学4年生のタイミングで就活をしていた中で自分の就職先としては何か作るものを仕事としたい何かクリエイティブな仕事をしたいというのでいろいろと仕事を受けていった結果デジタルマーケティングのウェブディレクターとして就職することを決め。",
      "start": 128134,
      "end": 152862,
      "timestamp": "02:08"
    },
    {
      "speaker": "A",
      "text": "ましたなんか会社によっても違うとは思うんですけどなんかちょっと似てるとはいえ結構そのウェブディレクターさんがいる業界とそのSaaSというかソフトウェアエンジニアのエンジニアリングの業界って結構違うじゃないですか僕あんまり認識がないんですけど結構忙しいんですかそれとも結構ソフトウェアエンジニアリングの業界と似てる感じなん。",
      "start": 152862,
      "end": 176715,
      "timestamp": "02:32"
    },
    {
      "speaker": "B",
      "text": "ですかそうですねそもそもそのソフトエンジニアリングの世界をあまり知らないのでちょっと比較が難しいところではあるんですけどもあの本当に私の会社はもうお客さんごとにそのお客さんの風土によって忙しさが変わるというような状況でしたねで1個経験した中だと松木割っかしこうこう足したないようにちょっと自分たちで業務量を調整したりといった結構残業がかさみがちな部署を経験したりでその時は忙しかった。",
      "start": 176715,
      "end": 211605,
      "timestamp": "02:56"
    },
    {
      "speaker": "A",
      "text": "と思いますねじゃあちょっとなんかSIOとかに近いのかななんか多分ソフトエンジニアリングのなんかSaaSとかの業界はまああのちょっともうちょっと忙しいとはいえまあなんか日本の文化があるとはいえこっちのなんかエンジニアリングそのSaaSの会社とまあそんなに違いはないのかなと思うそうですねそしたらじゃあどっちかといったらSaaSじゃなくてSIRとかに近いのか。",
      "start": 211605,
      "end": 238606,
      "timestamp": "03:31"
    },
    {
      "speaker": "B",
      "text": "なと思いますそうですね昔お客さんが持っているウェブサイトを自宅案件としてその代わりに例えばキャンペーンページを制作したり何か商品の商品の更新があればそれに合わせてそのページの掲載内容を更新したりといったことをしてい。",
      "start": 238606,
      "end": 258596,
      "timestamp": "03:58"
    },
    {
      "speaker": "A",
      "text": "ましたちょっと戻すんですけど、もともと大学の時から、子供の頃から海外で働きたいみたいなのあったんですか?英語とかってどういうふうに勉強されてたのかな?",
      "start": 258596,
      "end": 272992,
      "timestamp": "04:18"
    },
    {
      "speaker": "B",
      "text": "そうですね、海外に憧れは子供の頃からありましたね。とはいえ、英語が好きとかっていうわけでもなく、どちらかというとちょっと苦手意識があったぐらいで、大学時代も留学なんかも考えたりはしたんですけど、実際に行動も移すことはなかったですね。",
      "start": 272992,
      "end": 295519,
      "timestamp": "04:32"
    },
    {
      "speaker": "A",
      "text": "そしたら何かきっかけとかあったんですか?その就職した後に。",
      "start": 295519,
      "end": 300524,
      "timestamp": "04:55"
    },
    {
      "speaker": "B",
      "text": "そうですねきっかけについてはもともと就職した後もやっぱりその海外で暮らすって言ったことに関してこうなかなか夢を捨てきれない気持ちがあってたまにあの青年海外協力隊といったものを調べて海外に出るチャンスは何かあるものかっていうのは下がったことはいつかありましたで自分の中で大きくきっかけとなったのはあの働いてた部署の中で先輩が会社を辞められる際に私カナダ行くんだよねっていう話を聞いてえっどういうことですかっていうのでも実際に話を聞いて連絡先などをいただいていてで一緒にご飯なんかもしたりしてそのバンクーバーで行くってことを聞いたんですけども自分の中でまだまだすぐには渡航する気持ちはなかったんですけども、2022年のゴールデンウィークに、突然自分の中で海外行きたいってすごい衝動的に思って、その時に先輩に連絡して、いかがお過ごしですか?カナダの生活はどうですかって聞いて、その中でフロックさんを紹介いただいて、すぐにフロックの説明会に参加して、カナダ渡航について徐々に具体化していきましたね。",
      "start": 300534,
      "end": 378583,
      "timestamp": "05:00"
    },
    {
      "speaker": "C",
      "text": "カナダで働いてた、カナダに留学した先輩がいたっておっしゃってたんですけどいい話ばっかり聞けたんですか?それともなんでカナダがピンポイントで行きたいって思った理由になったのかな。",
      "start": 378593,
      "end": 394343,
      "timestamp": "06:18"
    },
    {
      "speaker": "B",
      "text": "と思ってその時はまずカナダじゃないですね海外に居住する選択肢が自分の中でどれだけ持てるのかっていうのが全くわからない状態の中から具体的にエンジニアとしてキャリアその先輩もウェブディレクターと同じ職で働いてた方がそういうキャリアチェンジをして実際にそのカナダに過ごして過ごしてみて快適だっていう良い印象も受けましたしその先輩からもフロックの説明会でされるようなあのもしあの予算少なめであればコーナーストーンの通うのが一番早い1年座学1年コープっていうその2年で2年でかかってプラスは掘りを追加したければ働くっていう3年のコースでかつ予算的にも学費自体が200万生活費も含めてだいたい400万ぐらいあればいけるよっていった話も教えいただいて自分の中でそれであれば自分も挑戦できるかもしれないっていうもう他の国は全く考慮することなく、とりあえずカナダ行こうと思って決めました。",
      "start": 394343,
      "end": 471995,
      "timestamp": "06:34"
    },
    {
      "speaker": "C",
      "text": "確かに先に行ってて、具体的に生活史とか教えてくれる人がいたら、行きやすいですよね。イメージしやすいです。",
      "start": 471995,
      "end": 480744,
      "timestamp": "07:51"
    },
    {
      "speaker": "B",
      "text": "そうですね。",
      "start": 480744,
      "end": 482906,
      "timestamp": "08:00"
    },
    {
      "speaker": "A",
      "text": "英語はそこから勉強されたんですか?それとも何だろう?大学受験とか、なんかその時から、あとは大学に在学中とか、なんかどういうところで勉強は学習されました?",
      "start": 482916,
      "end": 495939,
      "timestamp": "08:02"
    },
    {
      "speaker": "B",
      "text": "そうですね。英語は、大学受験とかで勉強して、文法の基礎といったものはあったと思いますし、大学の中も私、学科が国際関係学科といったところだったので、英語について専門的に学ぶ機会もあったので、比較的ベースはあったというところですね。私がコーナーストーンに入るときは、スコア英語の入学するために必要な英語力として例えばTOEICで言えば850点あればESLとかなしにそのままコースを始められるしもし800点以上であればESL1ヶ月通えば入学ができるといった条件だったのでとりあえず特効時にはTOEICは845点あったといった状況ですねとはいえアウトプット、スピーキングだとかライティングだとかに関しては全く自信がなくて今でももう本当基本的には喋りたくないっていう消極的な気持ち。",
      "start": 495939,
      "end": 560420,
      "timestamp": "08:15"
    },
    {
      "speaker": "A",
      "text": "ですちなみに国際関係の何だろう学科とかだともうなんかそこらへん学校の中でもトイックとか受けたりするんですかあ、。",
      "start": 560420,
      "end": 571902,
      "timestamp": "09:20"
    },
    {
      "speaker": "B",
      "text": "そうですね。私の場合はそういった機会はなかったんですけども、代わりにあのTOEFLの受験のための勉強コースっていうのが追加で、あの受けられたりっていうのがあって、勉強はしたんですけども、まああんまり伸びた感じはしないかったですね。",
      "start": 571902,
      "end": 588936,
      "timestamp": "09:31"
    },
    {
      "speaker": "A",
      "text": "じゃあTOEICはもう本当にこっちに来るって決めてから勉強し始めたんですか?",
      "start": 588936,
      "end": 593824,
      "timestamp": "09:48"
    },
    {
      "speaker": "B",
      "text": "そうですね、あのもうその説明会を受けてからまたちょっと熱が下がってしまって1年ぐらいあの特攻の準備をおろさかにしてしまったんですけども急いでこの計画的にはそのコープとワンホリを使った特攻計画にしたかったのでそれまでに年齢的に思うと2023年の8月のタイミングで入学しないとちょっとキツキツになるぞっていうのがで、急いで勉強をしてっていう感じで、そうですね、3ヶ月ぐらいで頑張って取った記憶があります。",
      "start": 593834,
      "end": 632409,
      "timestamp": "09:53"
    },
    {
      "speaker": "A",
      "text": "ちなみに何回受けられたんですか?",
      "start": 632409,
      "end": 634590,
      "timestamp": "10:32"
    },
    {
      "speaker": "B",
      "text": "多分3回ぐらいですかね。3、4回ぐらい。",
      "start": 634590,
      "end": 639751,
      "timestamp": "10:34"
    },
    {
      "speaker": "A",
      "text": "1回目はちなみに何点だったんですか?",
      "start": 639751,
      "end": 642121,
      "timestamp": "10:39"
    },
    {
      "speaker": "B",
      "text": "1回目めちゃめちゃ低かったですよ。自分で模擬でやった時かな560とか、もう全然600点いったかなぐらいの頃で何か回をうごとに上げて。",
      "start": 642121,
      "end": 652553,
      "timestamp": "10:42"
    },
    {
      "speaker": "A",
      "text": "いけましたでもそれでも何ヶ月かで850までいけるのすごいねそしたら技術の面について聞いていきたいんですけど一応未経験で投稿ってことになると思うんですけど来る前は何か学習されたりとかしましたか。",
      "start": 652553,
      "end": 671916,
      "timestamp": "10:52"
    },
    {
      "speaker": "B",
      "text": "そうですねまず前提としてその仕事の中でウェブサイトがどういうふうに作られているのかだとかそのウェブ制作をする中でどういった流れがあるのかその要件定義をして設計をして開発テストローンチっていった流れは知っていたっていうことがまず基礎知識を持っていたってことがありましたでその渡航の前に一応自分でその学校は行くといえどもカナダで学校に行くとはいえども、自分で勉強しようと思って、あのオンラインのテックスクール、オンラインのテックスクールに、それは何ヶ月ぐらいのコースだったかな、確か3ヶ月ぐらいのコースを受講した覚えがあります。",
      "start": 671916,
      "end": 715528,
      "timestamp": "11:11"
    },
    {
      "speaker": "A",
      "text": "それはなんか完全オンラインなんかゆうでみみたいなのではなくて、なんかオンラインで先生が。",
      "start": 715528,
      "end": 720520,
      "timestamp": "11:55"
    },
    {
      "speaker": "B",
      "text": "いるタイプの学校なんですか?私としてはメンターの方がついてくれるようなシステムで受講した理由としては会社で10万円までは授業料を免除してくれるといった教育支援システムがあったので利用して、せっかくならば、DEMYUといった選択肢もあったと思うんですけども、せっかくならば、そういった教育システムも使ってスクールに始めようというのでやりました。",
      "start": 720520,
      "end": 756831,
      "timestamp": "12:00"
    },
    {
      "speaker": "A",
      "text": "それは何を勉強されたんですか?具体的には、なんか技術的な意味ではない?",
      "start": 756831,
      "end": 763457,
      "timestamp": "12:36"
    },
    {
      "speaker": "B",
      "text": "フロントエンドのフロントエンドコースで内容としてはhtmlcsjavascriptといった基本的なところからjquery最終的にはVue。\njsを使って何かプロジェクトを作ってみようといった。",
      "start": 763467,
      "end": 776039,
      "timestamp": "12:43"
    },
    {
      "speaker": "A",
      "text": "コースでしたそれを来るまでにとりあえず終わらせて来てからは学校で勉強するみたい。",
      "start": 776039,
      "end": 783787,
      "timestamp": "12:56"
    },
    {
      "speaker": "B",
      "text": "な感じそうですねちょっとあのそのスクールでの余談にはなってしまうんですけどもあの当時スクール主催のコンテストがあってそのプログラミング部門であのコンテストに応募したら最優秀賞を取ったりってところでちょっとあのでも応募者も多分そこまでも私の回が最終回だったので多分応募者自体とかも少ない結構小牙なコンテストがあったんですけどもそういったものもあってでそうですね実際にカナダに来てからは学校のその授業とユーデミでリアクトとかを勉強したりそれに加えてクラスメイトでチームプロジェクトをやろうというふうに決めてテック業界で働いたことのあるメンバー私含めて4人プラス学生さんなんですけども結構プログラミングオタク軍で知識も豊富すごい学習意欲も旺盛たチームでチームプロジェクトをやってその中でビットの扱い方とかチームでどう動くべきかといった開発の進め方を学べたのは大きかったですね。",
      "start": 783787,
      "end": 853334,
      "timestamp": "13:03"
    },
    {
      "speaker": "C",
      "text": "学校に行ってた時ってなんかアルバイトすべきか生活に足りないからアルバイトする人もいっぱいいると思うんですけどアルバイトをすべきかしないべきかみたいな議論あると思うんですけどさとみさんはして。",
      "start": 855060,
      "end": 867483,
      "timestamp": "14:15"
    },
    {
      "speaker": "B",
      "text": "ましたか私は実はコープに入ってからなかなか仕事先見つからないぞっていうのでちょっと貯金的な体力が尽きてきたのでもう始めざるを得なくて始めた。",
      "start": 867483,
      "end": 879806,
      "timestamp": "14:27"
    },
    {
      "speaker": "C",
      "text": "っていう状況ですねアルバイト何してたんですか私。",
      "start": 879806,
      "end": 883759,
      "timestamp": "14:39"
    },
    {
      "speaker": "B",
      "text": "はあのカナダのローカルのカフェのブレカでサンドイッチ職人としてサンドイッチを作りまくってました。",
      "start": 883759,
      "end": 890994,
      "timestamp": "14:43"
    },
    {
      "speaker": "C",
      "text": "でもなんかそこで英語力練習できたり英語のコミュニケーション練習できたりできるからいいかもみたいな最近はそうやって別のバイトで英語はやって技術とはまた別に英語のスキルを養ってっていう人も結構聞くから良かったですか?その点では。",
      "start": 890994,
      "end": 909300,
      "timestamp": "14:50"
    },
    {
      "speaker": "B",
      "text": "そうですね、やっぱり仕事っていうそのお金をもらって責任がある状態でコミュニケーションを取らなきゃいけないしかも英語でってなるとやっぱり話さなきゃとかってなって責任感も生まれますしミスがあっちゃいけないのでそこで英語力が失われるっていうのはもう私も納得でそこの英語力を伸ばすために実際に仕事をしてみるっていうのはバイトでもいいから仕事してみるっていうのは私。",
      "start": 909310,
      "end": 937430,
      "timestamp": "15:09"
    },
    {
      "speaker": "A",
      "text": "も賛成ですちょっと戻って、座学の期間について質問なんですけど、座学の期間はすごい、なんだろう、学校で言われていることに取り組み続けたんですか、それとも結構自分で、なんかさっきユデミとか、学校の人と勉強したっていうふうに言われてたんですけど、クラスの内容は結構フォローされてましたか、それとも結構なんだろう、やっぱり学校の中でやれることって限られてて、就職するには結構足りないと思うんですけど、そこらへんはどうやって。",
      "start": 937430,
      "end": 969137,
      "timestamp": "15:37"
    },
    {
      "speaker": "B",
      "text": "キャッチアップされましたか?授業をベースとしてそこから自分の中で身につけられてないなっていうところに関してものにするためにUDEMYだとかそういったチームプロジェクトの中で実際に自分で手を動かしてみて理解を深めていくことをしていました。",
      "start": 969137,
      "end": 991626,
      "timestamp": "16:09"
    },
    {
      "speaker": "A",
      "text": "なんかあのインタビューしていてこれまでの方たちは結構あの学校でなんだやることは結構できるだけサボってあの自分のやらないといけないことを勉強したって人が多かったんですけどどうでしたか結構なん。",
      "start": 993348,
      "end": 1008673,
      "timestamp": "16:33"
    },
    {
      "speaker": "B",
      "text": "だろう確かに私は割りかしサボり気味な方だったと思いますあの課題もあの必須なものであればもちろん提出してちゃんと卒業に向けてやるってのことはしたんですけれどもあの毎回毎回というかその授業のに終わりに授業によっては授業の後に宿題が出されたりしたんですけど基本的に先生のさんとしてはスタンスとしては人それぞれの予定があって忙しい人もいるだろうからできたらペースで良いよこの課題はって言ったその幅を持たせてくれたのでもちろん自分の中でやれるやりたい時はやっていってでもちょっとそのチームプロジェクトの方を専念したいとか別のことに注力したいときはちょっとやらなかったりいったことを挑戦してました。",
      "start": 1008673,
      "end": 1054130,
      "timestamp": "16:48"
    },
    {
      "speaker": "A",
      "text": "なんか先生だったりとか友達とかもちろん日本人も少しはいると思うんですけど英語が基本的にコミュニケーションなんだろう英語でコミュニケーションを基本的に取ると思うんですけど英語力は学校の中での座学期間で伸びたなと思いますか?",
      "start": 1054130,
      "end": 1069419,
      "timestamp": "17:34"
    },
    {
      "speaker": "B",
      "text": "いやー学校の中で伸びた感じはしないですね。どちらかというと英語のみだなって思うきっかけ、理由ですね。私、こっちで出会った彼がいて、お互いカナダ人ではなく、お互いの非英語圏の国から来ているので、コミュニケーション英語、大人言語として英語を話すという状況なので、日常的に話すことでスピーキングへの抵抗感というか、多少文法的に間違っていても、コミュニケーション、英語っていうのは結局コミュニケーションだから伝わるもんだなっていうのは自信を持って、英語を話すことへの抵抗感はなくなったと思います。",
      "start": 1069419,
      "end": 1114453,
      "timestamp": "17:49"
    },
    {
      "speaker": "A",
      "text": "時期的には、その時期には英語力が上がったなと思うけど、それは学校ではなかったって感じですかね。",
      "start": 1114453,
      "end": 1123370,
      "timestamp": "18:34"
    },
    {
      "speaker": "C",
      "text": "もう1個聞きたいんですけど、これりょうさんにも聞きたいんですけど、なんか未経験、未経験というか、あのウェブの勉強し始めた時って英語で勉強しました?それとも日本語のその教材とかも見たりして、まあ学校は英語だと思うんですけど、なんか自分で勉強するときゆうねみとか、英語でしたか日本語でしたかってどっちですか?",
      "start": 1123380,
      "end": 1147126,
      "timestamp": "18:43"
    },
    {
      "speaker": "B",
      "text": "日本にいたときは、スクールが日本語だったので、日本語。でも、こっちに来たときは、極力教材も英語で買って、できるだけ英語の字幕をつけたとしても、英語で見る。ただし、理解が難しいとき、概念的でもうつかめないってときは、日本語にして、なるほど、こういうことかって理解を深めるってことをしてました。極力英語を使うようにした方がよかろうという意識でやってましたね。",
      "start": 1147136,
      "end": 1175237,
      "timestamp": "19:07"
    },
    {
      "speaker": "A",
      "text": "僕たぶん今も昔も変わらないんですけど、なんか日本語って結構いい教材があると思うんで、なんか日本人ってやっぱりもの、なんか本だったりとかプロダクトをわかりやすく作るみたいなのはすごい上手だなと思ってて、だからこの本読みたいとか、この内容について知りたいと思ったときに、なんかいい教材があったら英語でも日本語でもそのいい方を選ぶみたいなのを僕はよくやってるかなって思います。例えばだけどこっちでよく使われるリードコードの面接対策とかってこっちの方がやっぱり教材がいっぱいあるんでそれは基本的に僕は英語でやるしただこの言語について理解するみたいな本とか教材を探した時に日本で結構いいのがあったりするんでそういう時はそういう日本語のものを使ってるかなっていうふうに思いますあとは英語から日本語になって英語の本が出て、それがなんか翻訳されて日本に来たものは英語の方が読みやすいんで、英語の本を読むかなって感じです。逆にどうですか、。",
      "start": 1175247,
      "end": 1241259,
      "timestamp": "19:35"
    },
    {
      "speaker": "C",
      "text": "さやかさんは?私も最近その技術書とか読むときは、まず英語の現象がないか調べてあるんだったらそっち読んでて、で、私も基本ゆうでみとか全部英語で勉強したんで、なんか英語の方が分かってるけど、頭の中は難しいな、説明が。日本語で考えるときもあるから、互換性がちょっとないときがあって、日本語で説明したいときに全く日本語で説明できなくて、でも英語も別にネイティブじゃないから困るときもあるっていうので、情報の日本語と英語の互換するのに苦労したなっていうのが働き始めてから気づいた。",
      "start": 1241259,
      "end": 1286808,
      "timestamp": "20:41"
    },
    {
      "speaker": "B",
      "text": "だから、。",
      "start": 1286818,
      "end": 1287238,
      "timestamp": "21:26"
    },
    {
      "speaker": "C",
      "text": "最近は英語ばかりでやることの方が多いかもしれないです。私は。",
      "start": 1287238,
      "end": 1293851,
      "timestamp": "21:27"
    },
    {
      "speaker": "B",
      "text": "日本語で学んでた時の問題点としては、やっぱりその専門的な単語で、これ、なんかどういうものか知ってるけれども、英語でどういう単語で言うのか、どういう名前なのかわかんないみたいな時に、結局、今仕事で働いてる時も、それ知ってるけど英語で言えないって時は逆にあったりするので、できるだけ英語ってした方が、私は自分のためだなと思ってます。",
      "start": 1293851,
      "end": 1319195,
      "timestamp": "21:33"
    },
    {
      "speaker": "A",
      "text": "確かに、説明を考えるとそうかもしれないですね。そしたら、就職活動について聞いていきたいなと思うんですけど、就職活動はどういうふうにされましたか?",
      "start": 1319195,
      "end": 1331820,
      "timestamp": "21:59"
    },
    {
      "speaker": "B",
      "text": "そうですね、まず学校でキャリアサポートのシステムがあって実際にエンジニアとしても働いたことのある人がレジュメを添削してくれるといったサービスがあったのでそこにお願いしてレジュメのベースを作りましたこのポッドキャストにも出られたことがある石さんが一緒にボランティアをやっていましてそのボランティアをやっていたってことから実際に医師さんが就職された際に自分がどうやって今の職を得るまで何をやったかっていったことをすごい根絶丁寧に週末2回に分けて説明してくださってでもそのやり方に則って応募をしてました具体的には医師さんがやられた方法としてはリンクドインに1日に3件ぐらい応募するっていうのを目標にしてレジュメットカバーレターも毎回カスタマイズして出すと大変になるので基本的にテンプレートを用意してあまり興味がないとりあえず出してみるかっていう時には名前だけ変えて出す結構この会社覚悟が高いジョブマッチ率が高いぜひ働いてみたいってところはカスタマイズするっていうふうなやり方を取られていたのでそれにのっとって同じように応募していまし。",
      "start": 1331830,
      "end": 1407948,
      "timestamp": "22:11"
    },
    {
      "speaker": "A",
      "text": "た名前を変えるっていうのはどこの何の名前を変えてたんですか会社。",
      "start": 1407948,
      "end": 1412235,
      "timestamp": "23:27"
    },
    {
      "speaker": "B",
      "text": "の名前ですねその応募先の会社の名前をマッチ率を高めるためにキーワードを散りばめるといったそういったカスタマイズをするかどうかって。",
      "start": 1412235,
      "end": 1420961,
      "timestamp": "23:32"
    },
    {
      "speaker": "A",
      "text": "いうところですねどのくらい前から準備し始めたんです。",
      "start": 1420961,
      "end": 1427785,
      "timestamp": "23:40"
    },
    {
      "speaker": "B",
      "text": "かそこに関してはちょっとあまり胸を張っているような感じではなくて実はその座学も終わってコープが本当始まったタイミングでレジュメとかを整え始めましたそのレジュメに書く内容自体はもう座学期間中からできるだけ書く内容を増やすようにしていて例えばポートフォリオだったりその個人のプロジェクトチームプロジェクトだったりを作ったりあとはボランティアの経験を積んであのカナダの現地での就労経験を積むって言ったことを座学期間中はしていまし。",
      "start": 1427785,
      "end": 1462658,
      "timestamp": "23:47"
    },
    {
      "speaker": "C",
      "text": "たボランティアってどうやって見つけたんですか。",
      "start": 1462658,
      "end": 1465819,
      "timestamp": "24:22"
    },
    {
      "speaker": "B",
      "text": "今に至るまで4件受けてるんですけども1個目はミートアップで主催している方があのウェブサイトを作りたいってところで募集されてたのに応募したのこと2件目はフロックのこれが医師さんと同じボランティアなんですけどもフロックのポストでボランティアの募集があってそこに応募したこと3件目はそこのボランティアしていたところのプロジェクトマネージャーの方からクライメットテックのイベントを主催するからそのイベントLPを作ってくれって言ったことでやったのと4件目は学校のジョブ。",
      "start": 1470116,
      "end": 1506871,
      "timestamp": "24:30"
    },
    {
      "speaker": "C",
      "text": "ポストですねすごいなんかボランティアでも見つけるの大変って結構聞いたことあるのでいっぱい機会があったんですねそう。",
      "start": 1506871,
      "end": 1517196,
      "timestamp": "25:06"
    },
    {
      "speaker": "B",
      "text": "ですねそういった意味だと私は多分ラッキーだった。",
      "start": 1517196,
      "end": 1519237,
      "timestamp": "25:17"
    },
    {
      "speaker": "C",
      "text": "と思いますボランティアって完全無休でした?",
      "start": 1519237,
      "end": 1523509,
      "timestamp": "25:19"
    },
    {
      "speaker": "B",
      "text": "そうですねうち3つは完全無休でイベントLPだけ優勝。",
      "start": 1523509,
      "end": 1528202,
      "timestamp": "25:23"
    },
    {
      "speaker": "C",
      "text": "でしたラッキーですボランティアの時の経験とか面接に行きたなぁとか思います聞かれました?どんな内容のことをやったんですかとか面接の。",
      "start": 1528202,
      "end": 1542248,
      "timestamp": "25:28"
    },
    {
      "speaker": "B",
      "text": "中でそうですね就活には確実に行きたと思いますやっぱりそのどういった経験をしたかというのでボランティアの経験を主に話しましたしやっぱりそのレジュメを取った理由実は言うとあのレジュメあのセナさんにあのフロックのセナさんにデビューしたいもらったんですけどもその時は結構めちゃめちゃ赤が入りまくっていったようなあまり何でしょうもう本当に完璧なレジュメではなかったんですけれどもそれでも通ったのはやっぱりカナダのそのボランティアの経験があったからかなぁなんて推測してます。",
      "start": 1542248,
      "end": 1577292,
      "timestamp": "25:42"
    },
    {
      "speaker": "C",
      "text": "セナさんでレジュメレビューしてるんだすいません。",
      "start": 1577292,
      "end": 1579873,
      "timestamp": "26:17"
    },
    {
      "speaker": "A",
      "text": "ちなみにどのくらいの期間探して最終的に今の職に就いたんですか?レジュメ準備されたのが本当にもう座学期間が終わってさっきの話だと結構長い間決まらなかったのかな?で、アルバイトを始めたってことだったんですけどどのくらいの。",
      "start": 1586420,
      "end": 1607197,
      "timestamp": "26:26"
    },
    {
      "speaker": "B",
      "text": "期間間があったのか?応募を始めたのが今年の1月の末、2月くらいで実際にその就職決まったのが7月末なのでざっくり6ヶ月ぐらいですかね結構辛いですよね辛かったんですけれどもあまり辛いとこう被害者ずらすることもできずであんまりこうバイトが始まって忙しくなっちゃったりとかで自分であの何でしょうその6ヶ月間も毎日張り付いて頑張って応募してたかというとそうではなくてもどちらかというともう就職できないだろうっていうマイナスな気持ち周りも友達、クラスメイトも日本に日本帰国しちゃって日本でキャリアを積むっていった雰囲気だったりだとかやっぱり就職難しいよねっていうのがもう周りでみんな言ってるので応募しても通らないだろうっていう後ろ向きな気持ちになってちゃったので本当にもう頑張って気が向いてお尻叩いて感じでやっていたので、実はいうとトータルは30件いくかいかないかぐらいの応募件数だったんですね。",
      "start": 1607197,
      "end": 1682171,
      "timestamp": "26:47"
    },
    {
      "speaker": "A",
      "text": "いやでもそれでもなんかあんまり日本でエンジニアしている人たちはイメージできないと思うけど、結構なんか送っても返信もないしなんか自分何やってんだろうとかって思っちゃうからやっぱり辛いのかなあとまあねお金のこととかもあるしその間ってやっぱりその働いてたり勉強をしたりとかっていうのもなんかやっぱストップしちゃうからなんか自分の人生何も動いてないなぁみたいになってちょっと辛いかなとまあなんかその中でもまあ自分でお尻叩いてできたすごいのかな。",
      "start": 1682171,
      "end": 1710136,
      "timestamp": "28:02"
    },
    {
      "speaker": "B",
      "text": "確かにあのメンタル的にはめちゃめちゃ辛くて本当彼がいなかったら絶対に日本帰ってただろうなって確信して。",
      "start": 1712240,
      "end": 1719266,
      "timestamp": "28:32"
    },
    {
      "speaker": "A",
      "text": "ますそういうなんだろう人がいて息抜きに息抜きができるってのは確かにいいかもそしたら今の会社の面接について聞いていきたいんですけどどんな感じの流れであのレジュメの出した後はどんな感じの流れで面接まあ合格するまでに合格するに至ったん。",
      "start": 1719266,
      "end": 1737102,
      "timestamp": "28:39"
    },
    {
      "speaker": "B",
      "text": "ですか面接自体は2回ありまして、むしろ逆に2回だけで、1回目はHRの方、2回目はテックの人を含めてHRの方と合計4人、あとHRの方とテックの方から2人出て、その3人の方と面接していました。具体的な流れで言うと1回目のHRの方については、よくあるビヘイビアルインタビューという感じで、なんで応募したのといった死亡動機から具体的な経歴を話したり、でも1個質問としてもあったのが、実際に開発を終えて公開した後、どんな作業をするって言われて、どんな作業?一応デバイスとかタップトップ携帯とかを使って確認したりしますみたいな質問を一応そういったやり取りをしたりっていったことがあり。",
      "start": 1737102,
      "end": 1794319,
      "timestamp": "28:57"
    },
    {
      "speaker": "A",
      "text": "ましたそれは電話ですかそれともZomみたいな感じ?",
      "start": 1794319,
      "end": 1799743,
      "timestamp": "29:54"
    },
    {
      "speaker": "B",
      "text": "2回ともビデオ会議でした。",
      "start": 1799743,
      "end": 1801924,
      "timestamp": "29:59"
    },
    {
      "speaker": "A",
      "text": "GgleMtoを使ってそれはもう慣れていましたかすでにボランティアとかもやってたって言ったからちょっとそれに似た状況みたいなのはあったのかなと思う。",
      "start": 1801924,
      "end": 1811752,
      "timestamp": "30:01"
    },
    {
      "speaker": "B",
      "text": "んですけどそうですね。実はそういった面接対策は、英語を話すこと自体については日常会話であればできるようになっていたんですけども、具体的な面接の対策って言ったことは実はギリギリまでしてなくて日付が決まって急いであの学校のそのキャリアアポートの人にモック面接をお願いしてやったりでもモック面接の時も結構ボロボロで途中で何も話せなくなっちゃったりたことを経験したのでなのでもう彼にお願いしても4,5時間ぐらいその面接の前日に4,5時間ぐらい練習したりたこともしてました。",
      "start": 1811752,
      "end": 1852584,
      "timestamp": "30:11"
    },
    {
      "speaker": "A",
      "text": "2つ目の面接は技術者との面接でエンジニアとの面接だったと思うんですけどどんな感じの流れでどんなことをやられたのか技術。",
      "start": 1854915,
      "end": 1866381,
      "timestamp": "30:54"
    },
    {
      "speaker": "B",
      "text": "者の方たちの面談の時も基本的には質疑応答という形でテックに関する質問具体的に言えばテストツール使ったことあるかとかプロジェクト管理ツール使ったことあるリアクトについてどう思うって言ったらどうだったり新しいライブを学ぶ時にどういう風に学ぶのっていうような質問があってそれに対しても必死になって返していたって感じだったんですけどもなので何か実現するのか行動を書いたり実現することだったりだとか課題を出されることはなかったんですねただその面接が終わったタイミングは実は正直英語がボロボロに自分でも感じていてその理由としてはHRの人はやっぱり何かしらコメントを返してくれてあの伝わってるなっていう感覚があったもののテックのやっぱりエンジニアの方々はすごいもう表情が硬くてあのこれは響いているのかどうなのかって言ったらもう不安になってしまってもどんどんどんどん緊張でなんか話せなくなるっていう悪循環が生まれてなったhrの方も正直この子大丈夫かなーってなんか不安ないそう不安そうな顔をしていたりで辛かったのと極めつけはあのテストツールについてあの授業で学んだだけで実際のプロジェクトで使ったことがなくてストレートそのテストツールについては使ったことがないって正直に答えたんですねただ逆質問のタイミングでテストツールについて勉強するので実際にあの音者で使っているツールについて教えてくださいともしてでもあのテックスタック教えてもらってそれが幸いのことに金曜日だったのでもう土日に急いでプロジェクトをあの作り上げてなんか簡単なそのトゥールリストのプロジェクトを作り上げてテストツールも実装してあのあの時答えられなかったけれども月曜日にあの時答えられなかったけれども実際にあのプロジェクトを使って勉強してみたからよかったら見てみてくださいってメールを送りましてその翌日の火曜日に実際にその日の火曜日にHRの方からすごい参考になるよありがとう助かるっていうふうなメールいただけてその合格通知というかその結果通知については木曜日に来る予定だったんですけども木金と梢めちゃめちゃソワソワしてたら月曜日の朝に今日時間あるっていうふうにメールが来てビデオ会議でオファーをいただくっていうような流れでした。",
      "start": 1866381,
      "end": 2027655,
      "timestamp": "31:06"
    },
    {
      "speaker": "C",
      "text": "フォローアップ結構こっちでは評価高く見てもらえたりしますよね後からなんかできなかった問題をもう一回解きましたと。",
      "start": 2029453,
      "end": 2037240,
      "timestamp": "33:49"
    },
    {
      "speaker": "B",
      "text": "かもうまさしくその話をちょうどフロックの動画だどういう媒体かだったか忘れちゃったんですけどもフロックで実際に就労された方々の経験談としてフォローアップで挽回したって言った話を聞いていたのでそれを活かしてそういったフォローアップでもやりきるって言ったら精神大事ってのが知っていてやりきります。",
      "start": 2037240,
      "end": 2062930,
      "timestamp": "33:57"
    },
    {
      "speaker": "C",
      "text": "あとはなんか金曜日にやったっていうのも良かったかもしれないですね。なんか土日に時間を稼げたっていうのと、あとなんか金曜日の午後って結構みんなゆるっとしてたりするからなんかインタビューするなら狙い目とかって言うけど。",
      "start": 2062930,
      "end": 2075607,
      "timestamp": "34:22"
    },
    {
      "speaker": "B",
      "text": "もしかしたらいやもうあの全く同意で私さらにラッキーだったのは金曜日だったせいかその面接のビデオを録画してくれててしかもその面接が終わった後にAIの議事録が私にも共有されて実際になんかテックスタックとかも何を使ってるっていうのを再確認できたのでめちゃめちゃ私は金曜日狙い目だ。",
      "start": 2075607,
      "end": 2104878,
      "timestamp": "34:35"
    },
    {
      "speaker": "A",
      "text": "なって思いましたもちろんフォローアップできたのはすごい良かったのかなと思うんですけど他にもなんかこれが良かったなみたいなのはありますか。",
      "start": 2104878,
      "end": 2114640,
      "timestamp": "35:04"
    },
    {
      "speaker": "B",
      "text": "ありがとうございます。ぜひお話ししたかったのが1点ありまして一時面接の時にHRの方と実際一時面接の時はこれ通っただろ絶対っていうのを確信というかいい終わり方をできたんですけども何をしたかというとその逆質問のタイミングで事前に会社のビジョンだとか価値観競合他社とかのその上を逆質問でしたらばHRの方がすごい反応よく返してくれていっぱい調べてくれてありがとう嬉しいよって形もすごい一番の笑顔をその場で見せてくれてそこから他の質問した時もフルリモートの仕事だったのでどうやってコミュニケーションとっているのって時もすごい初めで話した時以上にニコニコ明るく話してくれたのでやっぱりその企業についてちゃんと下調べをしてあの面接に臨むって大事だなって思い。",
      "start": 2116812,
      "end": 2175640,
      "timestamp": "35:16"
    },
    {
      "speaker": "A",
      "text": "ましたありがとうねえっとオファーの何だろう連絡についてはどんな感じでしたかそれとその後の流れについて。",
      "start": 2175640,
      "end": 2183702,
      "timestamp": "36:15"
    },
    {
      "speaker": "B",
      "text": "教えてくださいえっとオファーについてはそのさっきの月曜日にメールいただいてあのビデオ会議実際にGgleMtoも他の面接同じようにGgleMtoに入って初めにちょっとあのスモールトークをしてその後にオファーが決まりましたのでおめでとうというふうに結果通知をいただいてその中から実際に改めてその契約書をどういったドキュメントを送るよといったことを説明してくれてその後に実際にそのメールでミーティングで話していただいたとおりにドキュメントを確認してサインをしてでその中で1個ちょっと話に聞いてなかった話聞いてないぞっていうのが1個だけあっていろいろと面接が終わってオファーもらった後にちなみにだけどこうプロフェッショナルのプロフェッショナルな経験のリファラル2件送ってねみたいな風に言われて面接が終わった後にそんなリファラルがいるのかというのは私はちょっとびっくりだったんですけども幸いそのボランティアでやっていたりだとか元の会社でよくしてくれた上司の方がいたので実はその医師さんと元いた会社の上司とそのボランティアのプロジェクトマネージャーの方2件って言われたんですけど一応3件お願いして送りました。",
      "start": 2183702,
      "end": 2269493,
      "timestamp": "36:23"
    },
    {
      "speaker": "A",
      "text": "前の上司っていうのは日本からのことですか?",
      "start": 2269493,
      "end": 2272365,
      "timestamp": "37:49"
    },
    {
      "speaker": "B",
      "text": "そうです日本で一番長くいた時にお世話になった上司の方にお願いしました。",
      "start": 2272365,
      "end": 2277829,
      "timestamp": "37:52"
    },
    {
      "speaker": "A",
      "text": "それはメールでされたんですか?",
      "start": 2277829,
      "end": 2280952,
      "timestamp": "37:57"
    },
    {
      "speaker": "B",
      "text": "そうですねメールでそのHRの方からそのオファーのリファラル先の方にメールが行ってその方たちにもちろん英語でいろいろと質問項目質問について回答してもらっていったことがありました。",
      "start": 2280952,
      "end": 2299458,
      "timestamp": "38:00"
    },
    {
      "speaker": "A",
      "text": "なんか結構電話とかズームだったりすることも多いから日本の会社でもいいのかと思ったらじゃあそれは何だろう文章でのやり取りだと。",
      "start": 2299458,
      "end": 2307102,
      "timestamp": "38:19"
    },
    {
      "speaker": "B",
      "text": "かそうですね、メールで送るよっていうのが言ってもらえてたので、メールだったら文章でしかないだろうっていうふうに思ったので、お願いしました。確かに、。",
      "start": 2307102,
      "end": 2315258,
      "timestamp": "38:27"
    },
    {
      "speaker": "A",
      "text": "自社も大丈夫だし。",
      "start": 2315258,
      "end": 2316159,
      "timestamp": "38:35"
    },
    {
      "speaker": "B",
      "text": "はい。",
      "start": 2316159,
      "end": 2319283,
      "timestamp": "38:36"
    },
    {
      "speaker": "A",
      "text": "そしたら最後にちょっと公開してもらえるってことだったんで、言える範囲で年収について教えてください。",
      "start": 2319283,
      "end": 2326490,
      "timestamp": "38:39"
    },
    {
      "speaker": "B",
      "text": "はい。年収については、私あのインディードで応募しましてインディードのジョブポストにまあえっと55型から70型の間っていう風な書かれ方をしていてそのジョブオファーもらった時にHRの方からそのレンジの間ぐらいでどうだいっていう風に言われたので私としてはもう仕事もらえるだけで万々歳だったのであもうぜひともよろしくお願いしますの。",
      "start": 2326490,
      "end": 2351922,
      "timestamp": "38:46"
    },
    {
      "speaker": "A",
      "text": "で決まりました日本とくらべて、なんだろう、ちがいとか、どうだなと思いました?そのオファーをもらって。",
      "start": 2351922,
      "end": 2360463,
      "timestamp": "39:11"
    },
    {
      "speaker": "B",
      "text": "いや、もう、日本からくらべたら、私としてはもう、めっちゃ上がったっていうぐらいに、嬉しくて、実はその日本で働いたときも、めちゃめちゃ残業しても、450ぐらいだったかな、450万円ぐらいだったと思うので、もう、私としてはめちゃめちゃ上がりましたし、未経験からのジュニアのポジションで、こっちでも経験はあれといえど、その無給のボランティアがベースだったので、そもそも実を言うと私だったら、当初思ってたのは、もう55件の、550万の一番下で来るかなって思ってたぐらいだったので、上げてくれてありがとうっていう気持ち。",
      "start": 2360463,
      "end": 2402345,
      "timestamp": "39:20"
    },
    {
      "speaker": "A",
      "text": "最初はあれですよね、仕事もらえただけで、とりあえずありがとうございますって感じ。",
      "start": 2402345,
      "end": 2408175,
      "timestamp": "40:02"
    },
    {
      "speaker": "B",
      "text": "そうですね。残業を結構経験したこともあったので、残業なしでジュニアでいろいろと教えてもらえる立場で、1社目としては満足だなと。",
      "start": 2408185,
      "end": 2421415,
      "timestamp": "40:08"
    },
    {
      "speaker": "A",
      "text": "ということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcasyoubetなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2421425,
      "end": 2439548,
      "timestamp": "40:21"
    }
  ]
}