{
  "episodeGuid": "ce272287-4ed3-44ea-ab1c-b13feda40c83",
  "episodeTitle": "「世界で唯一の専門家を目指して」新卒からアメリカ企業で活躍するエンジニアのキャリア戦略（後半）#4",
  "transcribedAt": "2025-10-19T21:41:07.203Z",
  "duration": 2365,
  "fullText": "はい、そしたら前回に引き続き今回もなおとくんに来てもらって今回はまあ後半で就職したその後みたいなことについて話していきたいと思いますよろしくお願いしますはい、お願いしますそしたらすごいざっくり働いてみて今どのぐらいでしたっけ?ちなみにまだ3週間も経ってないあ、そうなんでそんなになんか多分話せることあんまないかもしれないっていうちょっと感じですかでもまあ頑張ります、。はいいや、全然。また、長くなった時にまた撮らせてもらえればと思うんで。もちろん、。もちろん。でも、いつも、いつもというか、いつも、記事とか含めて、結構、日本との違いとかって結構聞くんですけど、直人くんの場合は、インターンだけだから、本当の社会人経験はないところだから、あれだよね、ちょっと変わってきますよね。そうだよね。比較のしようがないもんね、。だって。そうそうですね、その日本でインターンしてたところももうスタートアップみたいな感じなんで、多分全然そのカルチャー、日本の普通の会社とは全然違うと思うので、。そうですね。しかも前回も言ってたけど、1000万の給料を、1000万の年収の給料をパッと最初からもらえちゃうんだもんね、すごいですよね。そうだよね、間違いない。それは自分がすごいっていうよりは、やっぱカナダと業界っていう感じ。だと思いますね。とはいえねやっぱりそのもちろんいろんなあれがあって大学行けてその今の会社に就職してでまぁカナダの物価の高さとかいろいろありとはとはいえやっぱりその高校生の時にIL2まあ6。\n5取ったりだとかその海外の大学に向けて準備したりだとか海外の生活もう大学生から一人で海外で生活したりとかやっぱなんだろう頑張ったところがすごいたくさんあるんだろうなって思いますけどねありがとうござい。ますでもねむちゃくちゃ費用対効果のいい多分投資をたくさん自分にしてきた結果じゃないかなってやっぱ思っ。ちゃうもんねそこは自分といえば親がやってくれたって感じですちなみに親。のそういう方針だったんですか海外行ってこーいだったりとか今はね。今更やけど確かに結構ま。あその親はあの海外行った方がいいんじゃないかっていうのは言われてたんでそのそんな絶対行けみたいな感じではないんですけど全然行きたいなっていう風に言ったら確かに行った方がいいと思うよみたいな感じでは。ありましたちなみに、どの程度手助けがあったんですか?僕、例えば、SFUなんて知らなかったし、UBCなんて知らなかったし、なんなら海外の大学って、。うん、。ハーバードって聞いたことあるかぐらいの、いけるわけもないんだけど、すごい雑魚な考えの高校のときとか、特にあれだったんですけど、どんな感じの、なんだろう、大学を決めるプロセスだったりとか、大学を申請だったりとか、どの程度助けてくれてって感じだったんですか?まあ、親からの助けはそんなになかったですね。ほとんどまあ、大学のどこ行きたいかとか聞いたのは、それこそ僕がさっき言ってた、ずっと助けてくれた大学後の人からとか、カナダの大学に行ってたんで、そのそこから聞いて、その人から聞いてみたいな感じですかね。あとブログとか、海外の大学についてのブログとかがネットにもあったんで、それ読んでみたいな感じですかね。メンターの強さよねブログとかだけであるんだったらこっちだったらねもうubcトロント大学くらいしか出てこなさそうな気がするからで。もあの1個そのすごいモータールー大学についてっていうブログがあるんですけどそのブログが僕一番最初に見てすごいそのコーププログラムっていうのをそれで知ってあのすごいなーってあのそれ行きたいなーっていうふうに思ったのがそれ初めてあれですか。ねちなみにもし良ければどこ他に受けたんですか?すごいちょっと気になってた。んだけどWaterloとショッピファイって会社知ってます?もちろん大学と提携してるデプディグリーみたいなやつがあったんでそれも聞いたところによるとすごい倍率が高かったらしいので全然ダメだったんですけどそれとあとはUBCですかねあとSFって感じですかねであのSFにしかあの受かれなかったんであのSFに行ったみたい。な感じですねいやでも十分すごいですねその申請僕申請すらも高校生の時絶対できないもんねまあ僕ちなみに英語力ゼロだったんであの高校生はまあ申請も何も読めないあのホームページ読めないんでもうレベルが違いすぎてコメントのしようがないけどまあまとめるとすごいって感じですね僕。は君たちと違って大学すら行ってないからもう何。も言えへんちょっとまあいろいろ脱線しちゃったんですけどざっくりいろいろなんかなんだろうまあ3週間だけど働いてみて。どうですかまあそうですねあのまあインターンの時にあのやってたやってても同じことはやってないんですけどあの勤めてた会社で同じマネージャーのとに帰ることができたんでほぼ知ってる人なんでもあるそれは良かったな。オンボーディングはまあじゃあ終わったかなすでにオンボーディング。ってあれですかねなんかあの人事系のやつですかね。人事系のやつだったりとかなんか会社によってはなんかブートキャンプみたいななんかなんかハッカーソンみたいなのがあったりとかまあなんか会社によっていろいろなんですけどそれはなんか結構。インターの時にやってたんでまあいいんじゃねみたいな感じでなくなったみたい。なインターの時はどんなオンボーディングがあったんですか。ちなみにインターンの時はだからそれこそなんかもちろんそのなんか人事系のビデオを見たりとかしたりしてあと今も見ましたけどもちろんフルタイムに戻った時もでもあとなんかそのメンタープロジェクトみたいなのがあってメントープロジェクト123みたいなで1とかほんとすごい簡単ななんか本当にタイプを直すだけみたいなやつから始まってで2個とかはちょっとなんかちょい複雑になってるけどまぁそのなんかちょっと関数1個作るぐらいなってで3になってほんとなんかちょっと複雑になっていくみたいな感じのやつをそういう形のあの進め方でインターンがありましたそれ終わったらあの実際のインターンプロジェクトやるみたいな感じですか。ねじゃあインターンの時にはオンボーディング終わってえっと今はじゃあもう割と1週間目2週間目ぐらいからすぐにまあ本業務みたいなのに入ったって感じなんですか。まあそうですねでも本業務って言ってもちょっとなんかもう難しすぎてちょっと難しいとかなんかニッチすぎて何やってるか分かんないんでちょっと頑張って今何やってるのかなみたいなのをちょっと頑張ってキャッチアップしてるみたいな感じですねなんか。言えること言えないこととかあると思うんで言える範囲で実際にチームがやってることプラス会社がやってることみたいな業務の内容みたいなのがあってもいいです。かまず会社がやってることから始めた方がいいと思うんですけどアリスタネットワークスっていう会社なんですけど簡単に言うとデータセンター向けのネットワーキングスイッチっていうのを作ってる会社になります僕もそれ聞いてもマジなんだよみたいな全然分かんなかったんで誰も知らないと思うんですけど簡単に言うとデータセンターっていうのはいっぱいコンピューターが例えばGogleとかマイクロソフトとかそれと多分Amazonとかも例えばクラウドサービスを運営するときにすごいたくさんなんかコンピューターを使うんですね例えば何個使ってるか僕わかんないんですけど100万個例えばそのコンピューターが使ってたくさんのリクエストだったりすごいダイアリストのインフラとかが成り立ってるんですけどでそのデータセンターの中に100万個例えばコンピューターがあったとしてコンピュータAからコンピュータBに例えば情報を送りたいみたいなことが結構結構てかまあめちゃくちゃあるんですねそういう時にコンピュータAからコンピュータBに情報を送るのに基本的にあのネットワークで繋がってるんですねそのネットワークっていうのはその例えばイーサネットとかって言われる本当にその例えばケールでこう繋がってるみたいな感じのイメージが多分いいと思うんですけどそういうネットワークで繋がってたときに例えばコンピューターAからコンピューターBに情報を送ろうってなったときに情報を送るときにBってどこにいるの?みたいな例えばCと何が違うのか住所みたいなのがあるんですけどAから情報が出るときにお前こっち行けお前こっち行けみたいな交通整備みたいなことをやってるのがネットワーキングスイッチなんですけどそれを作っている会社なのでちなみにその会社はネットワーキングスイッチも作っているんですけどそれに乗っかるオペレーティングシステムも作っているそこが主なビジネスというか強みなんですけどネットワーキングオペレーティングシステムを作っている会社に今勤め。ていますなんか具体的にはどういう会社とかで使われてるんですか?それこそAmazonとかそういうコンピューティングのSaaSなんだっけ?AWSとかそこら辺が使われてるイメージなんですか?一応多分一番の顧客がMicrosftとMetaビジネス的には基本的にB2Bみたいなもうそうですね完全にB2Bの会社ですね数百。万のそれこそ情報のやり取りをするPCとかがないと必要ないもんねそういう会社というかシステムが情報のスイッチするっていう情報のシステム自体がねそうですね。その中でもチーム的にはどういう分野を担当されてるんですかそうです。ね僕の分野はさっきオペレーティングシステムを作るっていう話をしたんですけどそのネットワークエンベロープシステムもめちゃくちゃ大きいチームだと僕はそこに入っているチームでその中でもそのハードウェアに依存するものを書かなきゃいけないところとそのハードウェアに依存しないプラットフォームに依存しないプログラムがあるんですね例えばそのハードウェアだとハードウェアを例えば制御したりというか正直僕わかんないんですけどその辺はあの多分ハードウェアについての例えばその最適化だったりとかっていうのがあったり多分すると思うんですけどそういうのがあったりで僕のチームはそのハードウェアに依存しないあのもうジェネラルなあのもので例えばそのライティングプロトコル例えばそれこそえっとBGPとかあのOSPFとかっていうなんかそういうすごいそのラーティングプロトコルをなんか実装する二人とかあとそういうそのプラットフォームに依存しないなんかなんてことをやるっていうみたいなとこのでっかいチームの中の一人みたいな感じですか。ね本当にトガシさんが前回言ってたように、ワイルドソフトウェアばっかり作る会社がバンクーバー無茶苦茶多い中で、ガチガチにシステムのネットワーク側に入っている、しかもそんなに大きい顧客を持っている会社なんてあったん。だって思ったもん。確かに。大きさその企業の大きさで言うと結構マンケーバーでも大きい方なんじゃないかなと思いますかねあの従業員数はそんなに大きくないんですけど多分今4千いく何人とかじゃないですかでも多分あのなんか時価総額レベルだと結構あの大きい方だと思いますねあの会社はいや。すごいなぁそういうとこに入れるのってやっぱりそういうこっちの優秀な大学生なんだってちょっと一瞬思ったわもう。ちょっと何言ってるかあんまり分から。なかった8分くらい分からなかったもんでもネットワークをとりあえず司るスイッチだったりねそういう情報のそうそう情報のとりあえず統制を取るシステムとを作ってらっしゃる会社っていう認識だったらいいですよねとりあえずそうですそうですちなみにシンプルに疑問だったのがえっといらっしゃい直人さん以外にニューグラッズっているんですか?ちなみに全然いますよその人と一緒にインターンしてた人とかアーロンショーを入れるつもりですはいそうな。んだしなかった会社的には何人さっき規模何。によっても陽性に陽性。になんでその中でソフトエンジニアみたいなその総エンジニアのポジションはどのぐらいあるんです。か多分2千半分以上絶対いるんで僕の会社すごいエンジニアファーストの会社なんで多分そういう創業者も全員エンジニアみたいな感じなんです創業者がなんかそのサンマイクロシステムズとかって知ってます?もちろんもちろんあれの創業者が僕の会社の創業者なんですごっ結構そのエンジニアというかエンジニアファーストの結構。会社なんですね中でチームは今何人ぐらいの?なんか難しいんですよなんかチームっていうよりプロジェクトベースで結構動いてるんであんまなんかチームっていうのがないんですよだからその例えば僕のそのマネージャーにその下にいる人は何人とかは例えば15人ぐらいはいるんですけどでもその中でも全然プロジェクトによって違うんでもうあれですねあんま関係ないって感じですね。プロジェクトベースなんで面白いねーまあ合理的っちゃ合理的なのか各プロジェクトチームによってもね多分得意なプロジェクト不得意なプロジェクトあるだろうからそういう意味だとチームで縛らなくていい方がいいよねっていう判断なの。かないやまあ多分僕なんかそのもともとその入ってたチームがあったんですけどそのチームがなんかもうほぼなんか昨日とかも終わっちゃってそのチームがもうなんかもう離散するみたいな感じでプロジェクトベースになってたみたいな多分。感じはあったね流れでっ。てことかじゃあ多分そうだ。と思いますねでえっとそしたら一応マネージャーには15人ぐらいいてその中の今うちの1人みたいな感じですねそうですねで、新入社員というか尚人くんみたいなポジションで入ってきた人はどのぐらいいるんですか?いやだからそれこそ1年に多分何人みたいな話なんですよなんかその何僕みたいにその結構カナダってその一斉入社じゃないじゃないですかだからあんまわかんないんですけど多分まあ10人は絶対いると思うんですよね1年に入ってきてニューグラッドでだから10人以上20人いるかなーみたいな感じですかねわかんないですねそこまではこんななんかみんないつ入社したのみたいなのも聞かないんですそんなにまあその中に人じゃない限りでも10人は絶対いる。と思いますなんとなくインターンは一斉入社なのかな。って思ってました僕は。インターンのリターンオファーをもらった人たち?それも卒業によっては違うんで、。相談です。すごいね、でも年間で換算したとしても10人から20人、10人以上20人未満かアメリカのやっぱり会社じゃなくてバンクーバブランチでっていう風に考えるんだったら結構ちゃんと入ってるんだなって思いました。いや多分ですけど1番とかないですけど2番3番目ぐらいなんじゃないですか大きさでも。まあこれは今昨今の流れの話になっちゃうかもしれないけどねやっぱりまあlm代等してきてジュニアとかニューグラッツが主入社するなんてことを非効率的じゃないかみたいニュース多いじゃないですかなんかそんな中でもやっぱりsfuまあに限ったらしやなくニューグラッツでやっぱり入れるっていうのはその会社の方針としてなんかあるんですか人を育てるのが大事。だとか僕はそこまではちょっと分かんないんですけど会社の方針としてソフトウェアのクオリティが一番大事っていう方針が会社であって正しいことをするっていうとクオリティが一番大事っていう方針があるのでそういう意味でも多分僕が予想するに人がやらないとダメじゃないいけないっていうふうに思ってるんですか?品質をやっぱり重視するっていう社の方針としてはやっぱり人間がちゃんと絡まないとそれは話にならんよねっていう多分そこはあるってことだよね多分ね。そうじゃないかなって僕は今予想してますそこまであの聞いたわけではないんですけどその品質が大事っていうのはもう確実に会社がずっと言ってること。なんで。いや結構そうフロックみたいな仕事してるとよく聞かれるんですよやっぱニューグラッツに限ったんじゃないけどこっちで新卒等で今後仕事なんか見つかる人なんかいるんですかみたいなねあの今からの時代AIじゃないかみたいなやっぱ今からCS勉強するとかってなるとなおさらそこ多分心配でまあそういう意味で言うんだったらでもそういう今ねあの直さんがおっしゃったようなやっぱり品質を例えば重視している会社だったりまあこれからも人にやっぱ頼り続ける会社はそりゃいるんだろうからそういうところ頑張って狙いましょうって話になるのかなどうな。んですかねやっぱり少なくなってはいますよねやっぱりそういうその日その多分かなり多分うちの会社はそのそれこそがネットワーク壊れるともう大損害なんでめちゃくちゃ品質を大事にしている会社なんでっていうのがもしかしたらあると思うんですけどあのそうじゃなかったらもしかしたら違うかもしれないんでそのそうですねだから全体的にどうなっていくかっていうのはまあよくわかんないですね。なんかそれこそこの北米エリアではやっぱりなんかエンジニアとかソフトエンジニアかっこいいみたいな時代があったけどちょっとやっぱそうじゃなくなってきちゃってるというかなんか前世紀ではなくなってるんだなみたいなのがやっぱひしひしと感じます。よねそうだよね5。年前ぐらいはちょっともしかしたら僕がそれこそあのなんていうんですか大学入学した時はもうイケイケみたいな感じだったんですよ。確かに確かにいや減ってくんだろうなここから多分そう。ですね結構やっぱり自分の会社でもAIの進出怖いなみたいなやっぱ奪われるのかなみたいな感じで人も結構多いみたいで僕は結構楽天的なタイプなんであんまりそうなったらそうなった時に考えようぐらいで確かX。か何かの投稿で統計取ってたよね国ごとによってAIの進出に関してワクワクするかそれとも怖がっているかみたいな北米圏は軒並み全部ビビってんだよね確か仕事が奪われるとかストライキーとかなんかそっち方面でアジア圏のところはもうびっくりするくらいワクワクしてて俺らの時代きたみたいなで日本はどちらにもならないって。いうね。前は僕AIって聞いてAIに仕事取られるって聞いた時にソフトエンジニア取られたらそのAIに変わられたらその前にいろんな職業変わられるでしょって思ってたんですよって思ってたんだけどこの頃思うのはその中でも肉体労働をしてるのはまだ変わられないなっていうやっぱり人間でいう脳みそみたいな部分はAIでできるけどやっぱそれを体がないとその肉体労働はできないじゃないですか体をつける途端にやっぱり一台一台というかあのコストってめちゃくちゃ高くなってくるじゃないですかなんかSaaSみたいな感じでそのパソコンみんなが持っててその中でそのソフトウェアを使うっていうのは一人一人のには安くなるけどなんか前々からあるけどやっぱりなんかレストランにあるロボット、レストランであのなんか給仕ロボット。みたいなやつねそう、。給仕ロボットみたいなのってやっぱりまだ全然流行ってないじゃない。ですかなんでだろうねそれ。とやっぱりコスト高いんじゃない。ですかコストなのかなぁ。結局はだからやっぱなんかちょっと肉体労働が絡むところはやっぱりまだまだ取って変わられなくて実はやっぱソフトエンジニアとかパソコン一台でできる仕事とかが一番最初に取って変わられるんじゃないかな。って話があるだろうねー思っ。てきました僕はこの頃。なるほどねちょっとじゃあ転職考えよう。みんなでみんなで考えるんですかトラックドライバーとかどう?でもドライバーもダメか自動運転って言うもんねだから。それで言うとまあパソコン一台ではないからやっぱそのドライバーってその交通整備ができてからじゃないといられないじゃないですかまあまあ確かにねそういう意味ではまだやっぱり時間かかりますよねその交通省みたいな日本で言うとそういうところとちゃんと連携してなんか交通整備ができるようになって自動運転できるようになりましたみたいな法律も整備されましたってなってくる時間の余裕はあると思うんでまあなんかそういう意味ではトラックドライバーもありな。のかもしれないじゃあ狙おう。みんなで。何の話やねん。っていうねすごい脱線しちゃったけど僕もう一つ聞きたかったのはその結構やっぱ何回も出てる通りそのプロダクトエンジニアが結構まあ人気というかまあよくみんなが行く分野である中でそのちょっと違うところに行こうみたいな思ったのは理由があるんですかそれともなんかどっちでもよかったみたい。ななんかそれに関してはもう僕がそのそういうのがあのに興味があるからっていう感じですかねそのプロダクトを作るとかいうよりも僕結構そのコンピューターサイエンスの理論そのAI系とかは全然わかんないんですけどその型システムとかなんかそういうあとシステム系のこととかも研究もしてたんで研究もそのソフトエンジニア系の研究だったんでそういうのも結構その低レイヤー寄りというかあんまりそのプロダクト開発に生かさないような技術が多いんで自然とまあそういう会社に行きたいなっていうふうに思うようになったって感じですかね。そういう人とか言ってまとめちゃいけないと思うんですけどどういうモチベーションでちなみに働いてるんですかなんかプロダクトエンジニアすごい分かりやすくて今回のプロジェクトめちゃくちゃインパクト高いとか自分が出したプロジェクトなんかデータとかでめちゃくちゃ何だろう使われてるとかそういうのって結構モチベーションになったりだとかフィードバックが来たりだとかで結構そこでモチベーションって出てきたりとかすると思うんですけどなんかどういうことをなんかそのプログラミングだったり仕事してる間楽しいなみたいな思うですか今。ちょっと仕事はそのまだ3週間で始めたばっかなんでちょっとそれを置いておく一応その一応僕が今までやってきたことの延長戦ということで話すんですけど結構単純にその面白いあの興味なんかやってって楽しんで、もうちょっと知りたいからやってくみたいな、そういう単純なモチベーションですかね。そんなになんか、そうですね。じゃあ、もう興味とか知識を置くみたいなところを。まあそうですねこれがこうなったらどうなるんだろうみたいなそんな感じで面白かったからずっとやってるみたいな感じです。かねそうよね不思議に思うところは正直あるよね俺も前プレイステーションの基盤のセキュリティエンジニアをやってらっしゃる方と喋った時に同じ質問して何がモチベーションなん?って言ってしまったんやけどやっぱりセキュリティフォール見つけてすごく気持ちよくなった瞬間みたいなことをおっしゃってたりするからそういう問題完結した瞬間とかその人なりの気持ちいい瞬間は多分あるんだろう。ねおそらく確かにもちろんねプロダクタエンジニアでもやっぱなんかその見えないところだけど内側でどうなんかすごいスマートに解決なんか問題を解決できたら楽しいとかパフォーマンスめちゃくちゃ上げられたとかもちろんそういうのもあるんだけどなんかなんだろう僕たちの中でもやっぱり低レイヤーの人たちって結構なんだろうナードでかっこいいみたいなやっぱり喋ってて何言ってるかわかんないし低レイヤーの人たちは色々頭も良くてなんかねすごいそれこそなんかハッカーみたいな僕たちの中でもまだある。あるあるあるしこれさっきのエアーの話にリンクしそうやけど今さやっぱり低レイヤーをむしろ勉強するべきじゃないかっていう問い合わせやっぱフロックに来てて多くてまあ理屈としては正直そのねLMの時代でっていうところで表面的なじゃあパソコン次第でっていうところは変わらないかもしれないけど言うて低レイヤーにやっぱりAIが触り出すのってまだまだ先なんちゃうのみたいな多分文脈でなんかその辺は実際Naotさんの周りとかどうすかそのLMの進出で自分たちの仕事が奪われるかもってプロダクトほどはやっぱりなんか悲壮感がないというかそんな雰囲気が。僕の会社だってことですかどうなんですかねでもやっぱりまあそんなにまあどうなんですかねそれに関してはなんか僕は結構あの自分では心配してますけど僕のまあ今僕も全然専門性がないんで今今あのそれであの自分は心配してるんですけどあの他の人はちょっとどう思ってるのかちょっと今度聞いてみ。ますねまあタイミングがあれば。ねでもなんかあのあれなんですよやっぱ面白いなって思うことをやるのがいいんじゃないですか?わかんないですけどそれは本当。そうですねうん確かにそう。ですね本質的なところに戻っていくっていうので。そしたらなんかカルチャーみたいなところまあ会社かまあ会社以外でもいいんですけどねあのなとくんの場合は日本ではまあスタートアップみたいのインターンみたいなのしかしてないと思うんで日本の会社とここが違うみたいなのはあんまないかもしれないけどなんかまあ感覚なんだろう日本まああの会社の外でも中でもなんでもいいけど、これは全然日本と違うなみたいなこととかって感じます、。日々で。日本と違うかはわかんないんですけど、他の会社ともしかしたら違うかもわかんないんですけど、さっきも言ったクオリティーを重視するっていうカルチャー。は僕はもうめちゃくちゃ好きでっていうのも他の会社もどんな感じかわかんないですけどうちの会社めちゃくちゃテスト書くんですよテスト書くめちゃくちゃ書くし結構その例えばそのユニットテストはもちろんですけどインテグレーションテストもあるしみたいなのもあるし実際にそのテストがぐるぐるぐるぐる回ってるみたいなをのがあってすごいなんかテストをプラスあの例えばその機能を例えば改善したいって時に例えばリファクタリングが必要になった時とかそういう時ももう全然もうokみたいな感じの絶対やったほうがいいよみたいなそのクオリティをすごい重視する文化があるんで僕はすごいそのそれが好きだ。なっていうふうに確かにそのリファクタリングをもうやってやっていこうみたいなのはこっちは強いかもしれないですねなんか僕も日本で動いてんだから触らなくていいじゃんみたいなのはやっぱり結構あるあるなのかなもちろん日本でもいい会社だとね大きい会社だとできるっていうのもあるだろうしこっちでもやっぱり小さい会社でどんどん機能出していこうみたいなところだとやっぱりリファクタリングは後でいいんじゃないかなみたいなどんどん開発がしにくくなっていくみたいなのは小さい会社だったらあるしでもテスト書くの好きなんですね僕は嫌いだしこの頃AIとかの回答によりなんかテストを書くの結構簡単になってラッキーとかって思ったりして。いやテスト書くの自体はそんなに僕好きじゃないですよねユニットテスト書くとかはそんな好きじゃないですけどちゃんとコードが動いてるっていうのを確かめられる文化それが大事だなと思うんでそれ。で言うとどっちなんだろう?日本の方がなんか品質を大切にして先送りに、そのなんていうの、あのシップメントってかなんかその出すのを後にしそうなイメージはあるけどこっちは?それだからあれでしょ、本当に会社寄るんじゃない?日本のやばいところってさ完全にブラックボックス化してることじゃないですかあのもう銀行が超有名やけれどもさあのもう誰がどう触ったかもわからないものがどんどんどんどん炭素車変わっていって何がどうなっているかわからないっていうのを引き継いで動いているからもう触れないみたいななんかそういうのが一部のやばいところでそれは正直トップがエンジニアでもなんでもないし結局そのエンジニアリングの質品質っていうのがどれだけ重要かが系層が理解してるんだったら割と東海オンエアさんの言うとおりテスト大事品質重要視っていうのはあるだろうけどやっぱりトップがエンジニアリングに対してファーストで考えられてないところが多いからブラックマークスっていうのが多いなと日本の印象に関しては正直思う。ねでもなんかこっちでもやっぱサース多分これはそれこそサースの会社が多いと思うんですけどとりあえず出しちゃうよみたいななんか出す時もその何パーセントなんか大きい会社とか特にやってると思うんだけど何パーセントに出してあのちょいまあなんか自分たちの中でもまあテストするんだけど外を出しながらテストもしてなんかあったらすぐ直すみたいなそのイテレーションどんどん回してこいよみたいなのはあるんでその品質はもちろん良いのは良い方がいいんだけどなんかあるなんだろうある程度のところでもう出してどんどん回していこうみたいなのはあったりそれで言うと、まあやっぱなんか低レイヤーでとか、その会社によりけりな部分はありますよね、その会社とかも。そうですね、。それとジェンスの違いでもありますよね。確かに。確かに。ハース系でだってそんな品質側とか言ってたらね、もはや仕事にならないもんね、。一部は。まあ、そうですよね。そうですね。そういうことでも、たぶん、あのうちの会社とか、たぶんネットワーキングのところが壊れたら、たぶん結構大変なことになるんで、。確かに。あの、ていうってことだと思う。んですよね。そしたら今後今の結構多分やられてることがすごい好きって感じだと思うんでそれこそプロダクトエンジニアだといろんな会社回ろうみたいなのってあるけどあんまりだからそのポジションは少ないわけじゃないですか他のそうですねプロダクトエンジニアに比べてなんかどういう風なキャリアを進みたいなみたいなのってありますか。そうですねまあ自分はそのなんか今は全然もうまだ全然犯人前なんですけど将来的にはそのなんか世界でもなんか結構自分一人しかできないぐらいの専門性を持ちたいなっていうふうに今はそれがまず目標というかいうふうに思ってるのでそういう方向に行けるようなソフトエンジニアになりたいなっていうふうに。思ってますねそういうの、具体的にはどういう感じなんですか?あんまりイメージができなくて。僕も全くわかんないんですけど、勝手にそれは言ってるだけなんですけど、だから、それもなんか模索中というか、感じですか。なんか分野としては、例えば、ソフトウェアテスティングマニュアルのテスティングじゃなくて自動ソフトウェアテストがすごい研究でもやってたんですごい興味があるしあと行動の信頼性というかそういうのにも僕は興味があるんでそういう分野だったりとかっていうのに進めたらなっていうふう。に思ってますなるほどね。そうするとやっぱり北米とかアメリカとかメインで行こうかなみたいな感じなんですか?それともなんか日本に帰ったりとか、またまたヨーロッパに出てみたりみたいな、なんかそういうのは考える?そうですね、それに関してはまあ35歳ぐらいまでに頑張って一人前になって、そこからは日本に帰ろうかなっていうふうに思ってます。日本でもそういう会社ってあるんですか?そういうことができる会社だったりとか、そういうポジションみたいなのって募集あるんですか?どうなんですかね、全然だからそれもわかんないんで、それも自分で見つけていかなきゃいけないなっていうのがありますね。それこそ、本当に世界に1人ぐらいになれれば別に場所とか関係ないなとも別。にそれは思ってますね。あとは、データセンターで言うと別に必要なのは、北米だけって話じゃないから、なんか、今はまだないけど、そのAWSとかね、あのGCPみたいなのが日本でもできてきたりしたら、そういうところが使ってくれる。それこそ、ネットワークスイッチみたいなものとかも、開発とか、日本の独自のとかができたりするのかな。どうなんですかね確かにGogleは多分データセンター日本にあるってことですよね。そうだよねどこだったっけなんか地震が少ない地域がどちらこちらっていうなんか見た気がするけどそっかデータ。センターは地震と関係してく。んだねえそういうの知らない思ってたらそうだよねっていうねそりゃそう。だっていうでもそうですね、僕は日本に帰ろうと思ってるんで頑張ってその北米ででもやっぱりその自分のなりたいエンジニア人というかまあ国境のパス的にはやっぱり北米で経験を積むのが一番いいんでなるべく北米にその1、2万円になるまで空いてその後日本に帰ろうかなっていうふうに思って。ますなるほどね35っていう数字でちなみにどっから出てきたんですか?なんかあった、。あるんですか?僕の指導してた教官、あの教授の年齢がだいたい35歳とかそのぐらいでその人はあのその世界に一人と言ってもいいぐらいのあの知識だったりあの実績を持っている人なんで僕もそろそろそこにしようかなってまあとってはつまそれより年に置いちゃうとまあの勝手にまあ正直ランダムな数字ではあるんですけどあのそれより年行っちゃうとあのもしかしたらその日本で働き出すのがちょっと厳しいのかなとちょっと思ったりもって感じです。そのぐらいが一番フレッシュというかその時に働き出せるかなっていうふうに思ってます。もし一人前になれたらですけど。素晴らしい。目標がちゃんとあるっていうの。はすごいいいことですね。そしたら最後になおとくんみたいなパスでこれから留学しようとしている人たちに何かアドバイスとかこういうことをしておいたらいい方がいいよとかってあったらお願いします。僕でよくやるかなんですけど1、2年生の時は結構そのコンピューターサイエンスの基礎的なことを勉強した方がいいかなっていうふうにもちろんそのある人もいるんであのあれなんですけど基礎的なことをなんかしっかり勉強してあの例えばそのプログラムについて触れてみるとかデバッグをなんかいっぱいしてみるとかあとその理論的なこともすごい大事だと思うんでそういうのもしっかり勉強してみるとかやったりするのが12年生のうちはいいかなというふうに思いますかね34年生だったら例えばその基礎的な経験を生かして例えばいっぱいプロジェクトをやってみるとかあとそれこそ研究室に入って研究してみるのもいいですしあと後はインターンを例えば探してみるとかそういうのもあのするのがいいのかなっていうふうに思いますがめちゃくちゃありきたりなアドバイスですねこれ。来る人に対してはどうですかまあ高校生とかかな高校生中学生またまた中学生みたいな感じで大学は海外の大学に行こうみたいな人にはなんかアドバイスありますかこういう風にやるといい。よみたいな多分なんか英語がなんかもしかしたらなんかそんなにもしかしたら一番大事にもしかしたら海外の大学だから考えてる人がもしかしたらあの多いかもしれないですけどあんまりなんか自分的にはその英語そんなに重要じゃないかなっていうふうに思っててもちろん最低限の英語は必要なんですけど例えばそれよりなんかもうちょっと大事なのか例えばちゃんと考える力とかあと人とコミュニケーションする方法とかそれは言語関係なく人とコミュニケーションする方法だったりとかあと自分の興味思ったことをやるとかそういうことを続けていくと英語とかはあんまり後でも全然ついてくるのかなっていうふうには僕は思ってます。確かに、フィリピンに6か月で仕上げたっていうことだった。確かに、逆にそれだけで、もちろんそれだけじゃないし、いろいろ結構頑張ったんだろうけど、確かに、そこでそれ以外をいろいろやっておいて、フィリピンとか、英語を安く、長く、集中的にできるような場所で準備するってのはあり。でもその戦略モードもやっぱりその結構その人によって例えば親の資金力の違いとか人によって違うんでもちろんそのあのあれですけどでもなんか基本的にはなんか英語は全然なんかその後からでも僕は全然大丈夫かなっていうふうに思っているというかもっと例えばその自分がそのでそのなんか物事を動かしていく力その自発的になんか動かしていく力だったりとか人とコミュニケーション取る方法とかそういうのをしっかり、あと興味を持つことをちゃんとやるそういうのをやれば、結局英語はそれができればもう全然できると思うんで別にそんななんか英語についてそんな今全然日本ずっと日本でその帰国市場じゃないけどみたいなの全然心配しなくてもいいのかなって。いうふうに思いますなんかそうよね根底のコミュ力って俺はいつも思ってるけれどもそれどうやったらつくんだろうねなんかさっきのなおとさんのね話とがさんのエピソードみたいな話じゃないけどなんか自分から話しかけたりとかさ私こんな状況です車乗せてくださいみたいなさそういうのも含めだけどなんかそういう一言が言えるようになるのってどういう教育を積めばなるんだろうなーってずっと最近考えてるんですけどねみんなポッドキャストやれば。いいんだよ僕はでもそこじゃなくて逆にあの僕は高校生まで多分脳みそ入ってなかったんだよねだからあんまりそんな人います?そんな人いないよあんまりそういうなんだろう海外に出ようとか自発的にみたいなのなかったんでそれどうやって育つんだろうって逆に思いましたけどねコミュニケーションはまあまあなんかあの頑張ればちょっとなんとかなるのかなってわかんない僕は思ってるんですけどその自発的に海外出ようとか自分の生きたい方向性をそんな若い時から考えていくってのがすごいなって環境としか。思えないもん正直それだけも結構でかいんじゃないですかやっぱり実際何かをしたいってなってもかなり応援してくれる人が周りにいなかったらもちろんどんどん厳しくなってきますし自分の力があったとしてもだからそれはまあ難しいところではありますよねだからといって別になんか後からでも全然その例えばその奨学金を取るとかそういうのもまあなるのかなっていうふうには思いますねそうですね。間違いないまあやれることをやりましょうっていうことじゃなるんだろうけどもそうねまずはちょっとじゃあ根底のコミュニケーション能力から。日付大切ですねそしたら今回はこれで締めようかなと思います今回のゲストはナオトくんでしたありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "はい、そしたら前回に引き続き今回もなおとくんに来てもらって今回はまあ後半で就職したその後みたいなことについて話していきたいと思いますよろしくお願いしますはい、お願いしますそしたらすごいざっくり働いてみて今どのぐらいでしたっけ?",
      "start": 28,
      "end": 17178,
      "timestamp": "00:00"
    },
    {
      "speaker": "Naoto",
      "text": "ちなみにまだ3週間も経ってないあ、そうなんでそんなになんか多分話せることあんまないかもしれないっていうちょっと感じですかでもまあ頑張ります、。",
      "start": 17178,
      "end": 27924,
      "timestamp": "00:17"
    },
    {
      "speaker": "Ryo",
      "text": "はいいや、全然。また、長くなった時にまた撮らせてもらえればと思うんで。もちろん、。",
      "start": 27924,
      "end": 32948,
      "timestamp": "00:27"
    },
    {
      "speaker": "Naoto",
      "text": "もちろん。",
      "start": 32948,
      "end": 33998,
      "timestamp": "00:32"
    },
    {
      "speaker": "Ryo",
      "text": "でも、いつも、いつもというか、いつも、記事とか含めて、結構、日本との違いとかって結構聞くんですけど、直人くんの場合は、インターンだけだから、本当の社会人経験はないところだから、あれだよね、ちょっと変わってきますよね。",
      "start": 33998,
      "end": 48946,
      "timestamp": "00:33"
    },
    {
      "speaker": "Senna",
      "text": "そうだよね。比較のしようがないもんね、。",
      "start": 48946,
      "end": 51307,
      "timestamp": "00:48"
    },
    {
      "speaker": "Ryo",
      "text": "だって。",
      "start": 51307,
      "end": 52275,
      "timestamp": "00:51"
    },
    {
      "speaker": "Naoto",
      "text": "そうそうですね、その日本でインターンしてたところももうスタートアップみたいな感じなんで、多分全然そのカルチャー、日本の普通の会社とは全然違うと思うので、。",
      "start": 52285,
      "end": 61268,
      "timestamp": "00:52"
    },
    {
      "speaker": "Ryo",
      "text": "そうですね。しかも前回も言ってたけど、1000万の給料を、1000万の年収の給料をパッと最初からもらえちゃうんだもんね、すごいですよね。",
      "start": 61268,
      "end": 72302,
      "timestamp": "01:01"
    },
    {
      "speaker": "Senna",
      "text": "そうだよね、間違いない。",
      "start": 72302,
      "end": 74183,
      "timestamp": "01:12"
    },
    {
      "speaker": "Naoto",
      "text": "それは自分がすごいっていうよりは、やっぱカナダと業界っていう感じ。",
      "start": 74183,
      "end": 78975,
      "timestamp": "01:14"
    },
    {
      "speaker": "Ryo",
      "text": "だと思いますね。とはいえねやっぱりそのもちろんいろんなあれがあって大学行けてその今の会社に就職してでまぁカナダの物価の高さとかいろいろありとはとはいえやっぱりその高校生の時にIL2まあ6。\n5取ったりだとかその海外の大学に向けて準備したりだとか海外の生活もう大学生から一人で海外で生活したりとかやっぱなんだろう頑張ったところがすごいたくさんあるんだろうなって思いますけどねありがとうござい。",
      "start": 78975,
      "end": 112436,
      "timestamp": "01:18"
    },
    {
      "speaker": "Senna",
      "text": "ますでもねむちゃくちゃ費用対効果のいい多分投資をたくさん自分にしてきた結果じゃないかなってやっぱ思っ。",
      "start": 112436,
      "end": 117840,
      "timestamp": "01:52"
    },
    {
      "speaker": "Naoto",
      "text": "ちゃうもんねそこは自分といえば親がやってくれたって感じですちなみに親。",
      "start": 117840,
      "end": 124766,
      "timestamp": "01:57"
    },
    {
      "speaker": "Senna",
      "text": "のそういう方針だったんですか海外行ってこーいだったりとか今はね。",
      "start": 124766,
      "end": 128429,
      "timestamp": "02:04"
    },
    {
      "speaker": "Ryo",
      "text": "今更やけど確かに結構ま。",
      "start": 128429,
      "end": 130270,
      "timestamp": "02:08"
    },
    {
      "speaker": "Naoto",
      "text": "あその親はあの海外行った方がいいんじゃないかっていうのは言われてたんでそのそんな絶対行けみたいな感じではないんですけど全然行きたいなっていう風に言ったら確かに行った方がいいと思うよみたいな感じでは。",
      "start": 130270,
      "end": 140971,
      "timestamp": "02:10"
    },
    {
      "speaker": "Ryo",
      "text": "ありましたちなみに、どの程度手助けがあったんですか?僕、例えば、SFUなんて知らなかったし、UBCなんて知らなかったし、なんなら海外の大学って、。",
      "start": 140971,
      "end": 149228,
      "timestamp": "02:20"
    },
    {
      "speaker": "Senna",
      "text": "うん、。",
      "start": 149228,
      "end": 149458,
      "timestamp": "02:29"
    },
    {
      "speaker": "Ryo",
      "text": "ハーバードって聞いたことあるかぐらいの、いけるわけもないんだけど、すごい雑魚な考えの高校のときとか、特にあれだったんですけど、どんな感じの、なんだろう、大学を決めるプロセスだったりとか、大学を申請だったりとか、どの程度助けてくれてって感じだったんですか?",
      "start": 149458,
      "end": 169365,
      "timestamp": "02:29"
    },
    {
      "speaker": "Naoto",
      "text": "まあ、親からの助けはそんなになかったですね。ほとんどまあ、大学のどこ行きたいかとか聞いたのは、それこそ僕がさっき言ってた、ずっと助けてくれた大学後の人からとか、カナダの大学に行ってたんで、そのそこから聞いて、その人から聞いてみたいな感じですかね。あとブログとか、海外の大学についてのブログとかがネットにもあったんで、それ読んでみたいな感じですかね。",
      "start": 169375,
      "end": 193360,
      "timestamp": "02:49"
    },
    {
      "speaker": "Senna",
      "text": "メンターの強さよねブログとかだけであるんだったらこっちだったらねもうubcトロント大学くらいしか出てこなさそうな気がするからで。",
      "start": 193370,
      "end": 200794,
      "timestamp": "03:13"
    },
    {
      "speaker": "Naoto",
      "text": "もあの1個そのすごいモータールー大学についてっていうブログがあるんですけどそのブログが僕一番最初に見てすごいそのコーププログラムっていうのをそれで知ってあのすごいなーってあのそれ行きたいなーっていうふうに思ったのがそれ初めてあれですか。",
      "start": 200794,
      "end": 215322,
      "timestamp": "03:20"
    },
    {
      "speaker": "Ryo",
      "text": "ねちなみにもし良ければどこ他に受けたんですか?すごいちょっと気になってた。",
      "start": 215322,
      "end": 221770,
      "timestamp": "03:35"
    },
    {
      "speaker": "Naoto",
      "text": "んだけどWaterloとショッピファイって会社知ってます?もちろん大学と提携してるデプディグリーみたいなやつがあったんでそれも聞いたところによるとすごい倍率が高かったらしいので全然ダメだったんですけどそれとあとはUBCですかねあとSFって感じですかねであのSFにしかあの受かれなかったんであのSFに行ったみたい。",
      "start": 221770,
      "end": 250316,
      "timestamp": "03:41"
    },
    {
      "speaker": "Ryo",
      "text": "な感じですねいやでも十分すごいですねその申請僕申請すらも高校生の時絶対できないもんねまあ僕ちなみに英語力ゼロだったんであの高校生はまあ申請も何も読めないあのホームページ読めないんでもうレベルが違いすぎてコメントのしようがないけどまあまとめるとすごいって感じですね僕。",
      "start": 250316,
      "end": 277282,
      "timestamp": "04:10"
    },
    {
      "speaker": "Senna",
      "text": "は君たちと違って大学すら行ってないからもう何。",
      "start": 277282,
      "end": 279503,
      "timestamp": "04:37"
    },
    {
      "speaker": "Ryo",
      "text": "も言えへんちょっとまあいろいろ脱線しちゃったんですけどざっくりいろいろなんかなんだろうまあ3週間だけど働いてみて。",
      "start": 279503,
      "end": 288389,
      "timestamp": "04:39"
    },
    {
      "speaker": "Naoto",
      "text": "どうですかまあそうですねあのまあインターンの時にあのやってたやってても同じことはやってないんですけどあの勤めてた会社で同じマネージャーのとに帰ることができたんでほぼ知ってる人なんでもあるそれは良かったな。",
      "start": 288389,
      "end": 300978,
      "timestamp": "04:48"
    },
    {
      "speaker": "Ryo",
      "text": "オンボーディングはまあじゃあ終わったかなすでにオンボーディング。",
      "start": 303282,
      "end": 306903,
      "timestamp": "05:03"
    },
    {
      "speaker": "Naoto",
      "text": "ってあれですかねなんかあの人事系のやつですかね。",
      "start": 306903,
      "end": 309684,
      "timestamp": "05:06"
    },
    {
      "speaker": "Ryo",
      "text": "人事系のやつだったりとかなんか会社によってはなんかブートキャンプみたいななんかなんかハッカーソンみたいなのがあったりとかまあなんか会社によっていろいろなんですけどそれはなんか結構。",
      "start": 309684,
      "end": 321566,
      "timestamp": "05:09"
    },
    {
      "speaker": "Naoto",
      "text": "インターの時にやってたんでまあいいんじゃねみたいな感じでなくなったみたい。",
      "start": 321566,
      "end": 325847,
      "timestamp": "05:21"
    },
    {
      "speaker": "Ryo",
      "text": "なインターの時はどんなオンボーディングがあったんですか。",
      "start": 325847,
      "end": 328548,
      "timestamp": "05:25"
    },
    {
      "speaker": "Naoto",
      "text": "ちなみにインターンの時はだからそれこそなんかもちろんそのなんか人事系のビデオを見たりとかしたりしてあと今も見ましたけどもちろんフルタイムに戻った時もでもあとなんかそのメンタープロジェクトみたいなのがあってメントープロジェクト123みたいなで1とかほんとすごい簡単ななんか本当にタイプを直すだけみたいなやつから始まってで2個とかはちょっとなんかちょい複雑になってるけどまぁそのなんかちょっと関数1個作るぐらいなってで3になってほんとなんかちょっと複雑になっていくみたいな感じのやつをそういう形のあの進め方でインターンがありましたそれ終わったらあの実際のインターンプロジェクトやるみたいな感じですか。",
      "start": 328548,
      "end": 364324,
      "timestamp": "05:28"
    },
    {
      "speaker": "Ryo",
      "text": "ねじゃあインターンの時にはオンボーディング終わってえっと今はじゃあもう割と1週間目2週間目ぐらいからすぐにまあ本業務みたいなのに入ったって感じなんですか。",
      "start": 364324,
      "end": 375433,
      "timestamp": "06:04"
    },
    {
      "speaker": "Naoto",
      "text": "まあそうですねでも本業務って言ってもちょっとなんかもう難しすぎてちょっと難しいとかなんかニッチすぎて何やってるか分かんないんでちょっと頑張って今何やってるのかなみたいなのをちょっと頑張ってキャッチアップしてるみたいな感じですねなんか。",
      "start": 376315,
      "end": 393283,
      "timestamp": "06:16"
    },
    {
      "speaker": "Ryo",
      "text": "言えること言えないこととかあると思うんで言える範囲で実際にチームがやってることプラス会社がやってることみたいな業務の内容みたいなのがあってもいいです。",
      "start": 393283,
      "end": 404908,
      "timestamp": "06:33"
    },
    {
      "speaker": "Naoto",
      "text": "かまず会社がやってることから始めた方がいいと思うんですけどアリスタネットワークスっていう会社なんですけど簡単に言うとデータセンター向けのネットワーキングスイッチっていうのを作ってる会社になります僕もそれ聞いてもマジなんだよみたいな全然分かんなかったんで誰も知らないと思うんですけど簡単に言うとデータセンターっていうのはいっぱいコンピューターが例えばGogleとかマイクロソフトとかそれと多分Amazonとかも例えばクラウドサービスを運営するときにすごいたくさんなんかコンピューターを使うんですね例えば何個使ってるか僕わかんないんですけど100万個例えばそのコンピューターが使ってたくさんのリクエストだったりすごいダイアリストのインフラとかが成り立ってるんですけどでそのデータセンターの中に100万個例えばコンピューターがあったとしてコンピュータAからコンピュータBに例えば情報を送りたいみたいなことが結構結構てかまあめちゃくちゃあるんですねそういう時にコンピュータAからコンピュータBに情報を送るのに基本的にあのネットワークで繋がってるんですねそのネットワークっていうのはその例えばイーサネットとかって言われる本当にその例えばケールでこう繋がってるみたいな感じのイメージが多分いいと思うんですけどそういうネットワークで繋がってたときに例えばコンピューターAからコンピューターBに情報を送ろうってなったときに情報を送るときにBってどこにいるの?みたいな例えばCと何が違うのか住所みたいなのがあるんですけどAから情報が出るときにお前こっち行けお前こっち行けみたいな交通整備みたいなことをやってるのがネットワーキングスイッチなんですけどそれを作っている会社なのでちなみにその会社はネットワーキングスイッチも作っているんですけどそれに乗っかるオペレーティングシステムも作っているそこが主なビジネスというか強みなんですけどネットワーキングオペレーティングシステムを作っている会社に今勤め。",
      "start": 404908,
      "end": 524401,
      "timestamp": "06:44"
    },
    {
      "speaker": "Ryo",
      "text": "ていますなんか具体的にはどういう会社とかで使われてるんですか?それこそAmazonとかそういうコンピューティングのSaaSなんだっけ?AWSとかそこら辺が使われてるイメージなんですか?",
      "start": 524401,
      "end": 542288,
      "timestamp": "08:44"
    },
    {
      "speaker": "Naoto",
      "text": "一応多分一番の顧客がMicrosftとMetaビジネス的には基本的にB2Bみたいなもうそうですね完全にB2Bの会社ですね数百。",
      "start": 542288,
      "end": 569754,
      "timestamp": "09:02"
    },
    {
      "speaker": "Senna",
      "text": "万のそれこそ情報のやり取りをするPCとかがないと必要ないもんねそういう会社というかシステムが情報のスイッチするっていう情報のシステム自体がねそうですね。",
      "start": 569754,
      "end": 580277,
      "timestamp": "09:29"
    },
    {
      "speaker": "Ryo",
      "text": "その中でもチーム的にはどういう分野を担当されてるんですかそうです。",
      "start": 580277,
      "end": 585738,
      "timestamp": "09:40"
    },
    {
      "speaker": "Naoto",
      "text": "ね僕の分野はさっきオペレーティングシステムを作るっていう話をしたんですけどそのネットワークエンベロープシステムもめちゃくちゃ大きいチームだと僕はそこに入っているチームでその中でもそのハードウェアに依存するものを書かなきゃいけないところとそのハードウェアに依存しないプラットフォームに依存しないプログラムがあるんですね例えばそのハードウェアだとハードウェアを例えば制御したりというか正直僕わかんないんですけどその辺はあの多分ハードウェアについての例えばその最適化だったりとかっていうのがあったり多分すると思うんですけどそういうのがあったりで僕のチームはそのハードウェアに依存しないあのもうジェネラルなあのもので例えばそのライティングプロトコル例えばそれこそえっとBGPとかあのOSPFとかっていうなんかそういうすごいそのラーティングプロトコルをなんか実装する二人とかあとそういうそのプラットフォームに依存しないなんかなんてことをやるっていうみたいなとこのでっかいチームの中の一人みたいな感じですか。",
      "start": 585738,
      "end": 644828,
      "timestamp": "09:45"
    },
    {
      "speaker": "Senna",
      "text": "ね本当にトガシさんが前回言ってたように、ワイルドソフトウェアばっかり作る会社がバンクーバー無茶苦茶多い中で、ガチガチにシステムのネットワーク側に入っている、しかもそんなに大きい顧客を持っている会社なんてあったん。",
      "start": 644828,
      "end": 660325,
      "timestamp": "10:44"
    },
    {
      "speaker": "Ryo",
      "text": "だって思ったもん。",
      "start": 660325,
      "end": 662237,
      "timestamp": "11:00"
    },
    {
      "speaker": "Naoto",
      "text": "確かに。大きさその企業の大きさで言うと結構マンケーバーでも大きい方なんじゃないかなと思いますかねあの従業員数はそんなに大きくないんですけど多分今4千いく何人とかじゃないですかでも多分あのなんか時価総額レベルだと結構あの大きい方だと思いますねあの会社はいや。",
      "start": 662237,
      "end": 684736,
      "timestamp": "11:02"
    },
    {
      "speaker": "Senna",
      "text": "すごいなぁそういうとこに入れるのってやっぱりそういうこっちの優秀な大学生なんだってちょっと一瞬思ったわもう。",
      "start": 684736,
      "end": 692090,
      "timestamp": "11:24"
    },
    {
      "speaker": "Ryo",
      "text": "ちょっと何言ってるかあんまり分から。",
      "start": 692090,
      "end": 693971,
      "timestamp": "11:32"
    },
    {
      "speaker": "Senna",
      "text": "なかった8分くらい分からなかったもんでもネットワークをとりあえず司るスイッチだったりねそういう情報のそうそう情報のとりあえず統制を取るシステムとを作ってらっしゃる会社っていう認識だったらいいですよねとりあえずそうですそうですちなみにシンプルに疑問だったのがえっといらっしゃい直人さん以外にニューグラッズっているんですか?",
      "start": 693971,
      "end": 716414,
      "timestamp": "11:33"
    },
    {
      "speaker": "Naoto",
      "text": "ちなみに全然いますよその人と一緒にインターンしてた人とかアーロンショーを入れるつもりですはいそうな。",
      "start": 716414,
      "end": 723907,
      "timestamp": "11:56"
    },
    {
      "speaker": "Ryo",
      "text": "んだしなかった会社的には何人さっき規模何。",
      "start": 723907,
      "end": 731113,
      "timestamp": "12:03"
    },
    {
      "speaker": "Naoto",
      "text": "によっても陽性に陽性。",
      "start": 731113,
      "end": 732494,
      "timestamp": "12:11"
    },
    {
      "speaker": "Ryo",
      "text": "になんでその中でソフトエンジニアみたいなその総エンジニアのポジションはどのぐらいあるんです。",
      "start": 732494,
      "end": 738820,
      "timestamp": "12:12"
    },
    {
      "speaker": "Naoto",
      "text": "か多分2千半分以上絶対いるんで僕の会社すごいエンジニアファーストの会社なんで多分そういう創業者も全員エンジニアみたいな感じなんです創業者がなんかそのサンマイクロシステムズとかって知ってます?もちろんもちろんあれの創業者が僕の会社の創業者なんですごっ結構そのエンジニアというかエンジニアファーストの結構。",
      "start": 738820,
      "end": 770178,
      "timestamp": "12:18"
    },
    {
      "speaker": "Ryo",
      "text": "会社なんですね中でチームは今何人ぐらいの?",
      "start": 770178,
      "end": 777112,
      "timestamp": "12:50"
    },
    {
      "speaker": "Naoto",
      "text": "なんか難しいんですよなんかチームっていうよりプロジェクトベースで結構動いてるんであんまなんかチームっていうのがないんですよだからその例えば僕のそのマネージャーにその下にいる人は何人とかは例えば15人ぐらいはいるんですけどでもその中でも全然プロジェクトによって違うんでもうあれですねあんま関係ないって感じですね。",
      "start": 777112,
      "end": 799715,
      "timestamp": "12:57"
    },
    {
      "speaker": "Senna",
      "text": "プロジェクトベースなんで面白いねーまあ合理的っちゃ合理的なのか各プロジェクトチームによってもね多分得意なプロジェクト不得意なプロジェクトあるだろうからそういう意味だとチームで縛らなくていい方がいいよねっていう判断なの。",
      "start": 799715,
      "end": 813772,
      "timestamp": "13:19"
    },
    {
      "speaker": "Naoto",
      "text": "かないやまあ多分僕なんかそのもともとその入ってたチームがあったんですけどそのチームがなんかもうほぼなんか昨日とかも終わっちゃってそのチームがもうなんかもう離散するみたいな感じでプロジェクトベースになってたみたいな多分。",
      "start": 813772,
      "end": 827162,
      "timestamp": "13:33"
    },
    {
      "speaker": "Senna",
      "text": "感じはあったね流れでっ。",
      "start": 827162,
      "end": 829763,
      "timestamp": "13:47"
    },
    {
      "speaker": "Naoto",
      "text": "てことかじゃあ多分そうだ。",
      "start": 829763,
      "end": 831124,
      "timestamp": "13:49"
    },
    {
      "speaker": "Ryo",
      "text": "と思いますねでえっとそしたら一応マネージャーには15人ぐらいいてその中の今うちの1人みたいな感じですねそうですねで、新入社員というか尚人くんみたいなポジションで入ってきた人はどのぐらいいるんですか?",
      "start": 831124,
      "end": 846620,
      "timestamp": "13:51"
    },
    {
      "speaker": "Naoto",
      "text": "いやだからそれこそ1年に多分何人みたいな話なんですよなんかその何僕みたいにその結構カナダってその一斉入社じゃないじゃないですかだからあんまわかんないんですけど多分まあ10人は絶対いると思うんですよね1年に入ってきてニューグラッドでだから10人以上20人いるかなーみたいな感じですかねわかんないですねそこまではこんななんかみんないつ入社したのみたいなのも聞かないんですそんなにまあその中に人じゃない限りでも10人は絶対いる。",
      "start": 846630,
      "end": 875086,
      "timestamp": "14:06"
    },
    {
      "speaker": "Ryo",
      "text": "と思いますなんとなくインターンは一斉入社なのかな。",
      "start": 875086,
      "end": 878396,
      "timestamp": "14:35"
    },
    {
      "speaker": "Naoto",
      "text": "って思ってました僕は。",
      "start": 878396,
      "end": 880936,
      "timestamp": "14:38"
    },
    {
      "speaker": "Ryo",
      "text": "インターンのリターンオファーをもらった人たち?",
      "start": 880936,
      "end": 885027,
      "timestamp": "14:40"
    },
    {
      "speaker": "Naoto",
      "text": "それも卒業によっては違うんで、。",
      "start": 885027,
      "end": 886878,
      "timestamp": "14:45"
    },
    {
      "speaker": "Ryo",
      "text": "相談です。",
      "start": 886878,
      "end": 889058,
      "timestamp": "14:46"
    },
    {
      "speaker": "Senna",
      "text": "すごいね、でも年間で換算したとしても10人から20人、10人以上20人未満かアメリカのやっぱり会社じゃなくてバンクーバブランチでっていう風に考えるんだったら結構ちゃんと入ってるんだなって思いました。",
      "start": 889058,
      "end": 901742,
      "timestamp": "14:49"
    },
    {
      "speaker": "Naoto",
      "text": "いや多分ですけど1番とかないですけど2番3番目ぐらいなんじゃないですか大きさでも。",
      "start": 902197,
      "end": 908560,
      "timestamp": "15:02"
    },
    {
      "speaker": "Senna",
      "text": "まあこれは今昨今の流れの話になっちゃうかもしれないけどねやっぱりまあlm代等してきてジュニアとかニューグラッツが主入社するなんてことを非効率的じゃないかみたいニュース多いじゃないですかなんかそんな中でもやっぱりsfuまあに限ったらしやなくニューグラッツでやっぱり入れるっていうのはその会社の方針としてなんかあるんですか人を育てるのが大事。",
      "start": 913985,
      "end": 936358,
      "timestamp": "15:13"
    },
    {
      "speaker": "Naoto",
      "text": "だとか僕はそこまではちょっと分かんないんですけど会社の方針としてソフトウェアのクオリティが一番大事っていう方針が会社であって正しいことをするっていうとクオリティが一番大事っていう方針があるのでそういう意味でも多分僕が予想するに人がやらないとダメじゃないいけないっていうふうに思ってるんですか?",
      "start": 936358,
      "end": 966648,
      "timestamp": "15:36"
    },
    {
      "speaker": "Senna",
      "text": "品質をやっぱり重視するっていう社の方針としてはやっぱり人間がちゃんと絡まないとそれは話にならんよねっていう多分そこはあるってことだよね多分ね。",
      "start": 966648,
      "end": 975316,
      "timestamp": "16:06"
    },
    {
      "speaker": "Naoto",
      "text": "そうじゃないかなって僕は今予想してますそこまであの聞いたわけではないんですけどその品質が大事っていうのはもう確実に会社がずっと言ってること。",
      "start": 975316,
      "end": 984324,
      "timestamp": "16:15"
    },
    {
      "speaker": "Ryo",
      "text": "なんで。",
      "start": 984324,
      "end": 984624,
      "timestamp": "16:24"
    },
    {
      "speaker": "Senna",
      "text": "いや結構そうフロックみたいな仕事してるとよく聞かれるんですよやっぱニューグラッツに限ったんじゃないけどこっちで新卒等で今後仕事なんか見つかる人なんかいるんですかみたいなねあの今からの時代AIじゃないかみたいなやっぱ今からCS勉強するとかってなるとなおさらそこ多分心配でまあそういう意味で言うんだったらでもそういう今ねあの直さんがおっしゃったようなやっぱり品質を例えば重視している会社だったりまあこれからも人にやっぱ頼り続ける会社はそりゃいるんだろうからそういうところ頑張って狙いましょうって話になるのかなどうな。",
      "start": 986915,
      "end": 1016760,
      "timestamp": "16:26"
    },
    {
      "speaker": "Naoto",
      "text": "んですかねやっぱり少なくなってはいますよねやっぱりそういうその日その多分かなり多分うちの会社はそのそれこそがネットワーク壊れるともう大損害なんでめちゃくちゃ品質を大事にしている会社なんでっていうのがもしかしたらあると思うんですけどあのそうじゃなかったらもしかしたら違うかもしれないんでそのそうですねだから全体的にどうなっていくかっていうのはまあよくわかんないですね。",
      "start": 1016760,
      "end": 1040849,
      "timestamp": "16:56"
    },
    {
      "speaker": "Ryo",
      "text": "なんかそれこそこの北米エリアではやっぱりなんかエンジニアとかソフトエンジニアかっこいいみたいな時代があったけどちょっとやっぱそうじゃなくなってきちゃってるというかなんか前世紀ではなくなってるんだなみたいなのがやっぱひしひしと感じます。",
      "start": 1041300,
      "end": 1057714,
      "timestamp": "17:21"
    },
    {
      "speaker": "Senna",
      "text": "よねそうだよね5。",
      "start": 1057714,
      "end": 1059836,
      "timestamp": "17:37"
    },
    {
      "speaker": "Naoto",
      "text": "年前ぐらいはちょっともしかしたら僕がそれこそあのなんていうんですか大学入学した時はもうイケイケみたいな感じだったんですよ。",
      "start": 1059836,
      "end": 1065601,
      "timestamp": "17:39"
    },
    {
      "speaker": "Senna",
      "text": "確かに確かにいや減ってくんだろうなここから多分そう。",
      "start": 1065601,
      "end": 1069826,
      "timestamp": "17:45"
    },
    {
      "speaker": "Ryo",
      "text": "ですね結構やっぱり自分の会社でもAIの進出怖いなみたいなやっぱ奪われるのかなみたいな感じで人も結構多いみたいで僕は結構楽天的なタイプなんであんまりそうなったらそうなった時に考えようぐらいで確かX。",
      "start": 1069826,
      "end": 1087913,
      "timestamp": "17:49"
    },
    {
      "speaker": "Senna",
      "text": "か何かの投稿で統計取ってたよね国ごとによってAIの進出に関してワクワクするかそれとも怖がっているかみたいな北米圏は軒並み全部ビビってんだよね確か仕事が奪われるとかストライキーとかなんかそっち方面でアジア圏のところはもうびっくりするくらいワクワクしてて俺らの時代きたみたいなで日本はどちらにもならないって。",
      "start": 1087913,
      "end": 1110466,
      "timestamp": "18:07"
    },
    {
      "speaker": "Naoto",
      "text": "いうね。",
      "start": 1110466,
      "end": 1111287,
      "timestamp": "18:30"
    },
    {
      "speaker": "Ryo",
      "text": "前は僕AIって聞いてAIに仕事取られるって聞いた時にソフトエンジニア取られたらそのAIに変わられたらその前にいろんな職業変わられるでしょって思ってたんですよって思ってたんだけどこの頃思うのはその中でも肉体労働をしてるのはまだ変わられないなっていうやっぱり人間でいう脳みそみたいな部分はAIでできるけどやっぱそれを体がないとその肉体労働はできないじゃないですか体をつける途端にやっぱり一台一台というかあのコストってめちゃくちゃ高くなってくるじゃないですかなんかSaaSみたいな感じでそのパソコンみんなが持っててその中でそのソフトウェアを使うっていうのは一人一人のには安くなるけどなんか前々からあるけどやっぱりなんかレストランにあるロボット、レストランであのなんか給仕ロボット。",
      "start": 1113569,
      "end": 1169927,
      "timestamp": "18:33"
    },
    {
      "speaker": "Senna",
      "text": "みたいなやつねそう、。",
      "start": 1169927,
      "end": 1170788,
      "timestamp": "19:29"
    },
    {
      "speaker": "Ryo",
      "text": "給仕ロボットみたいなのってやっぱりまだ全然流行ってないじゃない。",
      "start": 1170788,
      "end": 1174029,
      "timestamp": "19:30"
    },
    {
      "speaker": "Senna",
      "text": "ですかなんでだろうねそれ。",
      "start": 1174029,
      "end": 1176310,
      "timestamp": "19:34"
    },
    {
      "speaker": "Ryo",
      "text": "とやっぱりコスト高いんじゃない。",
      "start": 1176310,
      "end": 1177791,
      "timestamp": "19:36"
    },
    {
      "speaker": "Senna",
      "text": "ですかコストなのかなぁ。",
      "start": 1177791,
      "end": 1178772,
      "timestamp": "19:37"
    },
    {
      "speaker": "Ryo",
      "text": "結局はだからやっぱなんかちょっと肉体労働が絡むところはやっぱりまだまだ取って変わられなくて実はやっぱソフトエンジニアとかパソコン一台でできる仕事とかが一番最初に取って変わられるんじゃないかな。",
      "start": 1178772,
      "end": 1194224,
      "timestamp": "19:38"
    },
    {
      "speaker": "Senna",
      "text": "って話があるだろうねー思っ。",
      "start": 1194224,
      "end": 1196065,
      "timestamp": "19:54"
    },
    {
      "speaker": "Ryo",
      "text": "てきました僕はこの頃。",
      "start": 1196065,
      "end": 1196906,
      "timestamp": "19:56"
    },
    {
      "speaker": "Senna",
      "text": "なるほどねちょっとじゃあ転職考えよう。",
      "start": 1196906,
      "end": 1199368,
      "timestamp": "19:56"
    },
    {
      "speaker": "Ryo",
      "text": "みんなでみんなで考えるんですかトラックドライバーとかどう?",
      "start": 1199368,
      "end": 1202821,
      "timestamp": "19:59"
    },
    {
      "speaker": "Senna",
      "text": "でもドライバーもダメか自動運転って言うもんねだから。",
      "start": 1202821,
      "end": 1207695,
      "timestamp": "20:02"
    },
    {
      "speaker": "Ryo",
      "text": "それで言うとまあパソコン一台ではないからやっぱそのドライバーってその交通整備ができてからじゃないといられないじゃないですかまあまあ確かにねそういう意味ではまだやっぱり時間かかりますよねその交通省みたいな日本で言うとそういうところとちゃんと連携してなんか交通整備ができるようになって自動運転できるようになりましたみたいな法律も整備されましたってなってくる時間の余裕はあると思うんでまあなんかそういう意味ではトラックドライバーもありな。",
      "start": 1207695,
      "end": 1237820,
      "timestamp": "20:07"
    },
    {
      "speaker": "Senna",
      "text": "のかもしれないじゃあ狙おう。",
      "start": 1237820,
      "end": 1240421,
      "timestamp": "20:37"
    },
    {
      "speaker": "Ryo",
      "text": "みんなで。",
      "start": 1240421,
      "end": 1240681,
      "timestamp": "20:40"
    },
    {
      "speaker": "Senna",
      "text": "何の話やねん。",
      "start": 1242621,
      "end": 1243281,
      "timestamp": "20:42"
    },
    {
      "speaker": "Ryo",
      "text": "っていうねすごい脱線しちゃったけど僕もう一つ聞きたかったのはその結構やっぱ何回も出てる通りそのプロダクトエンジニアが結構まあ人気というかまあよくみんなが行く分野である中でそのちょっと違うところに行こうみたいな思ったのは理由があるんですかそれともなんかどっちでもよかったみたい。",
      "start": 1243281,
      "end": 1264554,
      "timestamp": "20:43"
    },
    {
      "speaker": "Naoto",
      "text": "ななんかそれに関してはもう僕がそのそういうのがあのに興味があるからっていう感じですかねそのプロダクトを作るとかいうよりも僕結構そのコンピューターサイエンスの理論そのAI系とかは全然わかんないんですけどその型システムとかなんかそういうあとシステム系のこととかも研究もしてたんで研究もそのソフトエンジニア系の研究だったんでそういうのも結構その低レイヤー寄りというかあんまりそのプロダクト開発に生かさないような技術が多いんで自然とまあそういう会社に行きたいなっていうふうに思うようになったって感じですかね。",
      "start": 1264554,
      "end": 1301201,
      "timestamp": "21:04"
    },
    {
      "speaker": "Ryo",
      "text": "そういう人とか言ってまとめちゃいけないと思うんですけどどういうモチベーションでちなみに働いてるんですかなんかプロダクトエンジニアすごい分かりやすくて今回のプロジェクトめちゃくちゃインパクト高いとか自分が出したプロジェクトなんかデータとかでめちゃくちゃ何だろう使われてるとかそういうのって結構モチベーションになったりだとかフィードバックが来たりだとかで結構そこでモチベーションって出てきたりとかすると思うんですけどなんかどういうことをなんかそのプログラミングだったり仕事してる間楽しいなみたいな思うですか今。",
      "start": 1303062,
      "end": 1341246,
      "timestamp": "21:43"
    },
    {
      "speaker": "Naoto",
      "text": "ちょっと仕事はそのまだ3週間で始めたばっかなんでちょっとそれを置いておく一応その一応僕が今までやってきたことの延長戦ということで話すんですけど結構単純にその面白いあの興味なんかやってって楽しんで、もうちょっと知りたいからやってくみたいな、そういう単純なモチベーションですかね。そんなになんか、そうですね。",
      "start": 1341246,
      "end": 1364099,
      "timestamp": "22:21"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあ、もう興味とか知識を置くみたいなところを。",
      "start": 1364099,
      "end": 1367004,
      "timestamp": "22:44"
    },
    {
      "speaker": "Naoto",
      "text": "まあそうですねこれがこうなったらどうなるんだろうみたいなそんな感じで面白かったからずっとやってるみたいな感じです。",
      "start": 1367014,
      "end": 1375163,
      "timestamp": "22:47"
    },
    {
      "speaker": "Senna",
      "text": "かねそうよね不思議に思うところは正直あるよね俺も前プレイステーションの基盤のセキュリティエンジニアをやってらっしゃる方と喋った時に同じ質問して何がモチベーションなん?って言ってしまったんやけどやっぱりセキュリティフォール見つけてすごく気持ちよくなった瞬間みたいなことをおっしゃってたりするからそういう問題完結した瞬間とかその人なりの気持ちいい瞬間は多分あるんだろう。",
      "start": 1375163,
      "end": 1400029,
      "timestamp": "22:55"
    },
    {
      "speaker": "Ryo",
      "text": "ねおそらく確かにもちろんねプロダクタエンジニアでもやっぱなんかその見えないところだけど内側でどうなんかすごいスマートに解決なんか問題を解決できたら楽しいとかパフォーマンスめちゃくちゃ上げられたとかもちろんそういうのもあるんだけどなんかなんだろう僕たちの中でもやっぱり低レイヤーの人たちって結構なんだろうナードでかっこいいみたいなやっぱり喋ってて何言ってるかわかんないし低レイヤーの人たちは色々頭も良くてなんかねすごいそれこそなんかハッカーみたいな僕たちの中でもまだある。",
      "start": 1400029,
      "end": 1436880,
      "timestamp": "23:20"
    },
    {
      "speaker": "Senna",
      "text": "あるあるあるしこれさっきのエアーの話にリンクしそうやけど今さやっぱり低レイヤーをむしろ勉強するべきじゃないかっていう問い合わせやっぱフロックに来てて多くてまあ理屈としては正直そのねLMの時代でっていうところで表面的なじゃあパソコン次第でっていうところは変わらないかもしれないけど言うて低レイヤーにやっぱりAIが触り出すのってまだまだ先なんちゃうのみたいな多分文脈でなんかその辺は実際Naotさんの周りとかどうすかそのLMの進出で自分たちの仕事が奪われるかもってプロダクトほどはやっぱりなんか悲壮感がないというかそんな雰囲気が。",
      "start": 1436880,
      "end": 1472323,
      "timestamp": "23:56"
    },
    {
      "speaker": "Naoto",
      "text": "僕の会社だってことですかどうなんですかねでもやっぱりまあそんなにまあどうなんですかねそれに関してはなんか僕は結構あの自分では心配してますけど僕のまあ今僕も全然専門性がないんで今今あのそれであの自分は心配してるんですけどあの他の人はちょっとどう思ってるのかちょっと今度聞いてみ。",
      "start": 1472323,
      "end": 1494504,
      "timestamp": "24:32"
    },
    {
      "speaker": "Senna",
      "text": "ますねまあタイミングがあれば。",
      "start": 1494504,
      "end": 1496385,
      "timestamp": "24:54"
    },
    {
      "speaker": "Naoto",
      "text": "ねでもなんかあのあれなんですよやっぱ面白いなって思うことをやるのがいいんじゃないですか?わかんないですけどそれは本当。",
      "start": 1496385,
      "end": 1504859,
      "timestamp": "24:56"
    },
    {
      "speaker": "Ryo",
      "text": "そうですねうん確かにそう。",
      "start": 1504859,
      "end": 1506440,
      "timestamp": "25:04"
    },
    {
      "speaker": "Senna",
      "text": "ですね本質的なところに戻っていくっていうので。",
      "start": 1506440,
      "end": 1509063,
      "timestamp": "25:06"
    },
    {
      "speaker": "Ryo",
      "text": "そしたらなんかカルチャーみたいなところまあ会社かまあ会社以外でもいいんですけどねあのなとくんの場合は日本ではまあスタートアップみたいのインターンみたいなのしかしてないと思うんで日本の会社とここが違うみたいなのはあんまないかもしれないけどなんかまあ感覚なんだろう日本まああの会社の外でも中でもなんでもいいけど、これは全然日本と違うなみたいなこととかって感じます、。",
      "start": 1509063,
      "end": 1536118,
      "timestamp": "25:09"
    },
    {
      "speaker": "Naoto",
      "text": "日々で。日本と違うかはわかんないんですけど、他の会社ともしかしたら違うかもわかんないんですけど、さっきも言ったクオリティーを重視するっていうカルチャー。は僕はもうめちゃくちゃ好きでっていうのも他の会社もどんな感じかわかんないですけどうちの会社めちゃくちゃテスト書くんですよテスト書くめちゃくちゃ書くし結構その例えばそのユニットテストはもちろんですけどインテグレーションテストもあるしみたいなのもあるし実際にそのテストがぐるぐるぐるぐる回ってるみたいなをのがあってすごいなんかテストをプラスあの例えばその機能を例えば改善したいって時に例えばリファクタリングが必要になった時とかそういう時ももう全然もうokみたいな感じの絶対やったほうがいいよみたいなそのクオリティをすごい重視する文化があるんで僕はすごいそのそれが好きだ。",
      "start": 1536118,
      "end": 1588516,
      "timestamp": "25:36"
    },
    {
      "speaker": "Ryo",
      "text": "なっていうふうに確かにそのリファクタリングをもうやってやっていこうみたいなのはこっちは強いかもしれないですねなんか僕も日本で動いてんだから触らなくていいじゃんみたいなのはやっぱり結構あるあるなのかなもちろん日本でもいい会社だとね大きい会社だとできるっていうのもあるだろうしこっちでもやっぱり小さい会社でどんどん機能出していこうみたいなところだとやっぱりリファクタリングは後でいいんじゃないかなみたいなどんどん開発がしにくくなっていくみたいなのは小さい会社だったらあるしでもテスト書くの好きなんですね僕は嫌いだしこの頃AIとかの回答によりなんかテストを書くの結構簡単になってラッキーとかって思ったりして。",
      "start": 1588516,
      "end": 1641387,
      "timestamp": "26:28"
    },
    {
      "speaker": "Naoto",
      "text": "いやテスト書くの自体はそんなに僕好きじゃないですよねユニットテスト書くとかはそんな好きじゃないですけどちゃんとコードが動いてるっていうのを確かめられる文化それが大事だなと思うんでそれ。",
      "start": 1641387,
      "end": 1652857,
      "timestamp": "27:21"
    },
    {
      "speaker": "Ryo",
      "text": "で言うとどっちなんだろう?日本の方がなんか品質を大切にして先送りに、そのなんていうの、あのシップメントってかなんかその出すのを後にしそうなイメージはあるけどこっちは?",
      "start": 1652857,
      "end": 1668695,
      "timestamp": "27:32"
    },
    {
      "speaker": "Senna",
      "text": "それだからあれでしょ、本当に会社寄るんじゃない?日本のやばいところってさ完全にブラックボックス化してることじゃないですかあのもう銀行が超有名やけれどもさあのもう誰がどう触ったかもわからないものがどんどんどんどん炭素車変わっていって何がどうなっているかわからないっていうのを引き継いで動いているからもう触れないみたいななんかそういうのが一部のやばいところでそれは正直トップがエンジニアでもなんでもないし結局そのエンジニアリングの質品質っていうのがどれだけ重要かが系層が理解してるんだったら割と東海オンエアさんの言うとおりテスト大事品質重要視っていうのはあるだろうけどやっぱりトップがエンジニアリングに対してファーストで考えられてないところが多いからブラックマークスっていうのが多いなと日本の印象に関しては正直思う。",
      "start": 1668695,
      "end": 1714453,
      "timestamp": "27:48"
    },
    {
      "speaker": "Ryo",
      "text": "ねでもなんかこっちでもやっぱサース多分これはそれこそサースの会社が多いと思うんですけどとりあえず出しちゃうよみたいななんか出す時もその何パーセントなんか大きい会社とか特にやってると思うんだけど何パーセントに出してあのちょいまあなんか自分たちの中でもまあテストするんだけど外を出しながらテストもしてなんかあったらすぐ直すみたいなそのイテレーションどんどん回してこいよみたいなのはあるんでその品質はもちろん良いのは良い方がいいんだけどなんかあるなんだろうある程度のところでもう出してどんどん回していこうみたいなのはあったりそれで言うと、まあやっぱなんか低レイヤーでとか、その会社によりけりな部分はありますよね、その会社とかも。そうですね、。",
      "start": 1714453,
      "end": 1764043,
      "timestamp": "28:34"
    },
    {
      "speaker": "Naoto",
      "text": "それとジェンスの違いでもありますよね。",
      "start": 1764043,
      "end": 1765364,
      "timestamp": "29:24"
    },
    {
      "speaker": "Ryo",
      "text": "確かに。",
      "start": 1765364,
      "end": 1765854,
      "timestamp": "29:25"
    },
    {
      "speaker": "Senna",
      "text": "確かに。ハース系でだってそんな品質側とか言ってたらね、もはや仕事にならないもんね、。",
      "start": 1765854,
      "end": 1772529,
      "timestamp": "29:25"
    },
    {
      "speaker": "Ryo",
      "text": "一部は。",
      "start": 1772529,
      "end": 1773470,
      "timestamp": "29:32"
    },
    {
      "speaker": "Naoto",
      "text": "まあ、そうですよね。",
      "start": 1773470,
      "end": 1774330,
      "timestamp": "29:33"
    },
    {
      "speaker": "Ryo",
      "text": "そうですね。",
      "start": 1774330,
      "end": 1775141,
      "timestamp": "29:34"
    },
    {
      "speaker": "Naoto",
      "text": "そういうことでも、たぶん、あのうちの会社とか、たぶんネットワーキングのところが壊れたら、たぶん結構大変なことになるんで、。",
      "start": 1775141,
      "end": 1781716,
      "timestamp": "29:35"
    },
    {
      "speaker": "Ryo",
      "text": "確かに。",
      "start": 1781716,
      "end": 1782226,
      "timestamp": "29:41"
    },
    {
      "speaker": "Naoto",
      "text": "あの、ていうってことだと思う。",
      "start": 1782226,
      "end": 1783888,
      "timestamp": "29:42"
    },
    {
      "speaker": "Senna",
      "text": "んですよね。",
      "start": 1783888,
      "end": 1785855,
      "timestamp": "29:43"
    },
    {
      "speaker": "Ryo",
      "text": "そしたら今後今の結構多分やられてることがすごい好きって感じだと思うんでそれこそプロダクトエンジニアだといろんな会社回ろうみたいなのってあるけどあんまりだからそのポジションは少ないわけじゃないですか他のそうですねプロダクトエンジニアに比べてなんかどういう風なキャリアを進みたいなみたいなのってありますか。",
      "start": 1785865,
      "end": 1812859,
      "timestamp": "29:45"
    },
    {
      "speaker": "Naoto",
      "text": "そうですねまあ自分はそのなんか今は全然もうまだ全然犯人前なんですけど将来的にはそのなんか世界でもなんか結構自分一人しかできないぐらいの専門性を持ちたいなっていうふうに今はそれがまず目標というかいうふうに思ってるのでそういう方向に行けるようなソフトエンジニアになりたいなっていうふうに。",
      "start": 1812859,
      "end": 1836548,
      "timestamp": "30:12"
    },
    {
      "speaker": "Ryo",
      "text": "思ってますねそういうの、具体的にはどういう感じなんですか?あんまりイメージができなくて。",
      "start": 1836548,
      "end": 1842842,
      "timestamp": "30:36"
    },
    {
      "speaker": "Naoto",
      "text": "僕も全くわかんないんですけど、勝手にそれは言ってるだけなんですけど、だから、それもなんか模索中というか、感じですか。なんか分野としては、例えば、ソフトウェアテスティングマニュアルのテスティングじゃなくて自動ソフトウェアテストがすごい研究でもやってたんですごい興味があるしあと行動の信頼性というかそういうのにも僕は興味があるんでそういう分野だったりとかっていうのに進めたらなっていうふう。",
      "start": 1842842,
      "end": 1877608,
      "timestamp": "30:42"
    },
    {
      "speaker": "Senna",
      "text": "に思ってますなるほどね。",
      "start": 1877608,
      "end": 1879588,
      "timestamp": "31:17"
    },
    {
      "speaker": "Ryo",
      "text": "そうするとやっぱり北米とかアメリカとかメインで行こうかなみたいな感じなんですか?それともなんか日本に帰ったりとか、またまたヨーロッパに出てみたりみたいな、なんかそういうのは考える?",
      "start": 1879588,
      "end": 1892419,
      "timestamp": "31:19"
    },
    {
      "speaker": "Naoto",
      "text": "そうですね、それに関してはまあ35歳ぐらいまでに頑張って一人前になって、そこからは日本に帰ろうかなっていうふうに思ってます。",
      "start": 1892419,
      "end": 1903882,
      "timestamp": "31:32"
    },
    {
      "speaker": "Ryo",
      "text": "日本でもそういう会社ってあるんですか?そういうことができる会社だったりとか、そういうポジションみたいなのって募集あるんですか?",
      "start": 1903892,
      "end": 1911533,
      "timestamp": "31:43"
    },
    {
      "speaker": "Naoto",
      "text": "どうなんですかね、全然だからそれもわかんないんで、それも自分で見つけていかなきゃいけないなっていうのがありますね。それこそ、本当に世界に1人ぐらいになれれば別に場所とか関係ないなとも別。",
      "start": 1911533,
      "end": 1924996,
      "timestamp": "31:51"
    },
    {
      "speaker": "Ryo",
      "text": "にそれは思ってますね。あとは、データセンターで言うと別に必要なのは、北米だけって話じゃないから、なんか、今はまだないけど、そのAWSとかね、あのGCPみたいなのが日本でもできてきたりしたら、そういうところが使ってくれる。それこそ、ネットワークスイッチみたいなものとかも、開発とか、日本の独自のとかができたりするのかな。",
      "start": 1924996,
      "end": 1949847,
      "timestamp": "32:04"
    },
    {
      "speaker": "Naoto",
      "text": "どうなんですかね確かにGogleは多分データセンター日本にあるってことですよね。",
      "start": 1949857,
      "end": 1953479,
      "timestamp": "32:29"
    },
    {
      "speaker": "Senna",
      "text": "そうだよねどこだったっけなんか地震が少ない地域がどちらこちらっていうなんか見た気がするけどそっかデータ。",
      "start": 1953479,
      "end": 1959722,
      "timestamp": "32:33"
    },
    {
      "speaker": "Ryo",
      "text": "センターは地震と関係してく。",
      "start": 1959722,
      "end": 1961323,
      "timestamp": "32:39"
    },
    {
      "speaker": "Senna",
      "text": "んだねえそういうの知らない思ってたらそうだよねっていうねそりゃそう。",
      "start": 1961323,
      "end": 1965605,
      "timestamp": "32:41"
    },
    {
      "speaker": "Naoto",
      "text": "だっていうでもそうですね、僕は日本に帰ろうと思ってるんで頑張ってその北米ででもやっぱりその自分のなりたいエンジニア人というかまあ国境のパス的にはやっぱり北米で経験を積むのが一番いいんでなるべく北米にその1、2万円になるまで空いてその後日本に帰ろうかなっていうふうに思って。",
      "start": 1965605,
      "end": 1985697,
      "timestamp": "32:45"
    },
    {
      "speaker": "Senna",
      "text": "ますなるほどね35っていう数字でちなみにどっから出てきたんですか?なんかあった、。",
      "start": 1985697,
      "end": 1990510,
      "timestamp": "33:05"
    },
    {
      "speaker": "Naoto",
      "text": "あるんですか?僕の指導してた教官、あの教授の年齢がだいたい35歳とかそのぐらいでその人はあのその世界に一人と言ってもいいぐらいのあの知識だったりあの実績を持っている人なんで僕もそろそろそこにしようかなってまあとってはつまそれより年に置いちゃうとまあの勝手にまあ正直ランダムな数字ではあるんですけどあのそれより年行っちゃうとあのもしかしたらその日本で働き出すのがちょっと厳しいのかなとちょっと思ったりもって感じです。そのぐらいが一番フレッシュというかその時に働き出せるかなっていうふうに思ってます。もし一人前になれたらですけど。",
      "start": 1990510,
      "end": 2038526,
      "timestamp": "33:10"
    },
    {
      "speaker": "Senna",
      "text": "素晴らしい。目標がちゃんとあるっていうの。",
      "start": 2038526,
      "end": 2040488,
      "timestamp": "33:58"
    },
    {
      "speaker": "Ryo",
      "text": "はすごいいいことですね。そしたら最後になおとくんみたいなパスでこれから留学しようとしている人たちに何かアドバイスとかこういうことをしておいたらいい方がいいよとかってあったらお願いします。",
      "start": 2040488,
      "end": 2056465,
      "timestamp": "34:00"
    },
    {
      "speaker": "Naoto",
      "text": "僕でよくやるかなんですけど1、2年生の時は結構そのコンピューターサイエンスの基礎的なことを勉強した方がいいかなっていうふうにもちろんそのある人もいるんであのあれなんですけど基礎的なことをなんかしっかり勉強してあの例えばそのプログラムについて触れてみるとかデバッグをなんかいっぱいしてみるとかあとその理論的なこともすごい大事だと思うんでそういうのもしっかり勉強してみるとかやったりするのが12年生のうちはいいかなというふうに思いますかね34年生だったら例えばその基礎的な経験を生かして例えばいっぱいプロジェクトをやってみるとかあとそれこそ研究室に入って研究してみるのもいいですしあと後はインターンを例えば探してみるとかそういうのもあのするのがいいのかなっていうふうに思いますがめちゃくちゃありきたりなアドバイスですねこれ。",
      "start": 2056465,
      "end": 2106444,
      "timestamp": "34:16"
    },
    {
      "speaker": "Ryo",
      "text": "来る人に対してはどうですかまあ高校生とかかな高校生中学生またまた中学生みたいな感じで大学は海外の大学に行こうみたいな人にはなんかアドバイスありますかこういう風にやるといい。",
      "start": 2108859,
      "end": 2120587,
      "timestamp": "35:08"
    },
    {
      "speaker": "Naoto",
      "text": "よみたいな多分なんか英語がなんかもしかしたらなんかそんなにもしかしたら一番大事にもしかしたら海外の大学だから考えてる人がもしかしたらあの多いかもしれないですけどあんまりなんか自分的にはその英語そんなに重要じゃないかなっていうふうに思っててもちろん最低限の英語は必要なんですけど例えばそれよりなんかもうちょっと大事なのか例えばちゃんと考える力とかあと人とコミュニケーションする方法とかそれは言語関係なく人とコミュニケーションする方法だったりとかあと自分の興味思ったことをやるとかそういうことを続けていくと英語とかはあんまり後でも全然ついてくるのかなっていうふうには僕は思ってます。",
      "start": 2120587,
      "end": 2173210,
      "timestamp": "35:20"
    },
    {
      "speaker": "Ryo",
      "text": "確かに、フィリピンに6か月で仕上げたっていうことだった。確かに、逆にそれだけで、もちろんそれだけじゃないし、いろいろ結構頑張ったんだろうけど、確かに、そこでそれ以外をいろいろやっておいて、フィリピンとか、英語を安く、長く、集中的にできるような場所で準備するってのはあり。",
      "start": 2175724,
      "end": 2201475,
      "timestamp": "36:15"
    },
    {
      "speaker": "Naoto",
      "text": "でもその戦略モードもやっぱりその結構その人によって例えば親の資金力の違いとか人によって違うんでもちろんそのあのあれですけどでもなんか基本的にはなんか英語は全然なんかその後からでも僕は全然大丈夫かなっていうふうに思っているというかもっと例えばその自分がそのでそのなんか物事を動かしていく力その自発的になんか動かしていく力だったりとか人とコミュニケーション取る方法とかそういうのをしっかり、あと興味を持つことをちゃんとやるそういうのをやれば、結局英語はそれができればもう全然できると思うんで別にそんななんか英語についてそんな今全然日本ずっと日本でその帰国市場じゃないけどみたいなの全然心配しなくてもいいのかなって。",
      "start": 2201485,
      "end": 2246980,
      "timestamp": "36:41"
    },
    {
      "speaker": "Senna",
      "text": "いうふうに思いますなんかそうよね根底のコミュ力って俺はいつも思ってるけれどもそれどうやったらつくんだろうねなんかさっきのなおとさんのね話とがさんのエピソードみたいな話じゃないけどなんか自分から話しかけたりとかさ私こんな状況です車乗せてくださいみたいなさそういうのも含めだけどなんかそういう一言が言えるようになるのってどういう教育を積めばなるんだろうなーってずっと最近考えてるんですけどねみんなポッドキャストやれば。",
      "start": 2246980,
      "end": 2273595,
      "timestamp": "37:26"
    },
    {
      "speaker": "Ryo",
      "text": "いいんだよ僕はでもそこじゃなくて逆にあの僕は高校生まで多分脳みそ入ってなかったんだよねだからあんまりそんな人います?そんな人いないよあんまりそういうなんだろう海外に出ようとか自発的にみたいなのなかったんでそれどうやって育つんだろうって逆に思いましたけどねコミュニケーションはまあまあなんかあの頑張ればちょっとなんとかなるのかなってわかんない僕は思ってるんですけどその自発的に海外出ようとか自分の生きたい方向性をそんな若い時から考えていくってのがすごいなって環境としか。",
      "start": 2273595,
      "end": 2314771,
      "timestamp": "37:53"
    },
    {
      "speaker": "Naoto",
      "text": "思えないもん正直それだけも結構でかいんじゃないですかやっぱり実際何かをしたいってなってもかなり応援してくれる人が周りにいなかったらもちろんどんどん厳しくなってきますし自分の力があったとしてもだからそれはまあ難しいところではありますよねだからといって別になんか後からでも全然その例えばその奨学金を取るとかそういうのもまあなるのかなっていうふうには思いますねそうですね。",
      "start": 2314771,
      "end": 2345627,
      "timestamp": "38:34"
    },
    {
      "speaker": "Senna",
      "text": "間違いないまあやれることをやりましょうっていうことじゃなるんだろうけどもそうねまずはちょっとじゃあ根底のコミュニケーション能力から。",
      "start": 2345627,
      "end": 2352652,
      "timestamp": "39:05"
    },
    {
      "speaker": "Ryo",
      "text": "日付大切ですねそしたら今回はこれで締めようかなと思います今回のゲストはナオトくんでしたありがとうございました。",
      "start": 2353853,
      "end": 2363634,
      "timestamp": "39:13"
    }
  ],
  "highlight1": "カナダの大学でコンピューター サイエンスを学んだ直人さんが就職した会社は、アリスタ ネットワークスというデータ センター向けのネットワーキング スイッチを作る会社です。",
  "highlight2": "日本でインターンだけの経験がある直人さんですが、カナダの会社では1年に10人から20人のニューグラードが入社するようです。",
  "highlight3": "直人さんは将来的には、世界でも一人前になるくらいの専門性を持ったエンジニアになりたいと目標にしています。"
}