{
  "episodeGuid": "e848c1df-6345-45f9-89dc-c9d6f14f94d2",
  "episodeTitle": "日本でのキャリアに挫折しカナダへ！レイオフを乗り越え年収1000万円超えのエンジニアになった話（前半）#13",
  "transcribedAt": "2025-10-19T06:39:22.948Z",
  "duration": 2286,
  "fullText": "はいそれでは今回はヤンマーさんに来てもらいましたまず経歴から簡単に教えてもらってもいいですか了解。ですヤンマーって言います経歴を簡単に言うと日本のほうでCS系の大学を出てその後は日本でちょっと数年間働いてその時は結構なんかもうなんでも技術系なんですけどもなんでも屋さんみたいな感じのやつでその後にカナダに渡ってカナダでは1年間学校行った後にその後にCICCCっていうところの学校でそれを卒業した後に1年間カナダのやつでモバイルを1年間ちゃうわ数年間モバイルをやってで今最近ちょっと転職して1年間バックエンドエンジニアをやってるっていう感じですねめちゃくちゃじゃっくりなんですけど日本。での日本ではなんかプログラミングみたいなことはして。たんですかそうですねやってたんですけどもまあなんか中途半端っていう感じだったんでまあなんかSIR。みたいな。そうですね、そういうパートもあるし、結構なんか本当に何でもっていう感じでしたね。で、日本での経験がどのぐらい。って言われました?2、3年ぐらいですかね。で、。それからじゃあ大学行って2、3年やってこっち来たみたいな。そうですね。今はこっちでは2社目?3社目?カナダだけで言うんだったら2社目ですね。あれですよね、ヤンマーさん、レイオフも経験されてるんですよね、1社目ってかな。そうですねこっちで最初モバイルエンジニアでIOSでやったんですけどもメインでそっから23年間やった後に零予布食らってそっから転職活動っていう感じになってそれで結構苦労してでもそのときにモバイルじゃなくてバックエンドやりたいなってなったんで今バックエンドで転職したっていう感じ。ですねなんかちょうどこの間僕と彩香さんとあと瀬名さんかなでレイオフについて話したんですけどまあ僕たちはあのレイオフはえっとなんていうんだろう旗からは経験レイオフされてない側では経験してるんですけどなんか山さんはちゃんと何だろう本当にレイオフされた側だったと思うんでちょっとそこら辺についても聞いていけたらいいかなと思いますそしたらカナダに渡航するまでの何か経緯みたいな教えてもらってもいいですか。日本で卒業した後に技術職系で入って、2,3年くらいやってたんですけども、ちょっとやっぱり僕のせいか分かんない…本当に会社と合わないっていう感じで会社が悪くはないと思うんですけど本当に僕が合わなかったっていうのででも結構日本の会社で辞めるのもったいないみたいな感じの不調があって結構それで中途半端になって結構メンタルやんで僕そこで結構ちょっと休職しちゃって休職してこのまま日本でずっと働けるんかなみたいな思ってもともと僕結構英語には自信があったんで、なんかどうせ日本で無理だったら英語でちょっと働いてみたいっていうのが昔からあったんで、ちょっと勢いよくもうやるしかねーかなーみたいな感じで、なんかその時は僕は結構なんかめっちゃなんかこう日本、本当はそうじゃなかったんですけども、日本はもう働けねえみたいな、海外しかねえみたいななんかアホみたいな感じの考え方があったんで、ちょっと勢いよくカナダにせっかくやから行ってみようって、無理だったら帰ってきたらいいかっていうのをで、きっかけっていう感じでした。英語に自信あったっていうのはスピーキングのパートですか?それともなんかインプットみたいな意味で、それともどっちもだったんですか?リーディングとライティングを除くっていう感じですかね。逆にリスニングとスピーキングがすごい、その当時は自信ありました。こっち来てから打ち砕かれましたけど、その時は自分の中ではめっちゃできるやろって思ってました。それはもともとそういう英語を使ってたっていうバックグラウンドがあったんですか?そうですね、僕は本当に生まれてから、日本では生まれたんですけども、そこから生まれた後にすぐにカナダに漁師の仕事の都合上行って、5年くらい幼少期過ごしたんですよね、カナダで。で、日本に帰ってきたんで、そうなので、でもぶっちゃけ記憶は全然ないし、その時何が残ったかっていうと発音だけだったんですよねでも発音が残った時になんかこいつ発音だけすごいのに英語ダメダメじゃんって言われるのがめっちゃ悔しかったからちょっと中学校ぐらいの時に勉強英語しまくってちょっとそこで英語のリスニングとスピッキングが得になってでもなんかその後に高校とか大学は全然勉強しなかったんでなんかまた微妙になって、でもなんか微妙に英語をこいつ、まあこいつというか自分の中でもできるのにそれを全然仕事で使わないのってすげえもったいなくねみたいなのが世の中であったんで、まあいつかちょっと海外で行きたいなっていうのがすごいあったっていう感じですね。ちっちゃい頃はカナダのどこにいたんですか?カナダはね、確かトロントのそうだっすかね。トロントではないんですけど、トロントから1時間ぐらいの田舎だったんですけど。英語は具体的にどうやって勉強したんですか?中学生の時でもいいですし、社会人になってからでもいいんですけど、もともと大学出てると思うんで、インプットは結構、大学の時点ではグラマーとボキャブラリーのインプットはあったみたいな感じですか?そうですね、僕語彙力と文法だけはもうカスだったんで、ノリで喋るっていう感じの方が得意で。なので、とりあえずなんか実践的に使うのがすごい得意でしたね。なんか覚えるのかがすごい嫌いだったんで。英語とかも自分で中学とか勉強するときはとりあえずこれを英語で言うんだったらどう話せるんだろうっていうのを意識してずっとスピーキングの練習をひたすらやっててあとはリスニングの方は本当に映画とか好きだったんで映画とか聞きまくってたら何とかちょっとリスニング。が発達したスピーキング苦手な日本人って多いじゃないですかどっちかっていうとそのライティングとかリーディングの方が得意でみたいなだけどスピーキング苦手なのってやっぱり話す機会がなかったりとかそういうあのヤンマーさんみたいに頭の中で英語にするんだったらどうするんだろうって考えるけど実際口から音を発生するのがあんまり機会がないっていうのが苦手になっちゃう理由なのかなって私は思ってるんですけどなんかそういうアウトプット外国人の人を相手にとか、誰か違う人でも相手にとか、そういう場があったんですか?そうですね。半分イエスで半分ノーで、高校ぐらいまでの時ってそんな海外の人と話すっていうのがないんで、もうぶっちゃけボッチでひたすら部屋でモソモソ言うっていう感じでしたね。でもそれができるのすごいですね。もうプライドとかなかったんで、もうなんか普通に喋ればいいんじゃねーみたいな感じだったんで、ひたすらなんか、なんか別にその無理やり話すとかじゃなくて、例えば日本語の英語とかって、教材とか中学校のやつって、なんかすげー穴埋めとか、なんか日本語の文があって、その下に穴埋めとか、なんか文字並び変えるとか、そんな感じじゃないですか、英語のやつ。そういうのを見たときに、もうなんかそういう英文のヒントとかもガン無視して、とりあえず日本語があったら、これだったら自分で英語でどういうかなっていうのを全く、もう一から自分で話した後に、その後に適当な仕組みを取るという感じだったんで、もうなんか初めからとりあえずなんとか英文を構成するみたいなことをひたすらやってました。なんかそのモチベーションって結構難しいじゃないですか、勉強を続ける上で。そこら辺なんか英語はやっぱりずっと好きだったからモチベーションはずっと高かったんですか?それともなんかモチベーションを高く保つためになんかコツみたいなのがあったんですか?そうですね、これはまぁやっぱちょっと参考にならないですけどさっき言ったその悔しさっていうかなんか発音だけあんのになんか英語全然できねーってなんかわかるっていうのがすげー恥ずかしかったっていうのがあって僕あの中学校かどっかひどかったのがあのカフェってあるじゃないですかCAFEってうんで僕あれもくそ昔あのKFって呼んでたんですよねでなんかめっちゃそれで恥かいてそんなレベルの英語だったんでまぁ発音だけあんのにお前なんかナチュラルななんかちょっと外人ぽい発音なのにおいKFなんかよみたいな感じだったそういうのもあってって。感じでそれはなんか実際に馬鹿にされた感じなんですかそれともなんか自分の中でやっぱり強くなっていったんです。かそのあーなんかギリギリあのバレなかったんですけどもなんか友達とのなんか会話の中でなんかこう自分の中であれ系譜だって思ってたのに友達がカフェって言ってマジでみたいなあれがみたいな感じであやべやべみたいなという感じでしたねそしたら。次技術力について聞いていきたいんですけど技術力は大学行かれたんですよねCSKのそうです。ねその時は特に将来とかじゃなくてその頃ってちょうどパソコンとかめっちゃ流行ってたんでちょうどインターネットとかYouTbeとか流行りだしてで、まあなんかそれが好きになって、なんか勉強したいっていうよりも、なんかもうそれぐらいしかないかなーみたいな、なんか他のことあんま勉強しなかったんで、もうなんか半分逃げるようになった。それは大学に入る前ですか?前ですね。ちょうど高校ぐらいの時からなんか、あのまあ本当YouTbeとかニコニコ動画とかめっちゃ流行ってたじゃないですかまぁちょっとあの時代になっちゃうんですけどもその時になんかちょうどなんか画像画とか本当にメディアっていうのが本当にインターネットを通して広まってたんでそこでやっぱりその今まではテレビで見てたものがインターネットで見るようになってそうするとなんかやっぱりもうそこで全部なんかこうブロックとかあとはExcelとかもちょうどそういう時にできたんで、作業とかもそういうのになって、全部パソコンになっていったんで、自然とそのフォーカスがパソコンになったんで、そこで繋がったから、大学もそっち側でいけるかなーみたいな感じ。家にパソコンあったんですか?僕は田舎モンだったんで、で、お父さんもお母さんもパソコンとか触れなかったんでニコニコ動画とか僕、未だにほぼ多分触ったことないぐらいその頃はもう全然わかんなかったしそのなんかインターネットの発展みたいなのを全然見ずに僕は過ごしてきた人間なんでなんかどうやってそこに関われるようになったのかが全然イメージつかないんですけど。なんなんすかね僕でもなんか気づいたらパソコンは買ってもらえてたのかななんかそこは親が優しかったのかもしれないなんかその仕事でとかなんかで必要とかかなまあなんかもしかしたらその当時ちょうど学校で必要になってきたから宿題とかそういうのもなんかでもなんかこう事務作業とかもなんかちょっとエクセルでやるとかあったりしたんですよね宿題かわかんないですけど学校の行事とか委員会とかそうなので説得したのか親が優しさで買ってくれたのかわかんないですけどもうちのゲームは結構禁止で厳しかったんですけども時間制限があったんですけどパソコンは全然OKだったんで自然にそっちの方に行ったようになっ。たというかじゃあその高校時代に買ってもらってそこからもうじゃあプログラミングとかも興味出てきて自分で始めたみたいな感じなんですかそれとも大学で習ってみたいな流れだった。んですかいやープログラミングは全然したねーあの大学に入る前まではてかなんならプロ大学入った後も結構つまずいて1回挫折したんですよね結構日本の時はほぼほぼ挫折しててそのまあ詳しく言うとその詳しくっていうか大学入る時は本当にそのメディアの方なんですよね画像がどうとか動画がどうとかなんか動画の圧縮どうするとかそういう家の方に何かがすごい興味があってアルゴリズムほどではないんですけどもでもなんかこうウェブのなんかいろんな動画のなんか種類とかあれなんかダウンロードしてたりすると結構気付くんですけどなんかいろんな画像の種類とかなんかあってなんかそういうのにちょっとこう興味持ってたかなーみたいな感じででプログラミングはマジで大学入ってその遊びじゃなくなってそういう本当のコースに行ったんでプログラミングっていうのがあってでもそこで超挫折しましたねもうあのCとJavaのせいですねダメですあれは本当にあの分厚い教科書やばいっす本当にもう未だに覚えてますもんなんかポインターがなんちゃらとかなんかもう本当にしかもその時そんなになんかYouTbeでチュートリアルとかなかったんでなんかもう本当に本を通してやって本だったらコピーもできないからなんかキストエディターとかにパパパーって手打ちでやってなんかコンパイルしてみたいな感じでほんまに何のためにやってるのかなみたいなインターフェースとか継承とか何みたいな感じでほぼほぼ授業をサボってダメ学生っていう感じ。でこっち来てから確かあれですよね僕も同じだったんですけどコーナストンに行ってそれが1年勉強して1年コープっていうワークビザがもらえるコースに行ったと思うんですけどそこでは何を勉強され。たんですかそこはそうですね結構CSの基礎とプログラミング基礎プラスでもアルゴリズムどっすりかつモバイルっていうちょっと変化球みたいな感じでこれは名前出していいのかなあのcicccの多分ご存知だと思うんですけどあの先生これ先生があのすごいあの変態的といういるかなっていう感じのすごい人で即戦力としての内容を教えてくれるかっていうと分かんなかったんですけどもでもその逆に結構CSの基礎とかバイナリーとかなんかビットのやつとかそういうのの基礎からしかもめっちゃコンサイズが簡潔に分かりやすく教えてくれて結構アルゴリズムの方とか、モバイルががっつり得意だったんで、その時はモバイルのことを教えていったんで、結構そこで普通は学校ってカスっていうか全然頼りないっていう感じだったんですけど、僕は珍しくこの先生教え方面白いなってなって、そこでさっき言ってたみたいに僕結構右を曲折いってめっちゃプログラミング挫折しまくってデザイナー目指してたんですけどもそこでもう一回なんかあれなんかこれ大学で習ったことめっちゃ実は面白いやんってなってもう一回ソフトエンジニア全然目指せるやんとかモバイルやってみよっかって流れでそうなったあれ先生デリックでし。たっけデリックです僕と同じ。先生なのそうですね。なので全然、逆に経験あったり、目的が違うとなんか微妙かなっていう先生かもしれないですけど、僕はなんか運良くめっちゃ相性良かったなっていうか。その先生に出会ったのが苦手意識払拭みたいなきっかけになったと思うんですけど、そもそもその先生に出会うまで学校に入らないといけないじゃないですか。苦手なウェブ開発じゃないですか、コースが。そこに至るまでに、デザイナー目指してましたって時に何があって、やっぱり学校で再度プログラミング勉強しようと思ったんですか?えーと、めっちゃそこ聞いてくれて嬉しいですね。でもめっちゃ参考にならないです。これは本当になんでやねんっていう感じなんですけど。僕もデザイナーのあの学校2年間のやつで募金満々だったんですよね。学費も払って、しかもその大学結構いいところでなんか面接やって、論文書いて、日本からそれ全部やって。パスしたぜみたいな俺はもうデザイナーでやっていくんだぜってノリノリでやってたらなんか床を半年前ぐらいかなあのなんか頃中なんかしわかんないですけど経営のためで中の学校潰れちゃってもうあの完全にボーンってなって入れませんみたいなとなっちゃってどうすんねんってなってでその後にもう学費も払ったまえにどうしようみたいな感じでまぁちょっとそれを置いといてとりあえずじゃあここからカナダ行くにはどうするんだってなってなんか結構いろいろ僕の中でオプションがあってなんか落ち着くまで待つとかなんか今からじゃあどこの大学行くねんってなってで結構なんか効率のちゃんとしたところ行くって言ってもあったんですけども結構なんかそうするとなんかランガラっていう大学なんですけども結構時間もからまたさらに再入科までかかるし入学してから卒業までも時間かかるから多分こんだけ時間かけてたらなんか熱意しないそうだなっていう感じでその潰れた直後でもなんか全然入れそうなところがciccだってでそのCICCCっていうのがその当時は噂程度でそのデザイナーが潰れちゃったんでそれを救済するっていうかそれを引き抜くためにあのなんかデザイナーのコースを用意してるぜなんかする今後あの開催するつもりだぜっていうのが噂でなんか聞いてたんですよなんでだからまあじゃあそれだったらCICCCちょっとワンチャンとりあえず入っといてそのデザイナーのコース目指せるんじゃないかなと思ってあのそこで選ん。だっていう感じでとりあえずはもう来るためにあのコース変えてでもまずはとりあえず行ってみようみたいな感じだった。そうですねもうなんかもうもう行くしかないっしょってなってもその時はよく僕のとその時の地心理はよくわかんないです今でもなんかよくやったなって。いう感じです学費返ってきました?振り込んだやつちゃんとえっとです。ね1年後にようやく返ってきましたそこも結構実はいろいろあってなんか学校が学費払った時にレシートをちゃんと渡しなかったんでそのレシートがなくて一番最初審査降りた時にはなんかもうデポジットしか返ってこないみたいななんか審査くだされて学費ほぼほぼ返ってない来ないみたいな感じになってマジでどうしようかなと思ったんですけどその後ちょっといろいろ他の書類とか銀行の送金とかいろいろ集めて提出したらなんとか1年後に審査、再審査で全部返ってきた感じ。でもCICCのデザイナーコースも結局できなかったけど、CICCCでモバイルを勉強したって。ことですねそうですね結局そこがさっきの話に繋がるんですけどデザイナー来るっしょっていう感じになってでもじゃあそこまでにとりあえずどこ行くかなってなってたまたまそのウェブとかのモバイルみたいなコースがあってここだったら自分が1回通った道だったんでとりあえず入れてやりそうだなっていうので一時的にそこに入ってデザイナーがあるコースが来るまで待ってたんですけどもなんか気づいたら来ないし、だんだんなんかその担当の先生、さっき言ったデレックが面白い授業してくれるから、あれなんか普通にソフトウェアエンジニアっていうか、ここら辺のやつ面白くねってなって、なんか気づいたらそこまでいいやってなって、結局モバイルで就職したっていう感じ。ちなみに選ぶときにそのコースでモバイルとウェブがあったと思うんですけど、そのウェブじゃなくてモバイルを選んだ理由っていうのは何だった?バンクーバってやっぱウェブの仕事は多いじゃないですか、でモバイルって結構少ないじゃないですか、で確かそのさっき言われた通りあの日本最初の会社はモバイルで就職し結局就職できたと思うんですけど結構その募集とかも少ないからなんかそこらへんなんでウェブではなくモバイルにしたのかなぁみたいなちょっと気になったけどなん。かCICCって最初共通のコースがあるんですよねなんか共通期間みたいな感じででその後にまあモバイルとウェブに分かれてモバイル行きたい人はモバイルにウェブ行きたい人はウェブに行っていいよってなってでそのままデルクがモバイルでやるって言ったからじゃあモバイルやろうって。言っただけでしょじゃあそのモバイルを最初から選んだんじゃなくてえっと共通のコースにいた時にデリックが面白かったからその先生に習いたいみたいな感じあ、。そうですね本当にそんな感じ。そしたらえっと就職活動についてちょっと聞いていきたいんですけどどのぐらい前からその勉強のタームが1年あってその後すぐ働けるようになるじゃないですかどのぐらい前からなんだろう就職活動って始めました具体的になんかレジュメ書き始めたり。とかあーそれぐらいですかね。レジュメとかはちょっとなんかそのコープ始まる半年前ぐらいかなって感じで、レジュメ以外のちゃんとしたやつは4、5ヶ月前ぐらい。だいたい3年前ぐらいから引き付け始めて、本格的に動かしたのはなんか3ヶ月前ぐらいからって感じ。今考えるとちょっと遅い感じかもしれない。でも半年前からそのレジュメ書き始めたりだったら結構早い方なのかなヤンマーさんがその多分転職その就職活動してた頃ってあのatsが大切だアプリケーショントラッキングシステムのことatsっていうと思うんですけどなんかそこらへんが大切だとかっていうそういう情報はまだ多分流れてなかったじゃないですかその今僕たちがいるフロックのコミュニティ内ではあーで。もちょうど流れてきた感じで、ちょうどなんかレジュメやるんだったらATSってのがあるらしくて、そこも一応意識した方がいいんじゃねーっていう情報はあって、でもまあぶっちゃけでもその時期ってなんかもうマスアプライの時期だったって、なんかもう結局ATSよっていうよりは、もうとりあえず書いて出せっていうのが最終的になったんですけども、言葉自身は出てきた、初めて。対策実際してた人はそんなに多くなかったと。ちょうど出始めの感じだった。どのくらい前から送り始めたんですか、レジュメは。あー僕結構なんか段階踏んでて1回その半年前ぐらいにとりあえずレジュメ書いてみようみたいなもうなんか行くところとか働けもしないし行くところもないんだけどもとりあえずなんか出すだけノリでやってなんか気づかないかなみたいなんで出すだけ出しといてでなんか当たりだけといてでその後にまた2、3ヶ月前ぐらいになっていろいろそのポートフォリオとか定力とか準備ができ始めた時に本格的にだし始めたんでなんかその一家一段階を置くことでまあなんかいきなりあるよりは全然いう線。使っちょうどなんか医師さんっていう人をこの間あのインタビューさせてもらったんですけど一山も同じこと言っててでその時にも僕も言ったんですけど僕も結構早い段階で送ってで特に送んない時期があって今勉強している時期があってまた送るって言ったんだけどなんかそのそのアジャイルではないけどあの1回やってみてでその結構そのレジュメを書いてレジュメを送ってっていうのって結構つらいじゃないですか帰っても来ないしみたいなだからそれをなんか先にやっておいてまぁ1回ちょっと寝かせてまぁまたそこから再開するっていうのは結構いいやり方なんじゃないかみたいなのを来ないで話しててじゃあ結構その形に似てるというか1回まあ何もしない時期があってでまぁその前回のなんだろ結果からちょっとまた変更して送り直したみたいな感じあ。もうマジでその通りです間違いなくそれが一番いいかなーってますねなんかめっちゃ準備してからやるってよりはもうとりあえずやってみてでそこで足りないものを気づいてから準備するっていう方が逆にした方が全然やっぱいいかなその本格的。に送り始めてからはどのぐらい送ったんですか?まあサプライってことだったと思うんですけど忘れちゃった。んですけど結構やっぱ4年前ぐらいだったんでまあでもやっぱり100は100以上はとりあえず送ってましたね100から150かなって感じ。でどのぐらい帰ってきてました?うーん人数はどれぐらいだったかなぁ忘れちゃったなぁでも11割は絶対あってもしかしたら2割ぐらいかなかもしれないですね。それは全部モバイルにですかそれともあのウェブも合わせ。てウェブも合わせてましたねモバイルメインだったんですけども結構ウェブも合わせたりバックエンドもやったりソフトエンジニア結構あの全般やってそれぐらいででもまあちゃんとしたやつはモバイルの方そうする。とレジュメは2種類みたいな作ってたんですかそれとも1種類のものをもうバーッとどこでも出す。みたいな感じでレジュメは3種類ぐらい使ってましたねさすがにやっぱ教授にポジションによっては変えてました会社によって変えるってことは方法しなかったんですけども多分モバイル用ウェブ用なんかバックエンドかソフトウェアエンジン用みたいな3種類でそれでガーッと。ちょっと戻るんですけど、ポートフォリオみたいなのとか、レジュメ以外の活動とか、あとはイベントに参加するとかもあると思うんですけど、どういうことをされましたか?そうですね、それで言うとポートフォリオは作ってました。特にモバイルの場合は絶対そのアップルストアに1回出したことがあるっていう経験がすごい重要なんでアプリを作ってそれを出すっていう経験を何個かやってイベントはその頃まだちょっとコロナの影響があったんでそこまでなんかその盛んじゃなくて参加をしてなかったそれ以外だと一応ボランティア的なものは参加してましたね3ヶ月ぐらいなんですけどでもそこで結構経歴かなり作れたんでそれをもとに何とかこっちでも経歴あるよみたいなのを見せてそれが結構。繋がったというか就職活動っていつやってもしんどいじゃないですかってなんかうまくいかない時とか何がうまくいってないかとか吟味する必要があると思うんですけどそういう時にメンターとか周りの人の力を借りたとかっていうのはありましたか?もうバリバリ借りまくってましたね結構そのいろいろあってその頃だと友達はやっぱりそのクラスメイトが一番多かったかもしれないですねやっぱプロジェクトも一緒だし同じ時期に来たしってので結構クラスメイトと一緒にならなかったでしょうか遅くまで残ってなんか一緒にインタビューとか手伝いあったりしてっていうのは大きくてそれ以外だと本当にそのフロックの名前出していいのかなフロックの人たちに聞いてみたりレジュメ見せてこれをどうなのとかポートフォリオどうなのか聞いてみたりあとは結構こっちのカナダのネイティブの友達も運良くこの頃から遊んでたんでそこにちょっと同じようにソフトウェアエンジニアだったんでそこにちょっと聞いて。みたりその友達どうやって作ったんですかなかなかレアな出会いじゃないですかネイティブのカナダカナディアンでソフトウェアエンジニアし。てるあーそうですねそこはもうマジで完全に僕がラッキーでしたっていう感じであのたまたまルームウェイトの彼氏がそのカナダ人だったっていう感じだったんでなんかそこで結構めっちゃウマがあってもう今でもそう飛んでる。ありがたいそしたら一社目の会社のインタビューとかそこから一社目どうだったかみたいな聞いていきたいなって思うんですけど一社目はどんな流れのインタビューだったんですか?思い出せる範囲で一社目どんな感じだったかっていうと結構一社目はモバイルで入ってその時ポジションはジュニアだったんですけども入るときにダミデッドでやってくれないって言われて結構スタートアップのノリだってなんか会社自体は10人、あ、違う10人じゃない100人ぐらいの結構まあまあ大きな規模だったんですけどもでもそのもともとなんか技術部門みたいなのが全然なくて自社開発しようぜっていうノリで初めて技術部門を作って最初のスタートの人数がだいたい5、6人だってその中の僕がモバイルの人として初めて雇われたんで結構もうほぼほぼスタートアップのノリで会社の人数の規模に対してやったっていう感じだったんでなかなか最初の数ヶ月はもうやべぇやべぇっていう感じでしたねなんかもうほぼほぼ一人の戦いだったしなんかやっぱりなんだかんだやっぱこっちの初の仕事でしかもリモートワークだって本社はケローナだったんでもうなんかコミュニケーションとかもなんかそんなに取れないししかもケローナなんでカナダのケローナの会社なんでほぼほぼみんな白人みたいな感じでアジア人ほぼほぼいねぇじゃんみたいな感じだったんで結構なんか孤独というかなかなかその時いろいろ右往左往やりながらっていうやつ。でしたインタビューはどんな感じの流れだったんですか?インタビューに関してはですねあんまちょっと覚えてないんですけどでも本当にごくごくオーソドックスなこっちの感じでなんか最初レジュメ通った後にちょっと人事の人と話したりしてその後に軽くテックのインタビューがありましたねでもなんかそれは結構特殊で、簡単なそのワードの中に質問が2、3個ぐらいあって、なんかそのストリングをぶっつける時にどうしますか、みたいな気をつけることありますか、みたいなコンパティネーションってやつですかね。それなんとかで、あとは2問目がちょっとモバイルの基本に関してで、例えばなんかそのモバイルでなんかこういう画面製品があったときにどういう設計しますかみたいなのをまあ高等かちょっとそのワードリングっていうのがあってそういう技術のやつが1個あった後になんかもう1個カルチャーフィットみたいなやつが1個あって最後になんかあったっけななんかそのもう1回ぐらいあったかもしれないもしかしたらカルチャーフィットが最後だったかもしれないでまぁその後にオファーの。これは質問とかのやつはzomでやったんですかそれともなんかオンラインアセスメントみたいな感じだった。んですか全部zomで実際の対人でやるっていう感じでしたオフラインで宿題形式なのは他の専攻でいっぱいあったんですけどその会社は全然いなかったじゃあ。1日のうちに全部のインタビューは終えた感じなんですか。基本的には何回かに分けたんでだいたい2週間か3週間ぐらいかなのプロセスだったと思いますね4回ぐらいあって3回か4回ぐらいで1回はもう30分か1時間ぐらいでしたエンジニア。部門は新しかったってことだったんですけどもうすでに他のエンジニアはいて新しく新しくできたって感じだったからなんかそのインタビューとかは普通に滞りなくなんか普通のプロセッサーだったのかなそう。ですねえっとまっきり本当の本当のえっとなんかリードみたいなが人いてウェブの人が一人ってバックエンドの人が一人いてマネージャーが一人でこの4人ぐらいだったんじゃないかなで初めて僕はモバイルでっていう感じだってなので本当に最初のなんかそれぞれのパートのコアメンバーみたいな感じで最後モバイルを雇われるときに僕がやった技術面接はそのリードの人と軽く話したっていう感じで今。までのこのトッドキャストで話したか話してるかわかんないんですけど面接対策ってなんかいろんな種類の面接が会社によってあるじゃないですかペアプログラミングだったりとか一緒にアルゴリズムの問題解いたりとか質問形式、Q&Aみたいなのになる可能性もあるし、いろんなパターンを準備するかなと思うんですけど、私なんかその面接対策、あんまり何が有効なのか、人の意見を聞いたことがなくて、具体的に何されたかとか覚えてますか?そうですね、その頃はマジで超意識してたってわけじゃないんですけどもマジの面接対策って本当にビッグテックだとめっちゃ必要なんですけどもそれ以外だと結構、もうモックインタビューで慣れるっていう感じが結構重要だと思うんですよねあとは本当の技術的なものは普段から意識している業務内容をめっちゃしっかりやってたら意外と応えられるみたいなイメージがあったんでもちろんそういったいっても僕が初めてのカナダの会社だったんで色々そのなんだろうねCSとしての基礎的なところは勉強したしあとはモバイルはモバイルで結構その知っておかないといけないなんか基礎的なものがあったんでそこをしっかりやってでそれ以外は本当にそのモックインタビューってことで面接ならではのコミュニケーションのやり取りで必要なことを友達とか周りの人と協力しながら進めていった感じでものすごい特別何かを対策したっていうのはあんまりないかもしれない基本的にはもう基礎力っていうか基礎的な質を高めるのだけは意識したでもモック。インタビューするのって大事ですよ。ねなんか練習相手めちゃくちゃ大事ですねなんかもうむしろそれが一番っていうレベルでなんかもう結局どんだけ知識あって技術あってもなんかそのどういう面接の形とか知らないと慣れてないともう全くあれなんでスポーツとか一緒で教科書読んだだけでは絶対できないんでとりあえずハンズオンでやるっていうのが一番重要だったか。もそしたら最後にヤンマーさん年収公開してもいいよってことだったんで最初の会社の年収を教えて。いただいてもいいですか最初の入った時ですかね、結構僕いろいろ変わってたんで。じゃあそしたらその入った時と推移を、まあなんか思い出せる範囲で、言える範囲でお願いしてもいいですか?了解です。僕がまずカナダに入った時は、ジュニアのような、ほぼジュニアなんだけど、半分インターミディアみたいなポジションで、その時が650Kでしたね。65Kだ。650万みたいな、だいたい。そうそう、650万。その当時はめっちゃ大手だったんですよね。日本の時がだいたい400万か500万いってたかな、わかんないですけど、それぐらいだったんで。日本の方でも結構多いと思ってたんですよ。貰いすぎだろうと思ってたんで。カナダ来て、マジで一発目でこんなジニアっぽい人に、こんなくれんの?みたいな感じで。方法だったんですけどもしかもさらにその後に1年か2年ぐらいした後に1年ぐらいだったかなその後になんかもう交渉とかしたんですけど多分インターミデートのポジションだったかな会社もちょっと引き上げてくれてなんかある日突然こうあの偉い人からのコールがあってやったらなんか80kにあげるよってなってマジかよみたいな800万以上じゃんやべーやみたいな日本の中でやっぱその時やっぱ自分の中でオワイみたいな感じだったんでそれでイエーイってなってでさらにそっから1年ぐらいかな2年ぐらいか経った後になんか結構頑張ってたんでまたもう1回そういうのがあって最終的にその会社行ったのが105Kですねおお、。全然すごい。なんかすごい低いんですって謙遜してたから、結構もっと低めを想像してたけど、全然すごいですね。え、。それベースでですかね?その後はもろもろのうかってくるんですよね?いや、もう全部ですね。それが全部なんで、オプションとか全部抜きで、もう全部トータルで105っていう感じなんですよね。だからまあ、人によっては、もうちょっとあるんじゃね?っていうかもしれないし、。上がり方すごくないですか?65、80からの105?だっけ?なんか、ジャンプがすごい。いや、まじでやばかったですね。でもなんか、僕も結構そんな感じで、割と多分あれあれなのかな?やっぱり一社目って結構、その会社でも結構安めに言ってokしてくれたから多分それで取っちゃってでもこの人ちゃんと働いてくれてるし他の人たちとの差みたいなのあるから埋めた方がいいよねみたいなのでヤマンさんの場合はジュニアとはいえどインターミディエイトみたいなポジションで入ってるからそこまでは引き上げようかよくやってくれてるしねみたいなのでなんか上げてもらうみたいなケース結構多分あるあるあるというかあるのがあるのかなでもそれでもヤンマーさんのすごい高いなと思うんでめちゃくちゃ嬉しく何年目かでその3万2、3年でシックスフィギュアまでたぶん。3年は経ってなかったんで2年半ぐらいでガーって上がってくれたんでそれに関してはめっちゃいい会社でしたね結構ビジネスサイドが強い会社だったんでなんかうーんって感じだったんですけどもでも給料に関してはマジでそれで良かったんで本当にそこはありがてーと思っ。てましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcasyoubetなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "はいそれでは今回はヤンマーさんに来てもらいましたまず経歴から簡単に教えてもらってもいいですか了解。",
      "start": 28,
      "end": 7674,
      "timestamp": "00:00"
    },
    {
      "speaker": "Yanmer",
      "text": "ですヤンマーって言います経歴を簡単に言うと日本のほうでCS系の大学を出てその後は日本でちょっと数年間働いてその時は結構なんかもうなんでも技術系なんですけどもなんでも屋さんみたいな感じのやつでその後にカナダに渡ってカナダでは1年間学校行った後にその後にCICCCっていうところの学校でそれを卒業した後に1年間カナダのやつでモバイルを1年間ちゃうわ数年間モバイルをやってで今最近ちょっと転職して1年間バックエンドエンジニアをやってるっていう感じですねめちゃくちゃじゃっくりなんですけど日本。",
      "start": 7674,
      "end": 60365,
      "timestamp": "00:07"
    },
    {
      "speaker": "Ryo",
      "text": "での日本ではなんかプログラミングみたいなことはして。",
      "start": 60365,
      "end": 63545,
      "timestamp": "01:00"
    },
    {
      "speaker": "Yanmer",
      "text": "たんですかそうですねやってたんですけどもまあなんか中途半端っていう感じだったんでまあなんかSIR。",
      "start": 63545,
      "end": 72540,
      "timestamp": "01:03"
    },
    {
      "speaker": "Ryo",
      "text": "みたいな。",
      "start": 72540,
      "end": 72667,
      "timestamp": "01:12"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね、そういうパートもあるし、結構なんか本当に何でもっていう感じでしたね。",
      "start": 74429,
      "end": 79543,
      "timestamp": "01:14"
    },
    {
      "speaker": "Ryo",
      "text": "で、日本での経験がどのぐらい。",
      "start": 79543,
      "end": 82075,
      "timestamp": "01:19"
    },
    {
      "speaker": "Yanmer",
      "text": "って言われました?2、3年ぐらいですかね。で、。",
      "start": 82075,
      "end": 85488,
      "timestamp": "01:22"
    },
    {
      "speaker": "Ryo",
      "text": "それからじゃあ大学行って2、3年やってこっち来たみたいな。そうですね。今はこっちでは2社目?",
      "start": 85488,
      "end": 93084,
      "timestamp": "01:25"
    },
    {
      "speaker": "Yanmer",
      "text": "3社目?カナダだけで言うんだったら2社目ですね。",
      "start": 93084,
      "end": 97787,
      "timestamp": "01:33"
    },
    {
      "speaker": "Ryo",
      "text": "あれですよね、ヤンマーさん、レイオフも経験されてるんですよね、1社目ってかな。",
      "start": 97787,
      "end": 104406,
      "timestamp": "01:37"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですねこっちで最初モバイルエンジニアでIOSでやったんですけどもメインでそっから23年間やった後に零予布食らってそっから転職活動っていう感じになってそれで結構苦労してでもそのときにモバイルじゃなくてバックエンドやりたいなってなったんで今バックエンドで転職したっていう感じ。",
      "start": 104416,
      "end": 129839,
      "timestamp": "01:44"
    },
    {
      "speaker": "Ryo",
      "text": "ですねなんかちょうどこの間僕と彩香さんとあと瀬名さんかなでレイオフについて話したんですけどまあ僕たちはあのレイオフはえっとなんていうんだろう旗からは経験レイオフされてない側では経験してるんですけどなんか山さんはちゃんと何だろう本当にレイオフされた側だったと思うんでちょっとそこら辺についても聞いていけたらいいかなと思いますそしたらカナダに渡航するまでの何か経緯みたいな教えてもらってもいいですか。",
      "start": 129839,
      "end": 156828,
      "timestamp": "02:09"
    },
    {
      "speaker": "Yanmer",
      "text": "日本で卒業した後に技術職系で入って、2,3年くらいやってたんですけども、ちょっとやっぱり僕のせいか分かんない…本当に会社と合わないっていう感じで会社が悪くはないと思うんですけど本当に僕が合わなかったっていうのででも結構日本の会社で辞めるのもったいないみたいな感じの不調があって結構それで中途半端になって結構メンタルやんで僕そこで結構ちょっと休職しちゃって休職してこのまま日本でずっと働けるんかなみたいな思ってもともと僕結構英語には自信があったんで、なんかどうせ日本で無理だったら英語でちょっと働いてみたいっていうのが昔からあったんで、ちょっと勢いよくもうやるしかねーかなーみたいな感じで、なんかその時は僕は結構なんかめっちゃなんかこう日本、本当はそうじゃなかったんですけども、日本はもう働けねえみたいな、海外しかねえみたいななんかアホみたいな感じの考え方があったんで、ちょっと勢いよくカナダにせっかくやから行ってみようって、無理だったら帰ってきたらいいかっていうのをで、きっかけっていう感じでした。",
      "start": 159307,
      "end": 228477,
      "timestamp": "02:39"
    },
    {
      "speaker": "Ryo",
      "text": "英語に自信あったっていうのはスピーキングのパートですか?それともなんかインプットみたいな意味で、それともどっちもだったんですか?",
      "start": 228477,
      "end": 236719,
      "timestamp": "03:48"
    },
    {
      "speaker": "Yanmer",
      "text": "リーディングとライティングを除くっていう感じですかね。逆にリスニングとスピーキングがすごい、その当時は自信ありました。こっち来てから打ち砕かれましたけど、その時は自分の中ではめっちゃできるやろって思ってました。",
      "start": 236729,
      "end": 250561,
      "timestamp": "03:56"
    },
    {
      "speaker": "Ayaka",
      "text": "それはもともとそういう英語を使ってたっていうバックグラウンドがあったんですか?",
      "start": 250561,
      "end": 257332,
      "timestamp": "04:10"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね、僕は本当に生まれてから、日本では生まれたんですけども、そこから生まれた後にすぐにカナダに漁師の仕事の都合上行って、5年くらい幼少期過ごしたんですよね、カナダで。で、日本に帰ってきたんで、そうなので、でもぶっちゃけ記憶は全然ないし、その時何が残ったかっていうと発音だけだったんですよねでも発音が残った時になんかこいつ発音だけすごいのに英語ダメダメじゃんって言われるのがめっちゃ悔しかったからちょっと中学校ぐらいの時に勉強英語しまくってちょっとそこで英語のリスニングとスピッキングが得になってでもなんかその後に高校とか大学は全然勉強しなかったんでなんかまた微妙になって、でもなんか微妙に英語をこいつ、まあこいつというか自分の中でもできるのにそれを全然仕事で使わないのってすげえもったいなくねみたいなのが世の中であったんで、まあいつかちょっと海外で行きたいなっていうのがすごいあったっていう感じですね。",
      "start": 257341,
      "end": 320005,
      "timestamp": "04:17"
    },
    {
      "speaker": "Ayaka",
      "text": "ちっちゃい頃はカナダのどこにいたんですか?",
      "start": 320005,
      "end": 324176,
      "timestamp": "05:20"
    },
    {
      "speaker": "Yanmer",
      "text": "カナダはね、確かトロントのそうだっすかね。トロントではないんですけど、トロントから1時間ぐらいの田舎だったんですけど。",
      "start": 324176,
      "end": 335610,
      "timestamp": "05:24"
    },
    {
      "speaker": "Ryo",
      "text": "英語は具体的にどうやって勉強したんですか?中学生の時でもいいですし、社会人になってからでもいいんですけど、もともと大学出てると思うんで、インプットは結構、大学の時点ではグラマーとボキャブラリーのインプットはあったみたいな感じですか?",
      "start": 335610,
      "end": 357126,
      "timestamp": "05:35"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね、僕語彙力と文法だけはもうカスだったんで、ノリで喋るっていう感じの方が得意で。なので、とりあえずなんか実践的に使うのがすごい得意でしたね。なんか覚えるのかがすごい嫌いだったんで。英語とかも自分で中学とか勉強するときはとりあえずこれを英語で言うんだったらどう話せるんだろうっていうのを意識してずっとスピーキングの練習をひたすらやっててあとはリスニングの方は本当に映画とか好きだったんで映画とか聞きまくってたら何とかちょっとリスニング。",
      "start": 357136,
      "end": 395644,
      "timestamp": "05:57"
    },
    {
      "speaker": "Ayaka",
      "text": "が発達したスピーキング苦手な日本人って多いじゃないですかどっちかっていうとそのライティングとかリーディングの方が得意でみたいなだけどスピーキング苦手なのってやっぱり話す機会がなかったりとかそういうあのヤンマーさんみたいに頭の中で英語にするんだったらどうするんだろうって考えるけど実際口から音を発生するのがあんまり機会がないっていうのが苦手になっちゃう理由なのかなって私は思ってるんですけどなんかそういうアウトプット外国人の人を相手にとか、誰か違う人でも相手にとか、そういう場があったんですか?",
      "start": 395644,
      "end": 436919,
      "timestamp": "06:35"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね。半分イエスで半分ノーで、高校ぐらいまでの時ってそんな海外の人と話すっていうのがないんで、もうぶっちゃけボッチでひたすら部屋でモソモソ言うっていう感じでしたね。",
      "start": 436919,
      "end": 450490,
      "timestamp": "07:16"
    },
    {
      "speaker": "Ayaka",
      "text": "でもそれができるのすごいですね。",
      "start": 450490,
      "end": 453102,
      "timestamp": "07:30"
    },
    {
      "speaker": "Yanmer",
      "text": "もうプライドとかなかったんで、もうなんか普通に喋ればいいんじゃねーみたいな感じだったんで、ひたすらなんか、なんか別にその無理やり話すとかじゃなくて、例えば日本語の英語とかって、教材とか中学校のやつって、なんかすげー穴埋めとか、なんか日本語の文があって、その下に穴埋めとか、なんか文字並び変えるとか、そんな感じじゃないですか、英語のやつ。そういうのを見たときに、もうなんかそういう英文のヒントとかもガン無視して、とりあえず日本語があったら、これだったら自分で英語でどういうかなっていうのを全く、もう一から自分で話した後に、その後に適当な仕組みを取るという感じだったんで、もうなんか初めからとりあえずなんとか英文を構成するみたいなことをひたすらやってました。",
      "start": 453112,
      "end": 496720,
      "timestamp": "07:33"
    },
    {
      "speaker": "Ryo",
      "text": "なんかそのモチベーションって結構難しいじゃないですか、勉強を続ける上で。そこら辺なんか英語はやっぱりずっと好きだったからモチベーションはずっと高かったんですか?それともなんかモチベーションを高く保つためになんかコツみたいなのがあったんですか?",
      "start": 496730,
      "end": 512454,
      "timestamp": "08:16"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね、これはまぁやっぱちょっと参考にならないですけどさっき言ったその悔しさっていうかなんか発音だけあんのになんか英語全然できねーってなんかわかるっていうのがすげー恥ずかしかったっていうのがあって僕あの中学校かどっかひどかったのがあのカフェってあるじゃないですかCAFEってうんで僕あれもくそ昔あのKFって呼んでたんですよねでなんかめっちゃそれで恥かいてそんなレベルの英語だったんでまぁ発音だけあんのにお前なんかナチュラルななんかちょっと外人ぽい発音なのにおいKFなんかよみたいな感じだったそういうのもあってって。",
      "start": 512454,
      "end": 548798,
      "timestamp": "08:32"
    },
    {
      "speaker": "Ryo",
      "text": "感じでそれはなんか実際に馬鹿にされた感じなんですかそれともなんか自分の中でやっぱり強くなっていったんです。",
      "start": 548798,
      "end": 555351,
      "timestamp": "09:08"
    },
    {
      "speaker": "Yanmer",
      "text": "かそのあーなんかギリギリあのバレなかったんですけどもなんか友達とのなんか会話の中でなんかこう自分の中であれ系譜だって思ってたのに友達がカフェって言ってマジでみたいなあれがみたいな感じであやべやべみたいなという感じでしたねそしたら。",
      "start": 555351,
      "end": 572920,
      "timestamp": "09:15"
    },
    {
      "speaker": "Ryo",
      "text": "次技術力について聞いていきたいんですけど技術力は大学行かれたんですよねCSKのそうです。",
      "start": 572920,
      "end": 582665,
      "timestamp": "09:32"
    },
    {
      "speaker": "Yanmer",
      "text": "ねその時は特に将来とかじゃなくてその頃ってちょうどパソコンとかめっちゃ流行ってたんでちょうどインターネットとかYouTbeとか流行りだしてで、まあなんかそれが好きになって、なんか勉強したいっていうよりも、なんかもうそれぐらいしかないかなーみたいな、なんか他のことあんま勉強しなかったんで、もうなんか半分逃げるようになった。",
      "start": 582665,
      "end": 608331,
      "timestamp": "09:42"
    },
    {
      "speaker": "Ryo",
      "text": "それは大学に入る前ですか?",
      "start": 608331,
      "end": 610823,
      "timestamp": "10:08"
    },
    {
      "speaker": "Yanmer",
      "text": "前ですね。ちょうど高校ぐらいの時からなんか、あのまあ本当YouTbeとかニコニコ動画とかめっちゃ流行ってたじゃないですかまぁちょっとあの時代になっちゃうんですけどもその時になんかちょうどなんか画像画とか本当にメディアっていうのが本当にインターネットを通して広まってたんでそこでやっぱりその今まではテレビで見てたものがインターネットで見るようになってそうするとなんかやっぱりもうそこで全部なんかこうブロックとかあとはExcelとかもちょうどそういう時にできたんで、作業とかもそういうのになって、全部パソコンになっていったんで、自然とそのフォーカスがパソコンになったんで、そこで繋がったから、大学もそっち側でいけるかなーみたいな感じ。",
      "start": 610823,
      "end": 653632,
      "timestamp": "10:10"
    },
    {
      "speaker": "Ryo",
      "text": "家にパソコンあったんですか?僕は田舎モンだったんで、で、お父さんもお母さんもパソコンとか触れなかったんでニコニコ動画とか僕、未だにほぼ多分触ったことないぐらいその頃はもう全然わかんなかったしそのなんかインターネットの発展みたいなのを全然見ずに僕は過ごしてきた人間なんでなんかどうやってそこに関われるようになったのかが全然イメージつかないんですけど。",
      "start": 653642,
      "end": 677490,
      "timestamp": "10:53"
    },
    {
      "speaker": "Yanmer",
      "text": "なんなんすかね僕でもなんか気づいたらパソコンは買ってもらえてたのかななんかそこは親が優しかったのかもしれないなんかその仕事でとかなんかで必要とかかなまあなんかもしかしたらその当時ちょうど学校で必要になってきたから宿題とかそういうのもなんかでもなんかこう事務作業とかもなんかちょっとエクセルでやるとかあったりしたんですよね宿題かわかんないですけど学校の行事とか委員会とかそうなので説得したのか親が優しさで買ってくれたのかわかんないですけどもうちのゲームは結構禁止で厳しかったんですけども時間制限があったんですけどパソコンは全然OKだったんで自然にそっちの方に行ったようになっ。",
      "start": 679014,
      "end": 720478,
      "timestamp": "11:19"
    },
    {
      "speaker": "Ryo",
      "text": "たというかじゃあその高校時代に買ってもらってそこからもうじゃあプログラミングとかも興味出てきて自分で始めたみたいな感じなんですかそれとも大学で習ってみたいな流れだった。",
      "start": 720478,
      "end": 731804,
      "timestamp": "12:00"
    },
    {
      "speaker": "Yanmer",
      "text": "んですかいやープログラミングは全然したねーあの大学に入る前まではてかなんならプロ大学入った後も結構つまずいて1回挫折したんですよね結構日本の時はほぼほぼ挫折しててそのまあ詳しく言うとその詳しくっていうか大学入る時は本当にそのメディアの方なんですよね画像がどうとか動画がどうとかなんか動画の圧縮どうするとかそういう家の方に何かがすごい興味があってアルゴリズムほどではないんですけどもでもなんかこうウェブのなんかいろんな動画のなんか種類とかあれなんかダウンロードしてたりすると結構気付くんですけどなんかいろんな画像の種類とかなんかあってなんかそういうのにちょっとこう興味持ってたかなーみたいな感じででプログラミングはマジで大学入ってその遊びじゃなくなってそういう本当のコースに行ったんでプログラミングっていうのがあってでもそこで超挫折しましたねもうあのCとJavaのせいですねダメですあれは本当にあの分厚い教科書やばいっす本当にもう未だに覚えてますもんなんかポインターがなんちゃらとかなんかもう本当にしかもその時そんなになんかYouTbeでチュートリアルとかなかったんでなんかもう本当に本を通してやって本だったらコピーもできないからなんかキストエディターとかにパパパーって手打ちでやってなんかコンパイルしてみたいな感じでほんまに何のためにやってるのかなみたいなインターフェースとか継承とか何みたいな感じでほぼほぼ授業をサボってダメ学生っていう感じ。",
      "start": 731804,
      "end": 820573,
      "timestamp": "12:11"
    },
    {
      "speaker": "Ryo",
      "text": "でこっち来てから確かあれですよね僕も同じだったんですけどコーナストンに行ってそれが1年勉強して1年コープっていうワークビザがもらえるコースに行ったと思うんですけどそこでは何を勉強され。",
      "start": 820573,
      "end": 839727,
      "timestamp": "13:40"
    },
    {
      "speaker": "Yanmer",
      "text": "たんですかそこはそうですね結構CSの基礎とプログラミング基礎プラスでもアルゴリズムどっすりかつモバイルっていうちょっと変化球みたいな感じでこれは名前出していいのかなあのcicccの多分ご存知だと思うんですけどあの先生これ先生があのすごいあの変態的といういるかなっていう感じのすごい人で即戦力としての内容を教えてくれるかっていうと分かんなかったんですけどもでもその逆に結構CSの基礎とかバイナリーとかなんかビットのやつとかそういうのの基礎からしかもめっちゃコンサイズが簡潔に分かりやすく教えてくれて結構アルゴリズムの方とか、モバイルががっつり得意だったんで、その時はモバイルのことを教えていったんで、結構そこで普通は学校ってカスっていうか全然頼りないっていう感じだったんですけど、僕は珍しくこの先生教え方面白いなってなって、そこでさっき言ってたみたいに僕結構右を曲折いってめっちゃプログラミング挫折しまくってデザイナー目指してたんですけどもそこでもう一回なんかあれなんかこれ大学で習ったことめっちゃ実は面白いやんってなってもう一回ソフトエンジニア全然目指せるやんとかモバイルやってみよっかって流れでそうなったあれ先生デリックでし。",
      "start": 839727,
      "end": 928885,
      "timestamp": "13:59"
    },
    {
      "speaker": "Ryo",
      "text": "たっけデリックです僕と同じ。",
      "start": 928885,
      "end": 932588,
      "timestamp": "15:28"
    },
    {
      "speaker": "Yanmer",
      "text": "先生なのそうですね。なので全然、逆に経験あったり、目的が違うとなんか微妙かなっていう先生かもしれないですけど、僕はなんか運良くめっちゃ相性良かったなっていうか。",
      "start": 932588,
      "end": 947624,
      "timestamp": "15:32"
    },
    {
      "speaker": "Ayaka",
      "text": "その先生に出会ったのが苦手意識払拭みたいなきっかけになったと思うんですけど、そもそもその先生に出会うまで学校に入らないといけないじゃないですか。苦手なウェブ開発じゃないですか、コースが。そこに至るまでに、デザイナー目指してましたって時に何があって、やっぱり学校で再度プログラミング勉強しようと思ったんですか?",
      "start": 947624,
      "end": 975687,
      "timestamp": "15:47"
    },
    {
      "speaker": "Yanmer",
      "text": "えーと、めっちゃそこ聞いてくれて嬉しいですね。でもめっちゃ参考にならないです。これは本当になんでやねんっていう感じなんですけど。僕もデザイナーのあの学校2年間のやつで募金満々だったんですよね。学費も払って、しかもその大学結構いいところでなんか面接やって、論文書いて、日本からそれ全部やって。パスしたぜみたいな俺はもうデザイナーでやっていくんだぜってノリノリでやってたらなんか床を半年前ぐらいかなあのなんか頃中なんかしわかんないですけど経営のためで中の学校潰れちゃってもうあの完全にボーンってなって入れませんみたいなとなっちゃってどうすんねんってなってでその後にもう学費も払ったまえにどうしようみたいな感じでまぁちょっとそれを置いといてとりあえずじゃあここからカナダ行くにはどうするんだってなってなんか結構いろいろ僕の中でオプションがあってなんか落ち着くまで待つとかなんか今からじゃあどこの大学行くねんってなってで結構なんか効率のちゃんとしたところ行くって言ってもあったんですけども結構なんかそうするとなんかランガラっていう大学なんですけども結構時間もからまたさらに再入科までかかるし入学してから卒業までも時間かかるから多分こんだけ時間かけてたらなんか熱意しないそうだなっていう感じでその潰れた直後でもなんか全然入れそうなところがciccだってでそのCICCCっていうのがその当時は噂程度でそのデザイナーが潰れちゃったんでそれを救済するっていうかそれを引き抜くためにあのなんかデザイナーのコースを用意してるぜなんかする今後あの開催するつもりだぜっていうのが噂でなんか聞いてたんですよなんでだからまあじゃあそれだったらCICCCちょっとワンチャンとりあえず入っといてそのデザイナーのコース目指せるんじゃないかなと思ってあのそこで選ん。",
      "start": 975697,
      "end": 1086524,
      "timestamp": "16:15"
    },
    {
      "speaker": "Ryo",
      "text": "だっていう感じでとりあえずはもう来るためにあのコース変えてでもまずはとりあえず行ってみようみたいな感じだった。",
      "start": 1086524,
      "end": 1095977,
      "timestamp": "18:06"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですねもうなんかもうもう行くしかないっしょってなってもその時はよく僕のとその時の地心理はよくわかんないです今でもなんかよくやったなって。",
      "start": 1095977,
      "end": 1102602,
      "timestamp": "18:15"
    },
    {
      "speaker": "Ayaka",
      "text": "いう感じです学費返ってきました?振り込んだやつちゃんとえっとです。",
      "start": 1102602,
      "end": 1107758,
      "timestamp": "18:22"
    },
    {
      "speaker": "Yanmer",
      "text": "ね1年後にようやく返ってきましたそこも結構実はいろいろあってなんか学校が学費払った時にレシートをちゃんと渡しなかったんでそのレシートがなくて一番最初審査降りた時にはなんかもうデポジットしか返ってこないみたいななんか審査くだされて学費ほぼほぼ返ってない来ないみたいな感じになってマジでどうしようかなと思ったんですけどその後ちょっといろいろ他の書類とか銀行の送金とかいろいろ集めて提出したらなんとか1年後に審査、再審査で全部返ってきた感じ。",
      "start": 1107758,
      "end": 1144727,
      "timestamp": "18:27"
    },
    {
      "speaker": "Ayaka",
      "text": "でもCICCのデザイナーコースも結局できなかったけど、CICCCでモバイルを勉強したって。",
      "start": 1144727,
      "end": 1153343,
      "timestamp": "19:04"
    },
    {
      "speaker": "Yanmer",
      "text": "ことですねそうですね結局そこがさっきの話に繋がるんですけどデザイナー来るっしょっていう感じになってでもじゃあそこまでにとりあえずどこ行くかなってなってたまたまそのウェブとかのモバイルみたいなコースがあってここだったら自分が1回通った道だったんでとりあえず入れてやりそうだなっていうので一時的にそこに入ってデザイナーがあるコースが来るまで待ってたんですけどもなんか気づいたら来ないし、だんだんなんかその担当の先生、さっき言ったデレックが面白い授業してくれるから、あれなんか普通にソフトウェアエンジニアっていうか、ここら辺のやつ面白くねってなって、なんか気づいたらそこまでいいやってなって、結局モバイルで就職したっていう感じ。",
      "start": 1153343,
      "end": 1194254,
      "timestamp": "19:13"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみに選ぶときにそのコースでモバイルとウェブがあったと思うんですけど、そのウェブじゃなくてモバイルを選んだ理由っていうのは何だった?バンクーバってやっぱウェブの仕事は多いじゃないですか、でモバイルって結構少ないじゃないですか、で確かそのさっき言われた通りあの日本最初の会社はモバイルで就職し結局就職できたと思うんですけど結構その募集とかも少ないからなんかそこらへんなんでウェブではなくモバイルにしたのかなぁみたいなちょっと気になったけどなん。",
      "start": 1194254,
      "end": 1222567,
      "timestamp": "19:54"
    },
    {
      "speaker": "Yanmer",
      "text": "かCICCって最初共通のコースがあるんですよねなんか共通期間みたいな感じででその後にまあモバイルとウェブに分かれてモバイル行きたい人はモバイルにウェブ行きたい人はウェブに行っていいよってなってでそのままデルクがモバイルでやるって言ったからじゃあモバイルやろうって。",
      "start": 1222567,
      "end": 1237739,
      "timestamp": "20:22"
    },
    {
      "speaker": "Ryo",
      "text": "言っただけでしょじゃあそのモバイルを最初から選んだんじゃなくてえっと共通のコースにいた時にデリックが面白かったからその先生に習いたいみたいな感じあ、。",
      "start": 1237739,
      "end": 1248519,
      "timestamp": "20:37"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね本当にそんな感じ。",
      "start": 1248519,
      "end": 1250020,
      "timestamp": "20:48"
    },
    {
      "speaker": "Ryo",
      "text": "そしたらえっと就職活動についてちょっと聞いていきたいんですけどどのぐらい前からその勉強のタームが1年あってその後すぐ働けるようになるじゃないですかどのぐらい前からなんだろう就職活動って始めました具体的になんかレジュメ書き始めたり。",
      "start": 1250020,
      "end": 1267608,
      "timestamp": "20:50"
    },
    {
      "speaker": "Yanmer",
      "text": "とかあーそれぐらいですかね。レジュメとかはちょっとなんかそのコープ始まる半年前ぐらいかなって感じで、レジュメ以外のちゃんとしたやつは4、5ヶ月前ぐらい。だいたい3年前ぐらいから引き付け始めて、本格的に動かしたのはなんか3ヶ月前ぐらいからって感じ。今考えるとちょっと遅い感じかもしれない。",
      "start": 1267608,
      "end": 1289578,
      "timestamp": "21:07"
    },
    {
      "speaker": "Ryo",
      "text": "でも半年前からそのレジュメ書き始めたりだったら結構早い方なのかなヤンマーさんがその多分転職その就職活動してた頃ってあのatsが大切だアプリケーショントラッキングシステムのことatsっていうと思うんですけどなんかそこらへんが大切だとかっていうそういう情報はまだ多分流れてなかったじゃないですかその今僕たちがいるフロックのコミュニティ内ではあーで。",
      "start": 1289588,
      "end": 1312952,
      "timestamp": "21:29"
    },
    {
      "speaker": "Yanmer",
      "text": "もちょうど流れてきた感じで、ちょうどなんかレジュメやるんだったらATSってのがあるらしくて、そこも一応意識した方がいいんじゃねーっていう情報はあって、でもまあぶっちゃけでもその時期ってなんかもうマスアプライの時期だったって、なんかもう結局ATSよっていうよりは、もうとりあえず書いて出せっていうのが最終的になったんですけども、言葉自身は出てきた、初めて。対策実際してた人はそんなに多くなかったと。ちょうど出始めの感じだった。",
      "start": 1312952,
      "end": 1344778,
      "timestamp": "21:52"
    },
    {
      "speaker": "Ryo",
      "text": "どのくらい前から送り始めたんですか、レジュメは。",
      "start": 1344778,
      "end": 1348658,
      "timestamp": "22:24"
    },
    {
      "speaker": "Yanmer",
      "text": "あー僕結構なんか段階踏んでて1回その半年前ぐらいにとりあえずレジュメ書いてみようみたいなもうなんか行くところとか働けもしないし行くところもないんだけどもとりあえずなんか出すだけノリでやってなんか気づかないかなみたいなんで出すだけ出しといてでなんか当たりだけといてでその後にまた2、3ヶ月前ぐらいになっていろいろそのポートフォリオとか定力とか準備ができ始めた時に本格的にだし始めたんでなんかその一家一段階を置くことでまあなんかいきなりあるよりは全然いう線。",
      "start": 1348668,
      "end": 1381422,
      "timestamp": "22:28"
    },
    {
      "speaker": "Ryo",
      "text": "使っちょうどなんか医師さんっていう人をこの間あのインタビューさせてもらったんですけど一山も同じこと言っててでその時にも僕も言ったんですけど僕も結構早い段階で送ってで特に送んない時期があって今勉強している時期があってまた送るって言ったんだけどなんかそのそのアジャイルではないけどあの1回やってみてでその結構そのレジュメを書いてレジュメを送ってっていうのって結構つらいじゃないですか帰っても来ないしみたいなだからそれをなんか先にやっておいてまぁ1回ちょっと寝かせてまぁまたそこから再開するっていうのは結構いいやり方なんじゃないかみたいなのを来ないで話しててじゃあ結構その形に似てるというか1回まあ何もしない時期があってでまぁその前回のなんだろ結果からちょっとまた変更して送り直したみたいな感じあ。",
      "start": 1381422,
      "end": 1438859,
      "timestamp": "23:01"
    },
    {
      "speaker": "Yanmer",
      "text": "もうマジでその通りです間違いなくそれが一番いいかなーってますねなんかめっちゃ準備してからやるってよりはもうとりあえずやってみてでそこで足りないものを気づいてから準備するっていう方が逆にした方が全然やっぱいいかなその本格的。",
      "start": 1438859,
      "end": 1455851,
      "timestamp": "23:58"
    },
    {
      "speaker": "Ryo",
      "text": "に送り始めてからはどのぐらい送ったんですか?まあサプライってことだったと思うんですけど忘れちゃった。",
      "start": 1455851,
      "end": 1462434,
      "timestamp": "24:15"
    },
    {
      "speaker": "Yanmer",
      "text": "んですけど結構やっぱ4年前ぐらいだったんでまあでもやっぱり100は100以上はとりあえず送ってましたね100から150かなって感じ。",
      "start": 1462434,
      "end": 1471419,
      "timestamp": "24:22"
    },
    {
      "speaker": "Ryo",
      "text": "でどのぐらい帰ってきてました?",
      "start": 1471419,
      "end": 1474475,
      "timestamp": "24:31"
    },
    {
      "speaker": "Yanmer",
      "text": "うーん人数はどれぐらいだったかなぁ忘れちゃったなぁでも11割は絶対あってもしかしたら2割ぐらいかなかもしれないですね。",
      "start": 1474485,
      "end": 1487529,
      "timestamp": "24:34"
    },
    {
      "speaker": "Ryo",
      "text": "それは全部モバイルにですかそれともあのウェブも合わせ。",
      "start": 1487529,
      "end": 1491730,
      "timestamp": "24:47"
    },
    {
      "speaker": "Yanmer",
      "text": "てウェブも合わせてましたねモバイルメインだったんですけども結構ウェブも合わせたりバックエンドもやったりソフトエンジニア結構あの全般やってそれぐらいででもまあちゃんとしたやつはモバイルの方そうする。",
      "start": 1491730,
      "end": 1508699,
      "timestamp": "24:51"
    },
    {
      "speaker": "Ryo",
      "text": "とレジュメは2種類みたいな作ってたんですかそれとも1種類のものをもうバーッとどこでも出す。",
      "start": 1508699,
      "end": 1514924,
      "timestamp": "25:08"
    },
    {
      "speaker": "Yanmer",
      "text": "みたいな感じでレジュメは3種類ぐらい使ってましたねさすがにやっぱ教授にポジションによっては変えてました会社によって変えるってことは方法しなかったんですけども多分モバイル用ウェブ用なんかバックエンドかソフトウェアエンジン用みたいな3種類でそれでガーッと。",
      "start": 1514924,
      "end": 1531517,
      "timestamp": "25:14"
    },
    {
      "speaker": "Ryo",
      "text": "ちょっと戻るんですけど、ポートフォリオみたいなのとか、レジュメ以外の活動とか、あとはイベントに参加するとかもあると思うんですけど、どういうことをされましたか?",
      "start": 1533827,
      "end": 1543347,
      "timestamp": "25:33"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね、それで言うとポートフォリオは作ってました。特にモバイルの場合は絶対そのアップルストアに1回出したことがあるっていう経験がすごい重要なんでアプリを作ってそれを出すっていう経験を何個かやってイベントはその頃まだちょっとコロナの影響があったんでそこまでなんかその盛んじゃなくて参加をしてなかったそれ以外だと一応ボランティア的なものは参加してましたね3ヶ月ぐらいなんですけどでもそこで結構経歴かなり作れたんでそれをもとに何とかこっちでも経歴あるよみたいなのを見せてそれが結構。",
      "start": 1543347,
      "end": 1582953,
      "timestamp": "25:43"
    },
    {
      "speaker": "Ayaka",
      "text": "繋がったというか就職活動っていつやってもしんどいじゃないですかってなんかうまくいかない時とか何がうまくいってないかとか吟味する必要があると思うんですけどそういう時にメンターとか周りの人の力を借りたとかっていうのはありましたか?",
      "start": 1582953,
      "end": 1600269,
      "timestamp": "26:22"
    },
    {
      "speaker": "Yanmer",
      "text": "もうバリバリ借りまくってましたね結構そのいろいろあってその頃だと友達はやっぱりそのクラスメイトが一番多かったかもしれないですねやっぱプロジェクトも一緒だし同じ時期に来たしってので結構クラスメイトと一緒にならなかったでしょうか遅くまで残ってなんか一緒にインタビューとか手伝いあったりしてっていうのは大きくてそれ以外だと本当にそのフロックの名前出していいのかなフロックの人たちに聞いてみたりレジュメ見せてこれをどうなのとかポートフォリオどうなのか聞いてみたりあとは結構こっちのカナダのネイティブの友達も運良くこの頃から遊んでたんでそこにちょっと同じようにソフトウェアエンジニアだったんでそこにちょっと聞いて。",
      "start": 1600279,
      "end": 1650713,
      "timestamp": "26:40"
    },
    {
      "speaker": "Ayaka",
      "text": "みたりその友達どうやって作ったんですかなかなかレアな出会いじゃないですかネイティブのカナダカナディアンでソフトウェアエンジニアし。",
      "start": 1650713,
      "end": 1659649,
      "timestamp": "27:30"
    },
    {
      "speaker": "Yanmer",
      "text": "てるあーそうですねそこはもうマジで完全に僕がラッキーでしたっていう感じであのたまたまルームウェイトの彼氏がそのカナダ人だったっていう感じだったんでなんかそこで結構めっちゃウマがあってもう今でもそう飛んでる。",
      "start": 1659649,
      "end": 1675627,
      "timestamp": "27:39"
    },
    {
      "speaker": "Ryo",
      "text": "ありがたいそしたら一社目の会社のインタビューとかそこから一社目どうだったかみたいな聞いていきたいなって思うんですけど一社目はどんな流れのインタビューだったんですか?",
      "start": 1675627,
      "end": 1690488,
      "timestamp": "27:55"
    },
    {
      "speaker": "Yanmer",
      "text": "思い出せる範囲で一社目どんな感じだったかっていうと結構一社目はモバイルで入ってその時ポジションはジュニアだったんですけども入るときにダミデッドでやってくれないって言われて結構スタートアップのノリだってなんか会社自体は10人、あ、違う10人じゃない100人ぐらいの結構まあまあ大きな規模だったんですけどもでもそのもともとなんか技術部門みたいなのが全然なくて自社開発しようぜっていうノリで初めて技術部門を作って最初のスタートの人数がだいたい5、6人だってその中の僕がモバイルの人として初めて雇われたんで結構もうほぼほぼスタートアップのノリで会社の人数の規模に対してやったっていう感じだったんでなかなか最初の数ヶ月はもうやべぇやべぇっていう感じでしたねなんかもうほぼほぼ一人の戦いだったしなんかやっぱりなんだかんだやっぱこっちの初の仕事でしかもリモートワークだって本社はケローナだったんでもうなんかコミュニケーションとかもなんかそんなに取れないししかもケローナなんでカナダのケローナの会社なんでほぼほぼみんな白人みたいな感じでアジア人ほぼほぼいねぇじゃんみたいな感じだったんで結構なんか孤独というかなかなかその時いろいろ右往左往やりながらっていうやつ。",
      "start": 1690488,
      "end": 1764391,
      "timestamp": "28:10"
    },
    {
      "speaker": "Ryo",
      "text": "でしたインタビューはどんな感じの流れだったんですか?",
      "start": 1764391,
      "end": 1771826,
      "timestamp": "29:24"
    },
    {
      "speaker": "Yanmer",
      "text": "インタビューに関してはですねあんまちょっと覚えてないんですけどでも本当にごくごくオーソドックスなこっちの感じでなんか最初レジュメ通った後にちょっと人事の人と話したりしてその後に軽くテックのインタビューがありましたねでもなんかそれは結構特殊で、簡単なそのワードの中に質問が2、3個ぐらいあって、なんかそのストリングをぶっつける時にどうしますか、みたいな気をつけることありますか、みたいなコンパティネーションってやつですかね。それなんとかで、あとは2問目がちょっとモバイルの基本に関してで、例えばなんかそのモバイルでなんかこういう画面製品があったときにどういう設計しますかみたいなのをまあ高等かちょっとそのワードリングっていうのがあってそういう技術のやつが1個あった後になんかもう1個カルチャーフィットみたいなやつが1個あって最後になんかあったっけななんかそのもう1回ぐらいあったかもしれないもしかしたらカルチャーフィットが最後だったかもしれないでまぁその後にオファーの。",
      "start": 1771826,
      "end": 1837204,
      "timestamp": "29:31"
    },
    {
      "speaker": "Ryo",
      "text": "これは質問とかのやつはzomでやったんですかそれともなんかオンラインアセスメントみたいな感じだった。",
      "start": 1839306,
      "end": 1849535,
      "timestamp": "30:39"
    },
    {
      "speaker": "Yanmer",
      "text": "んですか全部zomで実際の対人でやるっていう感じでしたオフラインで宿題形式なのは他の専攻でいっぱいあったんですけどその会社は全然いなかったじゃあ。",
      "start": 1849535,
      "end": 1863326,
      "timestamp": "30:49"
    },
    {
      "speaker": "Ryo",
      "text": "1日のうちに全部のインタビューは終えた感じなんですか。",
      "start": 1863326,
      "end": 1867510,
      "timestamp": "31:03"
    },
    {
      "speaker": "Yanmer",
      "text": "基本的には何回かに分けたんでだいたい2週間か3週間ぐらいかなのプロセスだったと思いますね4回ぐらいあって3回か4回ぐらいで1回はもう30分か1時間ぐらいでしたエンジニア。",
      "start": 1870501,
      "end": 1885485,
      "timestamp": "31:10"
    },
    {
      "speaker": "Ryo",
      "text": "部門は新しかったってことだったんですけどもうすでに他のエンジニアはいて新しく新しくできたって感じだったからなんかそのインタビューとかは普通に滞りなくなんか普通のプロセッサーだったのかなそう。",
      "start": 1885485,
      "end": 1903373,
      "timestamp": "31:25"
    },
    {
      "speaker": "Yanmer",
      "text": "ですねえっとまっきり本当の本当のえっとなんかリードみたいなが人いてウェブの人が一人ってバックエンドの人が一人いてマネージャーが一人でこの4人ぐらいだったんじゃないかなで初めて僕はモバイルでっていう感じだってなので本当に最初のなんかそれぞれのパートのコアメンバーみたいな感じで最後モバイルを雇われるときに僕がやった技術面接はそのリードの人と軽く話したっていう感じで今。",
      "start": 1903373,
      "end": 1931250,
      "timestamp": "31:43"
    },
    {
      "speaker": "Ayaka",
      "text": "までのこのトッドキャストで話したか話してるかわかんないんですけど面接対策ってなんかいろんな種類の面接が会社によってあるじゃないですかペアプログラミングだったりとか一緒にアルゴリズムの問題解いたりとか質問形式、Q&Aみたいなのになる可能性もあるし、いろんなパターンを準備するかなと思うんですけど、私なんかその面接対策、あんまり何が有効なのか、人の意見を聞いたことがなくて、具体的に何されたかとか覚えてますか?",
      "start": 1931250,
      "end": 1963877,
      "timestamp": "32:11"
    },
    {
      "speaker": "Yanmer",
      "text": "そうですね、その頃はマジで超意識してたってわけじゃないんですけどもマジの面接対策って本当にビッグテックだとめっちゃ必要なんですけどもそれ以外だと結構、もうモックインタビューで慣れるっていう感じが結構重要だと思うんですよねあとは本当の技術的なものは普段から意識している業務内容をめっちゃしっかりやってたら意外と応えられるみたいなイメージがあったんでもちろんそういったいっても僕が初めてのカナダの会社だったんで色々そのなんだろうねCSとしての基礎的なところは勉強したしあとはモバイルはモバイルで結構その知っておかないといけないなんか基礎的なものがあったんでそこをしっかりやってでそれ以外は本当にそのモックインタビューってことで面接ならではのコミュニケーションのやり取りで必要なことを友達とか周りの人と協力しながら進めていった感じでものすごい特別何かを対策したっていうのはあんまりないかもしれない基本的にはもう基礎力っていうか基礎的な質を高めるのだけは意識したでもモック。",
      "start": 1963887,
      "end": 2037223,
      "timestamp": "32:43"
    },
    {
      "speaker": "Ayaka",
      "text": "インタビューするのって大事ですよ。",
      "start": 2037223,
      "end": 2038944,
      "timestamp": "33:57"
    },
    {
      "speaker": "Yanmer",
      "text": "ねなんか練習相手めちゃくちゃ大事ですねなんかもうむしろそれが一番っていうレベルでなんかもう結局どんだけ知識あって技術あってもなんかそのどういう面接の形とか知らないと慣れてないともう全くあれなんでスポーツとか一緒で教科書読んだだけでは絶対できないんでとりあえずハンズオンでやるっていうのが一番重要だったか。",
      "start": 2038944,
      "end": 2061029,
      "timestamp": "33:58"
    },
    {
      "speaker": "Ryo",
      "text": "もそしたら最後にヤンマーさん年収公開してもいいよってことだったんで最初の会社の年収を教えて。",
      "start": 2061029,
      "end": 2068094,
      "timestamp": "34:21"
    },
    {
      "speaker": "Yanmer",
      "text": "いただいてもいいですか最初の入った時ですかね、結構僕いろいろ変わってたんで。",
      "start": 2068094,
      "end": 2073385,
      "timestamp": "34:28"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあそしたらその入った時と推移を、まあなんか思い出せる範囲で、言える範囲でお願いしてもいいですか?",
      "start": 2073385,
      "end": 2079697,
      "timestamp": "34:33"
    },
    {
      "speaker": "Yanmer",
      "text": "了解です。僕がまずカナダに入った時は、ジュニアのような、ほぼジュニアなんだけど、半分インターミディアみたいなポジションで、その時が650Kでしたね。65Kだ。",
      "start": 2079697,
      "end": 2097472,
      "timestamp": "34:39"
    },
    {
      "speaker": "Ryo",
      "text": "650万みたいな、だいたい。",
      "start": 2097534,
      "end": 2099445,
      "timestamp": "34:57"
    },
    {
      "speaker": "Yanmer",
      "text": "そうそう、650万。その当時はめっちゃ大手だったんですよね。日本の時がだいたい400万か500万いってたかな、わかんないですけど、それぐらいだったんで。日本の方でも結構多いと思ってたんですよ。貰いすぎだろうと思ってたんで。カナダ来て、マジで一発目でこんなジニアっぽい人に、こんなくれんの?みたいな感じで。方法だったんですけどもしかもさらにその後に1年か2年ぐらいした後に1年ぐらいだったかなその後になんかもう交渉とかしたんですけど多分インターミデートのポジションだったかな会社もちょっと引き上げてくれてなんかある日突然こうあの偉い人からのコールがあってやったらなんか80kにあげるよってなってマジかよみたいな800万以上じゃんやべーやみたいな日本の中でやっぱその時やっぱ自分の中でオワイみたいな感じだったんでそれでイエーイってなってでさらにそっから1年ぐらいかな2年ぐらいか経った後になんか結構頑張ってたんでまたもう1回そういうのがあって最終的にその会社行ったのが105Kですねおお、。",
      "start": 2099445,
      "end": 2171277,
      "timestamp": "34:59"
    },
    {
      "speaker": "Ryo",
      "text": "全然すごい。なんかすごい低いんですって謙遜してたから、結構もっと低めを想像してたけど、全然すごいですね。え、。",
      "start": 2171277,
      "end": 2178764,
      "timestamp": "36:11"
    },
    {
      "speaker": "Ayaka",
      "text": "それベースでですかね?その後はもろもろのうかってくるんですよね?",
      "start": 2178764,
      "end": 2184015,
      "timestamp": "36:18"
    },
    {
      "speaker": "Yanmer",
      "text": "いや、もう全部ですね。それが全部なんで、オプションとか全部抜きで、もう全部トータルで105っていう感じなんですよね。だからまあ、人によっては、もうちょっとあるんじゃね?っていうかもしれないし、。",
      "start": 2184025,
      "end": 2194452,
      "timestamp": "36:24"
    },
    {
      "speaker": "Ayaka",
      "text": "上がり方すごくないですか?65、80からの105?だっけ?なんか、ジャンプがすごい。",
      "start": 2194452,
      "end": 2200646,
      "timestamp": "36:34"
    },
    {
      "speaker": "Yanmer",
      "text": "いや、まじでやばかったですね。",
      "start": 2200646,
      "end": 2202788,
      "timestamp": "36:40"
    },
    {
      "speaker": "Ryo",
      "text": "でもなんか、僕も結構そんな感じで、割と多分あれあれなのかな?やっぱり一社目って結構、その会社でも結構安めに言ってokしてくれたから多分それで取っちゃってでもこの人ちゃんと働いてくれてるし他の人たちとの差みたいなのあるから埋めた方がいいよねみたいなのでヤマンさんの場合はジュニアとはいえどインターミディエイトみたいなポジションで入ってるからそこまでは引き上げようかよくやってくれてるしねみたいなのでなんか上げてもらうみたいなケース結構多分あるあるあるというかあるのがあるのかなでもそれでもヤンマーさんのすごい高いなと思うんでめちゃくちゃ嬉しく何年目かでその3万2、3年でシックスフィギュアまでたぶん。",
      "start": 2202788,
      "end": 2245654,
      "timestamp": "36:42"
    },
    {
      "speaker": "Yanmer",
      "text": "3年は経ってなかったんで2年半ぐらいでガーって上がってくれたんでそれに関してはめっちゃいい会社でしたね結構ビジネスサイドが強い会社だったんでなんかうーんって感じだったんですけどもでも給料に関してはマジでそれで良かったんで本当にそこはありがてーと思っ。",
      "start": 2245654,
      "end": 2265732,
      "timestamp": "37:25"
    },
    {
      "speaker": "Ryo",
      "text": "てましたということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcasyoubetなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 2265732,
      "end": 2284563,
      "timestamp": "37:45"
    }
  ],
  "highlight1": "ヤンマーさんは日本のCS系大学を卒業した後、カナダに渡り、CICCCでモバイルを学び、モバイルエンジニアとして就職しました。",
  "highlight2": "カナダで働くために必要な英語力をどうやって身につけたのか、ヤンマーさんは5歳の時にカナダで過ごした経験から英語の発音が身につき、後に中学校で英語を勉強し始めました。",
  "highlight3": "ヤンマーさんの初任給は65,000カナダドルでしたが、2年半で105,000カナダドルまで昇給し、カナダでのキャリアにおいて給与面で大いに成長しました。"
}