{
  "episodeGuid": "efceda27-bd09-4302-af14-4463075baf2b",
  "episodeTitle": "TresureDataのプリンシパルエンジニアと語る、データサイエンティスト vs MLエンジニア、キャリアパスのリアル（前半）#29",
  "transcribedAt": "2026-01-11T23:34:20.871Z",
  "duration": 2912,
  "fullText": "始めていきましょう今回はアキさんに来ていただきましたアキさんは僕と瀬名さんもいるバンクーバーで今ソフトエンジニアテックリードでしたっけとして働くプリンシパルか僕全然とこら辺分かってないんですよねプリンシパルとかテックリードとか結構会社によってみたいなところもあるのかなと思うんですけど今でもちょっといろいろインタビューしていきたいと思いますまず簡単にざっくり経歴を教えていただいてもいいですかいろいろあると思うんですけど。ざっくりいきます長くなったんですけど最初試作で東芝の研究所に行ってリサーチャーをやったんですけどそこで音声対話とか今まで言うSirみたいなことの結局開発とかをやってその後Cokpadでプロダクトを開発する普通にレール図を書くエンジニアになりましたと当時はフロントエンドバックエンドの区分もなかったので普通にRailsからHTMLCSからなんならMLの的なレコメンドの機能を作るのにそのレコメンドのロジックのバッジも書いてみたいな感じで全部やるみたいなのをやってましたとその後にクラウデラっていうアメリカの会社なんですけどHadopを売る会社でセールスエンジニアとAWSというところのSA的な感じのポジションになった日本プランチそこでもマシンラーニングの話をいろいろしたりして製品を売るお客さんを支援するみたいなことをやって今はTreasureDataという会社でプリンシパルエンジニアですねマシンラーニングの機能プロダクトを開発するのをプロジェクト全体をエンジニアリングとしてリードするみたいなことをやっておりますめっちゃざっくりめっちゃざっくり。素晴らしいちなみにアキスさんといえばっていったらあれかもしれないですね今僕の目の前の本棚にですねオライリーの機械学習の本があってあれの著者っていう部分もあるかと思いますがこれ書かれたのはちなみに何年ですか。それをですね、イースもですね、それ書き始めたのはまだクックパッドにいる時代に書き始めたんですけど、転職してちょっと一変ポシャリかけたのを同人誌、技術書店ですね。で、。同人誌として復活させて、で、その後オライリーに商業誌として出すって感じですね。へえ、そういう流れだったんですね。なんかオライリーがこういう書籍の内容を選ぶときって、どういう流れだったんだろうってずっと思ってたんですけど、最初、じゃあ同人誌型だったんですか、形としては。そうですね。同人誌で書いて、知り合い1人と3人で同人誌で書いたんですけど、で、それをベースにブラッシュアップしていったって感じですね。なるほど。それ、。クッパとしてか。それはなんか自分で勝手に書き始めて、ものになったものを改めてオライリーで出しませんか?みたいな依頼が来るんですか?えっとですね、それでいうと、だから同人誌書く前に一遍書き始めてポシャっと取った時、とか同人誌書いて、書いた時には知り合いにオライリーの編集者がいてそこに同人誌も見せてみたいな感じで、どうすかねっていう、当時だからなんだっけな技術書店今は分かんないですけど当時結構いろんな編集いろんな出版社の編集さんがうちからどうすかみたいな感じのまだ3回目とかだったかな忘れましたけど言ってくれてたようなタイミングでこっちからも売り込みもしましたけど商業紙出せたらいいなという思いもありつつ同人誌からステップアップしたって感じですねそういう。流れはあり得るんだ。知らなかった。農人誌活動って馬鹿にならないんだな、じゃあ。確かに。ブログとかみたいなので書いてた経験とかあるんですか?なんとなくなんですけどブログとか書いてて、書いてくださいって言われるのが結構なんかよくあるパターンなのかなーなんて勝手に思ってたんですけどそれ。で言うとだからブログはもともと書いてはいたり最近は本当に書いてないですけど昔は書いてねスランさん分かりますよね僕らの時代ブログを書くのは割とエンジニアの会話の人はみんなやってたからもう書いてたんですかって言われたら書いてましたっていうスランそれは書いてるんですよ勉強するように書い。てツイッターと同じレベルで書い。てすいませんなんか今まで一回も書いたことないんでスランそうだよ。ねもうセネレーションっぽい今感じてるんですけど間違いないまあでもそうですねなんだろう一番最初にその本を書きたいと思ったきっかけはその最初のクックパッドに行った時の同僚にあの青木ミネローさん今も同僚なんですけど青木ミネローさんっていう人がいて10年戦えるSQLの本を書いた人なんですけどその書いた人そうそうあの人がなんか自分がなんで本を書いたかっていうと同僚に同じことを無限に説明するのが嫌になったからなるほど。それを本で書くと、もう本渡せ、本買ってね、とか本渡せば、それでもう説明終わるんで、めっちゃ楽ですよって言われて、そその二つ目で書いたっていうのはあります。なるほどね。確かにめちゃくちゃ、なんだろう、エンジニアっぽいエピソードっていうか。間違いない。そうそうそうそう。ある意味レイズですというか。そうそうそう。いやいや、。あるべき姿だと思います。なるほど、。素晴らしい。どっからちょっと行けばいいのかわかんないですけど今海外、カナダから働かれてるわけじゃないですかその海外に、海外で働きたいみたいなの昔からあったんですか?結構前から意識されてたことなんですか?そうですね結構それで言うとなんとなくぼんやりやっぱりクックパートに行った時に特にリビルドの宮川さんが同僚に当時いたんですね僕が働いてたタイミングってでその時にやっぱりなんかあれですね梅田茂雄さんとかのあー懐かしいなーシリコンバレーがやっぱりなんかかっこいいみたいなそういうイメージがあってそれでなんかいつか海外で働けたらなーっていうのとあとは家庭の事情で言うと奥さんが昔あのヨーロッパにドイツに住んだことがあってそれであの働いてるとあなたはいつ海外で働くのってことをずっとあのプレッシャーが勝てないであったんであーそうだったんだなのでそうするといつかは海外で働いてみたいなみたいなのはずっとぼんやりとはあってそれを本格的に動き始めたのはやっぱりクックパッドを辞めるときにクラウドを選んだのはアメリカの企業外資なんだけどリロケーションの可能性もワンチャンあるかなみたいなのも考えてでクラデランというわけでちょっとポジションがセールスエンジニアだったんでやっぱりお客さんと話をする立場の人がリロケーションすると結構厳しいじゃないですかなのでそれでトレジャーデータでまたソフトウェアエンジニアに戻って入るときにリロケーションしたいんですけどっていう話を込みで採用して。もらったって感じですねなんかあの前回実はあのユーセイさんっていう方同じ時期に多分あの今してくさってにいられたと思うんですけど彼と同じチームだったんですかなんかその聞いた感じだとクックパッドでも行くなんか海外に行くパターンなんてのパスがあったみたいな聞いてるんですけどいい質問。ですねそれでいうとクックパッドに僕がだからいたタイミングですねクックパッドの昔にですねそこにお家騒動というのがありましてありましたねなんというかだから創業者から次の社長に移ったんだけど、また創業者が帰り咲くみたいな、そういうタイミングがあって僕はその次の社長、雇われたというか、変わった社長のタイミングで入って、彼が辞めるというか出ていくタイミングより、本当に同じぐらいのタイミングかな。で、僕は辞めたので、その後、だから創業者が帰ってきてから海外の日本からエンジニアを送るみたいなのをやり始めてたんで、そういう意味で、だから僕がいたタイミングでは、そういう話はほとんどなかったですね。あの大井騒動の時、X状むっちゃられましたよね。懐かしいなぁもはやその後かクックパッドが割とロンドンかだったりとか海外のねイギリスの。そうそうイギリスに拠点を持つイギリス。だロンドンじゃないかイギリスか。そうですねはいありがとうございます。ちなみに僕もちょっと聞いてて思ったんですけどってするとまぁえっと具体的にトレジャーデータに入った都市っつうのが詰まるところはカナダの方にバンクーバーに来られた時っていうことになるのかなと思うんですけど。うちに今トリジャーデータに入ったのが2018年かなそっから結局だから3年ぐらいかかったかなやっぱりリロケーションしたいといっても一応ジャスティフィケーションがないとリロケーションのバジェット出せないじゃないですかそうそうそうだからやっぱりガパメント側に出すのにもこの人を辞めさせるぐらいならリロケーションさせたいみたいなそういうような社内も社外も全部そういう理屈を作らなきゃいけないんでそれなりに活動をしてちゃんとリロケーションさせた方がいいねっていう話に持っていくまでそれぐらいかなあとは実際にプロセスに対してが1年ぐらいなのでだから2年、正味2年ぐらい働いてそこから動き始めたみたいな感じプロセスを増し始めたみたいな。感じでしたねクラウデラの時は何かしらがあってうまくいかなかったみたいな感じなんですか?それで言うとクラウデラのときはだからSalesEngirっていうポジションなんですけど僕の経歴すごいよく分からない変わってるねとはよく言われるんですけどSalesEngirとかAWSのSAとかSolutinArchitectってとかだとイメージしやすいと思うんですけど割とお客さんのところに行ってお客さんがこういうことやりたいんですけどみたいなことを言ってそれを支援するみたいなそういう立ち回りなんですよねだからいわゆるプリセールスの立場なのでそこのポジションのままでインターナルでリロケーションするみたいなのは一応難しいんですよ当時データサイエンティストのチームがUSにいたんでそこに入るみたいな道はあるけれどそれって結局クラウドラのたてつけだとポストセールスになるのでだからプロフェッショナルサービスとかいわゆるお客さんに買ってもらって作業をがっつりプロジェクト案件として作業をするみたいな感じなんでより英語で要件とかをけんけんがくがくするみたいな感じにしなきゃいけなくってお前デカいバンクとかにお前ぶっこまれるけどそれできるかみたいなこと言われてねえ、あのバンカメとかに突っ込まれてシドロモドルの英語でやるなんてイメージできなかったので確かにお支えくださいなっていうのがあったものとあとは当時だから第一次トランプ政権でアメリカ行くのこれやばくね?みたいな思ったのもあってっていうのがあってそのクラウデラ時代はちょっとあのトーンダウンしたというかのはありましたねはい。そうアメリカのねワードもすいませんね出てきたかなというふうに思うのであれなんですけどあのトレジャーデータさんからこっち来る時っていうのはもう選択肢はバンクーバーだけだったん。ですかそういえば当時で言うとバンクーバーかUKかUKあの時はまだARMに配置されていたのでケンブリッジ内所はUKにも拠点とか人がいたのでかなーみたいな話だったんですけどただチーム的にはバンクーバーにメンバーがいるチームだったのでバンクーバーかなーっていう感じでしたね。そういうことですねありがとうございますまあね結構なんかエンジニア。と言ったらって言ったらあれ。かもしれませんがやっぱアメリカ行きたいとかさっきのこう奥様のねあの意向みたいな部分もあったのかなと思うんですがバンクーバーで良かったんだってちょっと思いつつだったんですけどなんかその辺ちょっと聞いてみたいなと思って。いてまあ多分えっとそれで言うとなんだろ早かったのがバンクーバーはスッと行ける僕はこっち来たタイミングって2021年の最終的に来たのが4月なんですけど、その1年ぐらい前、2020年だからCOVIDでわちゃわちゃ言いつつで、タイミング的にはもうUSのビザがそろそろ厳しくなってきてんじゃないかっていう雰囲気のタイミングだったんですよ実体開けてみたらCOVID中は比較的楽だったっぽいんですけど今から聞く感じではまあただその何だろう時間が長くなればなるほどまああの会社に何だろう居続けられるかどうかもわかんないみたいなリスクが増えてくるわけじゃない。ですか確かに確かに、なるほどね。そうそう。というのもあって、バンクーバーならチームもあるし、行きやすいんだったらぐらいな感じで来たっていうところありますね。もちろんアメリカに対する不安もありましたけどね、。当時も。世界情勢とビザ的動向といろんなものが重なってっていうことですね。そうっすね、はい。あとはなんか来方としては今のトレジャーデータでインターナルトランスファーっていう道を選んだと思うんですけどもうなんか来ちゃってからこっちでそのまま就活するみたいな道もなくもないじゃないですか学校行ってとかもあると思うんですけどなんかその中でインターナルトランスファーになんかこだわったみたいなのはなんか理由がある。んですか逆に言うと僕知らなかったんですよね今こっち来るとみんな大体カナダの鉄板はだから一旦枯れ地挟んでみたいなのが鉄板だよって話だっ。たと思うんですけど。僕がそういう動きをしてたときってみんなだからインターナルトランスファーで行くのが割と王道みたいな方法が多かったんですよ本とか読んでもそういうふうに書かれているとかっていうのはあったし140はもう年齢的に全然使えない人だったのでこういう話をしてたときにはそれもないのでだから知らなかったっていうのが一番大きいかな実際にそう。よねネットとか見てもだいたいインターナルトランスファーの話しか出てなかったですもんね。当時ってそうですねそうですねだからうちにトレジャーデータに入ると2018年でクラウデラー側も3年ぐらいまでか2015年とかそれぐらいかだからそれぐらいの時だとまだ多分そんなにみんななんだろうカレッジ経由してとかっていう話は知らなかったんじゃないかな確か。に僕がそれこそ2018年に来てカレッジ行ったんですけど確かにまあなんかあのほんとだいたいみんな僕と同じぐらいの年代僕当時来たのが23歳だったんですけどもうなんかそのぐらいの年代でまあ別になんかキャリアとか遠くにはあんまりないみたいなあとちょっと技術強い人が多めだったかなだけど、なんかみんな若くて、まぁなんかちょっと夏休み気分で1年間カレッジ行ってみたいなのが多かったのは確かに。そうかもしれないですね。僕だってもうそのタイミングってもう30超えてたんで、30半ばく、半ばく?ぐらい、嘘か、それは言い過ぎなんで30、むしろ後半か、ぐらいまで差し掛かってたんで、そうするとまずちょっとそのタイミングでカレッジ行ってって、家族も連れてってなるとたしかにね、。インターナルの方が安全は安全ですよね確かにそのもう仕事がありお金ももらえるっていうあれもありそれで。言うとまだトレジャーデータに転職するタイミングだとビザサポートありの会社の最初からビザサポートするよっていう会社がちらほらいたので当時だから転職活動してたときにはドイツの会社ベルリンかなドイツの会社も受けてまし。たねなるほど確かに数は少ないですもんね絶対的に。そうですねあとは聞いて。て気になったんですけどサービスエンジニアっていうのをやられたと思うんですけど結構ゴリゴリプログラミングをやってたエンジニアからすると結構違う分野だと思うんですけどそこに行った理由みたいなのはあるんですかもう会社に行きたかったからみたい。な感じですかいやそれで言うと何だろうな僕が最初の東芝の研究所を辞めたときに何でCokpadに移ったかっていうとお客さんに実際に使ってもらえるプロダクトを作りたかったっていうのが大きな理由で移りましたとCokpadでいろいろ特に主に有料会員向けの機能を開発をするみたいなのをやってたんですけどそのときにクラウドラに移ったときは外資で海外にワンチャン行けるようなチャンスを英語で仕事をして海外に行けるチャンスを使いみたかったっていうのがひとつとあとはセルスエンジニアがセルスエンジニアで何て言ったらいいのかなプロダクトエンジニアとある種営みとしては近いところはあるかなって思ったんですねっていうのはお客さんが本当に欲しいものは何かっていうのをB2Cの会社だとお客さんとたまにユーザーインタビューしたりっていうこともあったりもするだろうしあとはフィードバックが来たりとかログとかメトリクスとか見たりみたいなふうになると思うんですけどそれをそこからもうちょっと踏み越えて実際の商談でお客さんとお話をしてどういうものを作りたいとかっていうのを議論しながらうちのHadopの基盤データ基盤を作るソフトウェアを買ってもらうっていうたてつきだったんでそれを使って何をしたいんでしたっけとかそういう話をするっていうのは結局お客さん何がやりたくてゴールは何だろうみたいなのを考えるっていうところで近いのかなっていうのもあって映ったって感じ。ですねなるほどねなんかICのポジションの人たちってみんなお客さんと喋るのは嫌がるのかなっていうふうに思っていたんです。がそうですよね特に秋さんって技術の本格ぐらい技術に結構精通されてる方じゃないですかだから特になんかいや俺は別にずっとコード書いたりだとか売るというよりは作る方で極めたいみたいな感じのタイプなのかなと思っ。たらいやーでもそれで言うと僕は何だろうあのまあ結構技術を深掘りしたい人とあとはよくあるプラットフォーム系に行くのかプロダクト系に行くのかみたいなそういう議論あるじゃないですか僕だからそれでいうと一貫してプロダクト系のほうが好きなのでうちに来てもたまにというか割と最初の頃はそれこそ営業さんのところにひっついてSEにひっついていってこういう機能作ったんでとか言ってデモさせてくださいみたいなのをやらせてもらったりとかいろいろやってたりしてそういう意味で言うとそういう取り組みをしたのはよかったかなみたいなそのB2Bセールスの中でどういうサイクルがあってっていうのは知ってるしそこでどういう支援をすれば営業側の人が嬉しいかっていうのもなんとなく分かるので。そこはタッグでしたね。確か。にb2bセールスのサースってどうやって売ってんだろうって全然想像つかない。ですもんね使わないですね。ーアホな回答しかできねー。そしたらちょっとあの話を戻してあのちょっと英語の話を聞いていきたいんですけどなんかその結構そのもうクックパッド時代からなのかなえっと働き海外で働きたいみたいなを考えつつなんか英語の勉強みたいなのはされてきたんですか割となんかですなんだろうなんかあの外資に移ってみたいななんか割とステップがあってなんだろうこっちに来てるのかなぁみたいなのはキャリアから見えるんですけどそう。ですねだからえっとクックパッド時代は全然英語も使ってないし英語も別に何だろうできできないまあ今全然できなかったんですけどあのクラウデラに移った時は必死で当時はDMA会話を毎日レッスンを本当に1日も休まずに1年ぐらいずっと続けてレッスンをするみたいなことをしたりとか。して一日も休まなかっ。たんですか?そうそうそう頑張ったなと思って今はできないです。ね僕は3ヶ月ぐらいで諦めちゃいましたねあれなんか結構英語の会議の時にも同じような話をしたんですけどやっぱなんかいろんな人と話すじゃないですか毎回同じ先生を選べるわけではないのでプラットフォームの都合というかあれで確かにそうするとやっぱりなんか初めましてから始まることが多くなるじゃないですかでスモールトケでってなると15分ぐらい使っちゃってあとの15分しか勉強できなくて結局毎日同じこと言ってるなみたいなな気持ちになってちょっとなんか無駄が多いなぁみたいなのを感じてしまってなんか続かないかなっていうのが僕はあったし結構周りを聞くとそういう人が多いんですけどなんかそこらへん1年間続けられたと。いうかいやもうなんか、あのあれですね、とにかく翌日のスケジュールを予約してっていうのをやり続けるみたいな感じで、それを強制的に習慣化するみたいなのが先にやってましたね。で、あとはなんだっけな、当時思い返してみるとだから、なんだろうな、あのDMM会話の中でニュース記事を読んでなんかディスカッションするみたいなやつが確かあったと思うんですけどこうずっとやってたかなっていうのはあれって要するに文章があって読み上げてって感じなので先読みして自分が理解して構造を理解してそれであとはどこで行き継ぎをするかっていうのは結構当時難しかったんですよばーっと喋ってて適切なタイミングで行き継ぎをしないと意味が崩れちゃうんじゃないですかなるほどね考えたことあんまなかったななるほどなんかウィッチとかそういうところで区切るとかダッツとかなんかカマとかなんかそういうので区切っていいところかなみたいなのを先読みしてやってってやってであとはその話をフックにあのちょっと雑談っぽいものをするときはするみたいな感じで組み立ててたら同じ先生で何回も狙ってたってのもありますけどそうじゃなくてそうするとその何だろう余計な雑談をただただするのはやっぱり無益なことも多かったん。でそうですよねそうだ。からそれであの何だろう読んで発音に対するフィードバックをもらってで、いろいろ雑談議論するみたいな感じにしたら自分にはそれが合ってたかなって。感じですねちなみに始める前はよくある大学出た人大学受験やったからリーディングとか単語文法は大丈夫だよみたいな感じのレベルだったんですか?そうですね、そんな感じですだから学生時代に、大学院の時になんだっけえっと問い受けてうんまああ違うな東芝入った時ぐらいに、違う、大学の時に何か700何本とか、まあまあそんなもんかなぐらいな感じの別にめっちゃ、今から見ると大してできるわけでもないけど全くできないわけでもないぐらいな感じのスコアを取って、まあこんなもんかみたいな感じで生きてった感じですね、最初はねクラウドラに入った時に上司がオーストラリア人だったんですよ当時使ってたのがZomじゃなくてCiscoのWebExっていうですねめちゃくちゃしんどいやつがあってだからZomの人たち確かCiscoの人たちからスピンアウトして自分たちが2周目で作ったとかだったはずなんですけど本当に音がめちゃくちゃきついんですよなるほどねそうそうみたいな中で上司とミーティングをしたりするみたいなのを気合でなんとかやるみたいな感じだったんで瞬間的に作文をし続けるみたいなのを今はできますけど当時は全然できなかったっていうのがあって口をだから鳴らす筋肉をつけるみたいな目的でDMメーカーがやってたかなっていうの。はありますねじゃあogのそのえっとオーストラリアのその上司の方がいらっしゃった時はまだじゃあ英語のdm365日やってなかったんですかだ。から入って入ってからやっ。て入ってからやってるの。かって感じですね会社のあの経費というかお金出してもらったんではいんそうですねそういうことだったのか大変だ。そのやった結果どうですか変わりましたなんだろうそのその人とはちゃんと喋れるようになってたんですか?そうっすねそれで言うとクラウドランにいた時辞めるちょっと前かなシンガポールのオーライリー系でもう今なくなっちゃったんですけどストラッターっていう名前のデータ系のカンファレンスかでそこでシンガポールで英語で登壇もだから採択されて登壇もしてでその時にちょうどシンガポールでの集まりも会社の集まりもあったんでそこで上司と会って話したらいやー英語なんかめちゃくちゃできるようになったねって言わ。れてすごいですねなるほどなるほど。よかったっていう感じでっていうあれですねそう。っていうのが前半かなぁ、技術力のとこ聞く?もう僕、。あきさんに技術力のとこ…技術力。は、うん。何を聞けばいいんだろうっていうレベルなんだ。けど。あ、そしたら、じゃあ、あの、あれについて聞きましょうか。その、LMエンジニア。そう、こないだ、そう、なんだっけ、あの、バンクーバーで、えっと、僕は誘ってもらった側なんで、どういう風に起きたのかあまり分かってないんですけど、あの、パパさん会があったじゃないですか。そこでちょっと質問して聞いたんだけどあんまり理解できてなくて実際何だろうそのLMエンジニアっていうのは何ぞやみたいな何してるのみたいなところもちょっと。聞いていきたいなと僕はLMはやってないんですよ今難しいなこれなこの話をすると結構あれなんですけど僕はそれで言うと主にもうちょっとクラシックな機械学習をサービスとして開発していくみたいなのをまだやっていてLMは道具として使うだから普通にコーディメイジェントとか使って開発はもちろんしますけどLM自体をサービスに直で使うみたいなのは今はまだやって僕のチームはやってないんですけど。おだしょーエンジニアの種類で言うとプロダクトエンジニアなわけ。じゃないですかおだしょーそうプロダクトエンジニアっていうふうに僕は言ってるんですけど一般的には多分マシンラーニングエンジニアって言ったほうが通りがいいですねおだし。ょーそのマシンラーニングエンジニアっていうのは何なんです。かおだしょーこれがまた人によって変わるやつなんですけど第一に言うと機械学習グラデーションがあってデータサイエンティストっていうふうに言うと主に統計機械学習とかも使って分析をしたりレポーティングをしたりあとはどういうアクションをするかみたいなところまでやるあとはモデルを作るだけ機械学習のモデルを予測するモデルを作るみたいなところまでみたいなのがデータサイエンティストの範囲だったりすることが多いんですけどMachineLarnigEeっていうとモデルを作ることもあるしただもうちょっとソフトエンジニアの経路が強くなってくるので実際に機械学習を動かすプラットフォームというか基盤を作ったりみたいなところもあとは必要なサーバーサイドの開発とかもやったりとかっていうふうにやってますねだから機械学習を使ったプロダクトを開発してるって言ってるんですけど実態としてはバックエンドエンジニアに機械学習の要素が加わったっていうふうに考えてもらうのが一番分かりやすいと。思いますね分かりやすいこの機会。にね俺も秋さんのやっているMLエンジニアっていう領域を少し理解させていただきたい俺みたいなパーで。も要するに分かるようにって。いうところがちょっとあるんですが俺もちょっと聞きたいんですかったんですよねデータサイエンティストは俺の中では割と経営者とかとやっぱり並走してるイメージがすごくあってですよねそういうデータがローデータというか生のデータがあってお客さんの声なのか何なのかいろいろあってそれを実際データサイエンティストの方々がモデル化しつつなおかつ経営方針としてどういう。ふうにこれを活用して。いこうかみたいな話を提案するのが俺の中でデータサイエンティストでそれを実際パイプラインにつなげてらっしゃる方がデータエンジニアでマシンラーニングの領域がそれに入ってくるとMLエンジニアと呼ばれるのかみたいな。だからそれで言うとデータエンジニアがやるところってデータサイエンティストを中心に考えたときにはデータエンジニアがやるのってデータサイエンティストが使えるデータマートとかデータウェアハウスを準備するところまでが多分データエンジニアの仕事。なんですよおだしょーごめんなさいデータマートデータウェアハウスっていうのは要する。にあれですねすごくざっくり言うと例えばビッグクエリにデータがいろいろありますとそこのビッグクエリにある程度の形のデータを用意データを取り込んで整形してみたいなパイプラインを作ってくるのがデータエンジニアの仕事っていう感じですか。ね逆に分かんなくなっちゃうそれで言うとアサナは多分この間データサイエンティストの仕事ありますよみたいなのでアキさんに教えたと思うんでだんだんやってることは分かると思うんですけどアサナはデータサイエンティストが結構いてこの頃少なくなっちゃったりもしてるんだけど結構いて彼らがやってることはまず一部ですけどね僕が関わりあるエンジニアからの視点でっていうのでいうとログをどういうふうに入れてどういうふうにデータを取るかをまず設計するそのアプリ機能がこういうのがあってそのときにこういうふうにログを取りましょうっていうのを設計してそれをエンジニアにそのログを入れてもらう自分で入れる会社とかもあるのかもしんないですけどAsanaの場合はうちではエンジニアがそこを書いてその出てきたデータをもとにそういうクエリとかを作ってABテストしたときにこのページのこの昨日このボタンとこのボタンだったらこのボタンの方が良かったよみたいなのを出してそのPMの仕事を助けるではないけどそのディセージョンメイキングを助けるみたいなのがデータサイエンティストなのかなってそう思ってるんです。けど今だから三つのロールが出ててデータサイエンティストの話も今東橋さん出してくれましたとそれで瀬田さんが言ったのはデータエンジニアデータエンジニアの話も出てきてさらにマシンラーニングエンジニアっていう話もあって今三つのロールが出てて今データサイエンティストは大体その辺なんですね今東橋さん説明してくれた中でキーとなるのがログの設計をするっていったときにこういう多分アプリケーションログでこういうログがあるとこういうことができますよこういうエビデスとかでこういうふうに使えますよっていうのを整理してるっていうふうに理解をしたんですけど逆にもそのログを取る行動をデータサイエンティストが実装は多分してないですよねログコール大平。そうですね内部でやって。ますねですよねそこがだからそのログを取るコードを実装するのがソフトウェアエンジニアがやったりとかあとはそのログを何て言ったらいいのかな整形したりするみたいなデータのパイプラインがあると思うんですけどそれを主に見てるのがデータエンジニアっていう感じかなだからそれこそRDBとかまでデータが流れてくパイプラインがあったりするじゃないですかそのホームラインを主に作ったりメンテナンスするみたいなデータエンジニアですねプロジェクトエンジニアも多分そういうことをやれたりやるとは思うんですけどただそれを全部面倒を見るかっていうと多分ここに入れとけばあとはこっちに流れてくよみたいなそういういわゆる土管を作るみたいなのを作るのがデータエンジニアだったりしますねだからそれこそ入力としていろいろあるルールと思うんですけどリアルタイム系のデータでストリーミングのデータが入ってきたりするとかっていうときはそれをこういうふうにデータを処理していくみたいな基盤を管理したりとかみたいなのがデータエンジニアって感じでだからデータサイエンティストはさっき戸橋さん言ってくれたようにこういうふうにABテストしてこういうふうにアクションしたほうがいいですよみたいなことを言うっていうパターンが多分結構多くてそのもう一つの別のパターンまで行くとさらにそこから機械学習のモデルを使って予測をするっていうものをやるとこういうこともできますよみたいなことまで言うのが多分データサイエンティストかなって感じがするんですけどねおだしょーうんうんうんうんうんうん。うんうんうんうんうんうんうん。うんうんうんうんうんうんうん。うんうんうんうんうんうんうん。うんうんうんうんうんうんうんうんうんうんうんうんうんうん。うんうんうんうんうんうんうんうんうんうんうんうんうんうん。うんうんうんうんうんうマシンラーニングエンジニアになると、それをプロダクションでゴリゴリと機械学習、予測とかをずっと定常的にし続ける。つまりは予測のエンドポイントとかを作ってそれこそAmazonとかでレコメンドの結果出たりするじゃないですかレコメンドのロジックを書いてかつそれを都度都度予測をするみたいな仕組みを作ってみたいなところまでやるのがマシンラーニングエンジニアかなっていう気。がしますおだしょーめっちゃ。分かりやすい分かりましたなんと。なく繋がってきたシステムとして普通のソフトエンジニアでもやれる人もいると思うんですけどやっぱりちょっと機械学習、LMの時代もそうなんですけどシステムの特性と。し。て決定的に振る舞わないで確率的に振る舞うデータによって入力がだからプロンプトとかもそうだと思うんですけど入力を何に与えるかによって出力が全然変わるじゃないですかその振る舞いを分かった上でどういうシステムを設計するかみたいなのを考えるのがMachineLarnigEe。の一つ面白いところマッシュランニングエンジニアとAIエンジニアみたいに呼ばれてるのは一緒です。か?AIエンジニアは僕はね、AIエンジニアは僕はさらによくわからないんですよって人によって言ってるけど。最近出てきた言葉なんちゃうの?って思ってるけどな俺。はいやなんか僕今聞いた感じだとAIチームとかいろんな会社に今多分あると思うんですけどAIのフィーチャーを作っていくチームは聞いた感じだとプロンプトを書きつつフィーチャーにしていくみたいなのをやってるのかなみたいな僕の前のチームでもそういうところをちょっとやってる人がいてでもその人は別にそういうエンジニアじゃなかったんだけどただただもう技術レベルがすごい高くて任されてやってみるみたいな感じで結構大変だったけどできたよみたいな感じで言ってた。からそれでいうとだからそう僕が多分説明の仕方がちょっとあれで誤解を招いたのがプロンプトの話は多分LMの例にしたほうが分かりやすいかなと思ったので出しましたけどMLエンジニアって言われるときには割とクラシックなメールの場合は別にプロンプトンはやらなくて予測するモデルを作るんですねだからさっき言った典型的なやつで言うとメール食わせてスパムかそうじゃないか判定するとかレコメンドもそういうことユーザーのコードログを与えてこの人にはどういう商品がいいかみたいなのをレコメンドするとかっていうそういうものが基本的にクラシックな機械学習で解かれる問題でそれをやってるのがMLエンジニアって感じかなAIエンジニアってなるとプロンプティングとかはもうそうだしいろいろ幅が広いと思うんですよね実際にそのLM自体を作る人もAIエンジニアって多分言うだろうしわかんないですね僕はいや間違いないおだしょー定義まだここからされる。んだろうなと思ってます。けどねなんとなく確かに。新しいカラーっていうのもある。かもしれないですねヤンヤンそうJDとか見てると結局AIエンジニアって言いながらフルスタックでフロントエンドをゴリゴリ書いてオープンAIとかのAPI叩いてみたいなこともそうなんですよねうんそことはちょっと違うかなって感じですねその普通に。ソフトエンジニアがあのただあのチーム変わってるだけでいけるような人もAIエンジニアって呼ばれてるのかなっていうのはこの頃はなんか思います。よねまあそれはだからAIエンジニアって何ぞやってのが分からないって僕が言ったところで確かに確かにまとまっちなんですよね本当に今はだからそう名前が出てきてわっとそういうので人を集め始めたかなっていうところだと思うん。ですけどそしたらちょっと最後にもう1個だけ質問したいんですけどキャリアっていうのを見たときにちょっとAIエンジニアを1回飛ばしてそのデータサイエンティストとそのLMエンジニアっていうのはラダージョーみたいな感じであるんですかそれとも全然違うなんていうんだろう分野なんですか例えば学校で勉強するものからもう違うんですかそれとも同じものを勉強してフロントエンドエンジニアバックエンドエンジニアみたいな感じで分かれるものなのかそれとも一つのラダー上に二つのこっちが上でこっちが下みたいなものがあるのかそこら辺があんまり理解。できなかったんですけどLMじゃなくてMLですよねMLですよね機械学習エンジニアですよね機械学習エンジニアとデータサイエンティスト別にダダーとして上とか下とかってわけではなくて目指してる方向性のちょっと違いみたいな感じですね結局だからフロントエンドとバックエンドとみたいなどっちを中心にやるみたいなぐらいの感じですねただそれが領域として近しいところがあるっていうそう。すると学校のバチラーとかのメジャー的には一緒には。なるコンピュータサイエンスで来るんじゃないかな結局コンピュータサイエンスで機械学習を専攻してましたって言ってでどっちやるっていう話に多分なると思うんで今の。CSってそこまでやるんですか逆に僕ちょっとあまり自分。が理解してないんですけどMLの話はでも普通にCSのコースの中でやるみたいですよ今やってるよそれでんだったらじゃあ。もう本当にそっちが好きだったらそっち行くしプロダクトデベロッパーみたいになりたかったプロダクトエンジニアになりたかったらプロダクトのほう行くしみたいなそういうキャリアな。のかそうですねだからMLエンジニアのほうに来る人っていうのは大体ソフトウェアエンジニアの色が強いほうが好きだっていう人のほうが多いんじゃないかなときは言えるかでもデータサイエンティストは純粋にそのモデルだったり、アルゴリズムだったりっていう話にフォーカスしたりとか、あとは経営にインパクトを与えるとか、そっちの方が好きな人の方が多いんじゃないかなって気がします。ね。そうですよねなんか俺もこのボットキャストを聞いている人たちがどこを目指すみたいな時にどういうふうに何か考えるんだろうなーって思って今話聞いてたんですけどそれぞれそれぞれ面白みありそうですよねなんか世の中にたくさんあるデータが散らばっていてログだったりなんだったりっていう部分をパイプラインとしてつなげるっていうところがデータエンジニアでこれはこれでまあまあ面白そうだなーって思うしそれら集まってきたデータっていうのをどう経営方針だったりに活かすだったりインパクトに活かすだったりっていうことを考えるのが多分データサイエンティストだったりそれを実際予測だったりとかリコメンデーションだったりとかお客さんに届けるっていうところにマシンラーニングが絡んでくるとそれがおそらくMLエンジニアって呼ばれるんだろうなーっていうふうに思ったりって考えるとまあ本当になんか3者3様同じ位置というかねあのなんかどっちが上下っていう感じじゃないんだろうなーって思いはしましたねやっぱり聞いて。てなんかそう今このアキさんの話を聞いてわかってきたけどどこまでわかってんのかなみたいな多分僕がそれ今聞く前のレベルが大体みんなが思ってる。ものなんじゃないかな。って勝手に思ってるんです。けど知らない思いはするね。でもなんかやっぱりそのどこでインパクトを与えたいのかっていうそのなんかねなんか興奮を覚えるというかなんか楽しみを覚えるみたいなこと多分人によるじゃないですかなんかその辺で結局分かれるん。だろうなーって思ったねうーん。でもなんかもう一つ気になったのは結構キャリアとしては難しかったりするじゃないですかそこらへんがちょっとやっぱりその境があんまりないみたいなところもあると思うしあとはまあ純粋に結構そのポジションの数みたいなのは少ないですよねその例えばあと僕の今言ってる会社で言うと一チームにデータサイエンティストが一人みたいなレベルで今ちょっともっと減っちゃってるんで結構その感じで言うと本当なんだろうデザイナーとかエンジニアとソフトエンジニアとデザイナーぐらいのポジションの数の違いはあるのかなみたい。なのはありますねまあそうですねそれで言うだからまあそうかな会話性。はイメージあるよね正直ソフトウェア。エンジニアっていうふうにの一個のバリアントって感じで生きてるのでそういう意味で言うとどこにフォーカスしてるかっていう意味だけで言うと少ないですねだから最近ちょっと減ってきちゃってるかもしれないけど一時で言うとこのモバイルエンジニアとかって言うとソフトウェアエンジニア全体量少ないよねっていうと同じような感じだと思うんです。よおだしょーごめんなさいソフトウェアエンジニアって言ったかプロダクトエンジニアって言いたかったですちなみにああ。ああああまあまあそんな子が変わん。ねーちゃ変わんないかプロだその中フィーチャーを出し続けるのをプロダクト僕の中ではフィーチャーを出し続けてあプロントエンドからそのバックエンドの途中ぐらいまでやるのがあのプロダクトエンジニアって僕の中では。思っててそんなそう僕バック。エンド側なんではいあのそうですねそのmそのそこらへんなんか機械合宿中の人たちもいてあとはそのなんかえっとなんていうんだろうaフレームワークみたいなのを作るそのバックエンドだけを本当にやる人もいてみたいなそのなんかやっぱ規模で言うとプロダクトエンジニアって言われるそこがマシンランニングそういう機能をすでに作ってそういうチームが作ったものを使ってそのフィーチャーを作るみたいなところはポジション的にはやっぱ多いのかなってごちゃごちゃしちゃっ。たけどそれは多分あれでしょうねってか面白いじゃあ東岡さんが言うその何だろうフロントエンド寄りのところプロダクトエンジニアっていうふうに言ってるのが僕は個人的に面白くてっていうのは今回だと思ってて多分それって会社における役割分担の仕方に依存してるんだと思うんですよねそうですかねうちだとプラットフォーム寄りの人とあとはアプリケーション寄りの人って言い方するんですけどプロダクトにお客さんカスタマーフェイシングな機能を作るっていうので言うとうちはだからそうかフロントエンドの人たちはフロントエンドの人たちでいるけどバックエンドでそのフィーチャーを開発していくっていう人たちもいてさらに。バックエンドのヤンヤン別々な。んですねそこがおだしょープラットフォーム系をやってるチームもいてっていうそういう感じなんで多分そこは製品プロダクトの何だろうどこがコアでっていうので多分切れ目が変わってくるんだろうなっていうふうには見て。てヤンヤン確かにそうかもしれないですね僕の中ではバックエンドもフロントエンドもプロダクトエンジニアではあるけど会社によってはそこが分かれているところもあるしフロントからバックまでやる特配者もあるしっていう認識でしたね似たワードがあってなんかちょっとごちゃごちゃし。てきたけど頑張っていろいろとキャッチアップしなくちゃいけ。ないですもんねこの業界いや。そうなんですねということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しい。",
  "utterances": [
    {
      "speaker": "A",
      "text": "始めていきましょう今回はアキさんに来ていただきましたアキさんは僕と瀬名さんもいるバンクーバーで今ソフトエンジニアテックリードでしたっけとして働くプリンシパルか僕全然とこら辺分かってないんですよねプリンシパルとかテックリードとか結構会社によってみたいなところもあるのかなと思うんですけど今でもちょっといろいろインタビューしていきたいと思いますまず簡単にざっくり経歴を教えていただいてもいいですかいろいろあると思うんですけど。",
      "start": 969,
      "end": 30466,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "ざっくりいきます長くなったんですけど最初試作で東芝の研究所に行ってリサーチャーをやったんですけどそこで音声対話とか今まで言うSirみたいなことの結局開発とかをやってその後Cokpadでプロダクトを開発する普通にレール図を書くエンジニアになりましたと当時はフロントエンドバックエンドの区分もなかったので普通にRailsからHTMLCSからなんならMLの的なレコメンドの機能を作るのにそのレコメンドのロジックのバッジも書いてみたいな感じで全部やるみたいなのをやってましたとその後にクラウデラっていうアメリカの会社なんですけどHadopを売る会社でセールスエンジニアとAWSというところのSA的な感じのポジションになった日本プランチそこでもマシンラーニングの話をいろいろしたりして製品を売るお客さんを支援するみたいなことをやって今はTreasureDataという会社でプリンシパルエンジニアですねマシンラーニングの機能プロダクトを開発するのをプロジェクト全体をエンジニアリングとしてリードするみたいなことをやっておりますめっちゃざっくりめっちゃざっくり。",
      "start": 32523,
      "end": 127061,
      "timestamp": "00:32"
    },
    {
      "speaker": "C",
      "text": "素晴らしいちなみにアキスさんといえばっていったらあれかもしれないですね今僕の目の前の本棚にですねオライリーの機械学習の本があってあれの著者っていう部分もあるかと思いますがこれ書かれたのはちなみに何年ですか。",
      "start": 127061,
      "end": 141012,
      "timestamp": "02:07"
    },
    {
      "speaker": "B",
      "text": "それをですね、イースもですね、それ書き始めたのはまだクックパッドにいる時代に書き始めたんですけど、転職してちょっと一変ポシャリかけたのを同人誌、技術書店ですね。",
      "start": 141632,
      "end": 157664,
      "timestamp": "02:21"
    },
    {
      "speaker": "A",
      "text": "で、。",
      "start": 157664,
      "end": 157834,
      "timestamp": "02:37"
    },
    {
      "speaker": "B",
      "text": "同人誌として復活させて、で、その後オライリーに商業誌として出すって感じですね。",
      "start": 157834,
      "end": 165288,
      "timestamp": "02:37"
    },
    {
      "speaker": "C",
      "text": "へえ、そういう流れだったんですね。なんかオライリーがこういう書籍の内容を選ぶときって、どういう流れだったんだろうってずっと思ってたんですけど、最初、じゃあ同人誌型だったんですか、形としては。",
      "start": 165298,
      "end": 175686,
      "timestamp": "02:45"
    },
    {
      "speaker": "B",
      "text": "そうですね。同人誌で書いて、知り合い1人と3人で同人誌で書いたんですけど、で、それをベースにブラッシュアップしていったって感じですね。なるほど。",
      "start": 175686,
      "end": 188076,
      "timestamp": "02:55"
    },
    {
      "speaker": "A",
      "text": "それ、。",
      "start": 188076,
      "end": 188596,
      "timestamp": "03:08"
    },
    {
      "speaker": "B",
      "text": "クッパとしてか。",
      "start": 188596,
      "end": 189427,
      "timestamp": "03:08"
    },
    {
      "speaker": "A",
      "text": "それはなんか自分で勝手に書き始めて、ものになったものを改めてオライリーで出しませんか?みたいな依頼が来るんですか?",
      "start": 189437,
      "end": 198668,
      "timestamp": "03:09"
    },
    {
      "speaker": "B",
      "text": "えっとですね、それでいうと、だから同人誌書く前に一遍書き始めてポシャっと取った時、とか同人誌書いて、書いた時には知り合いにオライリーの編集者がいてそこに同人誌も見せてみたいな感じで、どうすかねっていう、当時だからなんだっけな技術書店今は分かんないですけど当時結構いろんな編集いろんな出版社の編集さんがうちからどうすかみたいな感じのまだ3回目とかだったかな忘れましたけど言ってくれてたようなタイミングでこっちからも売り込みもしましたけど商業紙出せたらいいなという思いもありつつ同人誌からステップアップしたって感じですねそういう。",
      "start": 198668,
      "end": 252040,
      "timestamp": "03:18"
    },
    {
      "speaker": "C",
      "text": "流れはあり得るんだ。知らなかった。農人誌活動って馬鹿にならないんだな、じゃあ。",
      "start": 252040,
      "end": 257356,
      "timestamp": "04:12"
    },
    {
      "speaker": "A",
      "text": "確かに。ブログとかみたいなので書いてた経験とかあるんですか?なんとなくなんですけどブログとか書いてて、書いてくださいって言われるのが結構なんかよくあるパターンなのかなーなんて勝手に思ってたんですけどそれ。",
      "start": 257356,
      "end": 269490,
      "timestamp": "04:17"
    },
    {
      "speaker": "B",
      "text": "で言うとだからブログはもともと書いてはいたり最近は本当に書いてないですけど昔は書いてねスランさん分かりますよね僕らの時代ブログを書くのは割とエンジニアの会話の人はみんなやってたからもう書いてたんですかって言われたら書いてましたっていうスランそれは書いてるんですよ勉強するように書い。",
      "start": 269490,
      "end": 288002,
      "timestamp": "04:29"
    },
    {
      "speaker": "C",
      "text": "てツイッターと同じレベルで書い。",
      "start": 288002,
      "end": 289443,
      "timestamp": "04:48"
    },
    {
      "speaker": "A",
      "text": "てすいませんなんか今まで一回も書いたことないんでスランそうだよ。",
      "start": 289443,
      "end": 294606,
      "timestamp": "04:49"
    },
    {
      "speaker": "B",
      "text": "ねもうセネレーションっぽい今感じてるんですけど間違いないまあでもそうですねなんだろう一番最初にその本を書きたいと思ったきっかけはその最初のクックパッドに行った時の同僚にあの青木ミネローさん今も同僚なんですけど青木ミネローさんっていう人がいて10年戦えるSQLの本を書いた人なんですけどその書いた人そうそうあの人がなんか自分がなんで本を書いたかっていうと同僚に同じことを無限に説明するのが嫌になったからなるほど。それを本で書くと、もう本渡せ、本買ってね、とか本渡せば、それでもう説明終わるんで、めっちゃ楽ですよって言われて、そその二つ目で書いたっていうのはあります。",
      "start": 294606,
      "end": 340533,
      "timestamp": "04:54"
    },
    {
      "speaker": "A",
      "text": "なるほどね。確かにめちゃくちゃ、なんだろう、エンジニアっぽいエピソードっていうか。",
      "start": 340533,
      "end": 344233,
      "timestamp": "05:40"
    },
    {
      "speaker": "B",
      "text": "間違いない。そうそうそうそう。ある意味レイズですというか。",
      "start": 344233,
      "end": 349524,
      "timestamp": "05:44"
    },
    {
      "speaker": "A",
      "text": "そうそうそう。いやいや、。",
      "start": 349524,
      "end": 350735,
      "timestamp": "05:49"
    },
    {
      "speaker": "C",
      "text": "あるべき姿だと思います。なるほど、。",
      "start": 350735,
      "end": 352565,
      "timestamp": "05:50"
    },
    {
      "speaker": "B",
      "text": "素晴らしい。",
      "start": 352565,
      "end": 355202,
      "timestamp": "05:52"
    },
    {
      "speaker": "A",
      "text": "どっからちょっと行けばいいのかわかんないですけど今海外、カナダから働かれてるわけじゃないですかその海外に、海外で働きたいみたいなの昔からあったんですか?結構前から意識されてたことなんですか?",
      "start": 355212,
      "end": 371612,
      "timestamp": "05:55"
    },
    {
      "speaker": "B",
      "text": "そうですね結構それで言うとなんとなくぼんやりやっぱりクックパートに行った時に特にリビルドの宮川さんが同僚に当時いたんですね僕が働いてたタイミングってでその時にやっぱりなんかあれですね梅田茂雄さんとかのあー懐かしいなーシリコンバレーがやっぱりなんかかっこいいみたいなそういうイメージがあってそれでなんかいつか海外で働けたらなーっていうのとあとは家庭の事情で言うと奥さんが昔あのヨーロッパにドイツに住んだことがあってそれであの働いてるとあなたはいつ海外で働くのってことをずっとあのプレッシャーが勝てないであったんであーそうだったんだなのでそうするといつかは海外で働いてみたいなみたいなのはずっとぼんやりとはあってそれを本格的に動き始めたのはやっぱりクックパッドを辞めるときにクラウドを選んだのはアメリカの企業外資なんだけどリロケーションの可能性もワンチャンあるかなみたいなのも考えてでクラデランというわけでちょっとポジションがセールスエンジニアだったんでやっぱりお客さんと話をする立場の人がリロケーションすると結構厳しいじゃないですかなのでそれでトレジャーデータでまたソフトウェアエンジニアに戻って入るときにリロケーションしたいんですけどっていう話を込みで採用して。",
      "start": 371622,
      "end": 465001,
      "timestamp": "06:11"
    },
    {
      "speaker": "A",
      "text": "もらったって感じですねなんかあの前回実はあのユーセイさんっていう方同じ時期に多分あの今してくさってにいられたと思うんですけど彼と同じチームだったんですかなんかその聞いた感じだとクックパッドでも行くなんか海外に行くパターンなんてのパスがあったみたいな聞いてるんですけどいい質問。",
      "start": 465001,
      "end": 485826,
      "timestamp": "07:45"
    },
    {
      "speaker": "B",
      "text": "ですねそれでいうとクックパッドに僕がだからいたタイミングですねクックパッドの昔にですねそこにお家騒動というのがありましてありましたねなんというかだから創業者から次の社長に移ったんだけど、また創業者が帰り咲くみたいな、そういうタイミングがあって僕はその次の社長、雇われたというか、変わった社長のタイミングで入って、彼が辞めるというか出ていくタイミングより、本当に同じぐらいのタイミングかな。で、僕は辞めたので、その後、だから創業者が帰ってきてから海外の日本からエンジニアを送るみたいなのをやり始めてたんで、そういう意味で、だから僕がいたタイミングでは、そういう話はほとんどなかったですね。",
      "start": 485826,
      "end": 542819,
      "timestamp": "08:05"
    },
    {
      "speaker": "C",
      "text": "あの大井騒動の時、X状むっちゃられましたよね。懐かしいなぁもはやその後かクックパッドが割とロンドンかだったりとか海外のねイギリスの。",
      "start": 542819,
      "end": 555295,
      "timestamp": "09:02"
    },
    {
      "speaker": "B",
      "text": "そうそうイギリスに拠点を持つイギリス。",
      "start": 555295,
      "end": 558576,
      "timestamp": "09:15"
    },
    {
      "speaker": "C",
      "text": "だロンドンじゃないかイギリスか。",
      "start": 558576,
      "end": 560276,
      "timestamp": "09:18"
    },
    {
      "speaker": "B",
      "text": "そうですねはいありがとうございます。",
      "start": 560276,
      "end": 563377,
      "timestamp": "09:20"
    },
    {
      "speaker": "C",
      "text": "ちなみに僕もちょっと聞いてて思ったんですけどってするとまぁえっと具体的にトレジャーデータに入った都市っつうのが詰まるところはカナダの方にバンクーバーに来られた時っていうことになるのかなと思うんですけど。",
      "start": 563377,
      "end": 574200,
      "timestamp": "09:23"
    },
    {
      "speaker": "B",
      "text": "うちに今トリジャーデータに入ったのが2018年かなそっから結局だから3年ぐらいかかったかなやっぱりリロケーションしたいといっても一応ジャスティフィケーションがないとリロケーションのバジェット出せないじゃないですかそうそうそうだからやっぱりガパメント側に出すのにもこの人を辞めさせるぐらいならリロケーションさせたいみたいなそういうような社内も社外も全部そういう理屈を作らなきゃいけないんでそれなりに活動をしてちゃんとリロケーションさせた方がいいねっていう話に持っていくまでそれぐらいかなあとは実際にプロセスに対してが1年ぐらいなのでだから2年、正味2年ぐらい働いてそこから動き始めたみたいな感じプロセスを増し始めたみたいな。",
      "start": 577601,
      "end": 634523,
      "timestamp": "09:37"
    },
    {
      "speaker": "A",
      "text": "感じでしたねクラウデラの時は何かしらがあってうまくいかなかったみたいな感じなんですか?",
      "start": 634523,
      "end": 642838,
      "timestamp": "10:34"
    },
    {
      "speaker": "B",
      "text": "それで言うとクラウデラのときはだからSalesEngirっていうポジションなんですけど僕の経歴すごいよく分からない変わってるねとはよく言われるんですけどSalesEngirとかAWSのSAとかSolutinArchitectってとかだとイメージしやすいと思うんですけど割とお客さんのところに行ってお客さんがこういうことやりたいんですけどみたいなことを言ってそれを支援するみたいなそういう立ち回りなんですよねだからいわゆるプリセールスの立場なのでそこのポジションのままでインターナルでリロケーションするみたいなのは一応難しいんですよ当時データサイエンティストのチームがUSにいたんでそこに入るみたいな道はあるけれどそれって結局クラウドラのたてつけだとポストセールスになるのでだからプロフェッショナルサービスとかいわゆるお客さんに買ってもらって作業をがっつりプロジェクト案件として作業をするみたいな感じなんでより英語で要件とかをけんけんがくがくするみたいな感じにしなきゃいけなくってお前デカいバンクとかにお前ぶっこまれるけどそれできるかみたいなこと言われてねえ、あのバンカメとかに突っ込まれてシドロモドルの英語でやるなんてイメージできなかったので確かにお支えくださいなっていうのがあったものとあとは当時だから第一次トランプ政権でアメリカ行くのこれやばくね?みたいな思ったのもあってっていうのがあってそのクラウデラ時代はちょっとあのトーンダウンしたというかのはありましたねはい。",
      "start": 642848,
      "end": 761102,
      "timestamp": "10:42"
    },
    {
      "speaker": "C",
      "text": "そうアメリカのねワードもすいませんね出てきたかなというふうに思うのであれなんですけどあのトレジャーデータさんからこっち来る時っていうのはもう選択肢はバンクーバーだけだったん。",
      "start": 761306,
      "end": 770757,
      "timestamp": "12:41"
    },
    {
      "speaker": "B",
      "text": "ですかそういえば当時で言うとバンクーバーかUKかUKあの時はまだARMに配置されていたのでケンブリッジ内所はUKにも拠点とか人がいたのでかなーみたいな話だったんですけどただチーム的にはバンクーバーにメンバーがいるチームだったのでバンクーバーかなーっていう感じでしたね。",
      "start": 770757,
      "end": 799795,
      "timestamp": "12:50"
    },
    {
      "speaker": "C",
      "text": "そういうことですねありがとうございますまあね結構なんかエンジニア。",
      "start": 800815,
      "end": 804257,
      "timestamp": "13:20"
    },
    {
      "speaker": "A",
      "text": "と言ったらって言ったらあれ。",
      "start": 804257,
      "end": 805618,
      "timestamp": "13:24"
    },
    {
      "speaker": "C",
      "text": "かもしれませんがやっぱアメリカ行きたいとかさっきのこう奥様のねあの意向みたいな部分もあったのかなと思うんですがバンクーバーで良かったんだってちょっと思いつつだったんですけどなんかその辺ちょっと聞いてみたいなと思って。",
      "start": 805618,
      "end": 815604,
      "timestamp": "13:25"
    },
    {
      "speaker": "B",
      "text": "いてまあ多分えっとそれで言うとなんだろ早かったのがバンクーバーはスッと行ける僕はこっち来たタイミングって2021年の最終的に来たのが4月なんですけど、その1年ぐらい前、2020年だからCOVIDでわちゃわちゃ言いつつで、タイミング的にはもうUSのビザがそろそろ厳しくなってきてんじゃないかっていう雰囲気のタイミングだったんですよ実体開けてみたらCOVID中は比較的楽だったっぽいんですけど今から聞く感じではまあただその何だろう時間が長くなればなるほどまああの会社に何だろう居続けられるかどうかもわかんないみたいなリスクが増えてくるわけじゃない。",
      "start": 815604,
      "end": 862036,
      "timestamp": "13:35"
    },
    {
      "speaker": "A",
      "text": "ですか確かに確かに、なるほどね。",
      "start": 862036,
      "end": 864332,
      "timestamp": "14:22"
    },
    {
      "speaker": "B",
      "text": "そうそう。というのもあって、バンクーバーならチームもあるし、行きやすいんだったらぐらいな感じで来たっていうところありますね。もちろんアメリカに対する不安もありましたけどね、。",
      "start": 864332,
      "end": 880740,
      "timestamp": "14:24"
    },
    {
      "speaker": "A",
      "text": "当時も。",
      "start": 880740,
      "end": 881810,
      "timestamp": "14:40"
    },
    {
      "speaker": "C",
      "text": "世界情勢とビザ的動向といろんなものが重なってっていうことですね。",
      "start": 881810,
      "end": 886963,
      "timestamp": "14:41"
    },
    {
      "speaker": "B",
      "text": "そうっすね、はい。",
      "start": 886963,
      "end": 888446,
      "timestamp": "14:46"
    },
    {
      "speaker": "A",
      "text": "あとはなんか来方としては今のトレジャーデータでインターナルトランスファーっていう道を選んだと思うんですけどもうなんか来ちゃってからこっちでそのまま就活するみたいな道もなくもないじゃないですか学校行ってとかもあると思うんですけどなんかその中でインターナルトランスファーになんかこだわったみたいなのはなんか理由がある。",
      "start": 888456,
      "end": 913067,
      "timestamp": "14:48"
    },
    {
      "speaker": "B",
      "text": "んですか逆に言うと僕知らなかったんですよね今こっち来るとみんな大体カナダの鉄板はだから一旦枯れ地挟んでみたいなのが鉄板だよって話だっ。",
      "start": 913067,
      "end": 924624,
      "timestamp": "15:13"
    },
    {
      "speaker": "A",
      "text": "たと思うんですけど。",
      "start": 924624,
      "end": 925165,
      "timestamp": "15:24"
    },
    {
      "speaker": "B",
      "text": "僕がそういう動きをしてたときってみんなだからインターナルトランスファーで行くのが割と王道みたいな方法が多かったんですよ本とか読んでもそういうふうに書かれているとかっていうのはあったし140はもう年齢的に全然使えない人だったのでこういう話をしてたときにはそれもないのでだから知らなかったっていうのが一番大きいかな実際にそう。",
      "start": 926909,
      "end": 958634,
      "timestamp": "15:26"
    },
    {
      "speaker": "C",
      "text": "よねネットとか見てもだいたいインターナルトランスファーの話しか出てなかったですもんね。",
      "start": 958634,
      "end": 962675,
      "timestamp": "15:58"
    },
    {
      "speaker": "B",
      "text": "当時ってそうですねそうですねだからうちにトレジャーデータに入ると2018年でクラウデラー側も3年ぐらいまでか2015年とかそれぐらいかだからそれぐらいの時だとまだ多分そんなにみんななんだろうカレッジ経由してとかっていう話は知らなかったんじゃないかな確か。",
      "start": 962675,
      "end": 987080,
      "timestamp": "16:02"
    },
    {
      "speaker": "A",
      "text": "に僕がそれこそ2018年に来てカレッジ行ったんですけど確かにまあなんかあのほんとだいたいみんな僕と同じぐらいの年代僕当時来たのが23歳だったんですけどもうなんかそのぐらいの年代でまあ別になんかキャリアとか遠くにはあんまりないみたいなあとちょっと技術強い人が多めだったかなだけど、なんかみんな若くて、まぁなんかちょっと夏休み気分で1年間カレッジ行ってみたいなのが多かったのは確かに。",
      "start": 987080,
      "end": 1012221,
      "timestamp": "16:27"
    },
    {
      "speaker": "B",
      "text": "そうかもしれないですね。僕だってもうそのタイミングってもう30超えてたんで、30半ばく、半ばく?ぐらい、嘘か、それは言い過ぎなんで30、むしろ後半か、ぐらいまで差し掛かってたんで、そうするとまずちょっとそのタイミングでカレッジ行ってって、家族も連れてってなるとたしかにね、。",
      "start": 1012221,
      "end": 1034933,
      "timestamp": "16:52"
    },
    {
      "speaker": "A",
      "text": "インターナルの方が安全は安全ですよね確かにそのもう仕事がありお金ももらえるっていうあれもありそれで。",
      "start": 1034933,
      "end": 1042415,
      "timestamp": "17:14"
    },
    {
      "speaker": "B",
      "text": "言うとまだトレジャーデータに転職するタイミングだとビザサポートありの会社の最初からビザサポートするよっていう会社がちらほらいたので当時だから転職活動してたときにはドイツの会社ベルリンかなドイツの会社も受けてまし。",
      "start": 1042415,
      "end": 1064164,
      "timestamp": "17:22"
    },
    {
      "speaker": "A",
      "text": "たねなるほど確かに数は少ないですもんね絶対的に。",
      "start": 1064164,
      "end": 1069786,
      "timestamp": "17:44"
    },
    {
      "speaker": "B",
      "text": "そうですねあとは聞いて。",
      "start": 1069786,
      "end": 1073423,
      "timestamp": "17:49"
    },
    {
      "speaker": "A",
      "text": "て気になったんですけどサービスエンジニアっていうのをやられたと思うんですけど結構ゴリゴリプログラミングをやってたエンジニアからすると結構違う分野だと思うんですけどそこに行った理由みたいなのはあるんですかもう会社に行きたかったからみたい。",
      "start": 1073423,
      "end": 1097802,
      "timestamp": "17:53"
    },
    {
      "speaker": "B",
      "text": "な感じですかいやそれで言うと何だろうな僕が最初の東芝の研究所を辞めたときに何でCokpadに移ったかっていうとお客さんに実際に使ってもらえるプロダクトを作りたかったっていうのが大きな理由で移りましたとCokpadでいろいろ特に主に有料会員向けの機能を開発をするみたいなのをやってたんですけどそのときにクラウドラに移ったときは外資で海外にワンチャン行けるようなチャンスを英語で仕事をして海外に行けるチャンスを使いみたかったっていうのがひとつとあとはセルスエンジニアがセルスエンジニアで何て言ったらいいのかなプロダクトエンジニアとある種営みとしては近いところはあるかなって思ったんですねっていうのはお客さんが本当に欲しいものは何かっていうのをB2Cの会社だとお客さんとたまにユーザーインタビューしたりっていうこともあったりもするだろうしあとはフィードバックが来たりとかログとかメトリクスとか見たりみたいなふうになると思うんですけどそれをそこからもうちょっと踏み越えて実際の商談でお客さんとお話をしてどういうものを作りたいとかっていうのを議論しながらうちのHadopの基盤データ基盤を作るソフトウェアを買ってもらうっていうたてつきだったんでそれを使って何をしたいんでしたっけとかそういう話をするっていうのは結局お客さん何がやりたくてゴールは何だろうみたいなのを考えるっていうところで近いのかなっていうのもあって映ったって感じ。",
      "start": 1097802,
      "end": 1205048,
      "timestamp": "18:17"
    },
    {
      "speaker": "C",
      "text": "ですねなるほどねなんかICのポジションの人たちってみんなお客さんと喋るのは嫌がるのかなっていうふうに思っていたんです。",
      "start": 1205048,
      "end": 1213371,
      "timestamp": "20:05"
    },
    {
      "speaker": "A",
      "text": "がそうですよね特に秋さんって技術の本格ぐらい技術に結構精通されてる方じゃないですかだから特になんかいや俺は別にずっとコード書いたりだとか売るというよりは作る方で極めたいみたいな感じのタイプなのかなと思っ。",
      "start": 1213371,
      "end": 1231259,
      "timestamp": "20:13"
    },
    {
      "speaker": "B",
      "text": "たらいやーでもそれで言うと僕は何だろうあのまあ結構技術を深掘りしたい人とあとはよくあるプラットフォーム系に行くのかプロダクト系に行くのかみたいなそういう議論あるじゃないですか僕だからそれでいうと一貫してプロダクト系のほうが好きなのでうちに来てもたまにというか割と最初の頃はそれこそ営業さんのところにひっついてSEにひっついていってこういう機能作ったんでとか言ってデモさせてくださいみたいなのをやらせてもらったりとかいろいろやってたりしてそういう意味で言うとそういう取り組みをしたのはよかったかなみたいなそのB2Bセールスの中でどういうサイクルがあってっていうのは知ってるしそこでどういう支援をすれば営業側の人が嬉しいかっていうのもなんとなく分かるので。",
      "start": 1231259,
      "end": 1289579,
      "timestamp": "20:31"
    },
    {
      "speaker": "C",
      "text": "そこはタッグでしたね。",
      "start": 1289579,
      "end": 1291320,
      "timestamp": "21:29"
    },
    {
      "speaker": "A",
      "text": "確か。",
      "start": 1293601,
      "end": 1293901,
      "timestamp": "21:33"
    },
    {
      "speaker": "C",
      "text": "にb2bセールスのサースってどうやって売ってんだろうって全然想像つかない。",
      "start": 1293901,
      "end": 1297383,
      "timestamp": "21:33"
    },
    {
      "speaker": "B",
      "text": "ですもんね使わないですね。",
      "start": 1297383,
      "end": 1299363,
      "timestamp": "21:37"
    },
    {
      "speaker": "C",
      "text": "ーアホな回答しかできねー。",
      "start": 1299363,
      "end": 1305246,
      "timestamp": "21:39"
    },
    {
      "speaker": "A",
      "text": "そしたらちょっとあの話を戻してあのちょっと英語の話を聞いていきたいんですけどなんかその結構そのもうクックパッド時代からなのかなえっと働き海外で働きたいみたいなを考えつつなんか英語の勉強みたいなのはされてきたんですか割となんかですなんだろうなんかあの外資に移ってみたいななんか割とステップがあってなんだろうこっちに来てるのかなぁみたいなのはキャリアから見えるんですけどそう。",
      "start": 1305246,
      "end": 1333847,
      "timestamp": "21:45"
    },
    {
      "speaker": "B",
      "text": "ですねだからえっとクックパッド時代は全然英語も使ってないし英語も別に何だろうできできないまあ今全然できなかったんですけどあのクラウデラに移った時は必死で当時はDMA会話を毎日レッスンを本当に1日も休まずに1年ぐらいずっと続けてレッスンをするみたいなことをしたりとか。",
      "start": 1333847,
      "end": 1358285,
      "timestamp": "22:13"
    },
    {
      "speaker": "C",
      "text": "して一日も休まなかっ。",
      "start": 1358285,
      "end": 1360728,
      "timestamp": "22:38"
    },
    {
      "speaker": "A",
      "text": "たんですか?",
      "start": 1360728,
      "end": 1361339,
      "timestamp": "22:40"
    },
    {
      "speaker": "B",
      "text": "そうそうそう頑張ったなと思って今はできないです。",
      "start": 1361339,
      "end": 1365913,
      "timestamp": "22:41"
    },
    {
      "speaker": "A",
      "text": "ね僕は3ヶ月ぐらいで諦めちゃいましたねあれなんか結構英語の会議の時にも同じような話をしたんですけどやっぱなんかいろんな人と話すじゃないですか毎回同じ先生を選べるわけではないのでプラットフォームの都合というかあれで確かにそうするとやっぱりなんか初めましてから始まることが多くなるじゃないですかでスモールトケでってなると15分ぐらい使っちゃってあとの15分しか勉強できなくて結局毎日同じこと言ってるなみたいなな気持ちになってちょっとなんか無駄が多いなぁみたいなのを感じてしまってなんか続かないかなっていうのが僕はあったし結構周りを聞くとそういう人が多いんですけどなんかそこらへん1年間続けられたと。",
      "start": 1365913,
      "end": 1410910,
      "timestamp": "22:45"
    },
    {
      "speaker": "B",
      "text": "いうかいやもうなんか、あのあれですね、とにかく翌日のスケジュールを予約してっていうのをやり続けるみたいな感じで、それを強制的に習慣化するみたいなのが先にやってましたね。で、あとはなんだっけな、当時思い返してみるとだから、なんだろうな、あのDMM会話の中でニュース記事を読んでなんかディスカッションするみたいなやつが確かあったと思うんですけどこうずっとやってたかなっていうのはあれって要するに文章があって読み上げてって感じなので先読みして自分が理解して構造を理解してそれであとはどこで行き継ぎをするかっていうのは結構当時難しかったんですよばーっと喋ってて適切なタイミングで行き継ぎをしないと意味が崩れちゃうんじゃないですかなるほどね考えたことあんまなかったななるほどなんかウィッチとかそういうところで区切るとかダッツとかなんかカマとかなんかそういうので区切っていいところかなみたいなのを先読みしてやってってやってであとはその話をフックにあのちょっと雑談っぽいものをするときはするみたいな感じで組み立ててたら同じ先生で何回も狙ってたってのもありますけどそうじゃなくてそうするとその何だろう余計な雑談をただただするのはやっぱり無益なことも多かったん。",
      "start": 1410910,
      "end": 1505513,
      "timestamp": "23:30"
    },
    {
      "speaker": "A",
      "text": "でそうですよねそうだ。",
      "start": 1505513,
      "end": 1508074,
      "timestamp": "25:05"
    },
    {
      "speaker": "B",
      "text": "からそれであの何だろう読んで発音に対するフィードバックをもらってで、いろいろ雑談議論するみたいな感じにしたら自分にはそれが合ってたかなって。",
      "start": 1508074,
      "end": 1521638,
      "timestamp": "25:08"
    },
    {
      "speaker": "A",
      "text": "感じですねちなみに始める前はよくある大学出た人大学受験やったからリーディングとか単語文法は大丈夫だよみたいな感じのレベルだったんですか?",
      "start": 1521638,
      "end": 1536936,
      "timestamp": "25:21"
    },
    {
      "speaker": "B",
      "text": "そうですね、そんな感じですだから学生時代に、大学院の時になんだっけえっと問い受けてうんまああ違うな東芝入った時ぐらいに、違う、大学の時に何か700何本とか、まあまあそんなもんかなぐらいな感じの別にめっちゃ、今から見ると大してできるわけでもないけど全くできないわけでもないぐらいな感じのスコアを取って、まあこんなもんかみたいな感じで生きてった感じですね、最初はねクラウドラに入った時に上司がオーストラリア人だったんですよ当時使ってたのがZomじゃなくてCiscoのWebExっていうですねめちゃくちゃしんどいやつがあってだからZomの人たち確かCiscoの人たちからスピンアウトして自分たちが2周目で作ったとかだったはずなんですけど本当に音がめちゃくちゃきついんですよなるほどねそうそうみたいな中で上司とミーティングをしたりするみたいなのを気合でなんとかやるみたいな感じだったんで瞬間的に作文をし続けるみたいなのを今はできますけど当時は全然できなかったっていうのがあって口をだから鳴らす筋肉をつけるみたいな目的でDMメーカーがやってたかなっていうの。",
      "start": 1536936,
      "end": 1629693,
      "timestamp": "25:36"
    },
    {
      "speaker": "C",
      "text": "はありますねじゃあogのそのえっとオーストラリアのその上司の方がいらっしゃった時はまだじゃあ英語のdm365日やってなかったんですかだ。",
      "start": 1629693,
      "end": 1638951,
      "timestamp": "27:09"
    },
    {
      "speaker": "B",
      "text": "から入って入ってからやっ。",
      "start": 1638951,
      "end": 1640612,
      "timestamp": "27:18"
    },
    {
      "speaker": "C",
      "text": "て入ってからやってるの。",
      "start": 1640612,
      "end": 1641613,
      "timestamp": "27:20"
    },
    {
      "speaker": "B",
      "text": "かって感じですね会社のあの経費というかお金出してもらったんではいんそうですねそういうことだったのか大変だ。",
      "start": 1641613,
      "end": 1653539,
      "timestamp": "27:21"
    },
    {
      "speaker": "A",
      "text": "そのやった結果どうですか変わりましたなんだろうそのその人とはちゃんと喋れるようになってたんですか?",
      "start": 1653539,
      "end": 1661090,
      "timestamp": "27:33"
    },
    {
      "speaker": "B",
      "text": "そうっすねそれで言うとクラウドランにいた時辞めるちょっと前かなシンガポールのオーライリー系でもう今なくなっちゃったんですけどストラッターっていう名前のデータ系のカンファレンスかでそこでシンガポールで英語で登壇もだから採択されて登壇もしてでその時にちょうどシンガポールでの集まりも会社の集まりもあったんでそこで上司と会って話したらいやー英語なんかめちゃくちゃできるようになったねって言わ。",
      "start": 1661090,
      "end": 1693170,
      "timestamp": "27:41"
    },
    {
      "speaker": "C",
      "text": "れてすごいですねなるほどなるほど。",
      "start": 1693170,
      "end": 1696871,
      "timestamp": "28:13"
    },
    {
      "speaker": "B",
      "text": "よかったっていう感じでっていうあれですねそう。",
      "start": 1696871,
      "end": 1701472,
      "timestamp": "28:16"
    },
    {
      "speaker": "C",
      "text": "っていうのが前半かなぁ、技術力のとこ聞く?もう僕、。",
      "start": 1705602,
      "end": 1709826,
      "timestamp": "28:25"
    },
    {
      "speaker": "A",
      "text": "あきさんに技術力のとこ…技術力。",
      "start": 1709826,
      "end": 1712068,
      "timestamp": "28:29"
    },
    {
      "speaker": "C",
      "text": "は、うん。何を聞けばいいんだろうっていうレベルなんだ。",
      "start": 1712068,
      "end": 1714129,
      "timestamp": "28:32"
    },
    {
      "speaker": "A",
      "text": "けど。あ、そしたら、じゃあ、あの、あれについて聞きましょうか。その、LMエンジニア。そう、こないだ、そう、なんだっけ、あの、バンクーバーで、えっと、僕は誘ってもらった側なんで、どういう風に起きたのかあまり分かってないんですけど、あの、パパさん会があったじゃないですか。そこでちょっと質問して聞いたんだけどあんまり理解できてなくて実際何だろうそのLMエンジニアっていうのは何ぞやみたいな何してるのみたいなところもちょっと。",
      "start": 1714129,
      "end": 1741231,
      "timestamp": "28:34"
    },
    {
      "speaker": "B",
      "text": "聞いていきたいなと僕はLMはやってないんですよ今難しいなこれなこの話をすると結構あれなんですけど僕はそれで言うと主にもうちょっとクラシックな機械学習をサービスとして開発していくみたいなのをまだやっていてLMは道具として使うだから普通にコーディメイジェントとか使って開発はもちろんしますけどLM自体をサービスに直で使うみたいなのは今はまだやって僕のチームはやってないんですけど。",
      "start": 1741231,
      "end": 1779348,
      "timestamp": "29:01"
    },
    {
      "speaker": "A",
      "text": "おだしょーエンジニアの種類で言うとプロダクトエンジニアなわけ。",
      "start": 1780309,
      "end": 1784150,
      "timestamp": "29:40"
    },
    {
      "speaker": "B",
      "text": "じゃないですかおだしょーそうプロダクトエンジニアっていうふうに僕は言ってるんですけど一般的には多分マシンラーニングエンジニアって言ったほうが通りがいいですねおだし。",
      "start": 1784150,
      "end": 1793492,
      "timestamp": "29:44"
    },
    {
      "speaker": "A",
      "text": "ょーそのマシンラーニングエンジニアっていうのは何なんです。",
      "start": 1793492,
      "end": 1796613,
      "timestamp": "29:53"
    },
    {
      "speaker": "B",
      "text": "かおだしょーこれがまた人によって変わるやつなんですけど第一に言うと機械学習グラデーションがあってデータサイエンティストっていうふうに言うと主に統計機械学習とかも使って分析をしたりレポーティングをしたりあとはどういうアクションをするかみたいなところまでやるあとはモデルを作るだけ機械学習のモデルを予測するモデルを作るみたいなところまでみたいなのがデータサイエンティストの範囲だったりすることが多いんですけどMachineLarnigEeっていうとモデルを作ることもあるしただもうちょっとソフトエンジニアの経路が強くなってくるので実際に機械学習を動かすプラットフォームというか基盤を作ったりみたいなところもあとは必要なサーバーサイドの開発とかもやったりとかっていうふうにやってますねだから機械学習を使ったプロダクトを開発してるって言ってるんですけど実態としてはバックエンドエンジニアに機械学習の要素が加わったっていうふうに考えてもらうのが一番分かりやすいと。",
      "start": 1796613,
      "end": 1864428,
      "timestamp": "29:56"
    },
    {
      "speaker": "A",
      "text": "思いますね分かりやすいこの機会。",
      "start": 1864428,
      "end": 1868175,
      "timestamp": "31:04"
    },
    {
      "speaker": "C",
      "text": "にね俺も秋さんのやっているMLエンジニアっていう領域を少し理解させていただきたい俺みたいなパーで。",
      "start": 1868175,
      "end": 1874219,
      "timestamp": "31:08"
    },
    {
      "speaker": "B",
      "text": "も要するに分かるようにって。",
      "start": 1874219,
      "end": 1875439,
      "timestamp": "31:14"
    },
    {
      "speaker": "C",
      "text": "いうところがちょっとあるんですが俺もちょっと聞きたいんですかったんですよねデータサイエンティストは俺の中では割と経営者とかとやっぱり並走してるイメージがすごくあってですよねそういうデータがローデータというか生のデータがあってお客さんの声なのか何なのかいろいろあってそれを実際データサイエンティストの方々がモデル化しつつなおかつ経営方針としてどういう。",
      "start": 1875439,
      "end": 1895871,
      "timestamp": "31:15"
    },
    {
      "speaker": "B",
      "text": "ふうにこれを活用して。",
      "start": 1895871,
      "end": 1896832,
      "timestamp": "31:35"
    },
    {
      "speaker": "C",
      "text": "いこうかみたいな話を提案するのが俺の中でデータサイエンティストでそれを実際パイプラインにつなげてらっしゃる方がデータエンジニアでマシンラーニングの領域がそれに入ってくるとMLエンジニアと呼ばれるのかみたいな。",
      "start": 1896832,
      "end": 1909819,
      "timestamp": "31:36"
    },
    {
      "speaker": "B",
      "text": "だからそれで言うとデータエンジニアがやるところってデータサイエンティストを中心に考えたときにはデータエンジニアがやるのってデータサイエンティストが使えるデータマートとかデータウェアハウスを準備するところまでが多分データエンジニアの仕事。",
      "start": 1910320,
      "end": 1923574,
      "timestamp": "31:50"
    },
    {
      "speaker": "A",
      "text": "なんですよおだしょーごめんなさいデータマートデータウェアハウスっていうのは要する。",
      "start": 1923574,
      "end": 1928800,
      "timestamp": "32:03"
    },
    {
      "speaker": "B",
      "text": "にあれですねすごくざっくり言うと例えばビッグクエリにデータがいろいろありますとそこのビッグクエリにある程度の形のデータを用意データを取り込んで整形してみたいなパイプラインを作ってくるのがデータエンジニアの仕事っていう感じですか。",
      "start": 1928800,
      "end": 1948697,
      "timestamp": "32:08"
    },
    {
      "speaker": "A",
      "text": "ね逆に分かんなくなっちゃうそれで言うとアサナは多分この間データサイエンティストの仕事ありますよみたいなのでアキさんに教えたと思うんでだんだんやってることは分かると思うんですけどアサナはデータサイエンティストが結構いてこの頃少なくなっちゃったりもしてるんだけど結構いて彼らがやってることはまず一部ですけどね僕が関わりあるエンジニアからの視点でっていうのでいうとログをどういうふうに入れてどういうふうにデータを取るかをまず設計するそのアプリ機能がこういうのがあってそのときにこういうふうにログを取りましょうっていうのを設計してそれをエンジニアにそのログを入れてもらう自分で入れる会社とかもあるのかもしんないですけどAsanaの場合はうちではエンジニアがそこを書いてその出てきたデータをもとにそういうクエリとかを作ってABテストしたときにこのページのこの昨日このボタンとこのボタンだったらこのボタンの方が良かったよみたいなのを出してそのPMの仕事を助けるではないけどそのディセージョンメイキングを助けるみたいなのがデータサイエンティストなのかなってそう思ってるんです。",
      "start": 1948697,
      "end": 2028683,
      "timestamp": "32:28"
    },
    {
      "speaker": "B",
      "text": "けど今だから三つのロールが出ててデータサイエンティストの話も今東橋さん出してくれましたとそれで瀬田さんが言ったのはデータエンジニアデータエンジニアの話も出てきてさらにマシンラーニングエンジニアっていう話もあって今三つのロールが出てて今データサイエンティストは大体その辺なんですね今東橋さん説明してくれた中でキーとなるのがログの設計をするっていったときにこういう多分アプリケーションログでこういうログがあるとこういうことができますよこういうエビデスとかでこういうふうに使えますよっていうのを整理してるっていうふうに理解をしたんですけど逆にもそのログを取る行動をデータサイエンティストが実装は多分してないですよねログコール大平。",
      "start": 2028683,
      "end": 2080221,
      "timestamp": "33:48"
    },
    {
      "speaker": "A",
      "text": "そうですね内部でやって。",
      "start": 2080221,
      "end": 2081581,
      "timestamp": "34:40"
    },
    {
      "speaker": "B",
      "text": "ますねですよねそこがだからそのログを取るコードを実装するのがソフトウェアエンジニアがやったりとかあとはそのログを何て言ったらいいのかな整形したりするみたいなデータのパイプラインがあると思うんですけどそれを主に見てるのがデータエンジニアっていう感じかなだからそれこそRDBとかまでデータが流れてくパイプラインがあったりするじゃないですかそのホームラインを主に作ったりメンテナンスするみたいなデータエンジニアですねプロジェクトエンジニアも多分そういうことをやれたりやるとは思うんですけどただそれを全部面倒を見るかっていうと多分ここに入れとけばあとはこっちに流れてくよみたいなそういういわゆる土管を作るみたいなのを作るのがデータエンジニアだったりしますねだからそれこそ入力としていろいろあるルールと思うんですけどリアルタイム系のデータでストリーミングのデータが入ってきたりするとかっていうときはそれをこういうふうにデータを処理していくみたいな基盤を管理したりとかみたいなのがデータエンジニアって感じでだからデータサイエンティストはさっき戸橋さん言ってくれたようにこういうふうにABテストしてこういうふうにアクションしたほうがいいですよみたいなことを言うっていうパターンが多分結構多くてそのもう一つの別のパターンまで行くとさらにそこから機械学習のモデルを使って予測をするっていうものをやるとこういうこともできますよみたいなことまで言うのが多分データサイエンティストかなって感じがするんですけどねおだしょーうんうんうんうんうんうん。",
      "start": 2081581,
      "end": 2181376,
      "timestamp": "34:41"
    },
    {
      "speaker": "A",
      "text": "うんうんうんうんうんうんうん。",
      "start": 2181376,
      "end": 2181716,
      "timestamp": "36:21"
    },
    {
      "speaker": "C",
      "text": "うんうんうんうんうんうんうん。",
      "start": 2181716,
      "end": 2182036,
      "timestamp": "36:21"
    },
    {
      "speaker": "B",
      "text": "うんうんうんうんうんうんうん。",
      "start": 2182036,
      "end": 2182516,
      "timestamp": "36:22"
    },
    {
      "speaker": "A",
      "text": "うんうんうんうんうんうんうんうんうんうんうんうんうんうん。",
      "start": 2182516,
      "end": 2183757,
      "timestamp": "36:22"
    },
    {
      "speaker": "C",
      "text": "うんうんうんうんうんうんうんうんうんうんうんうんうんうん。",
      "start": 2183757,
      "end": 2184737,
      "timestamp": "36:23"
    },
    {
      "speaker": "B",
      "text": "うんうんうんうんうんうマシンラーニングエンジニアになると、それをプロダクションでゴリゴリと機械学習、予測とかをずっと定常的にし続ける。つまりは予測のエンドポイントとかを作ってそれこそAmazonとかでレコメンドの結果出たりするじゃないですかレコメンドのロジックを書いてかつそれを都度都度予測をするみたいな仕組みを作ってみたいなところまでやるのがマシンラーニングエンジニアかなっていう気。",
      "start": 2184737,
      "end": 2220205,
      "timestamp": "36:24"
    },
    {
      "speaker": "A",
      "text": "がしますおだしょーめっちゃ。",
      "start": 2220205,
      "end": 2222307,
      "timestamp": "37:00"
    },
    {
      "speaker": "C",
      "text": "分かりやすい分かりましたなんと。",
      "start": 2222307,
      "end": 2224669,
      "timestamp": "37:02"
    },
    {
      "speaker": "B",
      "text": "なく繋がってきたシステムとして普通のソフトエンジニアでもやれる人もいると思うんですけどやっぱりちょっと機械学習、LMの時代もそうなんですけどシステムの特性と。",
      "start": 2224669,
      "end": 2239360,
      "timestamp": "37:04"
    },
    {
      "speaker": "A",
      "text": "し。",
      "start": 2239360,
      "end": 2239420,
      "timestamp": "37:19"
    },
    {
      "speaker": "B",
      "text": "て決定的に振る舞わないで確率的に振る舞うデータによって入力がだからプロンプトとかもそうだと思うんですけど入力を何に与えるかによって出力が全然変わるじゃないですかその振る舞いを分かった上でどういうシステムを設計するかみたいなのを考えるのがMachineLarnigEe。",
      "start": 2239420,
      "end": 2265000,
      "timestamp": "37:19"
    },
    {
      "speaker": "A",
      "text": "の一つ面白いところマッシュランニングエンジニアとAIエンジニアみたいに呼ばれてるのは一緒です。",
      "start": 2265000,
      "end": 2272732,
      "timestamp": "37:45"
    },
    {
      "speaker": "B",
      "text": "か?AIエンジニアは僕はね、AIエンジニアは僕はさらによくわからないんですよって人によって言ってるけど。",
      "start": 2272732,
      "end": 2280241,
      "timestamp": "37:52"
    },
    {
      "speaker": "C",
      "text": "最近出てきた言葉なんちゃうの?って思ってるけどな俺。",
      "start": 2280241,
      "end": 2282684,
      "timestamp": "38:00"
    },
    {
      "speaker": "A",
      "text": "はいやなんか僕今聞いた感じだとAIチームとかいろんな会社に今多分あると思うんですけどAIのフィーチャーを作っていくチームは聞いた感じだとプロンプトを書きつつフィーチャーにしていくみたいなのをやってるのかなみたいな僕の前のチームでもそういうところをちょっとやってる人がいてでもその人は別にそういうエンジニアじゃなかったんだけどただただもう技術レベルがすごい高くて任されてやってみるみたいな感じで結構大変だったけどできたよみたいな感じで言ってた。",
      "start": 2282684,
      "end": 2318602,
      "timestamp": "38:02"
    },
    {
      "speaker": "B",
      "text": "からそれでいうとだからそう僕が多分説明の仕方がちょっとあれで誤解を招いたのがプロンプトの話は多分LMの例にしたほうが分かりやすいかなと思ったので出しましたけどMLエンジニアって言われるときには割とクラシックなメールの場合は別にプロンプトンはやらなくて予測するモデルを作るんですねだからさっき言った典型的なやつで言うとメール食わせてスパムかそうじゃないか判定するとかレコメンドもそういうことユーザーのコードログを与えてこの人にはどういう商品がいいかみたいなのをレコメンドするとかっていうそういうものが基本的にクラシックな機械学習で解かれる問題でそれをやってるのがMLエンジニアって感じかなAIエンジニアってなるとプロンプティングとかはもうそうだしいろいろ幅が広いと思うんですよね実際にそのLM自体を作る人もAIエンジニアって多分言うだろうしわかんないですね僕はいや間違いないおだしょー定義まだここからされる。",
      "start": 2318602,
      "end": 2389039,
      "timestamp": "38:38"
    },
    {
      "speaker": "C",
      "text": "んだろうなと思ってます。",
      "start": 2389039,
      "end": 2389839,
      "timestamp": "39:49"
    },
    {
      "speaker": "B",
      "text": "けどねなんとなく確かに。",
      "start": 2389839,
      "end": 2391200,
      "timestamp": "39:49"
    },
    {
      "speaker": "A",
      "text": "新しいカラーっていうのもある。",
      "start": 2391200,
      "end": 2392321,
      "timestamp": "39:51"
    },
    {
      "speaker": "B",
      "text": "かもしれないですねヤンヤンそうJDとか見てると結局AIエンジニアって言いながらフルスタックでフロントエンドをゴリゴリ書いてオープンAIとかのAPI叩いてみたいなこともそうなんですよねうんそことはちょっと違うかなって感じですねその普通に。",
      "start": 2392321,
      "end": 2407767,
      "timestamp": "39:52"
    },
    {
      "speaker": "A",
      "text": "ソフトエンジニアがあのただあのチーム変わってるだけでいけるような人もAIエンジニアって呼ばれてるのかなっていうのはこの頃はなんか思います。",
      "start": 2407767,
      "end": 2416974,
      "timestamp": "40:07"
    },
    {
      "speaker": "B",
      "text": "よねまあそれはだからAIエンジニアって何ぞやってのが分からないって僕が言ったところで確かに確かにまとまっちなんですよね本当に今はだからそう名前が出てきてわっとそういうので人を集め始めたかなっていうところだと思うん。",
      "start": 2416974,
      "end": 2432840,
      "timestamp": "40:16"
    },
    {
      "speaker": "A",
      "text": "ですけどそしたらちょっと最後にもう1個だけ質問したいんですけどキャリアっていうのを見たときにちょっとAIエンジニアを1回飛ばしてそのデータサイエンティストとそのLMエンジニアっていうのはラダージョーみたいな感じであるんですかそれとも全然違うなんていうんだろう分野なんですか例えば学校で勉強するものからもう違うんですかそれとも同じものを勉強してフロントエンドエンジニアバックエンドエンジニアみたいな感じで分かれるものなのかそれとも一つのラダー上に二つのこっちが上でこっちが下みたいなものがあるのかそこら辺があんまり理解。",
      "start": 2432840,
      "end": 2470291,
      "timestamp": "40:32"
    },
    {
      "speaker": "B",
      "text": "できなかったんですけどLMじゃなくてMLですよねMLですよね機械学習エンジニアですよね機械学習エンジニアとデータサイエンティスト別にダダーとして上とか下とかってわけではなくて目指してる方向性のちょっと違いみたいな感じですね結局だからフロントエンドとバックエンドとみたいなどっちを中心にやるみたいなぐらいの感じですねただそれが領域として近しいところがあるっていうそう。",
      "start": 2470291,
      "end": 2500512,
      "timestamp": "41:10"
    },
    {
      "speaker": "A",
      "text": "すると学校のバチラーとかのメジャー的には一緒には。",
      "start": 2500512,
      "end": 2505414,
      "timestamp": "41:40"
    },
    {
      "speaker": "B",
      "text": "なるコンピュータサイエンスで来るんじゃないかな結局コンピュータサイエンスで機械学習を専攻してましたって言ってでどっちやるっていう話に多分なると思うんで今の。",
      "start": 2505414,
      "end": 2520838,
      "timestamp": "41:45"
    },
    {
      "speaker": "A",
      "text": "CSってそこまでやるんですか逆に僕ちょっとあまり自分。",
      "start": 2520838,
      "end": 2524140,
      "timestamp": "42:00"
    },
    {
      "speaker": "B",
      "text": "が理解してないんですけどMLの話はでも普通にCSのコースの中でやるみたいですよ今やってるよそれでんだったらじゃあ。",
      "start": 2524140,
      "end": 2533514,
      "timestamp": "42:04"
    },
    {
      "speaker": "A",
      "text": "もう本当にそっちが好きだったらそっち行くしプロダクトデベロッパーみたいになりたかったプロダクトエンジニアになりたかったらプロダクトのほう行くしみたいなそういうキャリアな。",
      "start": 2533514,
      "end": 2542941,
      "timestamp": "42:13"
    },
    {
      "speaker": "B",
      "text": "のかそうですねだからMLエンジニアのほうに来る人っていうのは大体ソフトウェアエンジニアの色が強いほうが好きだっていう人のほうが多いんじゃないかなときは言えるかでもデータサイエンティストは純粋にそのモデルだったり、アルゴリズムだったりっていう話にフォーカスしたりとか、あとは経営にインパクトを与えるとか、そっちの方が好きな人の方が多いんじゃないかなって気がします。",
      "start": 2542941,
      "end": 2570702,
      "timestamp": "42:22"
    },
    {
      "speaker": "C",
      "text": "ね。そうですよねなんか俺もこのボットキャストを聞いている人たちがどこを目指すみたいな時にどういうふうに何か考えるんだろうなーって思って今話聞いてたんですけどそれぞれそれぞれ面白みありそうですよねなんか世の中にたくさんあるデータが散らばっていてログだったりなんだったりっていう部分をパイプラインとしてつなげるっていうところがデータエンジニアでこれはこれでまあまあ面白そうだなーって思うしそれら集まってきたデータっていうのをどう経営方針だったりに活かすだったりインパクトに活かすだったりっていうことを考えるのが多分データサイエンティストだったりそれを実際予測だったりとかリコメンデーションだったりとかお客さんに届けるっていうところにマシンラーニングが絡んでくるとそれがおそらくMLエンジニアって呼ばれるんだろうなーっていうふうに思ったりって考えるとまあ本当になんか3者3様同じ位置というかねあのなんかどっちが上下っていう感じじゃないんだろうなーって思いはしましたねやっぱり聞いて。",
      "start": 2570702,
      "end": 2622627,
      "timestamp": "42:50"
    },
    {
      "speaker": "A",
      "text": "てなんかそう今このアキさんの話を聞いてわかってきたけどどこまでわかってんのかなみたいな多分僕がそれ今聞く前のレベルが大体みんなが思ってる。",
      "start": 2622627,
      "end": 2634636,
      "timestamp": "43:42"
    },
    {
      "speaker": "B",
      "text": "ものなんじゃないかな。",
      "start": 2634636,
      "end": 2635576,
      "timestamp": "43:54"
    },
    {
      "speaker": "A",
      "text": "って勝手に思ってるんです。",
      "start": 2635576,
      "end": 2637157,
      "timestamp": "43:55"
    },
    {
      "speaker": "B",
      "text": "けど知らない思いはするね。",
      "start": 2637157,
      "end": 2641298,
      "timestamp": "43:57"
    },
    {
      "speaker": "C",
      "text": "でもなんかやっぱりそのどこでインパクトを与えたいのかっていうそのなんかねなんか興奮を覚えるというかなんか楽しみを覚えるみたいなこと多分人によるじゃないですかなんかその辺で結局分かれるん。",
      "start": 2641298,
      "end": 2652788,
      "timestamp": "44:01"
    },
    {
      "speaker": "B",
      "text": "だろうなーって思ったねうーん。",
      "start": 2652788,
      "end": 2654910,
      "timestamp": "44:12"
    },
    {
      "speaker": "A",
      "text": "でもなんかもう一つ気になったのは結構キャリアとしては難しかったりするじゃないですかそこらへんがちょっとやっぱりその境があんまりないみたいなところもあると思うしあとはまあ純粋に結構そのポジションの数みたいなのは少ないですよねその例えばあと僕の今言ってる会社で言うと一チームにデータサイエンティストが一人みたいなレベルで今ちょっともっと減っちゃってるんで結構その感じで言うと本当なんだろうデザイナーとかエンジニアとソフトエンジニアとデザイナーぐらいのポジションの数の違いはあるのかなみたい。",
      "start": 2654910,
      "end": 2695831,
      "timestamp": "44:14"
    },
    {
      "speaker": "B",
      "text": "なのはありますねまあそうですねそれで言うだからまあそうかな会話性。",
      "start": 2695831,
      "end": 2704315,
      "timestamp": "44:55"
    },
    {
      "speaker": "C",
      "text": "はイメージあるよね正直ソフトウェア。",
      "start": 2704315,
      "end": 2706733,
      "timestamp": "45:04"
    },
    {
      "speaker": "B",
      "text": "エンジニアっていうふうにの一個のバリアントって感じで生きてるのでそういう意味で言うとどこにフォーカスしてるかっていう意味だけで言うと少ないですねだから最近ちょっと減ってきちゃってるかもしれないけど一時で言うとこのモバイルエンジニアとかって言うとソフトウェアエンジニア全体量少ないよねっていうと同じような感じだと思うんです。",
      "start": 2706733,
      "end": 2732019,
      "timestamp": "45:06"
    },
    {
      "speaker": "A",
      "text": "よおだしょーごめんなさいソフトウェアエンジニアって言ったかプロダクトエンジニアって言いたかったですちなみにああ。",
      "start": 2732019,
      "end": 2737080,
      "timestamp": "45:32"
    },
    {
      "speaker": "B",
      "text": "ああああまあまあそんな子が変わん。",
      "start": 2737080,
      "end": 2739763,
      "timestamp": "45:37"
    },
    {
      "speaker": "A",
      "text": "ねーちゃ変わんないかプロだその中フィーチャーを出し続けるのをプロダクト僕の中ではフィーチャーを出し続けてあプロントエンドからそのバックエンドの途中ぐらいまでやるのがあのプロダクトエンジニアって僕の中では。",
      "start": 2739763,
      "end": 2752876,
      "timestamp": "45:39"
    },
    {
      "speaker": "B",
      "text": "思っててそんなそう僕バック。",
      "start": 2752876,
      "end": 2756316,
      "timestamp": "45:52"
    },
    {
      "speaker": "A",
      "text": "エンド側なんではいあのそうですねそのmそのそこらへんなんか機械合宿中の人たちもいてあとはそのなんかえっとなんていうんだろうaフレームワークみたいなのを作るそのバックエンドだけを本当にやる人もいてみたいなそのなんかやっぱ規模で言うとプロダクトエンジニアって言われるそこがマシンランニングそういう機能をすでに作ってそういうチームが作ったものを使ってそのフィーチャーを作るみたいなところはポジション的にはやっぱ多いのかなってごちゃごちゃしちゃっ。",
      "start": 2756316,
      "end": 2791957,
      "timestamp": "45:56"
    },
    {
      "speaker": "B",
      "text": "たけどそれは多分あれでしょうねってか面白いじゃあ東岡さんが言うその何だろうフロントエンド寄りのところプロダクトエンジニアっていうふうに言ってるのが僕は個人的に面白くてっていうのは今回だと思ってて多分それって会社における役割分担の仕方に依存してるんだと思うんですよねそうですかねうちだとプラットフォーム寄りの人とあとはアプリケーション寄りの人って言い方するんですけどプロダクトにお客さんカスタマーフェイシングな機能を作るっていうので言うとうちはだからそうかフロントエンドの人たちはフロントエンドの人たちでいるけどバックエンドでそのフィーチャーを開発していくっていう人たちもいてさらに。",
      "start": 2791957,
      "end": 2833104,
      "timestamp": "46:31"
    },
    {
      "speaker": "A",
      "text": "バックエンドのヤンヤン別々な。",
      "start": 2833104,
      "end": 2834004,
      "timestamp": "47:13"
    },
    {
      "speaker": "B",
      "text": "んですねそこがおだしょープラットフォーム系をやってるチームもいてっていうそういう感じなんで多分そこは製品プロダクトの何だろうどこがコアでっていうので多分切れ目が変わってくるんだろうなっていうふうには見て。",
      "start": 2834004,
      "end": 2847092,
      "timestamp": "47:14"
    },
    {
      "speaker": "A",
      "text": "てヤンヤン確かにそうかもしれないですね僕の中ではバックエンドもフロントエンドもプロダクトエンジニアではあるけど会社によってはそこが分かれているところもあるしフロントからバックまでやる特配者もあるしっていう認識でしたね似たワードがあってなんかちょっとごちゃごちゃし。",
      "start": 2847092,
      "end": 2874868,
      "timestamp": "47:27"
    },
    {
      "speaker": "C",
      "text": "てきたけど頑張っていろいろとキャッチアップしなくちゃいけ。",
      "start": 2874868,
      "end": 2879549,
      "timestamp": "47:54"
    },
    {
      "speaker": "B",
      "text": "ないですもんねこの業界いや。",
      "start": 2879549,
      "end": 2881270,
      "timestamp": "47:59"
    },
    {
      "speaker": "A",
      "text": "そうなんですねということで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcastyoubeなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しい。",
      "start": 2881270,
      "end": 2895955,
      "timestamp": "48:01"
    }
  ],
  "highlight1": "アキさんは外資のクラウデラでセールスエンジニアをやっていて、英語ができるようにDMA会話を1年間毎日レッスンを受けたらしい。",
  "highlight2": "あなたも外国で働きたいなら、英語の勉強を始めてみてはどうだろうか。",
  "highlight3": "データサイエンティストとマシンラーニングエンジニアは似ているけれど、データサイエンティストはデータからインサイトを得て、意思決定を支援する役割ですが、マシンラーニングエンジニアは機械学習モデルを開発してプロダクションで利用するシステムを作る役割だそうです。"
}