{
  "episodeGuid": "f0fb621c-7e30-4209-b34c-b117dd6d8f7a",
  "episodeTitle": "「お金の話は嫌い」だった僕が、海外で市場価値と向き合い見つけた新境地（後半）#2",
  "transcribedAt": "2025-10-19T00:43:29.710Z",
  "duration": 3052,
  "fullText": "そしたら前回は、前半では就職するまでの流れ、3社目、特に3社目にフォーカスあって聞いてきたんですけどそしたらお金かなお金は大事、今回言ってくれるってことだったんでそしたらじゃあオファーとサインアップとか?サインアップとかあればサイン。アップとかなくてオファーはカナダドルで160,000円今は1ドル104円ぐらいですけど1ドル100円で換算すると日本円で1,600万ぐらいの現金上場してないのでストックオプションみたいな感じではあるんですけどシリーズはどのぐらいでしたっけ?シリーズBですB?あそこBなのか結構デカい。なくはないけどちょっと遠いぐらい。ですかね一応それがプラスで10系ちょっとぐらいある結構変動するからわかんないんですけどだから一番よく言うんだったら1700、800万円と言いたかったら。言えるぐらいすごいすごい日本だとなかなかねたどり着けないいやそうな。んですよねしかもこれでポジションがシニアソフトデベロッパーで別にテクニックリーダーとかマネージャーとか役職がついてないんで日本で役職なしでここの年賞いくらも返しだったらあるのかもしれないですけど日本の企業だったらまず無理だなそうよね難しいよねちなみになんてどの。ぐらい上がったとかあるんですか?日本の最後の会社という。か日本の最後がフリーランスとかしたりごちゃごちゃなんで。ちょっとフリーランス一回抜きますか。だいたい700万ぐらいだったのかちょっとうろ覚えですけど7800万円ぐらいなのが日本の。最後じゃ軽く2倍は軽く。場合ねーなんかそれでこっち来て一社目が750万円ぐらい2社目が950万円ぐらいまあ治癒してるからなんか上がったのか上がらないんですけどねで今いる会社が1600万円とかなんで結構もう文字通り2倍というか。2倍以上それこそもう普通の人が1年で2、3年4、5年通していくところを3ヶ月4ヶ月くらいにパパパっていった感じジョブホッピングしつつそこまでたどり着いたとまあ。そういうと2社目に行ったのは自分で行こうと思って行ったからなんですよ3社目はそれこそその昔の給料が払われてないという事件があったので練習の下っていうのがあるのでそこはまあなんか半分まあ乗り越えられたから運が良かったというか結果オーライというか感じかなってまあしかも思ったのは別にそれってシニアソフトデベロッパーでその年収ってまあ普通に平均こっちの平均から逸脱してるわけじゃないそうですね現金だけ見たらちょっと高いかもぐらい別に全然それで上払ってる会社結構多いし日本でもなお知れてる会社とかだったらもう別にシニアソフトデベロッパーで2千万円コストかオファーもちょくちょく調べたらあるっぽいので市場が変わるとこんなにやってること同じでも気度違うのかと思って資本主義を感じ。ましたいやーでも書いて。ましたよね書きましたねそうですねちょうどそのブログが書いててなんか僕的にはなんかなんだろうな年収1000万とか1500万って結構遠い世界の話かなって思ってたら意外とそうではないってことが感じたしが今回その1600万円オファーにビビらずメスとか望めたのも結構普段それこそ外出さんとかと接していると2結構こっちの市場感での昭久色の話とかを知ってたからビビらずいけたっていうのもあるかなだから割とそういうお金の話っていうのは日本人的にあんまりする文化なさそうな気はするんですけれどもするのに抵抗がない人はどんどん行ってった方がなんとなくそれが普通なんだっていう感覚が日本人の中でもできてきてその後来るとまた来てくる人も多くなるかなみたい。なそれは本当にそうで、この間僕もちょうど優吾くんとこの話してたんですけど、僕も来たときに、翔太くんっていう人がいたり、ここら辺で有名な圭佑くんとかがいたり、そこら辺みんな同期なんで、仲いいからえっと金額も言い合うんですよねそれに結構引っ張られたところはあって真中瀬名さんも覚えてるかもしれないけど前に言った話でねゲイくんがどんどん急に上がっていくとなんか僕の方ちょっと経験者だったのに抜かれちゃったみたいなのもありケツ蹴られて転職していくとかいや大事だよねそういうのってやっぱあとはそのやっぱその裸さっきも言ってくれたので裸んでなんかあれみんなこんないや、そうなんですね。あれ?じゃあ俺も行けんじゃない?みたいなのってやっぱあって。絶対ある。いや、それ絶対そうですよ。だからフロックの中でもそうだけど、。やっぱりこういうがあんまり周りの。ない人たちで言うところの給料を高いっていうので、大体800万、900万で止まってんすよ。だから本当に最近ね、。給料やっぱり話聞くときも、なんか80系とか90。系ってすごくもらえましたって言うから。周りとの情報交換大事だ。よねって正直思うよね日本の感覚で言うと80系90系って別に高い高いその感覚やっぱそういうのが普通っていう人たちとたくさん話して自分の感覚感じ方を変えるだったりしないとあんまりこう感覚変わっていかないかなと思う難しいね。なんかまあ僕も7年目でまあ観測してるでやっぱり一社目で止まっちゃうもったいないなーって一社目でまあ転職をしない人が結構多い中でまあ運が良かったのが悪かったのもあり、1社目は決断して2社目に行って、2社目はなんか給料止まっちゃったからってのもあるけどその転職繰り返すとやっぱり結構増えていくじゃないですか1社目ってやっぱり少なくなりがちやっぱりなんかまだ外国人で日本の年収700万だったからそれから500万もっと低いかもしれないけどだったから結構上がったっていうので行くんだけどそれまだまだ全然上がる余地があってそこらへんがね、なんだろう結構あと1社目。でやっぱりこうカルチャーショックが大き。すぎて疲れちゃったって人正直多いなって気がするけどね話聞いてると疲れちゃったやっぱり1社目で行ってまあ670系とかそのくらいからスタートしてのジュニアとかですごく居心地がいいからもうまたあのなんか少女活動の駅に戻りたく。ないみたいなのは結構効く。ただ印象としてはそのすごい強いのかもしれないけど2社目とか3社目になってくるとやっぱその喋り方とかもこっちの働き方を経験した上でとかあの経歴の書き方とかもこっちの働き方経験して上でになるんで結構簡単にはなっていくと思う。んですよねこっちで通用するやり方がなんか肌感わかってくるっていうのもあるし実際に医者でも働いてると自信にもなるので医者でも働けたんだら次もいけるだろうそれが初めてだったら面接はうまくいってるけど、実際に入ったらどうなるのかな?英語を使って仕事するのは初めてだけど、いけるんかな?そんな気持ちでオファーをあげる保証できないな。だから低く見積もらえても初めてだし、ありがとうございますという感じで行くけど。2社目以降になってくると自分の感覚的には結構そこが、自分のマインドが変わってよりこう戦いにいけるという立ち。位置をちゃんと確認できるみたいな。こともあるしねそれは。本当あるよピザも神聖サポート。しておかなくちゃいけない。しそしたら実際に今働いてみて今の会社は2週間3週間目ぐらいそう。ですね3週間ぐらい前の。会社とか前の会社あると思うんですけどなんか働いてみてなんか違うな日本の時の日本のエンジニア時代とこれが違うなぁみたいなのとかってあり。ますこれ実は意外かもしれないんですけど英語をすごく使いますね。それ意外だ。何狙ってんの?ちょっとボケてみた。それはもちろん。違うところで言うと、会社によって全然違うなっていうのは正直なところで僕は結構日本にいた時、日本で働いてた会社って結構整ってたし、技術もモダンだったし、職域構造もたくさんあったんですよ。だからカルチャー的に見てこっちの方がめちゃくちゃ働きやすいかって言われるとあんまり変わらないかもっていうのは正直、ただ勤務時間はやっぱり1時間違うなっていうのもあって例えばカナダだと9時5時がだいたい普通というわけじゃないですか日本だと9時から働いたら6時なんですよね1時間の間の休憩をカウントしないので9時間拘束なんです9時間拘束でなんですけどこっちだとそもそもそういうのがないから、単純に8時間高速で違うなっていう風に思ったし、あとは、やっぱ結構その用事がある時は気軽にちょっと時短で帰るみたいな人はカジュアルに多いなっていう印象があって確かに、。よくドクターポイントメント、カーポイントメント、電子スタポイントメントって聞きますよね、確かにとか、。金曜日でちょっと予定があるから、30ぐらいに今日早いけどあと、。今日Amazonからパッケージ届くから会社行かないでワークフロンフォームしますみたいなとかもあるからそういうのは多いかもしれ。ないですねそれはカルチャーがそうっていうのもあると思うんですけど僕的には打刻制度がないのが結構大きいかなと思って。ちなみに日本だと打刻し。てるんですか?するんですよ法律で決まってて勤務時間を記録しなきゃいけないそれなんかスラックで。できるとかないですか?スラックでできますじゃあ変わります?これも僕的な気持ち変わると思って働き始めたら絶対にデコッコマンド打って終わったら終了するっていうのをやるんですよ会社によってはそれはファミリーなチャンネルでやることもあるしプライベートでやることもあるしと思うんですけど僕的にはただの個人の感想になるけどそれがあるかないかによって割と結構しっかり働いてる時と働いてない時の気持ちの区別がなんかしちゃうというかなんだろう人によってはそれで結構なんかこう一回で隠し始めたしちゃんとなんか時間きっちり働かなきゃみたいなことを思う人もいるんじゃないかなぁと勝手に思ったりしてもちろんファン人ではないけど僕は結構個人的には個人の感じ方としては最初と感じるなるほど。それ日本僕あんまり日本のエンジニア業界においてないなかったんだあれなんですけどなんか吉田にやられてるところとかないんですか?なんかその打刻っていうものがもう全然その社員1社員単位で感じないみたいなのと会社とかはないんですか?なんか採用労働制だったり。とかもあるかもしれ。ないそれ結構レアだと思いますあ、そうなんだ普通は打刻すると思いますね打刻コマンドがあってそれ用の何かSARSとかもあったりするのでスラック連携されててそうだよねー基本をやる調べたら法律で記録することは確か決まってる気がするうーんそうなんだ基本的にはだからそのなんだろうその辺りがゆるいのが良いカルチャーっていうか良いことだっていう風に結構聞くんですけどまあ半分カルチャーだし半分法律だなとか思ったりまあ分かんないですけどねいやで。もシンプルにこっちレイオフあるから。さバリーン打極で勘弁し。なくてもさパフォーマンス低いんだったらもう切りゃいいじゃんっていうあれは正直あるかも。しれないと思うけどね日本辞めさせられないからさ確かにそれで言うとそういえば僕はやったことないですけどやっぱ残業している人が少ないなって気はしてそこをやった分ですけど日本だと練習というか収入を上げるためにわざと残業をして残業をやら。せたじゃないですか僕はやったことないほんとですか?それはやっぱこっちないのでやっぱなんか無駄な残業するメリットはやっぱないかなと思ってそれもあるちなみになんですけど、。最初聞いておけばわかったんだけど、3社ともカナダの会社ですか?あ、そうですね。1社目がセキュリティ系のスタートアップで、カナダの、てかバンクーバーに本社はあるけど、フルリモートの会社で、2社目ももうちょっと小さい、かなり小さいスタートアップで、バンクーバーに本社があって、ですか、オフィスがあったので、週2出社だったけど僕はオフィスが好きなんで毎日行ってたって感じで今のスペアという会社もカナダが本社でオフィスがあってそれとトガシさんが行ってる会社と同じビルでいいところなんで僕はオフィスが好きなんでほぼ毎日行ってるという感じですなんか。僕の肌感なんですけど全然他の会社とかわかんないですけど、カナダの会社とアメリカの会社でもちょっと忙しさが違うっていうか、カナダの会社より結構落ちるな感じするなって思いますね。これからアメリカの会社とか受けて会う機会があったら、またちょっと考えるかは分かるかもしれないですね。そしたら、差し支えない範囲で、会社に言えないこととかもあると思うので、差し支えない範囲で、業務だとかどういうチームにいるとかどういうこと日々やってるとか教えてもらってもいいですか?僕はタイトルとして、ジョブタイトルとしてはシニアソフトウェアディベロッパーなんですけど業務としては覚えるアプリがほぼ中心ですねリアクトネイティブ使ったアプリがあってそれを報酬と新機能開発っていうのをしている感じでただ僕が今いるチームがすごい新しいチームが人数少なくて僕とエンジニアリングマネージャーと、あとプロダクトマネージャーの3人しかいない。しかもプロダクトマネージャーは忙しいので、他のチームの兼任。ほぼ2人、2。5人、。2。\n3人くらいのチームで、結構やることがたまってる。アトリの歴史も結構長くて、5年とか6年くらいあるのかな。なので結構塞いも溜まってる箇所があったりするので結構マネージャー的には結構リファクタリングしたいけど僕が入る前は一人しかいなかったんでできないことがめちゃくちゃたくさんあったっていうところに僕が入っていくので入って直近だともう結構リファクタリングをしたりとか手が回っていなかった原因不明のバグをネイティブのロゴを見て修正したりとかなるほどしてます。アプリ的にはどんなアプリな。んでしたっけそうですねスペアはそのそもそもサービス的にはなんかあのモビリティー系のサースって言うのかななんかマイクロトランジットとかパラトランジットとか言うんですけどなんかそのそうだモビリティー系のサースっていう感じでなんかそういろんな国にサービス展開してるんですけど結構例えば大きい大学とかだと敷地が広すぎて大きなバスを大きなバス大きな車何台か借りて半分こうバスみたいな感じで運営してるみたいなところが結構各国であるんですねそういうところ向けにアプリと管理ツールを開発するみたいなところでアプリとしてはそのドライバーが使うアプリがあってもう一つはドルユーザー側がバスのリアクト化をしたりするアプリがあるあとはそれらのツールを連携したりとかマネジメントするためにウェブでいろんなサービスがいくつかあるっていう感じが全体でグループごとのウーバー。みたいなそうですね、。グループごとのウーバーみたいな感じですね実は日本でもいろんな地方自治体と契約していてあったりするんですけど僕がいるチームはドライバー向けのアプリを開発しているなんであの地図を表示して行き先設定されててこれ何人乗るとか次どこ行けばいいかっていうのがまあナビゲーションしてくれるじゃあ本当に。インターフェイスも本当にウーバーのドライバーのアプリに似てる感じなのかな僕はあんまりウーバーのドライバーのアプリを見てないけど上とか。下に情報があって地図が表示されててルートが示されててこっち行ってねーみたいな音声が流れて次曲がってくださいみたいなのを開設するようなところで2人だけのチームでかなり自由にというか2人って全体人数どのくらいですか?社員としては160人ぐらいがあってエンジニアリングチームも何個あんのこれ?5,6?もうちょっとあるかもね普通は各チーム5,6人いるので僕のいるチームがかなり特殊てか僕のチームかなり特殊ですね業態とし。ては完全にB2B。ってことだよねそうですね契約先は超自治体だったりとか大学とか正直スペアに入りましたって。言ってあの会社のことを割と調べて何回調べて。もこの業態どうやって儲ける。んだろうなってすごいわからなく。てでも自治体とか。が絡んでくるとそういうねやっぱり政府だったりとか。がお金出してくれるんだろうなっていう僕もそれ、面接ばっきり調べてわからなかったので、予設屋に聞きましたね。これ、誰がお話ししてるの?だから半分パブリックだもんね。技術的なところに戻ると聞いた感じだとじゃあAPIみたいなのを開発はせずにAPIはもうすでに全部他のチームから与えられて。そうですねすでにあるがたまに開発が必要なこともあるんでその時は自分でやろうと思えばやれる全体的にはフルタイプスクリプトみたいな感じであるのでデータの分析とかやスカラーとかがちょっとあったりしましたけど僕はそのフルスタックとして働いてた経験があるのでバックエンドも全然描けるし上のフロントエンドもやれるしデータベースもわかるっていう感じなんで必要があったら全然バックの開発もしたいという感じがあるんですけれども入って3週間としてはちょっとさっきとより人数が少ないモバイルアプリのチームで歴史も長いのでやるべきこととか改善したいことがたくさんあるのでまあなんか結構モバイルアプリのリアクトネイティブに関係する部分の回数がかなり9割以上になりそうだなぁしばらくはという感じ。ですなるほどねそしたらスプリントとかで時期が区切られてて目標があるっていうよりはもう今は結構溜まってるからそれをどんどん消化していくみたいな感じな。んですかまあなんか短いかも本当だったらその2週間のスプリントとかを切ってやりたいところがその2人しかいないので。そうですよねあんまり一応1。週間で区切ってプランニングとかするけどそんなにバックログも溜まり切ってるわけではなくてそもそもそのチケットにできてないことも多いので結構自分からアクティブに動いてこれやりますよーみたいな感じでやっぱり反スタートがそういいかつ反スタート僕はスタートアップの経験が多いので結構それは心地が良いああそうなんだ慣れてるので働き方が分かったんですだから働いて3週間ぐらいですけどちょうど今日もあのマネージャーと話してプロアクティブプラクティス、自分からタスクを取り入れてやってくれるのはすごいありがたいし、いいことだと思うので、もうやってくれっていうフィードバックもちょっとあったりして、今はそういう感じですね。新しく人を入れるためのポジションとかもオープンしてたりするのでもし人がもうちょっと入ってきたら入れ方は変わるのかなっていうふうに思いますけどそこもマネージャーと話してまあ別に急ぐことはないし2人だけなんで徐々に整えながらやっていこうということで合意をとってちなみに。そのチームは今後なんか今なんか何ポジションかオープンしてるみたい。なあるんですか今一つだけですね、僕と同じポジションが1個。応募してますじゃあ直近では今3人のチームが4人になるICとしては2人、マネージャー、。PMそうですね僕が応募した時点でこのポジションは2人募集してますっていう制度を出しててそこでやるだけ僕が1人決まってもう1個はまだ。決まってないそのpmだったりえっとデザインを喋ることもある。のかなあーでもサインまだあんまりないかもまだまあ。ちょっとあるでそのじゃあミッキーmだったりとかマネージャーとのコミュニケーションだったり今なんかどんな感じで他の人とコミュニケーションとら。れてるんですかどんな感じまあでもミーティングもそんなに多いわけじゃないから出社したらマネージャーとともに座ってやってるので聞きたいことがあったらそれを冒頭でパッと聞いてやるって感じ。でちなみになんですけど今回今の会社じゃなくてもいいんですけどさっきもちょっと英語の話聞いたんですけどまぁこっちが働き始めた後になんか感じた英語難しいなぁみたいなのとかなんか英語で大変だなぁみたいなのってありましたそれとも結構フワッとスルッと入ってなんとかなる。んじゃなぁみたいなネイティブの英語早いなっていうのは日々感じているネイティブじゃない人との会話は割と結構最近はあんまりストレスなくできるようになってきたけどネイティブの人で早口な人がたまにいてそうすると何言ってるかわかんないな基本的に超能力でエスパーするかみたいなのが結構多くなってしまうのはちょっと悩みの一つではあるしあと今の会社っていうか最初の一社目の会社がインド系の方が多くてあの、インド系の名前が強い英語は、ほんとに聞き取れないなっていう。わからんよね。でも、慣れですよね、そこらへんは。ほんと、慣れ。もう、時間をかけるしかない。どんどん、どんどん。増えるしかないなぁそう思って。いるところでそのなんかわかんなかった時とかはどうもうゲッスルそれともなんか僕一つ僕が働いてて思ったのは結構あのテキス結局決まったことをあのなんて言うんだろうカナダはなのかな特にあのふわーっと日なんか日本だと相手も理解してるよねみたいなんでふわーっと進んでふわーっとタスクがあるみたいな状態が多いんだけどこっちは割となんかコミュニケーションちゃんと取れてないっていうのが前提に働いてるなって思ってなんか後から確認してくれるとかそれか僕が理解してなさそうな顔してたから誰かもしれないけど結構そこらへんはなんかパスなんかん助けてくれてうまくいくなっていうのが僕はさえ特に最初の頃は思ったんですけどそこはなんかどうエト。ラーがましくに僕のチームのマネージャーもミーティング終わったら長めでやることが決まったみたいなときは絶対まとめて投稿してくれるのが多いですねあとしパスクレスが話するんだったチケットに起票するのでわかんなかったらそこでメンションして次に聞くとかもするしあと最近はAIに助けられてるんですねオンラインのミーティングだったら字幕ポチってわかんなかったらつけられるんで最悪つけてなるほどなるほどしかも最近なんかGogleMtとかジェミニーのまとめとかつけてくれるんで困ったらそこに頼るみたいな感じだけど基本あんまり頼ることはないかなそれ頼ってると結局自分の営業力いつまで経っても伸びなくていつまで経ってもその問題が起きるのかなと思うなるべく頼れないようにするけどちょっとギョンに支障が出るんだったら頼る感じでやってますねなるほどねインパーソン、。対面の場合?はいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいなんて聞かれてる?みたいなときってないですか?エスパーもすることもあるし、分からなかったら、大体の文脈から予測して、こういうことを聞きたい?って聞き直して、なんと言えたりする。単純にだから、パルン、ソーリーとかだけじゃなくて、。ユミン、。ホネララ、ホネララっていうことをすると、もうちょっとなんか違う言い方をしてくれたりとか。確かにやられるし。それは大きいかも。それは、面接のときにも最初はよく使ってたかもしれない。単純に聞き返すんじゃなくて、なんとなくいろんなよくある質問から接続するにこういうことかなって思ったらユミホネララホネララって聞いてもうちょっと分かってない。ところをなるほど小さくして相手に理解してもらって大切。ですよね大切だし自分としてもそういうのが理解しやすい単純にパワーがあるんだと同じことを同じスピードで言われるだけ。でいやネイティブの人はであのインターナショナルな人英語の話す人と喋ったことない人はそれがめちゃくちゃあるんで。いや絶対だよねもう大変。ちなみにさっきからねやっぱりネイティブの人ねやっぱり早口つらいよ。ねとかって話あると。思うけどどのくらいの人が。ネイティブなんですかスペアってえーいやーでも結構多国籍で多様性が多様性を大事にしますって会社なのでまあそうだよねどうなんすかねもう腹感2,3割くらいな気がするシャワーにいたらいい方だと思うけどネイティブは?ネイティブでもバンクーバーの人は割とゆっくりとか留学生に優しい人が多くてモントリオールとかトロントのロンドンっていうところに本社がある会社で働いてたんですけどそこの時は本当にみんな早いしうん?って言うと同じものを同じスピードで繰り返して次なんて言えばどうやって繰り返していいか分からないみたいなことがあったのであるよね地域によっての差が。激しくて出たくないミーティングがあるもんだってこの人と。ミーティングしたくないとかありますよね本当に大変です仕事内容は聞いてきたんでこれからなんか今は忙しいいっぱい溜まってるものがあるそれを紹介していくみたいなあるんですけどこれからなんか今の会社で関わっていきたい仕事とかこれやっていきたいなみたい。なってあったりしますか?まあでも開始仕事前で言うとやっぱ僕も結構技術大が好きっていうバックグラウンドがあるので今すぐ目につく改善ポイントはどんどん改善していきたいなというのもあってただそのキャリアの深みを考えるともうちょっとちゃんとリアクトネイティブでやるんだったリアクトネイティブはメイティブに近いところとか本部深掘ったほうがいいなと思うしそっちがやりたくないんだったらもうちょっとバックグラウンドじゃなくてバックエンドのタスクとも触れるような振る舞いしていかなきゃなとは思いつつもどっちかに触れるだろうなとは思いつつもまあひとまずは会社入ったばっかりだしパフォーマンスを出すためにも一番慣れているリアクトネイティブの自分が得意なところからどんどん改善していってまずは実力を示すか示してからちょっと考えようかなという感じですねこれも聞いていいん。やったらやけど、。割とね、。優吾さんといえばやっぱりブログだったり、。ポッドキャストだったり、。YouTbeだったりってアウトプットの達人みたいなイメージがありますけど、そっち方面なんかないんですか?そんな達人とは思ってないです。そうなの?めっちゃやっとるやん、。だって。だから、それで言うと、全然キャリア関係ないけど、YouTbeはYouTberになりたいです。YouTbeは狙いに行く。なりたいというか、YouTbeでマネ台像して本業と同じくらい稼ぎたいな。うわぁ、マジで?今の本業と同じくらいって結構大変なんじゃないですか?3000万を狙いに行く。3000万を狙いに行くぜ。もっと行きたい。もっと行きたい。うわぁ、。素晴らしい。それは、まぁ普通に趣味の範囲ですからまあ半年ちょっとぐらいやって全然人数は700人ぐらいしかチャンネル登録者数いないですけどなんかやっぱやればやっていくとなんか改善ポイントがわかってくるというかそれこそそのユーチューバーとしての肌感というか動画クリエイターとしての肌感がなんか育ちずつあるなみたいな感じがあるのでそれはそれと伸ばしておきますがあんまりエンジニアとしての自分と結びつける気はあんまりないから。キャリアとは別の観点からやってみたいこととしてってことですね前からその話聞いてたんだけどなんかそのさっきのやっぱりあのレジュメとかその就職に対する向け合い方とめちゃくちゃ似てるなぁと思ってまぁそこで繋がりはないんだけどなんか成功したその考え方をyoutbeに生かしてるんだなっていうのをすごい思ってちなみにそのエンジニアとしての今後のカナダでとかカナダ北米圏での今後の展望とかやりたいことどういう会社に行きたいなんかいっぱい稼ぎたいとかまぁなんかどういうふうな考えまあで。もなんかやれる自分の実力というかやれることは増やしたいもちろんそのお金もよりもらえたらいいなと思いますけどプラスアルファーというかまあ同時にやっぱり自分の実力も伸ばしたいなと思って自力で考えるとだからまあそのエンジニアとしてのテクニック的な側面がマネージャー的な側面があると思うんですけど僕的には結構昔からマネージャー職はなんとなくやってみたいなって思いがあるので手で伸ばすんだったらそういう方向でさえ伸ばして上のレンジを目指したいかなというふうに思ったりもしているかそれは一つの方向性でもしくは今リアクトネイティブを使って結構いい職業を手に入れたりしたしなんかやっぱいろいろ市場を見てみるとリアクトネイティブをがっつり触っている人ってそんなに多くはないけどその割には結構求人たくさんあって結構リアクトネイティブはいろいろあると思ったりもしたのでリアクトナイテムに舵を切って絞るのも一つの方向かなとは思いますしもうちょっと自分で見るとやっぱりバックエンドとかをまた触った方がというか人間として力を身につくかもなっていう気はするのでもうちょっとやっぱりフルスタッフにもう一回舵を振ってその上でもうちょっと会社の中で上を目指すのもいいし転職するのもいいかなっていう感じであるんですけれどもまあ大体まあそういう大きく分けて3つの方向性があるかなとは思いつつまあどれか進めばいいかなぁぐらいの北米の。良さで言うとそこホップできますよねなんかその結構うちの僕の働いてる会社でも多いのがマネージャーテックリードをやってテックリード嫌だったって言ってICに戻ってでマネージャーやってみてなんかやっぱりICの方がいいんじゃねって戻ってきてでその間ICとしてのレベルとかは上がりつつ給料も増やしつつマネージャーっていうポジションに行って戻ったりでまた戻ったりとかまあ別に会社内だけじゃなくて会社外でもそれをやってる人がいてなんかそれで言うとまあバックエンドのチームに移動してそこでマネージャーすることもできるしまあこのままリアクトネイティブのマスターしつつマネージャーっていうのを空いた時にポッて入るみたいなのもできると思うんでそれはなんかすごいなんかさっき多分カジを切るって言葉を使ってたと思うんですけど多分カジを切らないでもいいのかもしれないみたいなちょっと思ってましたね。去年のフロックのカンファレンス出て。くれた渡るさんって人が。さちょうどシビックテック行ってIC。やってユニティ行ってテクニーのマネージメントやってでやっぱりICだねって戻ってきたからザそんな感じのギャリアがいっぱい。いるからですねそんなになんかもうちょっと気軽に考えて。ただけみたいな感じじゃなくて戻ってこれるみたいなね。しかもその経験があるからEMからICに戻ったとしてもチームのEMのサポートできるとかもあるし。そうですね、いろんなポジション経験するのはすごい良いですよね。この頃、自分の話になっちゃうんですけど、ちゃんとしたオンコールを経験してるんですね。トレーニングが今回で終わったんですけど、2回やってプルリクエストの出し方とかめちゃくちゃ変わったんですよ。もうなんかオンコールやってると壊したところのプルリクエストを見に行ってそれがフィーチャーフラグの後ろにあるとかっていう情報が全部載っててくれるとすぐに対応できるんですけど立場を変わってみることでで僕としてはそのまあ普通のチームで働く時の業務にすごい役だったなぁと思ってだからなんか立場を変えることでその同じものでも見方が変わるなすごい思うんで例えば他にももう一つあるとしたらインタビューってすごい嫌じゃないですかでインタビューでまぁ僕たちの業界だってよくあるのがまあリートコード系のインタビューもあるしえっともう一つディヘイビュラル系のインタビューもあるしもう一つあのシステムデザイン系のインタビューもあるんですけどインタビュアー側をトレーニングしてやってみると結構こういうの聞きたいんだろうなとかっていうのをインタビューされる側の時にも分かってきたりするんですよそうだからちょっと立場を変えてやることでなんか違うことをマスターしやすいだったりとかその今度その立場になる人と一緒に働くときにその人がすごい働きやすくなったりだとかするんでいろんな立場を経験してみるのがすごい多分いいことですよねじゃあ次はEM行ってまた。IC行った方は合わないですけどとりあえず僕は現状維持はアクルという思想の持ち主なんで素晴らしいです現状にはちょっと留まりたくないです。素晴らしいです固まりみたいないやで。も半分そうあるべきだと思うけどね多分多分半分は恐怖心から来てると思いますそうそうそうね多分みんなそうだと思うわだからその恐怖心をうまいことを自分のモチベーションに変えてプラスアルファのようなことにチャレンジしていきたいなという感じですねそういうことですね。これをなんか、海外に出た人みんなとか、これから出る人も多分考えることなんですけど、その後、日本に帰るとか、違う国に行こうだとか、この今北米の次みたいなのってありますか?長い目で見て。僕は今付き合ってる彼女と結婚したいと思っていて僕的には子供も欲しいなと思っているのでだから子育てとかを考えるとこれからまた違う新しい国に行くってしかあんまないかなとカナダで子育てするか日本で子育てするかのどっちかかなっていらっしゃるんでただ僕的にはやっぱさあ話にもあった通りやっぱ給料のことを考えると一度そういうだから100万とか目指すんだったら2000万とか3000万は普通だぜっていう世界で働いてみるとそこからあえてなんか日本に戻って年収結構下げるっていう選択肢が結構取りにくくなってくるんだろうなーっていうふうに思ってるんできっとカナダに留まる気は。していて、。とはいえそれはパートナーがどこでどう住みたいかとか、もし子供ができたらまた教育のことについていろいろ考えると思うので、それはそれ次第かなとは思いつつ、今のところの予測としては大体カナダかなと。もしカナダで助け切ったぜ、ダイヤできるぜってなったら、日本全然帰ってもいいって感じはありますね。Xで見た人でさ、その人たちがタイ人との国際結婚をされてる方で、タイ人の奥さんの方が子供に日本語を教えたくねーって言ってた。で、。見た?で、。なぜなら日本語を覚えて。も別に稼げないからって言われちゃったらしくてだから、。偉いその人はやっぱり日本人の旦那さんとしてショックやったらしくてだから、。そこに別にそれは逆転かもしれないけどねそうか、でも確かにそれもあともう1個あったの、そのパートナーが別に日本人じゃないのでそれの状態で日本に住んじゃうと、僕自体は立場的に全然平等じゃないなという気がして。社会的にどうのというよりかは、単純に普通に暮らす中で僕の方が全てをよく知っているという風になっちゃうので、バランスがあんまりこう生活のバランスがあんまり取れないなという気がするそれは、別に彼女もカナダ人ではないからもしカナダで一緒に住めばお互い移民として同じ立場で同じ国に住んでお互いの気持ち理解できるなという風な気がしているのでそれも含めてカナダの方がいいなと今のところは思っている感じですねまあ確かにね、。そこら辺はあんまり壁感じにくい良い国ではあるか。もしれないですよね、ここは日本に住むとね、まあ日本人の特権があるとは言いずつ、確かに確かに。なんかここ、まあ何回か今、稼げるって話が出てきてて、なんかこの頃あの、ツイッターでなんか給料について、その稼げる稼げないについて確か触れてたと思うんですけど、なんかそこらへんって、なんだろう、どんなツイッターの内容でしたっけ?ブログですかね?ブログでしょ?元々はあれでしょ?お金をばっかり喋るエンジニアの。あれとか詐欺っぽくて嫌。だみたいなあれがあったんだけど実際もらってみると考えだいぶ変わったよねっていうそこについてもちょっと聞いてみたいなと思ってまあお金の話。ばっかりする日本人のみんなずっと嫌いですけど前提として日本でわざわざそういう話するのって結構その背景に自分のビジネスを持っているからその誘導用のために給料を使って煽ってるっていうかフックにしてるのは実はあると思うのであんまり好きじゃないっていうのがあったけどそのもう半分の嫌いだった理由としてお金のためだけでイメージ対策するのとかって結構本質的じゃないなと思ってたんでまあそれはいる市場によっても違うのかもしれないですけど確かに日本だとまあ外資に行けば確かに結構上がるかもしれないがとはいえ日本企業で見ると給与に差がつくと言ってもまあ同じレイブ館だったら3,400万ぐらいを吸うのがせいぜい3,400万ぐらいの魚って言うんですよねそれであんまりその数百万のためだけにかなり面接対策とか頑張るのってあんまりこうメリットがないことはないけどインセンティブとして小さいのは出来はしてたんですけどこっちって差がつくときめっちゃ差がつくじゃない。ですかワンチャン倍とかありますからね倍以上ある。じゃないですか僕のそのシニアソフトウェアディベロッパーも多分もうちょっと小さい会社だったらそれこそまあ900万くらい日本円にしてあると思うけど僕が1600万だしそれこそもうちょっと流し入れてるところ日本でも流し入れてる会社に行ったら2000万とか超えるしなんならgoogleとかそのもっと大きい超有名企業に行ったら3000万いくことあるんですよねそれでももう3倍、2倍以上しかも実際にそういうところで話してる人たちに箇所を聞いてみると確かに面接対策は頑張ってはいるが地頭の良さをめちゃくちゃ感じるわけでもないちゃんとみんな頑張ってるし勉強はしてるけどなんかこう手が届かない天才だけが、そういうめちゃくちゃ3倍するようなところ、給料3倍するところで働けるわけじゃないんだなと。見てみると、同じレベル間で3倍の給料が見えるんだったら、それは3倍なら当然対策したくなるなというふうに思って。そういう世界が、日本にいた頃からGogleは3000万名集を超えるとかってのを見てた情報として入ってくると、ゆうて雲の上の話でしょ、みたいなチームの限られた天才とか超優秀層だけがそこに行くんでしょっていう風に思ってたけどその部分にこっち見てすごい見え方が変わって結構クリア。になったというかクリア。になったし、より身近に感じるようになったまあそうだよね日本で優秀な人だったらこっちに来て英語ができてちゃんと対策すれば結構誰でも誰でもって言ったら言い過ぎだと思うんですけど日本で普通に優秀だよって言われるような人たちだったらこっちでもう全然通用するし言語の壁とかも無視するとだいたい同じレベル感なんだなっていうことが分かったのでそれで結構お金の話というか年収2000万とか3000万とかいうものに対しての見方が変わったっていうのはまあ言えその日本でそういうのを追ってビジネスに要するのは引き続き好きではないです。まあそれはね多分みんなそう。ながらそこは結構区別がついてなかった全部異色だ全部が半分情報商材に見えるまあそういうことだよね他の話に戻ってきてくれたか俺もちょっとし聞いてきたいんだけどあの今のスペアススペアに行く時にあのうちのフロックメンバーから。もビクトリアの会社1個受け。られてたじゃないですかそうっすねそれはビクトリアって。いうかビクトリアの人のリパラルル。かあそこもちなみにどのくらいの年収さんだったのかって110Kでした110K。かまぁまぁやっぱりそのくらいだよ。ねそれよりは高かったって感じ。そっちはでもプラスでボーナスとかがあったのかな。でも合計を計算してもスペアの方がよかったっていう感じはあって。まあ、お金もそうだし僕はオフィスに行くのが好きなので。うちの行かなかった会社はフルリモートの会社で、オフィスなかったので。それも大きかったです。そういうことですね。ビクトリー行かないとね、。そういえば。そうですね。マイスラーシに行かなきゃいけない。行ったことないし、ちょうど行ってみたいなんですよ。前の会社でね、お給料ちょっとヤバいよねってのを知ってて、フログもなんかできることないかなって思って。そしたらちょうどイエゴさんがこの会社受けようかなと言っ。ててあれどうやって見つけ。たんだっけフロックのね。確かにちゃんと会社のこと調べる人じゃないと使えない気がしますそもそも僕があの求人見つけて応募しようと思った会社名は違ったんですけどその会社っていろんな小さい会社を買収して大きくなっていたその一つのサービスの部門でフルスタックのエンジニア募集してたんですけどよくよく調べてみるとそのサービスってもともと違う会社でバンクマネーの会社でだったんですねでまあそういうのがあったらだいたい僕はフロックのメンタリストとかを見て何かリファレンスないかなと思って日々探しているんですよそうするとそのサービスネート一致する人がいたのでそれで見つけたよう見つけたよね本当に同じ求人でも確かに見つけられない人の方がいやそりゃそうでしょ多いかもな確かにアンテナの立て方に俺は驚愕したけどねそれ。はオファーまでもらった?もらって、じゃあ結局スペアの方を選んだみたいな。だからリファラルしてくれた。方がいらっしゃって、一緒に挨拶行こうぜってね。いいですね。ビクトリア旅行行こうぜ!そしたら最後に、2つ優吾くんからアドバイスをしてもらいたいなと思って、1つはジェネラルでこれから来る人、にまあこれからエンジニアとしてくる人かなどんなアドバイスをするかっていうのと質問だけ2つ言っちゃうともう一つは結構僕が知ってる中でいう僕みたいに日本でもエンジニアとして結構活躍してていいまあもともと知られている会社にいてこっちに来る人結構少ないと思うんですけどそういう人たちに向けてもまあスペシフィックにというかアドバイスがあればちょっと欲しいなぁどっちからでも思いつく方。からジェラルのアドバイスの方エンジニアとしてこっち来た人のアドバイスはやっぱなんかなんすかね自分の人生でアジャイル回していけみたいなそんな感じですか?めげすぎる?めげすぎる?いやなんかちょっと結構抽象的ですけどもうちょっと詳しく知りたいな。こっちに来ても思うし日本にいてなんかあんまり物事うまくいかないなっていう人エンジニアに限らずだったかもしれないですけど見てみると頑張ってないパターンか頑張ってるけど同じことをリピートしてる人が多いよ。ね頑張り方が間違ってる的。なそうです頑張ってないことはないけどなんか同じことを繰り返していてちゃんと確かに労力はかけて汗もかいてるんだけどあんまりそのなんて言うんですかねやってることの結果を確認していないのであんまり目指す方向に進んでないみたいなだから英語の学習とかちょっとジェネラルすぎるかな英語の学習とかもそうだと思うんですけどまあなんだろう勉強方法ていくらでもあると思うんですけどだからそのリスニングの練習だけを勉強だけをしていてもスピーチってまあその上上手くなるじゃないですかでもリスニングの勉強をしていてスピーキングの力が伸びないなって悩んでる人ってまあ努力してないわけではない努力の方向性が間違っ。てるなんか現在地と目標をちゃんと設定してそれに合わせた努力をしようみたいな感じ。ですかねでかつそういうのはまあいろんな本を読んでどういうかの仕方とかっていうのを学べると思うんですけども結局自分でやってみないとあのなんだろう自分の血肉にならないところあると思うんで日々そういう努力をやっていく中でなんかその努力の方向性自体も確認して毎回毎回同じすることを同じことをするんじゃなくてちゃんとそれで結果が出てるかとかちょっと結果に近づいてるかっていうことを確認して徐々にこう上に行けるようにねサイクルを回していくみたいなスピードを回していくみたいな素晴らしい。何かの本で読んだ。んですけどなんかそういうので努力をして結果が出ない人は同じことをリピートしている本当に必要なのはイテレートだみたいなことを言っているイテレートはまあリピートとは似てるんですけれども毎回毎回の試行錯誤でちょっとずつ方法を変えていって徐々にサイクルを回していって、どんどん目標に近づいていくみたいな。それは単純に同じことをするリピートとは全然似ていないものだよっていうことを、ちょっとどの本か忘れましたけど、言ってる人がいて。PDCAみたいな感じですね。そうですね、PDCAそうです。そしたらが際最後にそのなんだろうないう僕みたいな興奮の人もしくはもうすでにエンジニアとして会社で働いている人向けてなんかそれでまぁちょっと来ることを考えているような人がいたとしたらどんな。アドバイスをしますかまあ考えてる人がいたとするなら技術力は多分問題ない気がするのであとは英語力とコミュ力が大事だなコミュニケーション能力の大切さがすごいこっちで身に染みたというか日本だとエンジニアがずっと足りないっていうこともあって別にあんまりコミュニケーション能力を身につけてなくても技術力があれば相手側が補完してくれて何度かあるみたいなことが多かったなっていう印象だしあんまり自分も人とコミュニケーションするためにどうすればいいかとか考えたことはなかったんですけどやっぱ福井の市場だとまあ人手不足っていうよりかはエンジニーになりたい人とか転職したい人が溢れてるので技術力あるのは当然のことであとはいかにこう相手と一緒に一緒に働いてもらいたいと思う人になるかどうかなんか日本だとたまにこの最近もなんかエンジニアはいいやつあるべきみたいな現実が嫌いっていう人はいたんですけど気持ちはわかるんだけど国米の市場に来るんだったらいい奴になる必要は何らかあるあとはそれになるためにはやっぱり英語力が必要なので英語は何せお土田だなという感じはありますねプラスであの僕みたいなその日本で流す空もまあそうですね日本で流している会社で働いている人がこっちに来ない理由の一つまあ別に日本の中ではかなりいい給料をもらっていいタイプなのでこっちに来るインセンティブがないからなのかなと思うんですけど僕も別に最初は給料が目的っていうよりかは人生で後悔を残さないために海外で働いてみてこっちに来てみたので、そもそもリセーフが違ったんですけどやっぱりこっち来て思うのは、同じことをしててもさっきも言った通り、給料全然違うし、2倍とか3倍になるんだっていうことが分かったので本当にそれが普通なんだよっていうことをなんか自分もこれから自慢したいというよりかは、そういうことを普通のこととして発信していって、自分と似たような教育者がこっちに来て仲良くなれば嬉しいなと思っているので。今はGogleも手に届く雲の上の存在じゃない?いや、。あれですね。ちょっとあれですけど。Gogleとか面接は難しそうだから、めっちゃ対策しなきゃいけないなという気がします。なんかあとは僕が感じたことなんですけどその特に日本で強かったエンジニアの人たちがなんか困ってるというかあのつまずいてるなーってタイミングさっきのコミュニケーションの取り方であのなんだろうその日本だとやっぱりいくらでももう来てくださいみたいな感じわけじゃないですかやっほんそうですねでこっちだと一つのポジションに200人とか300人分くるのが普通なんでなんかそこでなんかあの頑張らなくても日本だと頑張らなくてもいいレジュメなんて別に書かなくてもよかったよぐらいで行けてた人たちがこっちに来てそれをやらないといけなくてそこになんかそのマインドセットの違いに結構つまずいてるなぁみたいなもんそこは何か意欲はどういうふうに変えたのかなっていうのが結構それともまあ何も何もなく勝手に変わったのか。いやまあそれは面接とかしてみてうまくいかない経験で自分の日本で培ったプライドをぶち殺すしかなんかノートにも書いたのかなしかも日本でエンジニア経験の人と話せば似たようなことを言ってる人多くて多いですね日本めちゃくちゃ言葉を選ばずに言うと日本の転職ってゆるゲーだよ。ねまあ無理よね別に。そういうあのまあ転職サイトで登録すれば会社側からリクルーター側からメッセージが届いてまぁこっちがもう会社を選ぶ勢いでカジュアル面談させて。もらって売り手市場だよね。こっちが気に入ったらメッセージしてやってもいいけどみたいなぐらいの市場で来ちゃってるともうその前のセットを日本に間に変えるのはほぼ無理かなと思ってこれ何回フロックで。説明会で話しても伝わらないんだよねやっぱりその。打ち砕くにはもうそうじゃない市場に出て一旦それでは通用しないんだってことはもう心の底から。実感するあとあれですねさっきのジェネラルのアドバイスでも言ったけどイテレイトマッサージャーとかがそれに気づいて僕が見てきた人たちも気づいてはいるんですよねそこからが大変だろうなでも。難しいなぁそこはもうなんかそういうマインドセットというか心の持ちような話だから結構もしかしたら岩内の性格特化があるのかもしれないですけどあんまりこれうまくいかなかったからといってなんか自分が悪いと考えすぎないことは大事かな。といや間違いないよ市場の。景気もあるしもしかかこっちでもし自分がカナダとかアメリカで生まれて同じようなエンジニアリングの勉強してたら多分うまくいってたんだろうなと思うしこっちで生まれてなんか英語に苦労せずにというか英語のネイティブの人が経験積んでこっちのいい会社で働く働けてる人がいたとしてももしその人が日本に生まれてたら同じ頭の良さを持ってたとしても英語の壁がプラスアルファであるからうまくいけなかったのかなとかを考えると半分自分のせいかもしれないけどまあ半分自分のせいじゃないなとそういうところもあるのでそこはなんかうまくこうまあ何事も自分の責任と捉えた方が伸びが早いという人もいますけどそれを考えすぎて落ち込んじゃったらね落ち込むこともないのでそこは実際問題自分のせいじゃないことの方が多いからうまくその自責志向とか責志向を使い分けてうまくこう自分のマインドというか心が折れないように頑張れるといいのかなぁと思ったりしてますね。ありがとうございました。今回は後半は就職して、金額とその後どういう違いがあったかみたいなことを話してもらいました。ありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "そしたら前回は、前半では就職するまでの流れ、3社目、特に3社目にフォーカスあって聞いてきたんですけどそしたらお金かなお金は大事、今回言ってくれるってことだったんでそしたらじゃあオファーとサインアップとか?サインアップとかあればサイン。",
      "start": 8,
      "end": 24984,
      "timestamp": "00:00"
    },
    {
      "speaker": "Yugo",
      "text": "アップとかなくてオファーはカナダドルで160,000円今は1ドル104円ぐらいですけど1ドル100円で換算すると日本円で1,600万ぐらいの現金上場してないのでストックオプションみたいな感じではあるんですけどシリーズはどのぐらいでしたっけ?シリーズBですB?あそこBなのか結構デカい。",
      "start": 24984,
      "end": 47614,
      "timestamp": "00:24"
    },
    {
      "speaker": "Ryo",
      "text": "なくはないけどちょっと遠いぐらい。",
      "start": 47614,
      "end": 49515,
      "timestamp": "00:47"
    },
    {
      "speaker": "Yugo",
      "text": "ですかね一応それがプラスで10系ちょっとぐらいある結構変動するからわかんないんですけどだから一番よく言うんだったら1700、800万円と言いたかったら。",
      "start": 49515,
      "end": 61665,
      "timestamp": "00:49"
    },
    {
      "speaker": "Ryo",
      "text": "言えるぐらいすごいすごい日本だとなかなかねたどり着けないいやそうな。",
      "start": 61665,
      "end": 66308,
      "timestamp": "01:01"
    },
    {
      "speaker": "Yugo",
      "text": "んですよねしかもこれでポジションがシニアソフトデベロッパーで別にテクニックリーダーとかマネージャーとか役職がついてないんで日本で役職なしでここの年賞いくらも返しだったらあるのかもしれないですけど日本の企業だったらまず無理だなそうよね難しいよねちなみになんてどの。",
      "start": 66308,
      "end": 85513,
      "timestamp": "01:06"
    },
    {
      "speaker": "Ryo",
      "text": "ぐらい上がったとかあるんですか?日本の最後の会社という。",
      "start": 85513,
      "end": 88794,
      "timestamp": "01:25"
    },
    {
      "speaker": "Yugo",
      "text": "か日本の最後がフリーランスとかしたりごちゃごちゃなんで。",
      "start": 88794,
      "end": 91895,
      "timestamp": "01:28"
    },
    {
      "speaker": "Ryo",
      "text": "ちょっとフリーランス一回抜きますか。",
      "start": 91895,
      "end": 94196,
      "timestamp": "01:31"
    },
    {
      "speaker": "Yugo",
      "text": "だいたい700万ぐらいだったのかちょっとうろ覚えですけど7800万円ぐらいなのが日本の。",
      "start": 94196,
      "end": 101559,
      "timestamp": "01:34"
    },
    {
      "speaker": "Ryo",
      "text": "最後じゃ軽く2倍は軽く。",
      "start": 101559,
      "end": 103259,
      "timestamp": "01:41"
    },
    {
      "speaker": "Yugo",
      "text": "場合ねーなんかそれでこっち来て一社目が750万円ぐらい2社目が950万円ぐらいまあ治癒してるからなんか上がったのか上がらないんですけどねで今いる会社が1600万円とかなんで結構もう文字通り2倍というか。",
      "start": 103259,
      "end": 120667,
      "timestamp": "01:43"
    },
    {
      "speaker": "Ryo",
      "text": "2倍以上それこそもう普通の人が1年で2、3年4、5年通していくところを3ヶ月4ヶ月くらいにパパパっていった感じジョブホッピングしつつそこまでたどり着いたとまあ。",
      "start": 120667,
      "end": 131709,
      "timestamp": "02:00"
    },
    {
      "speaker": "Yugo",
      "text": "そういうと2社目に行ったのは自分で行こうと思って行ったからなんですよ3社目はそれこそその昔の給料が払われてないという事件があったので練習の下っていうのがあるのでそこはまあなんか半分まあ乗り越えられたから運が良かったというか結果オーライというか感じかなってまあしかも思ったのは別にそれってシニアソフトデベロッパーでその年収ってまあ普通に平均こっちの平均から逸脱してるわけじゃないそうですね現金だけ見たらちょっと高いかもぐらい別に全然それで上払ってる会社結構多いし日本でもなお知れてる会社とかだったらもう別にシニアソフトデベロッパーで2千万円コストかオファーもちょくちょく調べたらあるっぽいので市場が変わるとこんなにやってること同じでも気度違うのかと思って資本主義を感じ。",
      "start": 131709,
      "end": 185417,
      "timestamp": "02:11"
    },
    {
      "speaker": "Ryo",
      "text": "ましたいやーでも書いて。",
      "start": 185417,
      "end": 186818,
      "timestamp": "03:05"
    },
    {
      "speaker": "Yugo",
      "text": "ましたよね書きましたねそうですねちょうどそのブログが書いててなんか僕的にはなんかなんだろうな年収1000万とか1500万って結構遠い世界の話かなって思ってたら意外とそうではないってことが感じたしが今回その1600万円オファーにビビらずメスとか望めたのも結構普段それこそ外出さんとかと接していると2結構こっちの市場感での昭久色の話とかを知ってたからビビらずいけたっていうのもあるかなだから割とそういうお金の話っていうのは日本人的にあんまりする文化なさそうな気はするんですけれどもするのに抵抗がない人はどんどん行ってった方がなんとなくそれが普通なんだっていう感覚が日本人の中でもできてきてその後来るとまた来てくる人も多くなるかなみたい。",
      "start": 186818,
      "end": 237568,
      "timestamp": "03:06"
    },
    {
      "speaker": "Ryo",
      "text": "なそれは本当にそうで、この間僕もちょうど優吾くんとこの話してたんですけど、僕も来たときに、翔太くんっていう人がいたり、ここら辺で有名な圭佑くんとかがいたり、そこら辺みんな同期なんで、仲いいからえっと金額も言い合うんですよねそれに結構引っ張られたところはあって真中瀬名さんも覚えてるかもしれないけど前に言った話でねゲイくんがどんどん急に上がっていくとなんか僕の方ちょっと経験者だったのに抜かれちゃったみたいなのもありケツ蹴られて転職していくとかいや大事だよねそういうのってやっぱあとはそのやっぱその裸さっきも言ってくれたので裸んでなんかあれみんなこんないや、そうなんですね。あれ?じゃあ俺も行けんじゃない?みたいなのってやっぱあって。",
      "start": 237568,
      "end": 283100,
      "timestamp": "03:57"
    },
    {
      "speaker": "Yugo",
      "text": "絶対ある。いや、それ絶対そうですよ。",
      "start": 283100,
      "end": 284701,
      "timestamp": "04:43"
    },
    {
      "speaker": "Ryo",
      "text": "だからフロックの中でもそうだけど、。",
      "start": 284701,
      "end": 286252,
      "timestamp": "04:44"
    },
    {
      "speaker": "Yugo",
      "text": "やっぱりこういうがあんまり周りの。",
      "start": 286252,
      "end": 287593,
      "timestamp": "04:46"
    },
    {
      "speaker": "Ryo",
      "text": "ない人たちで言うところの給料を高いっていうので、大体800万、900万で止まってんすよ。",
      "start": 287593,
      "end": 293166,
      "timestamp": "04:47"
    },
    {
      "speaker": "Yugo",
      "text": "だから本当に最近ね、。",
      "start": 293166,
      "end": 295317,
      "timestamp": "04:53"
    },
    {
      "speaker": "Ryo",
      "text": "給料やっぱり話聞くときも、なんか80系とか90。",
      "start": 295317,
      "end": 298459,
      "timestamp": "04:55"
    },
    {
      "speaker": "Yugo",
      "text": "系ってすごくもらえましたって言うから。",
      "start": 298459,
      "end": 301644,
      "timestamp": "04:58"
    },
    {
      "speaker": "Ryo",
      "text": "周りとの情報交換大事だ。",
      "start": 301654,
      "end": 302915,
      "timestamp": "05:01"
    },
    {
      "speaker": "Yugo",
      "text": "よねって正直思うよね日本の感覚で言うと80系90系って別に高い高いその感覚やっぱそういうのが普通っていう人たちとたくさん話して自分の感覚感じ方を変えるだったりしないとあんまりこう感覚変わっていかないかなと思う難しいね。",
      "start": 302915,
      "end": 318266,
      "timestamp": "05:02"
    },
    {
      "speaker": "Ryo",
      "text": "なんかまあ僕も7年目でまあ観測してるでやっぱり一社目で止まっちゃうもったいないなーって一社目でまあ転職をしない人が結構多い中でまあ運が良かったのが悪かったのもあり、1社目は決断して2社目に行って、2社目はなんか給料止まっちゃったからってのもあるけどその転職繰り返すとやっぱり結構増えていくじゃないですか1社目ってやっぱり少なくなりがちやっぱりなんかまだ外国人で日本の年収700万だったからそれから500万もっと低いかもしれないけどだったから結構上がったっていうので行くんだけどそれまだまだ全然上がる余地があってそこらへんがね、なんだろう結構あと1社目。",
      "start": 318266,
      "end": 360353,
      "timestamp": "05:18"
    },
    {
      "speaker": "Yugo",
      "text": "でやっぱりこうカルチャーショックが大き。",
      "start": 360353,
      "end": 361913,
      "timestamp": "06:00"
    },
    {
      "speaker": "Ryo",
      "text": "すぎて疲れちゃったって人正直多いなって気がするけどね話聞いてると疲れちゃったやっぱり1社目で行ってまあ670系とかそのくらいからスタートしてのジュニアとかですごく居心地がいいからもうまたあのなんか少女活動の駅に戻りたく。",
      "start": 361913,
      "end": 376417,
      "timestamp": "06:01"
    },
    {
      "speaker": "Yugo",
      "text": "ないみたいなのは結構効く。",
      "start": 376417,
      "end": 378318,
      "timestamp": "06:16"
    },
    {
      "speaker": "Ryo",
      "text": "ただ印象としてはそのすごい強いのかもしれないけど2社目とか3社目になってくるとやっぱその喋り方とかもこっちの働き方を経験した上でとかあの経歴の書き方とかもこっちの働き方経験して上でになるんで結構簡単にはなっていくと思う。",
      "start": 378318,
      "end": 395028,
      "timestamp": "06:18"
    },
    {
      "speaker": "Yugo",
      "text": "んですよねこっちで通用するやり方がなんか肌感わかってくるっていうのもあるし実際に医者でも働いてると自信にもなるので医者でも働けたんだら次もいけるだろうそれが初めてだったら面接はうまくいってるけど、実際に入ったらどうなるのかな?英語を使って仕事するのは初めてだけど、いけるんかな?そんな気持ちでオファーをあげる保証できないな。だから低く見積もらえても初めてだし、ありがとうございますという感じで行くけど。2社目以降になってくると自分の感覚的には結構そこが、自分のマインドが変わってよりこう戦いにいけるという立ち。",
      "start": 395028,
      "end": 436866,
      "timestamp": "06:35"
    },
    {
      "speaker": "Ryo",
      "text": "位置をちゃんと確認できるみたいな。",
      "start": 436866,
      "end": 438146,
      "timestamp": "07:16"
    },
    {
      "speaker": "Yugo",
      "text": "こともあるしねそれは。",
      "start": 438146,
      "end": 440227,
      "timestamp": "07:18"
    },
    {
      "speaker": "Ryo",
      "text": "本当あるよピザも神聖サポート。",
      "start": 440227,
      "end": 442048,
      "timestamp": "07:20"
    },
    {
      "speaker": "Yugo",
      "text": "しておかなくちゃいけない。",
      "start": 442048,
      "end": 442688,
      "timestamp": "07:22"
    },
    {
      "speaker": "Ryo",
      "text": "しそしたら実際に今働いてみて今の会社は2週間3週間目ぐらいそう。",
      "start": 442688,
      "end": 451112,
      "timestamp": "07:22"
    },
    {
      "speaker": "Yugo",
      "text": "ですね3週間ぐらい前の。",
      "start": 451112,
      "end": 453253,
      "timestamp": "07:31"
    },
    {
      "speaker": "Ryo",
      "text": "会社とか前の会社あると思うんですけどなんか働いてみてなんか違うな日本の時の日本のエンジニア時代とこれが違うなぁみたいなのとかってあり。",
      "start": 453253,
      "end": 461756,
      "timestamp": "07:33"
    },
    {
      "speaker": "Yugo",
      "text": "ますこれ実は意外かもしれないんですけど英語をすごく使いますね。",
      "start": 461756,
      "end": 466773,
      "timestamp": "07:41"
    },
    {
      "speaker": "Ryo",
      "text": "それ意外だ。何狙ってんの?",
      "start": 466773,
      "end": 469625,
      "timestamp": "07:46"
    },
    {
      "speaker": "Yugo",
      "text": "ちょっとボケてみた。それはもちろん。違うところで言うと、会社によって全然違うなっていうのは正直なところで僕は結構日本にいた時、日本で働いてた会社って結構整ってたし、技術もモダンだったし、職域構造もたくさんあったんですよ。だからカルチャー的に見てこっちの方がめちゃくちゃ働きやすいかって言われるとあんまり変わらないかもっていうのは正直、ただ勤務時間はやっぱり1時間違うなっていうのもあって例えばカナダだと9時5時がだいたい普通というわけじゃないですか日本だと9時から働いたら6時なんですよね1時間の間の休憩をカウントしないので9時間拘束なんです9時間拘束でなんですけどこっちだとそもそもそういうのがないから、単純に8時間高速で違うなっていう風に思ったし、あとは、やっぱ結構その用事がある時は気軽にちょっと時短で帰るみたいな人はカジュアルに多いなっていう印象があって確かに、。",
      "start": 469625,
      "end": 528064,
      "timestamp": "07:49"
    },
    {
      "speaker": "Ryo",
      "text": "よくドクターポイントメント、カーポイントメント、電子スタポイントメントって聞きますよね、確かにとか、。",
      "start": 528064,
      "end": 532326,
      "timestamp": "08:48"
    },
    {
      "speaker": "Yugo",
      "text": "金曜日でちょっと予定があるから、30ぐらいに今日早いけどあと、。",
      "start": 532326,
      "end": 535597,
      "timestamp": "08:52"
    },
    {
      "speaker": "Ryo",
      "text": "今日Amazonからパッケージ届くから会社行かないでワークフロンフォームしますみたいなとかもあるからそういうのは多いかもしれ。",
      "start": 535597,
      "end": 544291,
      "timestamp": "08:55"
    },
    {
      "speaker": "Yugo",
      "text": "ないですねそれはカルチャーがそうっていうのもあると思うんですけど僕的には打刻制度がないのが結構大きいかなと思って。",
      "start": 544291,
      "end": 553216,
      "timestamp": "09:04"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみに日本だと打刻し。",
      "start": 553216,
      "end": 555517,
      "timestamp": "09:13"
    },
    {
      "speaker": "Yugo",
      "text": "てるんですか?するんですよ法律で決まってて勤務時間を記録しなきゃいけないそれなんかスラックで。",
      "start": 555517,
      "end": 561540,
      "timestamp": "09:15"
    },
    {
      "speaker": "Ryo",
      "text": "できるとかないですか?",
      "start": 561540,
      "end": 562331,
      "timestamp": "09:21"
    },
    {
      "speaker": "Yugo",
      "text": "スラックでできますじゃあ変わります?これも僕的な気持ち変わると思って働き始めたら絶対にデコッコマンド打って終わったら終了するっていうのをやるんですよ会社によってはそれはファミリーなチャンネルでやることもあるしプライベートでやることもあるしと思うんですけど僕的にはただの個人の感想になるけどそれがあるかないかによって割と結構しっかり働いてる時と働いてない時の気持ちの区別がなんかしちゃうというかなんだろう人によってはそれで結構なんかこう一回で隠し始めたしちゃんとなんか時間きっちり働かなきゃみたいなことを思う人もいるんじゃないかなぁと勝手に思ったりしてもちろんファン人ではないけど僕は結構個人的には個人の感じ方としては最初と感じるなるほど。",
      "start": 562331,
      "end": 608247,
      "timestamp": "09:22"
    },
    {
      "speaker": "Ryo",
      "text": "それ日本僕あんまり日本のエンジニア業界においてないなかったんだあれなんですけどなんか吉田にやられてるところとかないんですか?なんかその打刻っていうものがもう全然その社員1社員単位で感じないみたいなのと会社とかはないんですか?",
      "start": 608247,
      "end": 622396,
      "timestamp": "10:08"
    },
    {
      "speaker": "Yugo",
      "text": "なんか採用労働制だったり。",
      "start": 622396,
      "end": 624786,
      "timestamp": "10:22"
    },
    {
      "speaker": "Ryo",
      "text": "とかもあるかもしれ。",
      "start": 624786,
      "end": 625446,
      "timestamp": "10:24"
    },
    {
      "speaker": "Yugo",
      "text": "ないそれ結構レアだと思いますあ、そうなんだ普通は打刻すると思いますね打刻コマンドがあってそれ用の何かSARSとかもあったりするのでスラック連携されててそうだよねー基本をやる調べたら法律で記録することは確か決まってる気がするうーんそうなんだ基本的にはだからそのなんだろうその辺りがゆるいのが良いカルチャーっていうか良いことだっていう風に結構聞くんですけどまあ半分カルチャーだし半分法律だなとか思ったりまあ分かんないですけどねいやで。",
      "start": 625446,
      "end": 656484,
      "timestamp": "10:25"
    },
    {
      "speaker": "Ryo",
      "text": "もシンプルにこっちレイオフあるから。",
      "start": 656484,
      "end": 658204,
      "timestamp": "10:56"
    },
    {
      "speaker": "Yugo",
      "text": "さバリーン打極で勘弁し。",
      "start": 658204,
      "end": 659885,
      "timestamp": "10:58"
    },
    {
      "speaker": "Ryo",
      "text": "なくてもさパフォーマンス低いんだったらもう切りゃいいじゃんっていうあれは正直あるかも。",
      "start": 659885,
      "end": 664346,
      "timestamp": "10:59"
    },
    {
      "speaker": "Yugo",
      "text": "しれないと思うけどね日本辞めさせられないからさ確かにそれで言うとそういえば僕はやったことないですけどやっぱ残業している人が少ないなって気はしてそこをやった分ですけど日本だと練習というか収入を上げるためにわざと残業をして残業をやら。",
      "start": 664346,
      "end": 681235,
      "timestamp": "11:04"
    },
    {
      "speaker": "Ryo",
      "text": "せたじゃないですか僕はやったことないほんとですか?",
      "start": 681235,
      "end": 683717,
      "timestamp": "11:21"
    },
    {
      "speaker": "Yugo",
      "text": "それはやっぱこっちないのでやっぱなんか無駄な残業するメリットはやっぱないかなと思ってそれもあるちなみになんですけど、。",
      "start": 683717,
      "end": 692500,
      "timestamp": "11:23"
    },
    {
      "speaker": "Ryo",
      "text": "最初聞いておけばわかったんだけど、3社ともカナダの会社ですか?",
      "start": 692500,
      "end": 695962,
      "timestamp": "11:32"
    },
    {
      "speaker": "Yugo",
      "text": "あ、そうですね。1社目がセキュリティ系のスタートアップで、カナダの、てかバンクーバーに本社はあるけど、フルリモートの会社で、2社目ももうちょっと小さい、かなり小さいスタートアップで、バンクーバーに本社があって、ですか、オフィスがあったので、週2出社だったけど僕はオフィスが好きなんで毎日行ってたって感じで今のスペアという会社もカナダが本社でオフィスがあってそれとトガシさんが行ってる会社と同じビルでいいところなんで僕はオフィスが好きなんでほぼ毎日行ってるという感じですなんか。",
      "start": 695962,
      "end": 731590,
      "timestamp": "11:35"
    },
    {
      "speaker": "Ryo",
      "text": "僕の肌感なんですけど全然他の会社とかわかんないですけど、カナダの会社とアメリカの会社でもちょっと忙しさが違うっていうか、カナダの会社より結構落ちるな感じするなって思いますね。これからアメリカの会社とか受けて会う機会があったら、またちょっと考えるかは分かるかもしれないですね。そしたら、差し支えない範囲で、会社に言えないこととかもあると思うので、差し支えない範囲で、業務だとかどういうチームにいるとかどういうこと日々やってるとか教えてもらってもいいですか?",
      "start": 731590,
      "end": 769250,
      "timestamp": "12:11"
    },
    {
      "speaker": "Yugo",
      "text": "僕はタイトルとして、ジョブタイトルとしてはシニアソフトウェアディベロッパーなんですけど業務としては覚えるアプリがほぼ中心ですねリアクトネイティブ使ったアプリがあってそれを報酬と新機能開発っていうのをしている感じでただ僕が今いるチームがすごい新しいチームが人数少なくて僕とエンジニアリングマネージャーと、あとプロダクトマネージャーの3人しかいない。しかもプロダクトマネージャーは忙しいので、他のチームの兼任。ほぼ2人、2。",
      "start": 769250,
      "end": 796386,
      "timestamp": "12:49"
    },
    {
      "speaker": "Ryo",
      "text": "5人、。",
      "start": 796386,
      "end": 796837,
      "timestamp": "13:16"
    },
    {
      "speaker": "Yugo",
      "text": "2。\n3人くらいのチームで、結構やることがたまってる。アトリの歴史も結構長くて、5年とか6年くらいあるのかな。なので結構塞いも溜まってる箇所があったりするので結構マネージャー的には結構リファクタリングしたいけど僕が入る前は一人しかいなかったんでできないことがめちゃくちゃたくさんあったっていうところに僕が入っていくので入って直近だともう結構リファクタリングをしたりとか手が回っていなかった原因不明のバグをネイティブのロゴを見て修正したりとかなるほどしてます。",
      "start": 796837,
      "end": 827521,
      "timestamp": "13:16"
    },
    {
      "speaker": "Ryo",
      "text": "アプリ的にはどんなアプリな。",
      "start": 827521,
      "end": 829282,
      "timestamp": "13:47"
    },
    {
      "speaker": "Yugo",
      "text": "んでしたっけそうですねスペアはそのそもそもサービス的にはなんかあのモビリティー系のサースって言うのかななんかマイクロトランジットとかパラトランジットとか言うんですけどなんかそのそうだモビリティー系のサースっていう感じでなんかそういろんな国にサービス展開してるんですけど結構例えば大きい大学とかだと敷地が広すぎて大きなバスを大きなバス大きな車何台か借りて半分こうバスみたいな感じで運営してるみたいなところが結構各国であるんですねそういうところ向けにアプリと管理ツールを開発するみたいなところでアプリとしてはそのドライバーが使うアプリがあってもう一つはドルユーザー側がバスのリアクト化をしたりするアプリがあるあとはそれらのツールを連携したりとかマネジメントするためにウェブでいろんなサービスがいくつかあるっていう感じが全体でグループごとのウーバー。",
      "start": 829282,
      "end": 884043,
      "timestamp": "13:49"
    },
    {
      "speaker": "Ryo",
      "text": "みたいなそうですね、。",
      "start": 884043,
      "end": 885624,
      "timestamp": "14:44"
    },
    {
      "speaker": "Yugo",
      "text": "グループごとのウーバーみたいな感じですね実は日本でもいろんな地方自治体と契約していてあったりするんですけど僕がいるチームはドライバー向けのアプリを開発しているなんであの地図を表示して行き先設定されててこれ何人乗るとか次どこ行けばいいかっていうのがまあナビゲーションしてくれるじゃあ本当に。",
      "start": 885624,
      "end": 908635,
      "timestamp": "14:45"
    },
    {
      "speaker": "Ryo",
      "text": "インターフェイスも本当にウーバーのドライバーのアプリに似てる感じなのかな僕はあんまりウーバーのドライバーのアプリを見てないけど上とか。",
      "start": 908635,
      "end": 914876,
      "timestamp": "15:08"
    },
    {
      "speaker": "Yugo",
      "text": "下に情報があって地図が表示されててルートが示されててこっち行ってねーみたいな音声が流れて次曲がってくださいみたいなのを開設するようなところで2人だけのチームでかなり自由にというか2人って全体人数どのくらいですか?社員としては160人ぐらいがあってエンジニアリングチームも何個あんのこれ?5,6?もうちょっとあるかもね普通は各チーム5,6人いるので僕のいるチームがかなり特殊てか僕のチームかなり特殊ですね業態とし。",
      "start": 914876,
      "end": 957042,
      "timestamp": "15:14"
    },
    {
      "speaker": "Ryo",
      "text": "ては完全にB2B。",
      "start": 957042,
      "end": 957922,
      "timestamp": "15:57"
    },
    {
      "speaker": "Yugo",
      "text": "ってことだよねそうですね契約先は超自治体だったりとか大学とか正直スペアに入りましたって。",
      "start": 957922,
      "end": 965963,
      "timestamp": "15:57"
    },
    {
      "speaker": "Ryo",
      "text": "言ってあの会社のことを割と調べて何回調べて。",
      "start": 965963,
      "end": 969144,
      "timestamp": "16:05"
    },
    {
      "speaker": "Yugo",
      "text": "もこの業態どうやって儲ける。",
      "start": 969144,
      "end": 971484,
      "timestamp": "16:09"
    },
    {
      "speaker": "Ryo",
      "text": "んだろうなってすごいわからなく。",
      "start": 971484,
      "end": 973105,
      "timestamp": "16:11"
    },
    {
      "speaker": "Yugo",
      "text": "てでも自治体とか。",
      "start": 973105,
      "end": 974305,
      "timestamp": "16:13"
    },
    {
      "speaker": "Ryo",
      "text": "が絡んでくるとそういうねやっぱり政府だったりとか。",
      "start": 974305,
      "end": 977706,
      "timestamp": "16:14"
    },
    {
      "speaker": "Yugo",
      "text": "がお金出してくれるんだろうなっていう僕もそれ、面接ばっきり調べてわからなかったので、予設屋に聞きましたね。これ、誰がお話ししてるの?だから半分パブリックだもんね。",
      "start": 977706,
      "end": 993123,
      "timestamp": "16:17"
    },
    {
      "speaker": "Ryo",
      "text": "技術的なところに戻ると聞いた感じだとじゃあAPIみたいなのを開発はせずにAPIはもうすでに全部他のチームから与えられて。",
      "start": 993133,
      "end": 1002580,
      "timestamp": "16:33"
    },
    {
      "speaker": "Yugo",
      "text": "そうですねすでにあるがたまに開発が必要なこともあるんでその時は自分でやろうと思えばやれる全体的にはフルタイプスクリプトみたいな感じであるのでデータの分析とかやスカラーとかがちょっとあったりしましたけど僕はそのフルスタックとして働いてた経験があるのでバックエンドも全然描けるし上のフロントエンドもやれるしデータベースもわかるっていう感じなんで必要があったら全然バックの開発もしたいという感じがあるんですけれども入って3週間としてはちょっとさっきとより人数が少ないモバイルアプリのチームで歴史も長いのでやるべきこととか改善したいことがたくさんあるのでまあなんか結構モバイルアプリのリアクトネイティブに関係する部分の回数がかなり9割以上になりそうだなぁしばらくはという感じ。",
      "start": 1002580,
      "end": 1047423,
      "timestamp": "16:42"
    },
    {
      "speaker": "Ryo",
      "text": "ですなるほどねそしたらスプリントとかで時期が区切られてて目標があるっていうよりはもう今は結構溜まってるからそれをどんどん消化していくみたいな感じな。",
      "start": 1047423,
      "end": 1057838,
      "timestamp": "17:27"
    },
    {
      "speaker": "Yugo",
      "text": "んですかまあなんか短いかも本当だったらその2週間のスプリントとかを切ってやりたいところがその2人しかいないので。",
      "start": 1057838,
      "end": 1064883,
      "timestamp": "17:37"
    },
    {
      "speaker": "Ryo",
      "text": "そうですよねあんまり一応1。",
      "start": 1064883,
      "end": 1066625,
      "timestamp": "17:44"
    },
    {
      "speaker": "Yugo",
      "text": "週間で区切ってプランニングとかするけどそんなにバックログも溜まり切ってるわけではなくてそもそもそのチケットにできてないことも多いので結構自分からアクティブに動いてこれやりますよーみたいな感じでやっぱり反スタートがそういいかつ反スタート僕はスタートアップの経験が多いので結構それは心地が良いああそうなんだ慣れてるので働き方が分かったんですだから働いて3週間ぐらいですけどちょうど今日もあのマネージャーと話してプロアクティブプラクティス、自分からタスクを取り入れてやってくれるのはすごいありがたいし、いいことだと思うので、もうやってくれっていうフィードバックもちょっとあったりして、今はそういう感じですね。新しく人を入れるためのポジションとかもオープンしてたりするのでもし人がもうちょっと入ってきたら入れ方は変わるのかなっていうふうに思いますけどそこもマネージャーと話してまあ別に急ぐことはないし2人だけなんで徐々に整えながらやっていこうということで合意をとってちなみに。",
      "start": 1066625,
      "end": 1132205,
      "timestamp": "17:46"
    },
    {
      "speaker": "Ryo",
      "text": "そのチームは今後なんか今なんか何ポジションかオープンしてるみたい。",
      "start": 1132205,
      "end": 1136749,
      "timestamp": "18:52"
    },
    {
      "speaker": "Yugo",
      "text": "なあるんですか今一つだけですね、僕と同じポジションが1個。",
      "start": 1136749,
      "end": 1140326,
      "timestamp": "18:56"
    },
    {
      "speaker": "Ryo",
      "text": "応募してますじゃあ直近では今3人のチームが4人になるICとしては2人、マネージャー、。",
      "start": 1140326,
      "end": 1150199,
      "timestamp": "19:00"
    },
    {
      "speaker": "Yugo",
      "text": "PMそうですね僕が応募した時点でこのポジションは2人募集してますっていう制度を出しててそこでやるだけ僕が1人決まってもう1個はまだ。",
      "start": 1150199,
      "end": 1161012,
      "timestamp": "19:10"
    },
    {
      "speaker": "Ryo",
      "text": "決まってないそのpmだったりえっとデザインを喋ることもある。",
      "start": 1161012,
      "end": 1166862,
      "timestamp": "19:21"
    },
    {
      "speaker": "Yugo",
      "text": "のかなあーでもサインまだあんまりないかもまだまあ。",
      "start": 1166862,
      "end": 1172268,
      "timestamp": "19:26"
    },
    {
      "speaker": "Ryo",
      "text": "ちょっとあるでそのじゃあミッキーmだったりとかマネージャーとのコミュニケーションだったり今なんかどんな感じで他の人とコミュニケーションとら。",
      "start": 1172268,
      "end": 1180316,
      "timestamp": "19:32"
    },
    {
      "speaker": "Yugo",
      "text": "れてるんですかどんな感じまあでもミーティングもそんなに多いわけじゃないから出社したらマネージャーとともに座ってやってるので聞きたいことがあったらそれを冒頭でパッと聞いてやるって感じ。",
      "start": 1180316,
      "end": 1193905,
      "timestamp": "19:40"
    },
    {
      "speaker": "Ryo",
      "text": "でちなみになんですけど今回今の会社じゃなくてもいいんですけどさっきもちょっと英語の話聞いたんですけどまぁこっちが働き始めた後になんか感じた英語難しいなぁみたいなのとかなんか英語で大変だなぁみたいなのってありましたそれとも結構フワッとスルッと入ってなんとかなる。",
      "start": 1193905,
      "end": 1212231,
      "timestamp": "19:53"
    },
    {
      "speaker": "Yugo",
      "text": "んじゃなぁみたいなネイティブの英語早いなっていうのは日々感じているネイティブじゃない人との会話は割と結構最近はあんまりストレスなくできるようになってきたけどネイティブの人で早口な人がたまにいてそうすると何言ってるかわかんないな基本的に超能力でエスパーするかみたいなのが結構多くなってしまうのはちょっと悩みの一つではあるしあと今の会社っていうか最初の一社目の会社がインド系の方が多くてあの、インド系の名前が強い英語は、ほんとに聞き取れないなっていう。",
      "start": 1212231,
      "end": 1248482,
      "timestamp": "20:12"
    },
    {
      "speaker": "Ryo",
      "text": "わからんよね。でも、慣れですよね、そこらへんは。",
      "start": 1248482,
      "end": 1251105,
      "timestamp": "20:48"
    },
    {
      "speaker": "Yugo",
      "text": "ほんと、慣れ。もう、時間をかけるしかない。どんどん、どんどん。増えるしかないなぁそう思って。",
      "start": 1251105,
      "end": 1259089,
      "timestamp": "20:51"
    },
    {
      "speaker": "Ryo",
      "text": "いるところでそのなんかわかんなかった時とかはどうもうゲッスルそれともなんか僕一つ僕が働いてて思ったのは結構あのテキス結局決まったことをあのなんて言うんだろうカナダはなのかな特にあのふわーっと日なんか日本だと相手も理解してるよねみたいなんでふわーっと進んでふわーっとタスクがあるみたいな状態が多いんだけどこっちは割となんかコミュニケーションちゃんと取れてないっていうのが前提に働いてるなって思ってなんか後から確認してくれるとかそれか僕が理解してなさそうな顔してたから誰かもしれないけど結構そこらへんはなんかパスなんかん助けてくれてうまくいくなっていうのが僕はさえ特に最初の頃は思ったんですけどそこはなんかどうエト。",
      "start": 1259089,
      "end": 1305883,
      "timestamp": "20:59"
    },
    {
      "speaker": "Yugo",
      "text": "ラーがましくに僕のチームのマネージャーもミーティング終わったら長めでやることが決まったみたいなときは絶対まとめて投稿してくれるのが多いですねあとしパスクレスが話するんだったチケットに起票するのでわかんなかったらそこでメンションして次に聞くとかもするしあと最近はAIに助けられてるんですねオンラインのミーティングだったら字幕ポチってわかんなかったらつけられるんで最悪つけてなるほどなるほどしかも最近なんかGogleMtとかジェミニーのまとめとかつけてくれるんで困ったらそこに頼るみたいな感じだけど基本あんまり頼ることはないかなそれ頼ってると結局自分の営業力いつまで経っても伸びなくていつまで経ってもその問題が起きるのかなと思うなるべく頼れないようにするけどちょっとギョンに支障が出るんだったら頼る感じでやってますねなるほどねインパーソン、。",
      "start": 1305883,
      "end": 1357898,
      "timestamp": "21:45"
    },
    {
      "speaker": "Ryo",
      "text": "対面の場合?はいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいはいなんて聞かれてる?みたいなときってないですか?",
      "start": 1357898,
      "end": 1368126,
      "timestamp": "22:37"
    },
    {
      "speaker": "Yugo",
      "text": "エスパーもすることもあるし、分からなかったら、大体の文脈から予測して、こういうことを聞きたい?って聞き直して、なんと言えたりする。単純にだから、パルン、ソーリーとかだけじゃなくて、。",
      "start": 1368126,
      "end": 1383209,
      "timestamp": "22:48"
    },
    {
      "speaker": "Ryo",
      "text": "ユミン、。",
      "start": 1383209,
      "end": 1383659,
      "timestamp": "23:03"
    },
    {
      "speaker": "Yugo",
      "text": "ホネララ、ホネララっていうことをすると、もうちょっとなんか違う言い方をしてくれたりとか。",
      "start": 1383659,
      "end": 1387980,
      "timestamp": "23:03"
    },
    {
      "speaker": "Ryo",
      "text": "確かにやられるし。",
      "start": 1387980,
      "end": 1388850,
      "timestamp": "23:07"
    },
    {
      "speaker": "Yugo",
      "text": "それは大きいかも。それは、面接のときにも最初はよく使ってたかもしれない。単純に聞き返すんじゃなくて、なんとなくいろんなよくある質問から接続するにこういうことかなって思ったらユミホネララホネララって聞いてもうちょっと分かってない。",
      "start": 1388850,
      "end": 1406393,
      "timestamp": "23:08"
    },
    {
      "speaker": "Ryo",
      "text": "ところをなるほど小さくして相手に理解してもらって大切。",
      "start": 1406393,
      "end": 1411158,
      "timestamp": "23:26"
    },
    {
      "speaker": "Yugo",
      "text": "ですよね大切だし自分としてもそういうのが理解しやすい単純にパワーがあるんだと同じことを同じスピードで言われるだけ。",
      "start": 1411158,
      "end": 1419332,
      "timestamp": "23:31"
    },
    {
      "speaker": "Ryo",
      "text": "でいやネイティブの人はであのインターナショナルな人英語の話す人と喋ったことない人はそれがめちゃくちゃあるんで。",
      "start": 1419332,
      "end": 1425176,
      "timestamp": "23:39"
    },
    {
      "speaker": "Yugo",
      "text": "いや絶対だよねもう大変。",
      "start": 1425176,
      "end": 1427357,
      "timestamp": "23:45"
    },
    {
      "speaker": "Ryo",
      "text": "ちなみにさっきからねやっぱりネイティブの人ねやっぱり早口つらいよ。",
      "start": 1427357,
      "end": 1430319,
      "timestamp": "23:47"
    },
    {
      "speaker": "Yugo",
      "text": "ねとかって話あると。",
      "start": 1430319,
      "end": 1431240,
      "timestamp": "23:50"
    },
    {
      "speaker": "Ryo",
      "text": "思うけどどのくらいの人が。",
      "start": 1431240,
      "end": 1432201,
      "timestamp": "23:51"
    },
    {
      "speaker": "Yugo",
      "text": "ネイティブなんですかスペアってえーいやーでも結構多国籍で多様性が多様性を大事にしますって会社なのでまあそうだよねどうなんすかねもう腹感2,3割くらいな気がするシャワーにいたらいい方だと思うけどネイティブは?",
      "start": 1432201,
      "end": 1449570,
      "timestamp": "23:52"
    },
    {
      "speaker": "Ryo",
      "text": "ネイティブでもバンクーバーの人は割とゆっくりとか留学生に優しい人が多くてモントリオールとかトロントのロンドンっていうところに本社がある会社で働いてたんですけどそこの時は本当にみんな早いしうん?って言うと同じものを同じスピードで繰り返して次なんて言えばどうやって繰り返していいか分からないみたいなことがあったのであるよね地域によっての差が。",
      "start": 1449570,
      "end": 1479914,
      "timestamp": "24:09"
    },
    {
      "speaker": "Yugo",
      "text": "激しくて出たくないミーティングがあるもんだってこの人と。",
      "start": 1479914,
      "end": 1485137,
      "timestamp": "24:39"
    },
    {
      "speaker": "Ryo",
      "text": "ミーティングしたくないとかありますよね本当に大変です仕事内容は聞いてきたんでこれからなんか今は忙しいいっぱい溜まってるものがあるそれを紹介していくみたいなあるんですけどこれからなんか今の会社で関わっていきたい仕事とかこれやっていきたいなみたい。",
      "start": 1485137,
      "end": 1502086,
      "timestamp": "24:45"
    },
    {
      "speaker": "Yugo",
      "text": "なってあったりしますか?まあでも開始仕事前で言うとやっぱ僕も結構技術大が好きっていうバックグラウンドがあるので今すぐ目につく改善ポイントはどんどん改善していきたいなというのもあってただそのキャリアの深みを考えるともうちょっとちゃんとリアクトネイティブでやるんだったリアクトネイティブはメイティブに近いところとか本部深掘ったほうがいいなと思うしそっちがやりたくないんだったらもうちょっとバックグラウンドじゃなくてバックエンドのタスクとも触れるような振る舞いしていかなきゃなとは思いつつもどっちかに触れるだろうなとは思いつつもまあひとまずは会社入ったばっかりだしパフォーマンスを出すためにも一番慣れているリアクトネイティブの自分が得意なところからどんどん改善していってまずは実力を示すか示してからちょっと考えようかなという感じですねこれも聞いていいん。",
      "start": 1502086,
      "end": 1550951,
      "timestamp": "25:02"
    },
    {
      "speaker": "Ryo",
      "text": "やったらやけど、。",
      "start": 1550951,
      "end": 1551811,
      "timestamp": "25:50"
    },
    {
      "speaker": "Yugo",
      "text": "割とね、。",
      "start": 1551811,
      "end": 1552331,
      "timestamp": "25:51"
    },
    {
      "speaker": "Ryo",
      "text": "優吾さんといえばやっぱりブログだったり、。",
      "start": 1552331,
      "end": 1554342,
      "timestamp": "25:52"
    },
    {
      "speaker": "Yugo",
      "text": "ポッドキャストだったり、。",
      "start": 1554342,
      "end": 1555638,
      "timestamp": "25:54"
    },
    {
      "speaker": "Ryo",
      "text": "YouTbeだったりってアウトプットの達人みたいなイメージがありますけど、そっち方面なんかないんですか?",
      "start": 1555638,
      "end": 1560864,
      "timestamp": "25:55"
    },
    {
      "speaker": "Yugo",
      "text": "そんな達人とは思ってないです。そうなの?",
      "start": 1560874,
      "end": 1563105,
      "timestamp": "26:00"
    },
    {
      "speaker": "Ryo",
      "text": "めっちゃやっとるやん、。",
      "start": 1563105,
      "end": 1563795,
      "timestamp": "26:03"
    },
    {
      "speaker": "Yugo",
      "text": "だって。だから、それで言うと、全然キャリア関係ないけど、YouTbeはYouTberになりたいです。YouTbeは狙いに行く。なりたいというか、YouTbeでマネ台像して本業と同じくらい稼ぎたいな。",
      "start": 1563795,
      "end": 1574419,
      "timestamp": "26:03"
    },
    {
      "speaker": "Ryo",
      "text": "うわぁ、マジで?",
      "start": 1574419,
      "end": 1575829,
      "timestamp": "26:14"
    },
    {
      "speaker": "Yugo",
      "text": "今の本業と同じくらいって結構大変なんじゃないですか?",
      "start": 1575829,
      "end": 1578070,
      "timestamp": "26:15"
    },
    {
      "speaker": "Ryo",
      "text": "3000万を狙いに行く。",
      "start": 1578070,
      "end": 1579150,
      "timestamp": "26:18"
    },
    {
      "speaker": "Yugo",
      "text": "3000万を狙いに行くぜ。もっと行きたい。",
      "start": 1579150,
      "end": 1581271,
      "timestamp": "26:19"
    },
    {
      "speaker": "Ryo",
      "text": "もっと行きたい。うわぁ、。",
      "start": 1581271,
      "end": 1582242,
      "timestamp": "26:21"
    },
    {
      "speaker": "Yugo",
      "text": "素晴らしい。それは、まぁ普通に趣味の範囲ですからまあ半年ちょっとぐらいやって全然人数は700人ぐらいしかチャンネル登録者数いないですけどなんかやっぱやればやっていくとなんか改善ポイントがわかってくるというかそれこそそのユーチューバーとしての肌感というか動画クリエイターとしての肌感がなんか育ちずつあるなみたいな感じがあるのでそれはそれと伸ばしておきますがあんまりエンジニアとしての自分と結びつける気はあんまりないから。",
      "start": 1582242,
      "end": 1613010,
      "timestamp": "26:22"
    },
    {
      "speaker": "Ryo",
      "text": "キャリアとは別の観点からやってみたいこととしてってことですね前からその話聞いてたんだけどなんかそのさっきのやっぱりあのレジュメとかその就職に対する向け合い方とめちゃくちゃ似てるなぁと思ってまぁそこで繋がりはないんだけどなんか成功したその考え方をyoutbeに生かしてるんだなっていうのをすごい思ってちなみにそのエンジニアとしての今後のカナダでとかカナダ北米圏での今後の展望とかやりたいことどういう会社に行きたいなんかいっぱい稼ぎたいとかまぁなんかどういうふうな考えまあで。",
      "start": 1613010,
      "end": 1651872,
      "timestamp": "26:53"
    },
    {
      "speaker": "Yugo",
      "text": "もなんかやれる自分の実力というかやれることは増やしたいもちろんそのお金もよりもらえたらいいなと思いますけどプラスアルファーというかまあ同時にやっぱり自分の実力も伸ばしたいなと思って自力で考えるとだからまあそのエンジニアとしてのテクニック的な側面がマネージャー的な側面があると思うんですけど僕的には結構昔からマネージャー職はなんとなくやってみたいなって思いがあるので手で伸ばすんだったらそういう方向でさえ伸ばして上のレンジを目指したいかなというふうに思ったりもしているかそれは一つの方向性でもしくは今リアクトネイティブを使って結構いい職業を手に入れたりしたしなんかやっぱいろいろ市場を見てみるとリアクトネイティブをがっつり触っている人ってそんなに多くはないけどその割には結構求人たくさんあって結構リアクトネイティブはいろいろあると思ったりもしたのでリアクトナイテムに舵を切って絞るのも一つの方向かなとは思いますしもうちょっと自分で見るとやっぱりバックエンドとかをまた触った方がというか人間として力を身につくかもなっていう気はするのでもうちょっとやっぱりフルスタッフにもう一回舵を振ってその上でもうちょっと会社の中で上を目指すのもいいし転職するのもいいかなっていう感じであるんですけれどもまあ大体まあそういう大きく分けて3つの方向性があるかなとは思いつつまあどれか進めばいいかなぁぐらいの北米の。",
      "start": 1651872,
      "end": 1745871,
      "timestamp": "27:31"
    },
    {
      "speaker": "Ryo",
      "text": "良さで言うとそこホップできますよねなんかその結構うちの僕の働いてる会社でも多いのがマネージャーテックリードをやってテックリード嫌だったって言ってICに戻ってでマネージャーやってみてなんかやっぱりICの方がいいんじゃねって戻ってきてでその間ICとしてのレベルとかは上がりつつ給料も増やしつつマネージャーっていうポジションに行って戻ったりでまた戻ったりとかまあ別に会社内だけじゃなくて会社外でもそれをやってる人がいてなんかそれで言うとまあバックエンドのチームに移動してそこでマネージャーすることもできるしまあこのままリアクトネイティブのマスターしつつマネージャーっていうのを空いた時にポッて入るみたいなのもできると思うんでそれはなんかすごいなんかさっき多分カジを切るって言葉を使ってたと思うんですけど多分カジを切らないでもいいのかもしれないみたいなちょっと思ってましたね。",
      "start": 1745871,
      "end": 1800012,
      "timestamp": "29:05"
    },
    {
      "speaker": "Yugo",
      "text": "去年のフロックのカンファレンス出て。",
      "start": 1800012,
      "end": 1801453,
      "timestamp": "30:00"
    },
    {
      "speaker": "Ryo",
      "text": "くれた渡るさんって人が。",
      "start": 1801453,
      "end": 1802734,
      "timestamp": "30:01"
    },
    {
      "speaker": "Yugo",
      "text": "さちょうどシビックテック行ってIC。",
      "start": 1802734,
      "end": 1805075,
      "timestamp": "30:02"
    },
    {
      "speaker": "Ryo",
      "text": "やってユニティ行ってテクニーのマネージメントやってでやっぱりICだねって戻ってきたからザそんな感じのギャリアがいっぱい。",
      "start": 1805075,
      "end": 1812800,
      "timestamp": "30:05"
    },
    {
      "speaker": "Yugo",
      "text": "いるからですねそんなになんかもうちょっと気軽に考えて。",
      "start": 1812800,
      "end": 1817282,
      "timestamp": "30:12"
    },
    {
      "speaker": "Ryo",
      "text": "ただけみたいな感じじゃなくて戻ってこれるみたいなね。",
      "start": 1817282,
      "end": 1820004,
      "timestamp": "30:17"
    },
    {
      "speaker": "Yugo",
      "text": "しかもその経験があるからEMからICに戻ったとしてもチームのEMのサポートできるとかもあるし。",
      "start": 1820004,
      "end": 1827267,
      "timestamp": "30:20"
    },
    {
      "speaker": "Ryo",
      "text": "そうですね、いろんなポジション経験するのはすごい良いですよね。この頃、自分の話になっちゃうんですけど、ちゃんとしたオンコールを経験してるんですね。トレーニングが今回で終わったんですけど、2回やってプルリクエストの出し方とかめちゃくちゃ変わったんですよ。もうなんかオンコールやってると壊したところのプルリクエストを見に行ってそれがフィーチャーフラグの後ろにあるとかっていう情報が全部載っててくれるとすぐに対応できるんですけど立場を変わってみることでで僕としてはそのまあ普通のチームで働く時の業務にすごい役だったなぁと思ってだからなんか立場を変えることでその同じものでも見方が変わるなすごい思うんで例えば他にももう一つあるとしたらインタビューってすごい嫌じゃないですかでインタビューでまぁ僕たちの業界だってよくあるのがまあリートコード系のインタビューもあるしえっともう一つディヘイビュラル系のインタビューもあるしもう一つあのシステムデザイン系のインタビューもあるんですけどインタビュアー側をトレーニングしてやってみると結構こういうの聞きたいんだろうなとかっていうのをインタビューされる側の時にも分かってきたりするんですよそうだからちょっと立場を変えてやることでなんか違うことをマスターしやすいだったりとかその今度その立場になる人と一緒に働くときにその人がすごい働きやすくなったりだとかするんでいろんな立場を経験してみるのがすごい多分いいことですよねじゃあ次はEM行ってまた。",
      "start": 1828970,
      "end": 1922176,
      "timestamp": "30:28"
    },
    {
      "speaker": "Yugo",
      "text": "IC行った方は合わないですけどとりあえず僕は現状維持はアクルという思想の持ち主なんで素晴らしいです現状にはちょっと留まりたくないです。",
      "start": 1922176,
      "end": 1929818,
      "timestamp": "32:02"
    },
    {
      "speaker": "Ryo",
      "text": "素晴らしいです固まりみたいないやで。",
      "start": 1929818,
      "end": 1932298,
      "timestamp": "32:09"
    },
    {
      "speaker": "Yugo",
      "text": "も半分そうあるべきだと思うけどね多分多分半分は恐怖心から来てると思いますそうそうそうね多分みんなそうだと思うわだからその恐怖心をうまいことを自分のモチベーションに変えてプラスアルファのようなことにチャレンジしていきたいなという感じですねそういうことですね。",
      "start": 1932298,
      "end": 1946422,
      "timestamp": "32:12"
    },
    {
      "speaker": "Ryo",
      "text": "これをなんか、海外に出た人みんなとか、これから出る人も多分考えることなんですけど、その後、日本に帰るとか、違う国に行こうだとか、この今北米の次みたいなのってありますか?",
      "start": 1948425,
      "end": 1964966,
      "timestamp": "32:28"
    },
    {
      "speaker": "Yugo",
      "text": "長い目で見て。僕は今付き合ってる彼女と結婚したいと思っていて僕的には子供も欲しいなと思っているのでだから子育てとかを考えるとこれからまた違う新しい国に行くってしかあんまないかなとカナダで子育てするか日本で子育てするかのどっちかかなっていらっしゃるんでただ僕的にはやっぱさあ話にもあった通りやっぱ給料のことを考えると一度そういうだから100万とか目指すんだったら2000万とか3000万は普通だぜっていう世界で働いてみるとそこからあえてなんか日本に戻って年収結構下げるっていう選択肢が結構取りにくくなってくるんだろうなーっていうふうに思ってるんできっとカナダに留まる気は。",
      "start": 1964966,
      "end": 2010773,
      "timestamp": "32:44"
    },
    {
      "speaker": "Ryo",
      "text": "していて、。",
      "start": 2010773,
      "end": 2011954,
      "timestamp": "33:30"
    },
    {
      "speaker": "Yugo",
      "text": "とはいえそれはパートナーがどこでどう住みたいかとか、もし子供ができたらまた教育のことについていろいろ考えると思うので、それはそれ次第かなとは思いつつ、今のところの予測としては大体カナダかなと。もしカナダで助け切ったぜ、ダイヤできるぜってなったら、日本全然帰ってもいいって感じはありますね。Xで見た人でさ、その人たちがタイ人との国際結婚をされてる方で、タイ人の奥さんの方が子供に日本語を教えたくねーって言ってた。",
      "start": 2011954,
      "end": 2043644,
      "timestamp": "33:31"
    },
    {
      "speaker": "Ryo",
      "text": "で、。",
      "start": 2043654,
      "end": 2044284,
      "timestamp": "34:03"
    },
    {
      "speaker": "Yugo",
      "text": "見た?で、。",
      "start": 2044284,
      "end": 2044974,
      "timestamp": "34:04"
    },
    {
      "speaker": "Ryo",
      "text": "なぜなら日本語を覚えて。",
      "start": 2044974,
      "end": 2046055,
      "timestamp": "34:04"
    },
    {
      "speaker": "Yugo",
      "text": "も別に稼げないからって言われちゃったらしくてだから、。",
      "start": 2046055,
      "end": 2049275,
      "timestamp": "34:06"
    },
    {
      "speaker": "Ryo",
      "text": "偉いその人はやっぱり日本人の旦那さんとしてショックやったらしくてだから、。",
      "start": 2049275,
      "end": 2054307,
      "timestamp": "34:09"
    },
    {
      "speaker": "Yugo",
      "text": "そこに別にそれは逆転かもしれないけどねそうか、でも確かにそれもあともう1個あったの、そのパートナーが別に日本人じゃないのでそれの状態で日本に住んじゃうと、僕自体は立場的に全然平等じゃないなという気がして。社会的にどうのというよりかは、単純に普通に暮らす中で僕の方が全てをよく知っているという風になっちゃうので、バランスがあんまりこう生活のバランスがあんまり取れないなという気がするそれは、別に彼女もカナダ人ではないからもしカナダで一緒に住めばお互い移民として同じ立場で同じ国に住んでお互いの気持ち理解できるなという風な気がしているのでそれも含めてカナダの方がいいなと今のところは思っている感じですねまあ確かにね、。",
      "start": 2054307,
      "end": 2098749,
      "timestamp": "34:14"
    },
    {
      "speaker": "Ryo",
      "text": "そこら辺はあんまり壁感じにくい良い国ではあるか。",
      "start": 2098749,
      "end": 2101120,
      "timestamp": "34:58"
    },
    {
      "speaker": "Yugo",
      "text": "もしれないですよね、ここは日本に住むとね、まあ日本人の特権があるとは言いずつ、確かに確かに。",
      "start": 2101120,
      "end": 2109248,
      "timestamp": "35:01"
    },
    {
      "speaker": "Ryo",
      "text": "なんかここ、まあ何回か今、稼げるって話が出てきてて、なんかこの頃あの、ツイッターでなんか給料について、その稼げる稼げないについて確か触れてたと思うんですけど、なんかそこらへんって、なんだろう、どんなツイッターの内容でしたっけ?",
      "start": 2109248,
      "end": 2128127,
      "timestamp": "35:09"
    },
    {
      "speaker": "Yugo",
      "text": "ブログですかね?",
      "start": 2128137,
      "end": 2129368,
      "timestamp": "35:28"
    },
    {
      "speaker": "Ryo",
      "text": "ブログでしょ?",
      "start": 2129368,
      "end": 2130469,
      "timestamp": "35:29"
    },
    {
      "speaker": "Yugo",
      "text": "元々はあれでしょ?",
      "start": 2130469,
      "end": 2131670,
      "timestamp": "35:30"
    },
    {
      "speaker": "Ryo",
      "text": "お金をばっかり喋るエンジニアの。",
      "start": 2131670,
      "end": 2133641,
      "timestamp": "35:31"
    },
    {
      "speaker": "Yugo",
      "text": "あれとか詐欺っぽくて嫌。",
      "start": 2133641,
      "end": 2134762,
      "timestamp": "35:33"
    },
    {
      "speaker": "Ryo",
      "text": "だみたいなあれがあったんだけど実際もらってみると考えだいぶ変わったよねっていうそこについてもちょっと聞いてみたいなと思ってまあお金の話。",
      "start": 2134762,
      "end": 2143868,
      "timestamp": "35:34"
    },
    {
      "speaker": "Yugo",
      "text": "ばっかりする日本人のみんなずっと嫌いですけど前提として日本でわざわざそういう話するのって結構その背景に自分のビジネスを持っているからその誘導用のために給料を使って煽ってるっていうかフックにしてるのは実はあると思うのであんまり好きじゃないっていうのがあったけどそのもう半分の嫌いだった理由としてお金のためだけでイメージ対策するのとかって結構本質的じゃないなと思ってたんでまあそれはいる市場によっても違うのかもしれないですけど確かに日本だとまあ外資に行けば確かに結構上がるかもしれないがとはいえ日本企業で見ると給与に差がつくと言ってもまあ同じレイブ館だったら3,400万ぐらいを吸うのがせいぜい3,400万ぐらいの魚って言うんですよねそれであんまりその数百万のためだけにかなり面接対策とか頑張るのってあんまりこうメリットがないことはないけどインセンティブとして小さいのは出来はしてたんですけどこっちって差がつくときめっちゃ差がつくじゃない。",
      "start": 2143868,
      "end": 2211809,
      "timestamp": "35:43"
    },
    {
      "speaker": "Ryo",
      "text": "ですかワンチャン倍とかありますからね倍以上ある。",
      "start": 2211809,
      "end": 2214391,
      "timestamp": "36:51"
    },
    {
      "speaker": "Yugo",
      "text": "じゃないですか僕のそのシニアソフトウェアディベロッパーも多分もうちょっと小さい会社だったらそれこそまあ900万くらい日本円にしてあると思うけど僕が1600万だしそれこそもうちょっと流し入れてるところ日本でも流し入れてる会社に行ったら2000万とか超えるしなんならgoogleとかそのもっと大きい超有名企業に行ったら3000万いくことあるんですよねそれでももう3倍、2倍以上しかも実際にそういうところで話してる人たちに箇所を聞いてみると確かに面接対策は頑張ってはいるが地頭の良さをめちゃくちゃ感じるわけでもないちゃんとみんな頑張ってるし勉強はしてるけどなんかこう手が届かない天才だけが、そういうめちゃくちゃ3倍するようなところ、給料3倍するところで働けるわけじゃないんだなと。見てみると、同じレベル間で3倍の給料が見えるんだったら、それは3倍なら当然対策したくなるなというふうに思って。そういう世界が、日本にいた頃からGogleは3000万名集を超えるとかってのを見てた情報として入ってくると、ゆうて雲の上の話でしょ、みたいなチームの限られた天才とか超優秀層だけがそこに行くんでしょっていう風に思ってたけどその部分にこっち見てすごい見え方が変わって結構クリア。",
      "start": 2214391,
      "end": 2301121,
      "timestamp": "36:54"
    },
    {
      "speaker": "Ryo",
      "text": "になったというかクリア。",
      "start": 2301121,
      "end": 2301701,
      "timestamp": "38:21"
    },
    {
      "speaker": "Yugo",
      "text": "になったし、より身近に感じるようになったまあそうだよね日本で優秀な人だったらこっちに来て英語ができてちゃんと対策すれば結構誰でも誰でもって言ったら言い過ぎだと思うんですけど日本で普通に優秀だよって言われるような人たちだったらこっちでもう全然通用するし言語の壁とかも無視するとだいたい同じレベル感なんだなっていうことが分かったのでそれで結構お金の話というか年収2000万とか3000万とかいうものに対しての見方が変わったっていうのはまあ言えその日本でそういうのを追ってビジネスに要するのは引き続き好きではないです。",
      "start": 2301701,
      "end": 2342355,
      "timestamp": "38:21"
    },
    {
      "speaker": "Ryo",
      "text": "まあそれはね多分みんなそう。",
      "start": 2342355,
      "end": 2343997,
      "timestamp": "39:02"
    },
    {
      "speaker": "Yugo",
      "text": "ながらそこは結構区別がついてなかった全部異色だ全部が半分情報商材に見えるまあそういうことだよね他の話に戻ってきてくれたか俺もちょっとし聞いてきたいんだけどあの今のスペアススペアに行く時にあのうちのフロックメンバーから。",
      "start": 2343997,
      "end": 2362921,
      "timestamp": "39:03"
    },
    {
      "speaker": "Ryo",
      "text": "もビクトリアの会社1個受け。",
      "start": 2362921,
      "end": 2364082,
      "timestamp": "39:22"
    },
    {
      "speaker": "Yugo",
      "text": "られてたじゃないですかそうっすねそれはビクトリアって。",
      "start": 2364082,
      "end": 2366585,
      "timestamp": "39:24"
    },
    {
      "speaker": "Ryo",
      "text": "いうかビクトリアの人のリパラルル。",
      "start": 2366585,
      "end": 2369368,
      "timestamp": "39:26"
    },
    {
      "speaker": "Yugo",
      "text": "かあそこもちなみにどのくらいの年収さんだったのかって110Kでした110K。",
      "start": 2369368,
      "end": 2375044,
      "timestamp": "39:29"
    },
    {
      "speaker": "Ryo",
      "text": "かまぁまぁやっぱりそのくらいだよ。",
      "start": 2375044,
      "end": 2377157,
      "timestamp": "39:35"
    },
    {
      "speaker": "Yugo",
      "text": "ねそれよりは高かったって感じ。そっちはでもプラスでボーナスとかがあったのかな。でも合計を計算してもスペアの方がよかったっていう感じはあって。まあ、お金もそうだし僕はオフィスに行くのが好きなので。うちの行かなかった会社はフルリモートの会社で、オフィスなかったので。それも大きかったです。そういうことですね。",
      "start": 2377157,
      "end": 2396753,
      "timestamp": "39:37"
    },
    {
      "speaker": "Ryo",
      "text": "ビクトリー行かないとね、。",
      "start": 2396753,
      "end": 2397593,
      "timestamp": "39:56"
    },
    {
      "speaker": "Yugo",
      "text": "そういえば。そうですね。マイスラーシに行かなきゃいけない。行ったことないし、ちょうど行ってみたいなんですよ。",
      "start": 2397593,
      "end": 2405022,
      "timestamp": "39:57"
    },
    {
      "speaker": "Ryo",
      "text": "前の会社でね、お給料ちょっとヤバいよねってのを知ってて、フログもなんかできることないかなって思って。そしたらちょうどイエゴさんがこの会社受けようかなと言っ。",
      "start": 2405022,
      "end": 2413494,
      "timestamp": "40:05"
    },
    {
      "speaker": "Yugo",
      "text": "ててあれどうやって見つけ。",
      "start": 2413494,
      "end": 2415855,
      "timestamp": "40:13"
    },
    {
      "speaker": "Ryo",
      "text": "たんだっけフロックのね。",
      "start": 2415855,
      "end": 2417637,
      "timestamp": "40:15"
    },
    {
      "speaker": "Yugo",
      "text": "確かにちゃんと会社のこと調べる人じゃないと使えない気がしますそもそも僕があの求人見つけて応募しようと思った会社名は違ったんですけどその会社っていろんな小さい会社を買収して大きくなっていたその一つのサービスの部門でフルスタックのエンジニア募集してたんですけどよくよく調べてみるとそのサービスってもともと違う会社でバンクマネーの会社でだったんですねでまあそういうのがあったらだいたい僕はフロックのメンタリストとかを見て何かリファレンスないかなと思って日々探しているんですよそうするとそのサービスネート一致する人がいたのでそれで見つけたよう見つけたよね本当に同じ求人でも確かに見つけられない人の方がいやそりゃそうでしょ多いかもな確かにアンテナの立て方に俺は驚愕したけどねそれ。",
      "start": 2417637,
      "end": 2467210,
      "timestamp": "40:17"
    },
    {
      "speaker": "Ryo",
      "text": "はオファーまでもらった?もらって、じゃあ結局スペアの方を選んだみたいな。",
      "start": 2467210,
      "end": 2473802,
      "timestamp": "41:07"
    },
    {
      "speaker": "Yugo",
      "text": "だからリファラルしてくれた。",
      "start": 2473802,
      "end": 2474873,
      "timestamp": "41:13"
    },
    {
      "speaker": "Ryo",
      "text": "方がいらっしゃって、一緒に挨拶行こうぜってね。",
      "start": 2474873,
      "end": 2478564,
      "timestamp": "41:14"
    },
    {
      "speaker": "Yugo",
      "text": "いいですね。",
      "start": 2478564,
      "end": 2479094,
      "timestamp": "41:18"
    },
    {
      "speaker": "Ryo",
      "text": "ビクトリア旅行行こうぜ!そしたら最後に、2つ優吾くんからアドバイスをしてもらいたいなと思って、1つはジェネラルでこれから来る人、にまあこれからエンジニアとしてくる人かなどんなアドバイスをするかっていうのと質問だけ2つ言っちゃうともう一つは結構僕が知ってる中でいう僕みたいに日本でもエンジニアとして結構活躍してていいまあもともと知られている会社にいてこっちに来る人結構少ないと思うんですけどそういう人たちに向けてもまあスペシフィックにというかアドバイスがあればちょっと欲しいなぁどっちからでも思いつく方。",
      "start": 2479094,
      "end": 2518850,
      "timestamp": "41:19"
    },
    {
      "speaker": "Yugo",
      "text": "からジェラルのアドバイスの方エンジニアとしてこっち来た人のアドバイスはやっぱなんかなんすかね自分の人生でアジャイル回していけみたいなそんな感じですか?めげすぎる?めげすぎる?",
      "start": 2518850,
      "end": 2532235,
      "timestamp": "41:58"
    },
    {
      "speaker": "Ryo",
      "text": "いやなんかちょっと結構抽象的ですけどもうちょっと詳しく知りたいな。",
      "start": 2532235,
      "end": 2537416,
      "timestamp": "42:12"
    },
    {
      "speaker": "Yugo",
      "text": "こっちに来ても思うし日本にいてなんかあんまり物事うまくいかないなっていう人エンジニアに限らずだったかもしれないですけど見てみると頑張ってないパターンか頑張ってるけど同じことをリピートしてる人が多いよ。",
      "start": 2537416,
      "end": 2552484,
      "timestamp": "42:17"
    },
    {
      "speaker": "Ryo",
      "text": "ね頑張り方が間違ってる的。",
      "start": 2552484,
      "end": 2554065,
      "timestamp": "42:32"
    },
    {
      "speaker": "Yugo",
      "text": "なそうです頑張ってないことはないけどなんか同じことを繰り返していてちゃんと確かに労力はかけて汗もかいてるんだけどあんまりそのなんて言うんですかねやってることの結果を確認していないのであんまり目指す方向に進んでないみたいなだから英語の学習とかちょっとジェネラルすぎるかな英語の学習とかもそうだと思うんですけどまあなんだろう勉強方法ていくらでもあると思うんですけどだからそのリスニングの練習だけを勉強だけをしていてもスピーチってまあその上上手くなるじゃないですかでもリスニングの勉強をしていてスピーキングの力が伸びないなって悩んでる人ってまあ努力してないわけではない努力の方向性が間違っ。",
      "start": 2554065,
      "end": 2596752,
      "timestamp": "42:34"
    },
    {
      "speaker": "Ryo",
      "text": "てるなんか現在地と目標をちゃんと設定してそれに合わせた努力をしようみたいな感じ。",
      "start": 2596752,
      "end": 2604177,
      "timestamp": "43:16"
    },
    {
      "speaker": "Yugo",
      "text": "ですかねでかつそういうのはまあいろんな本を読んでどういうかの仕方とかっていうのを学べると思うんですけども結局自分でやってみないとあのなんだろう自分の血肉にならないところあると思うんで日々そういう努力をやっていく中でなんかその努力の方向性自体も確認して毎回毎回同じすることを同じことをするんじゃなくてちゃんとそれで結果が出てるかとかちょっと結果に近づいてるかっていうことを確認して徐々にこう上に行けるようにねサイクルを回していくみたいなスピードを回していくみたいな素晴らしい。",
      "start": 2604177,
      "end": 2639789,
      "timestamp": "43:24"
    },
    {
      "speaker": "Ryo",
      "text": "何かの本で読んだ。",
      "start": 2639789,
      "end": 2640609,
      "timestamp": "43:59"
    },
    {
      "speaker": "Yugo",
      "text": "んですけどなんかそういうので努力をして結果が出ない人は同じことをリピートしている本当に必要なのはイテレートだみたいなことを言っているイテレートはまあリピートとは似てるんですけれども毎回毎回の試行錯誤でちょっとずつ方法を変えていって徐々にサイクルを回していって、どんどん目標に近づいていくみたいな。それは単純に同じことをするリピートとは全然似ていないものだよっていうことを、ちょっとどの本か忘れましたけど、言ってる人がいて。",
      "start": 2640609,
      "end": 2668921,
      "timestamp": "44:00"
    },
    {
      "speaker": "Ryo",
      "text": "PDCAみたいな感じですね。",
      "start": 2668921,
      "end": 2669982,
      "timestamp": "44:28"
    },
    {
      "speaker": "Yugo",
      "text": "そうですね、PDCAそうです。",
      "start": 2669982,
      "end": 2671931,
      "timestamp": "44:29"
    },
    {
      "speaker": "Ryo",
      "text": "そしたらが際最後にそのなんだろうないう僕みたいな興奮の人もしくはもうすでにエンジニアとして会社で働いている人向けてなんかそれでまぁちょっと来ることを考えているような人がいたとしたらどんな。",
      "start": 2671941,
      "end": 2688053,
      "timestamp": "44:31"
    },
    {
      "speaker": "Yugo",
      "text": "アドバイスをしますかまあ考えてる人がいたとするなら技術力は多分問題ない気がするのであとは英語力とコミュ力が大事だなコミュニケーション能力の大切さがすごいこっちで身に染みたというか日本だとエンジニアがずっと足りないっていうこともあって別にあんまりコミュニケーション能力を身につけてなくても技術力があれば相手側が補完してくれて何度かあるみたいなことが多かったなっていう印象だしあんまり自分も人とコミュニケーションするためにどうすればいいかとか考えたことはなかったんですけどやっぱ福井の市場だとまあ人手不足っていうよりかはエンジニーになりたい人とか転職したい人が溢れてるので技術力あるのは当然のことであとはいかにこう相手と一緒に一緒に働いてもらいたいと思う人になるかどうかなんか日本だとたまにこの最近もなんかエンジニアはいいやつあるべきみたいな現実が嫌いっていう人はいたんですけど気持ちはわかるんだけど国米の市場に来るんだったらいい奴になる必要は何らかあるあとはそれになるためにはやっぱり英語力が必要なので英語は何せお土田だなという感じはありますねプラスであの僕みたいなその日本で流す空もまあそうですね日本で流している会社で働いている人がこっちに来ない理由の一つまあ別に日本の中ではかなりいい給料をもらっていいタイプなのでこっちに来るインセンティブがないからなのかなと思うんですけど僕も別に最初は給料が目的っていうよりかは人生で後悔を残さないために海外で働いてみてこっちに来てみたので、そもそもリセーフが違ったんですけどやっぱりこっち来て思うのは、同じことをしててもさっきも言った通り、給料全然違うし、2倍とか3倍になるんだっていうことが分かったので本当にそれが普通なんだよっていうことをなんか自分もこれから自慢したいというよりかは、そういうことを普通のこととして発信していって、自分と似たような教育者がこっちに来て仲良くなれば嬉しいなと思っているので。",
      "start": 2688053,
      "end": 2821002,
      "timestamp": "44:48"
    },
    {
      "speaker": "Ryo",
      "text": "今はGogleも手に届く雲の上の存在じゃない?いや、。",
      "start": 2821002,
      "end": 2824115,
      "timestamp": "47:01"
    },
    {
      "speaker": "Yugo",
      "text": "あれですね。ちょっとあれですけど。Gogleとか面接は難しそうだから、めっちゃ対策しなきゃいけないなという気がします。",
      "start": 2824115,
      "end": 2832542,
      "timestamp": "47:04"
    },
    {
      "speaker": "Ryo",
      "text": "なんかあとは僕が感じたことなんですけどその特に日本で強かったエンジニアの人たちがなんか困ってるというかあのつまずいてるなーってタイミングさっきのコミュニケーションの取り方であのなんだろうその日本だとやっぱりいくらでももう来てくださいみたいな感じわけじゃないですかやっほんそうですねでこっちだと一つのポジションに200人とか300人分くるのが普通なんでなんかそこでなんかあの頑張らなくても日本だと頑張らなくてもいいレジュメなんて別に書かなくてもよかったよぐらいで行けてた人たちがこっちに来てそれをやらないといけなくてそこになんかそのマインドセットの違いに結構つまずいてるなぁみたいなもんそこは何か意欲はどういうふうに変えたのかなっていうのが結構それともまあ何も何もなく勝手に変わったのか。",
      "start": 2832552,
      "end": 2880410,
      "timestamp": "47:12"
    },
    {
      "speaker": "Yugo",
      "text": "いやまあそれは面接とかしてみてうまくいかない経験で自分の日本で培ったプライドをぶち殺すしかなんかノートにも書いたのかなしかも日本でエンジニア経験の人と話せば似たようなことを言ってる人多くて多いですね日本めちゃくちゃ言葉を選ばずに言うと日本の転職ってゆるゲーだよ。",
      "start": 2880410,
      "end": 2901089,
      "timestamp": "48:00"
    },
    {
      "speaker": "Ryo",
      "text": "ねまあ無理よね別に。",
      "start": 2901089,
      "end": 2903130,
      "timestamp": "48:21"
    },
    {
      "speaker": "Yugo",
      "text": "そういうあのまあ転職サイトで登録すれば会社側からリクルーター側からメッセージが届いてまぁこっちがもう会社を選ぶ勢いでカジュアル面談させて。",
      "start": 2903130,
      "end": 2914237,
      "timestamp": "48:23"
    },
    {
      "speaker": "Ryo",
      "text": "もらって売り手市場だよね。",
      "start": 2914237,
      "end": 2916258,
      "timestamp": "48:34"
    },
    {
      "speaker": "Yugo",
      "text": "こっちが気に入ったらメッセージしてやってもいいけどみたいなぐらいの市場で来ちゃってるともうその前のセットを日本に間に変えるのはほぼ無理かなと思ってこれ何回フロックで。",
      "start": 2916258,
      "end": 2930451,
      "timestamp": "48:36"
    },
    {
      "speaker": "Ryo",
      "text": "説明会で話しても伝わらないんだよねやっぱりその。",
      "start": 2930451,
      "end": 2932812,
      "timestamp": "48:50"
    },
    {
      "speaker": "Yugo",
      "text": "打ち砕くにはもうそうじゃない市場に出て一旦それでは通用しないんだってことはもう心の底から。",
      "start": 2932812,
      "end": 2940154,
      "timestamp": "48:52"
    },
    {
      "speaker": "Ryo",
      "text": "実感するあとあれですねさっきのジェネラルのアドバイスでも言ったけどイテレイトマッサージャーとかがそれに気づいて僕が見てきた人たちも気づいてはいるんですよねそこからが大変だろうなでも。",
      "start": 2940154,
      "end": 2956419,
      "timestamp": "49:00"
    },
    {
      "speaker": "Yugo",
      "text": "難しいなぁそこはもうなんかそういうマインドセットというか心の持ちような話だから結構もしかしたら岩内の性格特化があるのかもしれないですけどあんまりこれうまくいかなかったからといってなんか自分が悪いと考えすぎないことは大事かな。",
      "start": 2956419,
      "end": 2976410,
      "timestamp": "49:16"
    },
    {
      "speaker": "Ryo",
      "text": "といや間違いないよ市場の。",
      "start": 2976410,
      "end": 2978371,
      "timestamp": "49:36"
    },
    {
      "speaker": "Yugo",
      "text": "景気もあるしもしかかこっちでもし自分がカナダとかアメリカで生まれて同じようなエンジニアリングの勉強してたら多分うまくいってたんだろうなと思うしこっちで生まれてなんか英語に苦労せずにというか英語のネイティブの人が経験積んでこっちのいい会社で働く働けてる人がいたとしてももしその人が日本に生まれてたら同じ頭の良さを持ってたとしても英語の壁がプラスアルファであるからうまくいけなかったのかなとかを考えると半分自分のせいかもしれないけどまあ半分自分のせいじゃないなとそういうところもあるのでそこはなんかうまくこうまあ何事も自分の責任と捉えた方が伸びが早いという人もいますけどそれを考えすぎて落ち込んじゃったらね落ち込むこともないのでそこは実際問題自分のせいじゃないことの方が多いからうまくその自責志向とか責志向を使い分けてうまくこう自分のマインドというか心が折れないように頑張れるといいのかなぁと思ったりしてますね。",
      "start": 2978371,
      "end": 3037498,
      "timestamp": "49:38"
    },
    {
      "speaker": "Ryo",
      "text": "ありがとうございました。今回は後半は就職して、金額とその後どういう違いがあったかみたいなことを話してもらいました。ありがとうございました。",
      "start": 3037498,
      "end": 3049781,
      "timestamp": "50:37"
    }
  ],
  "highlight1": "衝撃の年収1600万円！カナダのソフトウェアデベロッパーが語る日本では考えられない高収入の世界",
  "highlight2": "知らないと損！日本とカナダのエンジニア市場の驚くほどの大きな違いとは何か？",
  "highlight3": "99%が失敗する！カナダでのジョブハンティングに成功するための秘訣、転職を繰り返すことで年収が2倍になる 놀라운事実"
}