{
  "episodeGuid": "f2e25653-2229-4b80-a261-54ea62c2e83d",
  "episodeTitle": "【特別回】海外エンジニア3人が語る！挫折しない英語学習のリアルとモチベーション維持術",
  "transcribedAt": "2025-11-23T02:15:14.074Z",
  "duration": 3739,
  "fullText": "それでは今回は英語について話していこうかなと思うんですけどホストは僕と彩香さんでゲストには前にインタビューで出てもらった優斗くんに来ていただきました優斗くんはなんか周りの情報によると英語がすごい上手だっていうことなんでちょっとどうやって勉強したのかとかモチベーションどうやって保ったのかとかそこらへんを聞いていけたらいいかなと思うんですけどちょっとまぁ今回初めて聞く人のためにちょっと優斗くんからじゃあ自己紹介をお願い。してもらっていいですかはい、一度前にポドキャストを出させてもらった優斗です英語に関してのメジャーな経験としては大学の時によく一人でバックパッカーをしていたりだとかその後にフィリピンの語学留学とオーストラリアとニュージーランドにワーキングホリデーに行っていて、で、あと、アメリカ人の彼女がいたりとか、そういうので基本的に英語を伸ばしてきたと思っています。今日はよろしくお願いします。お願いします。あやかさんは何回も出てもらって、ホストやってもらってるんで大丈夫だと思うんですけど、どんな英語の勉強をしてきたかみたいなのを簡単に教えてくれると。えっと、大学受験の時に、やっぱり結構高校が英語に力を入れてる高校だったので、なんかこう徹底的に文法と単語を知って、そこのこう、理想的な土台はその期間にできたかなと思っていて、で私は大学の時に、バイリンガルのポッドキャストを英語と日本語のポッドキャストを聞くのにはまってた時期があってその時から英語がペラペラの人に憧れを抱いてちょっと勉強しようと思って大学生の時に喋るとか聞くコミュニケーションメインの勉強を始めましたボランティアとか行ったりとか海外旅行好きだったのでおちょこ英語を話す機会が大学の時からあってで、カナダに来たのが4年前なんでカナダでは英語を仕事でも使って実践的なトレーニングを日々生きながらしているって感じです勉強方法はできるだけインプットとアウトプットをバランスよくしたいなと思っているけどインプットは英語でポッドキャストを聞いたりとか英語で読書したりとか英語の本を読んだりとかですねでアウトプットはえっとシャドウイングとリピーティングを時々自分で時間を作ってやろうとしているいや頑張っているとまあ日々の生活ですねでボキャブラリーがこう減っていくので同じ単語ばっかり使うようになっちゃうので、ボキャブラリー増やそうと思って、こう意識的に新しい単語に出会った時はメモしちゃうように。僕はどこからだっけ?僕あんまり高校、大学受験僕してなくて、で、高校もなんか工業系のなんか英語とか全然力入れてないし、自分でも力入れてなかったので、全然文法とかなんだろう、単語はダメダメだったんですけど一番最初は高い時に3、4年目ぐらいまで結構残業とかもしてちゃんと働いて疲れたなぁと思ってフィリピンに2、3ヶ月行こうって思ってなんかフィリピンでバケーションだみたいなのででもなんか何もしないのもあれだからと思ってなんか英語の学校に行ったみたいなところから始まってで、そこで何だろう英語は喋れないんけどなんか会話をするみたいなのをはできるようになってそこからなんか英語喋れなかった全然喋れなかったくせに喋れるようになったと勘違いをして外資にまあうまいこと受かったっていうのもあり言ったんですけど外資なのに全然英語使わないじゃんって思ってなんかじゃあ違う国で働こうみたいなので今カナダにいるんですけどでさすがにその単語力とか文法とかがなさすぎるからなんかイングリッシュカンパニーっていうなんかライザップの英語版みたいなライザップって知ってます?2人知ってます?イングリッシュカンパニーなんか3ヶ月でこんなに痩せるぜみたいなそうそうそう流行ってたと思うんですけどあの頃でなんか英語のライザップみたいな感じで売り出しているところがあってそこはなんか本当に毎日100単語ずつ覚えさせられてで、なんか一応トイックで、その1ヶ月100点上げようみたいなのを目標に、でもなんか割と、でも東洋は何だろう、インプットの量が多いから結構英語力はみっとみたいな感じだったのかなっていうのが3ヶ月やって、そっからちょっとしてカナダに来て、あと、まあなんかその日本人以外のパートナーみたいなちょこちょこいたり今のまあ今も僕結婚してるんですけどパートナーがえっとブラジルの人ですごい英語の上手な人なのでまぁなんかそこらへんかなまぁあとはあのもうこっち来て8年っていうのとえっと3社くらい経験会社は3社目なんでなんかそういうところで勉強してきたかなどっから話しましょうなんかなんだろう英語を話せるようになって、よかったですか?なんか、いいことから。結構、つらいじゃないですか?英語を勉強し続けるのって、モチベーションもそうだし。わかんない、僕は、なんか、僕は結構、つらいというか、その、なんだろう、挫折して、そっから勉強するみたいなタイプだったんで、結構、ネガティブなところから割と入ってるかなって感じですけど、英語なんかできるようになってよかった。2人多分、もともと興味あってって感じですね。よかったこと、どうだろう。なんか手段として、英語がないと生きていけない環境に今いるから、なんか特別自分が英語しゃべれるなと思わないし、。なんだろう。どうだろう、英語で、英語を使って仕事活躍できたとかも、なんか時々英語を使う人だったら思うのかもしれないけど、毎日使ってなんか、思わない。確かに、なんかこれあんまり良いこと何も言えないかも。僕たちって多分、このフロックっていうコミュニティの中では多分きっと英語喋れる方ではあるじゃないですか。まあもう仕事一応英語使ってできてるし、でも会社とかでは別に英語喋れる方とかでもないし、むしろ全然喋れない方じゃん、。英語だと。そう、。相対的に見たらね、周りがペラペラすぎて、危険を感じることの方が多いけど、。まあでも少なくともそのこっちで仕事を見つけ普通に働けてるっていうのはまあやっぱり英語喋れるからっていうのは。一番でかいと思うなんかこの頃ツイッターとかでもエンジニアの人たちすぐお金の話するとか言って言われてるの多いけどまあそれでいうその流れで言うとまあこっちで英語喋れてエンジニアをやると給料稼げるってのはまあ一ついいことなのかもねそういう人たちに叩かれそうだけど。でもあとはやっぱりこっちのなんか働くカルチャーが好きであればそこも英語を喋るメリットがある結局喋れることによってこっちで働けてお金も増えるし仕事もそこまで日本行った時よりは多分みんなきつくないと思う人が。多いかな確かにホワイトな企業は基本的に多いです。ね。なんかあんまりできるようになって良かったこと全然出てこないです。そんなに良くないのか。いや、。どうしたら良いのか。もう1個ありますよ。なんか旅行した時にいや、めちゃくちゃ楽しいですね。英語喋れた方が。確かに。それはそうだね。確かに。旅行するとパートルが塞がるよね。そうですね。確かにそれで言うと、ヨーロッパとか行っても英語話せってたらなんか堂々と行ける感ない?なんか俺別に喋れるよみたいなので喋れる系の。アジア人だよみたいなもちろん。そっちも喋れるような感じで行くよね日本人だとさ日本人だとっていうか英語喋れなかった時はさスペイン行ったらちょっとスパニッシュなんか適当に頑張って喋った方がいいのかなみたいなのとか思いながらあまり喋れずに行くんだけど基本的には英語で通じそうだからなんか誰にでもなんだろうなんてガツガツいけるではないけどいけるみたいなのはあるかもしれないね。確かになんかそういう意味で言うと自信は多少ないともつく気がしますね英語喋れるようになると。あとツアーを使わなくていいこれわかんない他の人は気にしないのかもしれないけど僕なんかツアーとかみたいになんか自分の時間決められるのがめちゃくちゃ嫌でだから自分のなんだろう、時間で行きたいから、ツアーとか使うと結構なんか、すごい嫌なんだけど、そういうのもいらないし、情報収集とかも英語でできるから、まあなんか、旅行の時とかも、まあ安上がりというか、ツアー使わないから安上がりだったり、まあ自由行動が増えたりとかってあるかも。あとはなんかその情報収集で言うとエンジニアに特にあると思うんですけどやっぱりその海外の記事とか英語の記事の方がいいものとかもあったりするんで自分たちの場合日本語の記事も読めるし英語の記事も読めるしYouTbeとかもしかり情報のそのターゲットがめっちゃ広いんでなんか自分で触ったことない技術で何か作ってみようとかになった時にめっちゃ助かるなと思う特にyoutbeとかがやっぱり日本だと技術系のyoutbeってあんまりないけど海外の方がチュートリアル系とか本当に何でもあるんでなんか。すごい助かるな意外といいことはそんなないんですね意外とない。次行きましょう。英語の学習って、やっぱりモチベーションの維持がめちゃくちゃ大変だと思うんだけど、海外にいるから、僕たちは割とモチベーション高くいれるっていうのは多分あると思うけど、2人は特に日本の時から結構勉強されてきたと思うんですけど、どういうふうに英語の学習を続けてきましたか?なんかコツとかありますか?モチベーションのコツ。どうぞ、先に。あ、いや、。ちょっと聞きたかった。モチベーションを保つコツですか?そうですね。特に日本にいる人に向けてってことですよね。そう、日本で学習すると結構大変だと思うんだけど。やっぱり、こう、時々は、英語を使う場に出ていて、いかにこう話すのって、やっぱり難しいじゃないですか。間の取り方とか、なんだろう。やっぱりリスニングも入ってくると、こう、自分一人でしゃべるのがいくいちとか、準備したプレゼントが大丈夫な人がいたとしても、いざ外国人の人と話すときに、外だと周りがガヤガヤして、話すってなると、全然まったくちがうスキルが壊れると思うし、そういうのを、やっぱり日本にいても経験できる場はあると思うから、そういうところに行ってみて、どれだけ自分ができるのか。できなかったら、たぶんもっとやろうと思うし、私も大学生のときは、よく海外旅行に行ったりとかしてたし、ボランティアとか行ってたし、働いたりもしてたから、その時にうまくいかなかったこととかを持ち帰って、悔しい思いを持ち帰って、やるっていう感じだったかなって思います。確かに、環境作るのはめちゃくちゃ大切ですよね。僕も割と東京で同じようなことをしてて、で、なんだろう、そのミートアップみたいなところにいっぱいいったりだとか、で、一人、もともと、その、台湾人系のカナダ人、あの、バンクーバー出身の人と友達になって、で、その人と僕、すっごい仲良くて、ちょうどカナダ来る、フィリピン行った後で、カナダ来る前の2年ぐらいが、すごい仲良かったんで、結構、毎、よく毎週遊ぶとか、みたいなのしてて、なんか、そういうのは、めちゃくちゃ、いいかもしれないです。その、それこそ、うわ、こういうの喋れなかった、って思って勉強したりだとか、なんか、それこそ、あやかさんがさっき言った、なんか、ラジオとかから流れてくる綺麗な音は聞こえるんだけど、ガヤガヤしてるところだと、日本語は拾えるのに、英語は全然耳が聞き取ってくんないみたいなのも、最初の頃あったりして、確かにそういうのに慣れるみたいなの、めちゃくちゃ大切だし、そういう環境がいっぱいあると、なんか、あ、英語勉強しないとなって思う機会はめっちゃ増えそうです。ゆうとくん、。あります?なんか自分は嫌な思いをしたからっていうよりもどっちかっていうと例えばその海外旅行行った時にまた行った時に喋れたらもっと楽しいだろうなぁみたいのを日々考えて過ごしていたのでなんかこれ英語勉強してもっと楽しんじゃおうみたいな感じで自分にモチベーションを与え続けてます私まあなんかそのもともと海外に行きたい、海外でエンジニアになりたいっていうのはずっと思ってたのでまあそこはなんかそんなに長くずっとモチベーション保てるかっていうのは人によるかなとは思うんですけどやっぱりなんかそのこういうふうにしたいっていうのを定期的に考えてまあそのために英語が必要だからちょっと楽しむ、人生楽しむために英語やろうかみたいな感じで。その未来のためっていうのは、それはもう確定した未来のためなの?それとも、ふわっとしたものなの?なんか僕はさ、例えばさ、再来月に旅行行くとか、海外に旅行に行くとかっていう、決まった未来に対してはそのモチベーションを保てるんだけど、次、なんか別に予定もしまだしてないけど、次行った時には英語もっと話せるようになったら楽しいなみたいなのを、ちょっと想像力の欠如か分からないんだけど、あんまりそういうことができなくて、なんだろう。いやなんか多分自分の場合勝手にもうなんか行けるだろうって思っててなんかいつかはいける海外でエンジニアになれるだろうっていうのを勝手に信じ込ませてたのでだからなんかすごいクリアーに自分の中で見えててじゃあそれだったらまあそれをクリアにするために逆になんか英語をやんないとだよなみたいな感じです。なんか海外で働きたいって思う人たくさんいるけど、なんかそのきっかけって何なんですかね?なんか人によると思うけど、周りにそういう人がいたとか、私の場合は周り、家族も親戚も、あんまりそんな海外志向の人いなくて、私だけちょっと変な人なんですよ、家族の中では。ずっと昔から会って、私も海外で過ごしてみたいなって。なんか留学も行きたかったけど、まあ働いてから行こうかなとか、ずっと思ってて。うん、確かに、でもそういう目標がぼやっとでもあれば、ちょっと英語でお接するようになるだろうから、ちょっとずっとやっていこうかなって思ってたのもあるから、そういうビジョンがある人はいいと思うけど、全くない人は、まあ全くないでいいのか、それはそれで。でも全くなかったらもう別にいかないんじゃない?全然英語もいらないもんね。たぶんそれだったら英語いらなそう。なんかなんとなくそれこそ英語をやった方がいいんじゃないかみたいな感じで英語やってると絶対やっぱ続かないです。それは難しいね。なんか結構いるじゃないですかそういう人も例えばなんか時間余ってるからなんか勉強しようかじゃあまあ出てくるのは英語だよなって言って英語やって1ヶ月ぐらい1ヶ月はまあ多分続かないと思う。それで英語続かないんだよねっていうのは、やっぱり目標とか、なんかしたいこと、英語でしたいこととかがないから、まあそうなるよね、。と。2人は、なんか日本人以外のパートナーがいたことがある、もしくは今いるじゃないですか。これについてはどう思います?僕結構やっぱいいなって思って、僕も何人か彼女がいて、結構その時に学んだというか、なんだろ、学んだ?その人から学んだのかは分からないけど、結構その時に成長した、伸びたなって思うんですけど。うん、そうです。なんかその、喋る機会がやっぱり多くなりますよね。自分がいた時はカナダじゃなくて、日本にいた時だったんですけど、それこそ日本だと本当に喋る機会ってかなり限られるので、それで、その海外の彼女がいたっていうのは、めちゃめちゃアドバンテージ。自分の中で英語の、なんだろう、スキルアップに、まあ、ちょっと言い方悪いですけど、すごい伸びたなとは思いますね。いや、めちゃ思うと思う。なんか、なんだろう、ナーナーになるって話は聞きません?私は、私ももちろん、なんかその、全く話せる状況がない人が、誰かと海外の人と付き合って、英語話す機会ができたから、もう強制的に話さないといけないし、聞かないといけないから、それはすごいプラスだと思うんだけど、あるところまで関係性が発展したりして、長い間一緒にいたりすると、なんか、二人の関係の中で、こう、コミュニケーションを向上させようみたいなものが、ちょっとなあなあになってきて、雰囲気で伝わることとかも増えてきて、ちょっとこう、成長曲線が平らになってくる時が、来るのもあるんじゃないかなと思ったけど。最初はすごいいいよね。最初はすごい、だし、一人付き合って、別れたとして、次の人付き合うと、その人が使うボキャブラリーが違ったりするから、その最初のほう、最初の1年ぐらいは確かにやっぱめちゃくちゃなんか喋る機会も多くなるし、おーって感じになるけど、その後は確かになんかその2人の言葉みたいなのとか、言葉を使わなくて、通じるものがどんどん増えてって、てのはあるかも。でも、それでもなんか、今とか僕、なんだろうな、仕事とかで言えなかったこととかを軽く聞いたりとかなんかそのわざわざ調べないけどこれってどういうふうに言ったらよかったんだろうみたいなのをたまに会話でする時とかもあるからそういう意味で言うとまあなんかその確かにその成長曲線みたいなのはまあ良くないけどまあそういうのがなんか普段から聞ける環境にあるっていうのはいいなっていうのとなんかこれ結構カナダ特有、バンクーバー特有なのかもしれないけど、アジア人、日本人も含めてアジア人めちゃくちゃ多いじゃないですか。ワンチャンなんだろう、バンクーバーって日本語だけで生きていけちゃうじゃないですか。全く喋らなくても全然。そうですね。ジャパレスで働いてさ、買い物とかも別に英語なんか使わなくてもいいし、もちろんなんかリスニングちょっとは必要だし、とかはあるけど、全然いけちゃうじゃん。だからなんか、そういう人とかにはまあ、おすすめって言ったらいいね。なんか一人でできるもんでもないから付き合うって、あれだけど。日常会話がすごいカバーされる気がする。恋人、恋人じゃなくてもそのルームメイトとかでもいいと思うんだけど、すごい身近に英語を話す人がいる。かゆいところに手が届かないけど、普段すごい身近にあるのに言えないことって結構あると思うけど、それが普段一緒に生活してると使うからやっぱり。でもエンジニアとして何か必要な単語とかが増えるかっていうとそれはあんまり関係ないですよねパートナー。がエンジニアだったらバラシャンそう。ですね確かにパートナーがエンジニアのネイティブだったらめっちゃ強いですねでもちょっと嫌だけどなパートナーが同じ職業嫌です。よどうだろうなぁ。絶対、エンジニア一緒なの嫌だな。確かに、エンジニア二人でっていうのは微妙かも。特にエンジニアっていうのが、あれだけど。でも、それが日本人じゃなかったら、わかんない、違うかもしれないしね。仕事は仕事、家は家みたいな人も結構いるし、わかんないけど。でも、仕事のやっぱり英語は、職場で一番身につくってのはあるよね。二人とも一緒目か。だから、僕、今3社目なんだけど、1社目、2社目、3社目で、それぞれなんか、やっぱ、毎回、英語難しいなっていう、最初の3ヶ月、4ヶ月ぐらいはあって、なんか、そのチーム特有、それこそさっき言ったようになんか、その、パートナー、そのパートナーが使うボキャブラリーみたいなのが、やっぱ会社だったり、チームの単位でもあって、その人たちの、なんて言うんだろう、まあすごい簡単なこととかはね、誰が言っても、グッドモーニングは誰が言ってもグッドモーニングだと思うんだけど、なんか、そのよく使われる言葉みたいなのとかがあって、それを覚えるのに結構時間が、まあ時間かかるというか、最初難しいなって感じたりとか、僕、1社目すごいインターナショナルな、特にスペイン系のアクセントの強い上司だったんだけど、2社目はみんなカナダ人の、特にトロントの会社だったから全然アジア人もなくて、すごい英語。で、3社目はみんな僕、アメリカのチームに配属されたから、みんなアメリカ人。結構もっと大変だった。なんか仕事のボキャブラリーとかはやっぱ仕事で一番覚えられる。のかなとでもなんかそれこそ日本にいる人がこれ聞いてるとしたら結構どうしようもないところもあるのか確かに確かに。でもそれこそその基盤があればなんとかなるんじゃないその最初確かにやっぱ苦労はするけどその日常会話はまあちょっと話せてそのボキャブラリーと文法力はありますって言ったらまあなんか入ってからなんとかなりはするじゃんそうですね、確かに、。それもめっちゃある。どっちかっていうと、伝えたいことがある方が大事な気がしてて、私、エンジニアにこっちでなって、英語で勉強してやり始めたんだけど、やっぱり元々のバックグラウンドがないと、エンジニアとしての。ディスカッションとかで意見を求められても、なんかエンジニアとして働いたことないから、なんて言うべきなんだろう、ここで、。みたいな。になることも多くて、最初の頃は特に。で、やっぱり日本でそういう、同じエンジニアとしての経歴がある人は、多分、わかる、何言ったらいいかわかると思うし、。技術的にこう。ジャバスクリプト喋れるよね、。みたいな。なんかエンジニアのコミュニケーションの仕方って多分あるじゃないですか日本でもなんかエンジニアが質問する時はこうやって質問しないといけないみたいな例えばなんか全部聞きすぎないである程度実装して自分で調べた上で聞くとかあ、。そうなるんだ?いや、まぁなんかその聞きすぎずみたいなこっちのベイブレーに聞けよ。みたいなこれはなんか例、なんだろうなんて言うんだ日本語が出てこないと?礼儀?マナーとかあんまこっちは気にされてないよね。え、でもあれじゃないですか、なんか例えば、それこそ今あったチャットGPDとかあるし、なんかあまりに簡単すぎることを聞くのはちょっと個人的には、これはちょっと調べようとはなるんですか?めっちゃ普通に、Oh,tismgbeaverysilquton,bIhavetoaskみたいな感じで聞くときもあるよ。えー、。あ、。そうなんだ。あと、リモートか現地にいるかっていうのもあって、隣にいて携帯いじってたら、もう聞けばよくねってなったりするのと、あとなんか、周りの人がすげえそういう質問を結構してると、。あれ、。じゃあいいんじゃね?みたいになったりもするかな。うん、。周りの人は結構そういう人多いかも。なんか僕も割と聞いちゃう。すごい。何がこう、知ってて当たり前だろうなのかわかんないよね。でもなんか、そもそもそんな知ってて当たり前だろうはなくない?なんかその聞きたくないっていうのは多分、こいつもこんなことも知らないエンジニアなんだって思われたくないとかっていうのがあるから、たまに聞かないこととかはあるけど、でもなんか割と聞けるかも、なんでも。うん、めっちゃ前置きするけど。なんかメッセージ書く方が時間長くなりそうだなみたいな時に調べたりするじゃないですか?それは直接、あ、そうだ、その何だろう会議とかでパッて思って調べるんじゃなくてそのまま聞いちゃうはあるけど一人でわざわざメッセージするんだったらその前に調べる。かもそうそうそうそうだから。なんかそこが大変だなあ、。そうなのどうだろう、場合によるか。あとは関係性にもよるくない?そのそういう人がいれば聞きやすい人僕あの今の会社で一番仲良い友達は会社の中で仲良い人は普通にプライベートでも遊ぶくらい仲良いんだけどその人はpmなんだけどpmだからやっぱなんかコミュニケーション能力がそもそも高いしなんかニュースがちゃんと入ってってるんだよねその人になんかエンジニアって結構会社で何が起こってるかわかんないみたいなあるじゃんわかんないある僕はあるんだけどそういう人なんでも結構オフィスのこととか新しい人とかもなんでも知ってるしなんかあのrsuじゃなくてえっとespsなんだっけ忘れちゃったあの自社株買うタイミングとかってあるんだけどそういうのとかもなんかなんかよくちゃんと情報仕入れてるから結構その仕事以外のこととかはその人にあれこれいつだったっけとか結構仲良いっていうのもあってもう調べずにいくみたいなのをやってるけどだから関係性にもよるのかなってのはあります。ちょっと英語のことから外れてきちゃったんで、ちょっと戻すと、なんか、この勉強法すごいよかったなとか、こういう勉強法おすすめだよ、みたいなのってあります。さっきなんか、あやかさん、シャドーイングとリピーティングって言ってたんだけど、。これをやったのは、耳をとりあえず鳴らすために、シャドーウィングはオススメだし、いろんな人が言ってるもんだって。けど、シャドーウィングだけじゃダメだなと思ったのが、日々英語をよく聞く機会があると、聞き流すのも得意になってきて、職場とかで長い会議とかに出てると、ちゃんと聞かなきゃいけないんだけど、すごい重要じゃないな、これとか思った瞬間にシャットアウトして、全然聞いてない時とかがあったりして、プラプラプラって早く言われた時とかに、聞き返すのも慣れてきたら、聞き返すのデフォになるとかも、良くないと思ったからちょっと一発でしっかり聞き取ってで長いことを喋られてもこうちゃんと追いついて全部聞けるっていう状態にしたいなって思った時にそのリピーティングはその耳に入ってきたことを1回自分の頭の中に留めてそれを自分の口から出すから留めてる間にちょっと解釈する間があるからちょっと内容を追いやすいなと思ってやってました。結構難しいんだけど、リピーティングに。日本語でも、なんか、バーって言われて、そのまま喋るの難しいから。教材とかはどういうのを使ってる?教材は、私はあんまりお金かけたくなくて、英語のリソース、すごいいろんなところに今、転がってるから、YouTbeとかPodcastで、よく聞くのが好きな人のやつを選んで、で、自分が興味ない内容だと、どんどん、続かないので興味あるなんか心理学とかのことを。聞いてますそれってでもなんか何回も同じのを聞いたりするんですか?なんか自分的にシャドーイングが自分もやったことあるんですけど続かなかった理由がなんか基本的に1回見たことあるやつとかを2回目とかでシャドーイングするみたいな感じだと思うんですけどそうなると全然面白くないなと思って全然通かなくてコツを。教えてほしいです同じコンテンツででも最初はやるかなそのシャドーイングもなんかこう詰まってたりする場所があると次のところに行ってもあんまり意味ないのかなだから短いやつを選ぶ方がいいんじゃないかななんかテッドトークとかでなんか10分とか、いやもう5分はないか、テッドトークだと。まあ短いやつ選んで、すぐに1回終えられる、1周終えられるやつにすると、なんか筋トレみたいな感じで、こう繰り返すのも甘くじゃないのかなって。長いやつをなんか、今回はその30分の中の5分しかできなかったとか、。いったとだんだんね、。しんどくなってくるから。いや、そうですね、。それやってましたね。私も長いやつは続かなかった。僕なんか、この頃シャドーテンをやったんだけど、コスパとかを考えると、相対的にはまぁなんかうんって感じだけど、良かったなって思うのは、そのフィードバックがやっぱりあって、自分がどこで詰まってて、どういう風にするとその詰まってるのが取れるのかみたいなのが分かるようになって、るからシャドーテンはすごい良かったなあっていうのがあってその後そのシャドーテンを僕は3ヶ月やってみたのかな中でやっぱ結構同じようなところで詰まるんだよねなんでその自分のパターンみたいなが見えてくるから1回シャドーテンをやってみてちょっと2人がやったことあるかどうかわかんないけどやってみてそれからなんかその他のものにその経験を生かしてみるといいかもしれないシャドウイングその短くやるとかっていうのもまあ多分いろいろ多分そのポイントみたいなのはいろいろあるんだけどその2回目3回目やってもわーっとなんかできなんかできてるようにはなるけどそのちゃんとここがうまくなったとかっていうのはあんまりないのとあとなんかその詰まるポイントがあってその詰まるポイントはいつも詰まってる感じないやってるときその他のその前後がうまくなることによってそのついていけるようにはなってるんだけど詰まるタイミングみたいなのは変わってないみたいなのが僕の場合はあってそこらへんそういうのをなんかそのシャドー10で何回も指摘されることによってあまたこれだとかっていうのがあって1回だけなんかそのあれシャドー10ってなんか1ヶ月2万5千円するから私やったこと。あるんですよ結構長いでやってたけど、高くて費用対効果としての大きな伸びみたいなものがなかったし、さっきもりょうさん言ってたみたいな、ある程度やったら自分のパターンとかも深めてきて、別にそれがわかってれば他の教材使っても、ね、そこを気をつけた方がいいのかってできるから、いいかとか思ってやめちゃった。シャドウイングのやり方の矯正を、なんか、その、するのにはありだよね、最初の方。2、3ヶ月やってみてってあると思う。シャドウテンの添削の人たちもチェックリストがあって、なんかリンキングとか、なんか太鼓の音の消失とか、そういうので多分チェックしてて、なんかそれをコンプリートさえすれば多分シャドウテンの何も言われなくなっちゃうと思うからなんかゲーム感覚でえ、。それってAIとかじゃないんですか?ほぼ使われてるよね、シャドウ10をやってるのとあと多分ちょっと僕それAIで作れるんじゃないと思ったんだけど調べてみたらなんかちょっと難しそうでなんか発音記号とかそこら辺なんか発音とかを確認するのがあんまりそこまで正確にまだできない多分技術的にもしかしたらできるのかもしれないけど、僕が調べた中ではできなくて、やっぱりその人がやるのにはまだ勝てないなっていう印象だったわ。だからできなそうなのと。ちなみになんか僕、彩香さんがお金をかけない、英語のリソースいっぱいあるからお金をかけないって言ったのに、ちょっと僕は逆だなって思って、僕は逆にお金をかけるようにしてて、それモチベーションもあるんだけど、なんか自分で集めようと思ったら確かに絶対集められるんだけどその集める時間を省略できるのとあとなんかお金をかけることでやっぱそのモチベーションの自分へのプレッシャーになるみたいなっていうのがあってそうお金やっぱかけたほうが僕にはねいいのかなって思うどうですか、ゆうとくんはどっち派です。かいやー自分はなんか日本行った時そもそも全然お金がなかったのでお金をかける選択肢がなかったっていうのはあるんですけどでもまあなんかその話聞いてやっぱりモチベーションをお金を払うことによってモチベーションは得れるなぁとはめっちゃ思いますだからなんかまあ今日本行った時よりはお金あるんでもしなんかがっつりそれこそPRのためにあの英語をちょっと伸ばさないとみたいな話になったらけっこうお金かけるのはけようかなとは思います。さっき言ったイングリッシュカンパニーっていうのが3ヶ月で55万から60万ぐらいするんだよね。だから、もうそれは元取らないといけないと思って頑張れたっていうのもあるし。3ヶ月とか決まってて、そこで集中してできる。でもサブスクリプションも結構僕それを同じようなのを感じて、さっきのシャドーテンもそうだし、25,000円か、じゃあちょっと毎日やるかみたいなのもあるから、僕は何だろう、お金もちろんお金をかけれるならっていうのと、かけなくても多分モチベーションを保てる人とかはいいんだろうけど、モチベーションやっぱちょっと管理に結構つまずいてる人たちは、ワンチャンちょっとお金かけてみてもいいんじゃないのかなっていうのはちょっとおすすめだったり。あとあの、デュオリンゴの戦略ってやっぱすごいなぁと思う。すごいすげー。今フランス語をデュオリンゴでやってるんだけど、絶対毎日やるもん。あのなんかストリートをちょっと止めたくないから。し、。怒られるしなんか。めっちゃ悲しんだりしちゃうし。そう、11時45分ぐらいになったらなんか、カウントダウン始まるし、やらなきゃって思うから、その感じでやっぱ、英語も、なんだろう、自分のこう、ハビットトラッカーとかで毎日つけていってて、そのアップができるの嫌だからとかって言われる人もいるかも。そのデュオリングほどハビットトラッカーのストリークの、あれうまくいってなくない?ハビットトラッカーとかさ、番号とかは出るしさ、ウィジェットに追加とかはできるけどさ、デュオリンゴほどのなんか強制力というかさ。なんだろうね、デュオリンゴの強制力って。いや、。デュオリンゴすごいですね。あれ多分もうガッツリそれこそなんかメンタル系の人が関わってそうですね、。開発。うん、なんかテッドトークでデュオリンゴの社長が語ってたんだよな。えー。俺も最初に見たか忘れちゃった。でもさ、なんか、僕デュオリンゴ、僕もポルトガル語をやってるんだけどさ、なんなら今もうすぐ500いくぐらい、500日いくぐらいやってるんだけどさ、日付、回数をためることが目的になっちゃうよね。うん、。なりますね。勉強あんまりできてない、ぶっちゃけ。もう僕そこは割り切って、確かに、割り切ればOK。でも、効率はよくはないよなっていうのは、ちょっと思っちゃってる。なんか、最初は特に単語だけやってて、特に英語と違って、ポルトガル語って全然僕たちが日常に接してこなかった言語だから、やっぱ単語はすごい大変で、だから単語を覚えるためにと思って最初やってたんだけど、で、なんか途中から、モチベーションが下がって、でもストリークは続けたいっていうので、結構適当にやるようになっちゃって。で、。この頃は適当にやってるんだけど、スピーキングだけをやるようにしてて、だから毎日絶対喋って、発音の勉強にはなってる、発音の練習はし続けてるみたいな状態をやってるんだけど、でもなんかすごい、デュオリンゴすごいし、いいけど、なんだろう、やれる人からしたら効率は良くないのかもしれないかな。デュオリンゴはちなみに課金してますか?課金してます。全部課金してる。でも、デオリンゴはそうだね、家族でうちのお母さんが使い始めて、ちょっとそれを助ける意味もあるみたいな。なんかちょっとうちのお母さんは、英語とか、うちの家族は弟2人は英語喋れるけど、親が喋れなくて、で、僕のパートナーと喋るためにちょっと英語の勉強を始めてくれたから、なんか助けられればいいなみたいなので、家族のを契約してるから、もう切れないっていうのも。今、その沼に陥ってる。すぐにいいよね、シェアできる。あと何でしたっけね、海外で働くのに必要な英語力はどれくらいでしたっけ?確かに、めちゃくちゃ大切。どのくらいあったら出るんだろう?でもそれこそ結構職場によるっていうのはありますよね。ネイティブが多いところとか、りょうさんのところみたいにアメリカの会社でこっちだったらアメリカの人とかもいっぱいいて、こっちにいたとしても大企業だったらだいたいネイティブの人が多くなるじゃないですか。ってなると求められるレベルというかは結構上がりますよね。確かに、なんかバンクーバーっていうのがすごい多分、英語が第一言語だけど、すごい海外の人に優しい英語をしゃべるというか、もうみんななんかその半分ぐらい、半分ぐらいは嘘かもしんないけど、アジア人と半々っていうのもあるし、その移民がめちゃくちゃ多いから、もともとしゃべれない人たちとしゃべるのに慣れてる環境みたいなのがあるから、でもなんかミニマムでしゃべると、ミニマムどのぐらいいけたらいけるんだろうね。働くのにでしょ。なんか喋るっていうよりかは、リスニングの方が大事なのかな。なんかスピーキングってその人の、なんだろう、性格にもよるのかなと思って、なんか結構度胸ある人が、別になんか間違ってもいいやっていう結構強気な人は、スピーキングは別に下手でもコミュニケーション取れるじゃない。そうですね。でもやっぱなんか、聞こえてきたことをちゃんと理解せずに、なんかコミュニケーション取っちゃうと、こいつ何のこっちゃになっちゃうから。確かに。最初はやっぱ、ミニマムは言われていること、全部じゃなくてもいいけど、聞き取って、わからないことを聞けるぐらいじゃないとだめ。信用に関わってくる。いいのを思いつきました。youtbeで、youtbeとかyudemとかで、普通にチュートリアルなり何なり、ネイティブの人の講座とかを完全に分かれば最低じゃないですか。結構難しくない?僕が僕が思いついたのは、あの、教育特有の勉強をせずに、教育の点数で800点取ればいけるかもしれない。あー、。いいかもいいかも。英語の、英語系の勉強とかなんかそのテスト系ってやっぱりさ、その対策ができちゃうじゃん。その対策することで、例えば、教育だと100点から200点ぐらい上げられたりするじゃん。たぶん。だからその対策っていうのをせずに、本当にもう自分の英語力だけで、別にスピーキングをちょっと1回抜いて、ソスで800点取れたら、まあ働けはするかもね。その、やっぱ言ってることは理解できそうだよね。ありそう。まあ、そうね、単語力とか文法力。単語と文法やっぱめちゃくちゃ大切じゃん。やっぱその理解しないといけないから。文法全くわからないとか、だと本当にむずいよね、。何言われてもわかんないですね。確かに。でもエンジニアじゃなければ多分もっと簡単なのとかあると、なんだろう、カフェとか難しいのかな?いや、カフェ、自分一回働いてたことあるんですけど、それこそワーホリの大学2年生の時のワーホリカフェだったんですけど、やっぱり基本的に同じ言葉しか喋らないので、結構、エンジニアの方が高いと思いますね。エンジニアだけの英語とかもあるし。今、私が聞いたことないよ。言うならば、コーヒーかお茶。出せればいいみたいな感じだ。もんね最悪何か詰めたら。どっちって言って難しいけどねきっと難しいけどでもやっぱその単語さえ分かれば分かりそうだ。もんねそうですね確かに。職種によるになっちゃうの。かなでも僕たちの場合ITの今バックグラウンドがあるんでやっぱエンジニアとかデザイナーデザイナーちょっと入れたくないなデザイナーめちゃくちゃ難しそうだからソフトウェアエンジニアだったらっていうのがいい。んじゃないデザイナー確かに結構難しいですね。自分はそのカレッジデザイン系のやつ半年行ってたんですけど、なんかデザインの方が英語の求められるレベルは高いかなと思います。デザイナーはビジネスのこともわかんないといけないしそうです。ねなんかUXのこととかもガッツリ話すんでそうしたらビジネス側のもガッツリ話せるようにならないといけないし実際なんかその求められるIRとかの方はもうあのデザインのあれが一番高かった。うんめちゃくちゃ難しいとうーんまあだからどうなんだろうスピーキングはなんかIELTSで4。\n5とかあればワンチャンいけんじゃないかなって僕は思ってるえ?6あったらもう結構いいと思うえ?4。\n5?いや、いけるでしょ?4。5はまずいじゃないですか?いや、。いけるよ。いける、いける。4。5ってどれくらいなんですか?だって、6じゃないとPR取れないしね。いや、。6じゃないとPRは取れないけど、だからリスニングは、リスニングっていうか、トイック800点自力で取れて、スピーキングは全然できないけど、4。\n5で生き残れはするんじゃないかなって。5か。じゃあ5でいこう。4。\n5、たしかにあんま聞いたことない。エンジニアはね、インタビューを乗り切らないといけないから、。そもそも。インタビューって、たぶん、最初はワンオンワンで、。たぶん、。ハイアリングマネージャーみたいな人がお話する。ワンオンワンは、絶対、椅子でこう、何だろう、会話の滞りなくできないと、。まずいと思う。そこまでかな。グループトークになると、え、ダメかな?多分、あやかさんは結構特殊なケースで、1冊目で結構いいところ行って、確かにその難しいと思う。でも、そのワンオワンでも、例えば上司が第一言語じゃなくて、その苦労を知ってたら結構汲み取ってくれたりするよ。本当?優しいな。だから、いやそう、そういう多分優しい世界線もあるし、。優しい世界線あるんだ。上司が、上司がスピーキング5。\n5とかあったら、5でも余裕かもしれない。それはない、。それはない、さすがにそれはない。それは、やばいでしょ。でも、でもなんか、確かにワンワンで喋れないって、でもそれさっき多分、あやかさんがさっき言ってたように、言いたい気持ちみたいなのが強ければ、伝えたい気持ちが強ければ、その、なんとかはなるじゃん。だって、800点の文法力と単語力はあるわけだから、。確かに。つなぎ合わせることができるのかな。そう。だからなんとか多分エンジニアだったら5で。5。5じゃないですか。5。5じゃないですか。いやいやいや、5でいけるでしょ。俺も結構まだ4。\n5よりだけど。なるほど。でもみんな違うっていう。でもサバイブだからね。うまくやれるじゃないよ。それがそこからもちろんその人は成長しないといけないけど、4。\n5から始められるんじゃないかなって、。僕は。確かに。その会社でも、そういう、組み取ってくれるような。そうそう。だから、どこでも入れるじゃなくて、そういう、ゆるいって言ったら、英語の優しい世界線の上司がいる会社に、引っかかるかもっていう意味です、。僕は。ネイティブスピーカーじゃない人が起用した会社とかだったら、そこまでかも。バンクーバーとか、結構多いもんね。ファンクーはそういう人が多いし、その上司がやっぱり第一言語が英語じゃないって、その苦労したのを知ってるから、エンジニアだから、書く行動さえ良ければみたいな、そこまでじゃないけど、書く行動が良くて、あと結構、スピーキングだけじゃなくて、スラックとかで結構しゃべれたりするから、で、この800あれば、トイック800あれば、そこらへんはなんとかなりそうじゃん。文法力を駆使して書く内容はすごいちゃんとしてるってなれば、結構印象は違うかも。やっぱりスラックでメッセージすることも頻繁にあるから。あとなんかこっちあるあるかもしれないけど、相手のコミュニケーション能力が高すぎて、全然伝わってないかもしれないのに、向こうが全部汲み取ってくれるパターン。そんなことある?でも、たぶん、本人もそこまでわかってないと思うんだけど、たぶん、番組はあるあるかな。なんかやっぱり、自分の親とかが、そんなに英語が上手じゃない。とかっていう人が、。すごい理解能力高くて、断片断片でしか多分伝わってないはずなのに、すっごい頭の中で繋ぎ合わせて、こういうことだよねとか言った時に全て合ってて、すげーこの人って思うとか。いるいるいる。僕、よく中国系の3世、4世、2世、3世とかが多いじゃん、やっぱりカナダって。その人たちの、英語はちゃんと上手なのに、僕たちの英語を理解してくれる能力は、確かにめちゃくちゃすごいかもしれない。すごいよね、感動したもん。すごい初期に、なんかすごい助けられた。そしたら最後に、2人ともこっちでもう仕事されてると思うんですけど、仕事してる中でこういうところ苦労したよ、英語で苦労したよみたいなのあります?たくさんあると思う、特にあれば。はい苦労したのなんか自分がその知らない領域とかを任された時にそれこそなんか英単語とかもあんまり知らないしでなんかミーティングの時に知らない領域なんでめちゃめちゃ頭を使わないといけなくてでかつ英語でそれを喋らないといけない説明しないといけないみたいなになったとき。例えば違う領域ってどういう領域。なのなんか自分今2社目なんですけどあの1社目の時はもうめちゃめちゃフルスタックでデザインもやってみたいのをやらされててでなんかそのサーバー周りとか全然自分得意じゃないんですけど人数がいないから自分がそっちもやらないといけないクラウドがとかもやらないといけないってなって上司にどんな感じって報告してる時とかでめっちゃ掘られたりしてあーもうもうダメちょっと待って待って待ってみたいなちょっとゆっくり説明させて俺もあんま分かってないからみたいな確か。に僕たち英語だとさ知らない分野になると途端に幼稚園児みたいになっ。ちゃうじゃんマジで全然分かんない。確かにその知らない分野っていうのはめっちゃなんかその英語でメモリ使うしその知らない単語多くてメモリ使うしめちゃくちゃメモリー使う感じが出て、全然口から出てこないみたいなのになる。なんかもう脳がショートしてる感じになりますね。わかる。煙出てる感ある。それが一番きついですね、やっぱり英語。エンジニアだと余計にね、頭を使わないと。そうですね。私はね、エンジニアとして黙々と仕事する分には良いんだけど、人の前で発表したりとか、リベートじゃないけど、自分がいろいろ決めないといけないプロジェクトをどう進めていくとか、自分の持ってる、なんだろう、自分がこの、分野担当しますか?ってリードしないといけない時とかに、なんかどう思う?なんか、いつまでに終わると思う?とかなんか、その突発的にパッて質問されて、パッて答えないといけないんだけど、ある程度こう、考えて、ものを言わないといけないとかに、それこそショートするじゃないけど、考えつつ、これも考えないといけないよな、これも考慮しないといけないよな、とかっていうのを、頭ん中で考えつつ、人にわかるように話すってなったときに、途中で、自分が何言ってるかわからなくなってきて、笑われるみたいな、人に、そうだな、大きい会議とかになってくると、偉い人とかもいると、ちょっと緊張するのもあるし、質問されて答えるっていう単純なことなんだけど、それらしいことを言うのが難しくて、今も苦労します。それは。めっちゃ準備しないとって思う。あれだよね、発表はいいけど、発表の後に何か質問あるって言った時に、こっちの人たちめっちゃ質問してくるじゃん。発表の後が一番しんどい。で、。言い切りできないじゃん、何聞かれるか。だから、まあ発表だけは準備頑張っていくんだけど、何聞かれるか、予想外のカーボールを出された時に、ってなっちゃう。確かに確かに。僕なんか、あの、入った当時、今の会社入った当時、みんなアメリカにチームの人たちはいるから、なんかバンクーバーの人たちのオールハンズって言ってみんなが集まるミーティングがあるんだけど、そこで各チームがやってることを紹介するみたいな、紹介してそれについて説明して質問して終わりみたいなのが5分くらいあるんだけど、僕はバンクーバーチーム1人だからいつも僕が発表で、でいつも質問でみんなそのチームについてあんまり知らないからいつもちゃんと質問くるんだよねもうすっごいもう3ヶ月にしかもそれが3ヶ月か4ヶ月に1回あるからもうすっごい嫌ででバンクーバーって言っても100人ぐらいいるから結構緊張もするしさちょっと確かにそういうのはめっちゃ苦労するよねもうこれからもうすっごい必死になってあのありなんか来そうな質問考えてで答え用意し。とくみたいな用意するんです。ね一応っていうのを最初はしてたで途中の方からまあ別にワンチャンわかんないでいけるなみたいなのもありすぐ出ないものは後で返すって終わるようにでちょっとずつは楽になったけどでも最初の3回ぐらいはもうなんか嫌。な気持ちだよね爆風を踏まない突然というのも上達しないけど時々しか起きないイベントとかだったね。そうなんだよね。良くなったと思ったら、次ダメで、みたいな。そこで、英語暗黒期に入る。僕が困ったではないけど、たまに困るのは、ファシリテーター、ミーティングのファシリテーターは結構なんか、やだったね。それもなんか、毎週やってると慣れたりするけど、やなやだったなってかなんかたまにでも今でも今でもなんかそのずっとやんないで久しぶりにやってを準備もしてないみたいになっちゃうとなんかを追ってあとそのなんか形式が決まってないミーティングのファシリティーだとか結構やらね。うーんファシリテーターが毎回いるんですかミーティングにいる。なんかその、例えば、あの、スプリントのリストロスペクティブみたいな、あの、反省会みたいなのも、その人が決まってたりだとか、あとなんか、うちのチームだと、今日、みんなで、その、エスティメート、なんだろう、どのくらい時間かかるかみたいな、そう、プランニングの時に、なんか、この、トピックはみんなでコスト医者なんかエスティメイトしようみたいなのがあってそれのファシリテーターもいるし1個割とファシリテーターがいてで割とみんな1個ぐらいはそのファシリテーターのあれを持つみたいなのがあるからでもそれはね割となんか毎週か毎スプリントあるからその1,2回では慣れる3回目ぐらいからはなんかまあ。前は英語嫌いになった時どうするって話してた。確かに実は僕たちこれ今回2回目で1回目のデータが消えちゃったんで確かに僕結構それはシンプルで別になんかあんまり落ち込まないんで僕その挫折はするんだけど前言ってた挫折で言うとタブーっていうゲームがあってタブーっていうゲームってグループの10人だったら10人で半々に分かれてカードにトピックとそのトピックに近いワードが5個ぐらい並べられててそのトピックについて説明するんだけどそのトピックとその5個ぐらいリストされているワードを使わずにそれについて説明しないといけなくてで自分のチームの仲間にそのトピックのワードが何だかを当ててもらうっていうのを1分間の間に何枚当ててもらえるかみたいなゲームでそれを僕と僕のパートナーと他の人たちは全員ネイティブでしかもなんかみんな割といい大学行っててみんななんか頭いいというかボキャブラリーが多い人やって他の人たちが1分間に6枚とか7枚とか当てられていく中自分は最初0枚とか1枚とかでなんならそのトピックのワードが分からないとかっていうのがあってそれに結構挫折感を感じ帰りの車の中で、アマゾンで注文して、その後2人でやるっていう。だから、そういう挫折とかはちょくちょくあるけど、あんまりそれで嫌いになったりとか落ち込んだりはしない。なんかあります?確かあれだよね、あやかさんは暗黒期みたいなのがあるって言ってたよね。私、定期的にやってきますよ。もう英語嫌。喋らない。もう耳も受け付けない。家帰ってからも英語ですもんね。ずっと英語はね。家帰ってからも英語だし、あまり成長を感じなくなってくるじゃないですか、長い期間。引っ張ってると。意識的に勉強しないといけないっていうリマインダーでもあるんだけれど、難しいよね。ネイティブにもなれないし、と言って、一応日常生活とか仕事は多くできちゃうから、毎日忙しい中で、時間が取れないとき、ちゃんと勉強できてないとき、罪悪感、勉強してない時の罪悪感と、理想の高さとかにやられて、もういいって感じになるけど、どうせ日常を送らないといけないし、英語を使わないといけないから、なんか、よし、もうちょっとやってみるかっていう風に戻る時もあるんだけど、なんかこう、暗黒期に入る時は、意識的にもう聞かない、喋らない、アタッとする、そしてリセットする時もあります。別にそういうのがない人はいいけど、あっても、また戻ってやり始めればいいだけの話だから休憩してもいいんじゃないかなと個人的にはと。いうことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますSpotify、ApplePodcast、YouTbeなどで番組のフォローをぜひお願いしますまたXでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "Ryo",
      "text": "それでは今回は英語について話していこうかなと思うんですけどホストは僕と彩香さんでゲストには前にインタビューで出てもらった優斗くんに来ていただきました優斗くんはなんか周りの情報によると英語がすごい上手だっていうことなんでちょっとどうやって勉強したのかとかモチベーションどうやって保ったのかとかそこらへんを聞いていけたらいいかなと思うんですけどちょっとまぁ今回初めて聞く人のためにちょっと優斗くんからじゃあ自己紹介をお願い。",
      "start": 8,
      "end": 31686,
      "timestamp": "00:00"
    },
    {
      "speaker": "Yuto",
      "text": "してもらっていいですかはい、一度前にポドキャストを出させてもらった優斗です英語に関してのメジャーな経験としては大学の時によく一人でバックパッカーをしていたりだとかその後にフィリピンの語学留学とオーストラリアとニュージーランドにワーキングホリデーに行っていて、で、あと、アメリカ人の彼女がいたりとか、そういうので基本的に英語を伸ばしてきたと思っています。今日はよろしくお願いします。",
      "start": 31686,
      "end": 70160,
      "timestamp": "00:31"
    },
    {
      "speaker": "Ryo",
      "text": "お願いします。あやかさんは何回も出てもらって、ホストやってもらってるんで大丈夫だと思うんですけど、どんな英語の勉強をしてきたかみたいなのを簡単に教えてくれると。",
      "start": 70160,
      "end": 83525,
      "timestamp": "01:10"
    },
    {
      "speaker": "Ayaka",
      "text": "えっと、大学受験の時に、やっぱり結構高校が英語に力を入れてる高校だったので、なんかこう徹底的に文法と単語を知って、そこのこう、理想的な土台はその期間にできたかなと思っていて、で私は大学の時に、バイリンガルのポッドキャストを英語と日本語のポッドキャストを聞くのにはまってた時期があってその時から英語がペラペラの人に憧れを抱いてちょっと勉強しようと思って大学生の時に喋るとか聞くコミュニケーションメインの勉強を始めましたボランティアとか行ったりとか海外旅行好きだったのでおちょこ英語を話す機会が大学の時からあってで、カナダに来たのが4年前なんでカナダでは英語を仕事でも使って実践的なトレーニングを日々生きながらしているって感じです勉強方法はできるだけインプットとアウトプットをバランスよくしたいなと思っているけどインプットは英語でポッドキャストを聞いたりとか英語で読書したりとか英語の本を読んだりとかですねでアウトプットはえっとシャドウイングとリピーティングを時々自分で時間を作ってやろうとしているいや頑張っているとまあ日々の生活ですねでボキャブラリーがこう減っていくので同じ単語ばっかり使うようになっちゃうので、ボキャブラリー増やそうと思って、こう意識的に新しい単語に出会った時はメモしちゃうように。",
      "start": 83535,
      "end": 198188,
      "timestamp": "01:23"
    },
    {
      "speaker": "Ryo",
      "text": "僕はどこからだっけ?僕あんまり高校、大学受験僕してなくて、で、高校もなんか工業系のなんか英語とか全然力入れてないし、自分でも力入れてなかったので、全然文法とかなんだろう、単語はダメダメだったんですけど一番最初は高い時に3、4年目ぐらいまで結構残業とかもしてちゃんと働いて疲れたなぁと思ってフィリピンに2、3ヶ月行こうって思ってなんかフィリピンでバケーションだみたいなのででもなんか何もしないのもあれだからと思ってなんか英語の学校に行ったみたいなところから始まってで、そこで何だろう英語は喋れないんけどなんか会話をするみたいなのをはできるようになってそこからなんか英語喋れなかった全然喋れなかったくせに喋れるようになったと勘違いをして外資にまあうまいこと受かったっていうのもあり言ったんですけど外資なのに全然英語使わないじゃんって思ってなんかじゃあ違う国で働こうみたいなので今カナダにいるんですけどでさすがにその単語力とか文法とかがなさすぎるからなんかイングリッシュカンパニーっていうなんかライザップの英語版みたいなライザップって知ってます?2人知ってます?イングリッシュカンパニーなんか3ヶ月でこんなに痩せるぜみたいなそうそうそう流行ってたと思うんですけどあの頃でなんか英語のライザップみたいな感じで売り出しているところがあってそこはなんか本当に毎日100単語ずつ覚えさせられてで、なんか一応トイックで、その1ヶ月100点上げようみたいなのを目標に、でもなんか割と、でも東洋は何だろう、インプットの量が多いから結構英語力はみっとみたいな感じだったのかなっていうのが3ヶ月やって、そっからちょっとしてカナダに来て、あと、まあなんかその日本人以外のパートナーみたいなちょこちょこいたり今のまあ今も僕結婚してるんですけどパートナーがえっとブラジルの人ですごい英語の上手な人なのでまぁなんかそこらへんかなまぁあとはあのもうこっち来て8年っていうのとえっと3社くらい経験会社は3社目なんでなんかそういうところで勉強してきたかなどっから話しましょうなんかなんだろう英語を話せるようになって、よかったですか?なんか、いいことから。結構、つらいじゃないですか?英語を勉強し続けるのって、モチベーションもそうだし。わかんない、僕は、なんか、僕は結構、つらいというか、その、なんだろう、挫折して、そっから勉強するみたいなタイプだったんで、結構、ネガティブなところから割と入ってるかなって感じですけど、英語なんかできるようになってよかった。2人多分、もともと興味あってって感じですね。",
      "start": 198188,
      "end": 380189,
      "timestamp": "03:18"
    },
    {
      "speaker": "Ayaka",
      "text": "よかったこと、どうだろう。なんか手段として、英語がないと生きていけない環境に今いるから、なんか特別自分が英語しゃべれるなと思わないし、。",
      "start": 380189,
      "end": 394417,
      "timestamp": "06:20"
    },
    {
      "speaker": "Ryo",
      "text": "なんだろう。",
      "start": 394417,
      "end": 397080,
      "timestamp": "06:34"
    },
    {
      "speaker": "Ayaka",
      "text": "どうだろう、英語で、英語を使って仕事活躍できたとかも、なんか時々英語を使う人だったら思うのかもしれないけど、毎日使ってなんか、思わない。確かに、なんかこれあんまり良いこと何も言えないかも。",
      "start": 397090,
      "end": 414634,
      "timestamp": "06:37"
    },
    {
      "speaker": "Ryo",
      "text": "僕たちって多分、このフロックっていうコミュニティの中では多分きっと英語喋れる方ではあるじゃないですか。まあもう仕事一応英語使ってできてるし、でも会社とかでは別に英語喋れる方とかでもないし、むしろ全然喋れない方じゃん、。",
      "start": 414644,
      "end": 432806,
      "timestamp": "06:54"
    },
    {
      "speaker": "Yuto",
      "text": "英語だと。そう、。",
      "start": 432806,
      "end": 433896,
      "timestamp": "07:12"
    },
    {
      "speaker": "Ayaka",
      "text": "相対的に見たらね、周りがペラペラすぎて、危険を感じることの方が多いけど、。",
      "start": 433896,
      "end": 441947,
      "timestamp": "07:13"
    },
    {
      "speaker": "Yuto",
      "text": "まあでも少なくともそのこっちで仕事を見つけ普通に働けてるっていうのはまあやっぱり英語喋れるからっていうのは。",
      "start": 441957,
      "end": 450521,
      "timestamp": "07:21"
    },
    {
      "speaker": "Ryo",
      "text": "一番でかいと思うなんかこの頃ツイッターとかでもエンジニアの人たちすぐお金の話するとか言って言われてるの多いけどまあそれでいうその流れで言うとまあこっちで英語喋れてエンジニアをやると給料稼げるってのはまあ一ついいことなのかもねそういう人たちに叩かれそうだけど。",
      "start": 450521,
      "end": 471050,
      "timestamp": "07:30"
    },
    {
      "speaker": "Yuto",
      "text": "でもあとはやっぱりこっちのなんか働くカルチャーが好きであればそこも英語を喋るメリットがある結局喋れることによってこっちで働けてお金も増えるし仕事もそこまで日本行った時よりは多分みんなきつくないと思う人が。",
      "start": 473297,
      "end": 492931,
      "timestamp": "07:53"
    },
    {
      "speaker": "Ryo",
      "text": "多いかな確かにホワイトな企業は基本的に多いです。",
      "start": 492931,
      "end": 496874,
      "timestamp": "08:12"
    },
    {
      "speaker": "Ayaka",
      "text": "ね。",
      "start": 496874,
      "end": 496894,
      "timestamp": "08:16"
    },
    {
      "speaker": "Ryo",
      "text": "なんかあんまりできるようになって良かったこと全然出てこないです。そんなに良くないのか。",
      "start": 499292,
      "end": 505175,
      "timestamp": "08:19"
    },
    {
      "speaker": "Ayaka",
      "text": "いや、。",
      "start": 505175,
      "end": 505685,
      "timestamp": "08:25"
    },
    {
      "speaker": "Ryo",
      "text": "どうしたら良いのか。",
      "start": 505685,
      "end": 507557,
      "timestamp": "08:25"
    },
    {
      "speaker": "Yuto",
      "text": "もう1個ありますよ。なんか旅行した時にいや、めちゃくちゃ楽しいですね。英語喋れた方が。",
      "start": 507557,
      "end": 513950,
      "timestamp": "08:27"
    },
    {
      "speaker": "Ayaka",
      "text": "確かに。",
      "start": 513950,
      "end": 514580,
      "timestamp": "08:33"
    },
    {
      "speaker": "Ryo",
      "text": "それはそうだね。",
      "start": 514580,
      "end": 515340,
      "timestamp": "08:34"
    },
    {
      "speaker": "Yuto",
      "text": "確かに。",
      "start": 515340,
      "end": 515941,
      "timestamp": "08:35"
    },
    {
      "speaker": "Ayaka",
      "text": "旅行するとパートルが塞がるよね。",
      "start": 515941,
      "end": 519272,
      "timestamp": "08:35"
    },
    {
      "speaker": "Ryo",
      "text": "そうですね。確かにそれで言うと、ヨーロッパとか行っても英語話せってたらなんか堂々と行ける感ない?なんか俺別に喋れるよみたいなので喋れる系の。",
      "start": 519272,
      "end": 532327,
      "timestamp": "08:39"
    },
    {
      "speaker": "Yuto",
      "text": "アジア人だよみたいなもちろん。",
      "start": 532327,
      "end": 539312,
      "timestamp": "08:52"
    },
    {
      "speaker": "Ryo",
      "text": "そっちも喋れるような感じで行くよね日本人だとさ日本人だとっていうか英語喋れなかった時はさスペイン行ったらちょっとスパニッシュなんか適当に頑張って喋った方がいいのかなみたいなのとか思いながらあまり喋れずに行くんだけど基本的には英語で通じそうだからなんか誰にでもなんだろうなんてガツガツいけるではないけどいけるみたいなのはあるかもしれないね。",
      "start": 539312,
      "end": 566350,
      "timestamp": "08:59"
    },
    {
      "speaker": "Yuto",
      "text": "確かになんかそういう意味で言うと自信は多少ないともつく気がしますね英語喋れるようになると。",
      "start": 566350,
      "end": 573833,
      "timestamp": "09:26"
    },
    {
      "speaker": "Ryo",
      "text": "あとツアーを使わなくていいこれわかんない他の人は気にしないのかもしれないけど僕なんかツアーとかみたいになんか自分の時間決められるのがめちゃくちゃ嫌でだから自分のなんだろう、時間で行きたいから、ツアーとか使うと結構なんか、すごい嫌なんだけど、そういうのもいらないし、情報収集とかも英語でできるから、まあなんか、旅行の時とかも、まあ安上がりというか、ツアー使わないから安上がりだったり、まあ自由行動が増えたりとかってあるかも。",
      "start": 573833,
      "end": 608284,
      "timestamp": "09:33"
    },
    {
      "speaker": "Yuto",
      "text": "あとはなんかその情報収集で言うとエンジニアに特にあると思うんですけどやっぱりその海外の記事とか英語の記事の方がいいものとかもあったりするんで自分たちの場合日本語の記事も読めるし英語の記事も読めるしYouTbeとかもしかり情報のそのターゲットがめっちゃ広いんでなんか自分で触ったことない技術で何か作ってみようとかになった時にめっちゃ助かるなと思う特にyoutbeとかがやっぱり日本だと技術系のyoutbeってあんまりないけど海外の方がチュートリアル系とか本当に何でもあるんでなんか。",
      "start": 608294,
      "end": 645018,
      "timestamp": "10:08"
    },
    {
      "speaker": "Ryo",
      "text": "すごい助かるな意外といいことはそんなないんですね意外とない。次行きましょう。英語の学習って、やっぱりモチベーションの維持がめちゃくちゃ大変だと思うんだけど、海外にいるから、僕たちは割とモチベーション高くいれるっていうのは多分あると思うけど、2人は特に日本の時から結構勉強されてきたと思うんですけど、どういうふうに英語の学習を続けてきましたか?なんかコツとかありますか?",
      "start": 645018,
      "end": 683607,
      "timestamp": "10:45"
    },
    {
      "speaker": "Yuto",
      "text": "モチベーションのコツ。",
      "start": 683617,
      "end": 686088,
      "timestamp": "11:23"
    },
    {
      "speaker": "Ayaka",
      "text": "どうぞ、先に。",
      "start": 686088,
      "end": 687688,
      "timestamp": "11:26"
    },
    {
      "speaker": "Ryo",
      "text": "あ、いや、。",
      "start": 687688,
      "end": 688238,
      "timestamp": "11:27"
    },
    {
      "speaker": "Yuto",
      "text": "ちょっと聞きたかった。モチベーションを保つコツですか?",
      "start": 688238,
      "end": 691549,
      "timestamp": "11:28"
    },
    {
      "speaker": "Ryo",
      "text": "そうですね。",
      "start": 691549,
      "end": 692540,
      "timestamp": "11:31"
    },
    {
      "speaker": "Ayaka",
      "text": "特に日本にいる人に向けてってことですよね。",
      "start": 692540,
      "end": 695670,
      "timestamp": "11:32"
    },
    {
      "speaker": "Ryo",
      "text": "そう、日本で学習すると結構大変だと思うんだけど。",
      "start": 695670,
      "end": 701522,
      "timestamp": "11:35"
    },
    {
      "speaker": "Ayaka",
      "text": "やっぱり、こう、時々は、英語を使う場に出ていて、いかにこう話すのって、やっぱり難しいじゃないですか。間の取り方とか、なんだろう。やっぱりリスニングも入ってくると、こう、自分一人でしゃべるのがいくいちとか、準備したプレゼントが大丈夫な人がいたとしても、いざ外国人の人と話すときに、外だと周りがガヤガヤして、話すってなると、全然まったくちがうスキルが壊れると思うし、そういうのを、やっぱり日本にいても経験できる場はあると思うから、そういうところに行ってみて、どれだけ自分ができるのか。できなかったら、たぶんもっとやろうと思うし、私も大学生のときは、よく海外旅行に行ったりとかしてたし、ボランティアとか行ってたし、働いたりもしてたから、その時にうまくいかなかったこととかを持ち帰って、悔しい思いを持ち帰って、やるっていう感じだったかなって思います。",
      "start": 701522,
      "end": 773406,
      "timestamp": "11:41"
    },
    {
      "speaker": "Ryo",
      "text": "確かに、環境作るのはめちゃくちゃ大切ですよね。僕も割と東京で同じようなことをしてて、で、なんだろう、そのミートアップみたいなところにいっぱいいったりだとか、で、一人、もともと、その、台湾人系のカナダ人、あの、バンクーバー出身の人と友達になって、で、その人と僕、すっごい仲良くて、ちょうどカナダ来る、フィリピン行った後で、カナダ来る前の2年ぐらいが、すごい仲良かったんで、結構、毎、よく毎週遊ぶとか、みたいなのしてて、なんか、そういうのは、めちゃくちゃ、いいかもしれないです。その、それこそ、うわ、こういうの喋れなかった、って思って勉強したりだとか、なんか、それこそ、あやかさんがさっき言った、なんか、ラジオとかから流れてくる綺麗な音は聞こえるんだけど、ガヤガヤしてるところだと、日本語は拾えるのに、英語は全然耳が聞き取ってくんないみたいなのも、最初の頃あったりして、確かにそういうのに慣れるみたいなの、めちゃくちゃ大切だし、そういう環境がいっぱいあると、なんか、あ、英語勉強しないとなって思う機会はめっちゃ増えそうです。ゆうとくん、。",
      "start": 773406,
      "end": 837404,
      "timestamp": "12:53"
    },
    {
      "speaker": "Yuto",
      "text": "あります?なんか自分は嫌な思いをしたからっていうよりもどっちかっていうと例えばその海外旅行行った時にまた行った時に喋れたらもっと楽しいだろうなぁみたいのを日々考えて過ごしていたのでなんかこれ英語勉強してもっと楽しんじゃおうみたいな感じで自分にモチベーションを与え続けてます私まあなんかそのもともと海外に行きたい、海外でエンジニアになりたいっていうのはずっと思ってたのでまあそこはなんかそんなに長くずっとモチベーション保てるかっていうのは人によるかなとは思うんですけどやっぱりなんかそのこういうふうにしたいっていうのを定期的に考えてまあそのために英語が必要だからちょっと楽しむ、人生楽しむために英語やろうかみたいな感じで。",
      "start": 837404,
      "end": 893346,
      "timestamp": "13:57"
    },
    {
      "speaker": "Ryo",
      "text": "その未来のためっていうのは、それはもう確定した未来のためなの?それとも、ふわっとしたものなの?なんか僕はさ、例えばさ、再来月に旅行行くとか、海外に旅行に行くとかっていう、決まった未来に対してはそのモチベーションを保てるんだけど、次、なんか別に予定もしまだしてないけど、次行った時には英語もっと話せるようになったら楽しいなみたいなのを、ちょっと想像力の欠如か分からないんだけど、あんまりそういうことができなくて、なんだろう。",
      "start": 895287,
      "end": 923523,
      "timestamp": "14:55"
    },
    {
      "speaker": "Yuto",
      "text": "いやなんか多分自分の場合勝手にもうなんか行けるだろうって思っててなんかいつかはいける海外でエンジニアになれるだろうっていうのを勝手に信じ込ませてたのでだからなんかすごいクリアーに自分の中で見えててじゃあそれだったらまあそれをクリアにするために逆になんか英語をやんないとだよなみたいな感じです。",
      "start": 923533,
      "end": 947462,
      "timestamp": "15:23"
    },
    {
      "speaker": "Ayaka",
      "text": "なんか海外で働きたいって思う人たくさんいるけど、なんかそのきっかけって何なんですかね?なんか人によると思うけど、周りにそういう人がいたとか、私の場合は周り、家族も親戚も、あんまりそんな海外志向の人いなくて、私だけちょっと変な人なんですよ、家族の中では。ずっと昔から会って、私も海外で過ごしてみたいなって。なんか留学も行きたかったけど、まあ働いてから行こうかなとか、ずっと思ってて。うん、確かに、でもそういう目標がぼやっとでもあれば、ちょっと英語でお接するようになるだろうから、ちょっとずっとやっていこうかなって思ってたのもあるから、そういうビジョンがある人はいいと思うけど、全くない人は、まあ全くないでいいのか、それはそれで。",
      "start": 950087,
      "end": 1004729,
      "timestamp": "15:50"
    },
    {
      "speaker": "Ryo",
      "text": "でも全くなかったらもう別にいかないんじゃない?",
      "start": 1004739,
      "end": 1008266,
      "timestamp": "16:44"
    },
    {
      "speaker": "Ayaka",
      "text": "全然英語もいらないもんね。",
      "start": 1008266,
      "end": 1010409,
      "timestamp": "16:48"
    },
    {
      "speaker": "Ryo",
      "text": "たぶんそれだったら英語いらなそう。",
      "start": 1010409,
      "end": 1013833,
      "timestamp": "16:50"
    },
    {
      "speaker": "Yuto",
      "text": "なんかなんとなくそれこそ英語をやった方がいいんじゃないかみたいな感じで英語やってると絶対やっぱ続かないです。",
      "start": 1013843,
      "end": 1021615,
      "timestamp": "16:53"
    },
    {
      "speaker": "Ryo",
      "text": "それは難しいね。",
      "start": 1021615,
      "end": 1023046,
      "timestamp": "17:01"
    },
    {
      "speaker": "Yuto",
      "text": "なんか結構いるじゃないですかそういう人も例えばなんか時間余ってるからなんか勉強しようかじゃあまあ出てくるのは英語だよなって言って英語やって1ヶ月ぐらい1ヶ月はまあ多分続かないと思う。それで英語続かないんだよねっていうのは、やっぱり目標とか、なんかしたいこと、英語でしたいこととかがないから、まあそうなるよね、。",
      "start": 1023046,
      "end": 1046820,
      "timestamp": "17:03"
    },
    {
      "speaker": "Ryo",
      "text": "と。2人は、なんか日本人以外のパートナーがいたことがある、もしくは今いるじゃないですか。これについてはどう思います?僕結構やっぱいいなって思って、僕も何人か彼女がいて、結構その時に学んだというか、なんだろ、学んだ?その人から学んだのかは分からないけど、結構その時に成長した、伸びたなって思うんですけど。",
      "start": 1046820,
      "end": 1073041,
      "timestamp": "17:26"
    },
    {
      "speaker": "Yuto",
      "text": "うん、そうです。なんかその、喋る機会がやっぱり多くなりますよね。自分がいた時はカナダじゃなくて、日本にいた時だったんですけど、それこそ日本だと本当に喋る機会ってかなり限られるので、それで、その海外の彼女がいたっていうのは、めちゃめちゃアドバンテージ。自分の中で英語の、なんだろう、スキルアップに、まあ、ちょっと言い方悪いですけど、すごい伸びたなとは思いますね。",
      "start": 1073041,
      "end": 1108954,
      "timestamp": "17:53"
    },
    {
      "speaker": "Ryo",
      "text": "いや、めちゃ思うと思う。",
      "start": 1108954,
      "end": 1110835,
      "timestamp": "18:28"
    },
    {
      "speaker": "Ayaka",
      "text": "なんか、なんだろう、ナーナーになるって話は聞きません?私は、私ももちろん、なんかその、全く話せる状況がない人が、誰かと海外の人と付き合って、英語話す機会ができたから、もう強制的に話さないといけないし、聞かないといけないから、それはすごいプラスだと思うんだけど、あるところまで関係性が発展したりして、長い間一緒にいたりすると、なんか、二人の関係の中で、こう、コミュニケーションを向上させようみたいなものが、ちょっとなあなあになってきて、雰囲気で伝わることとかも増えてきて、ちょっとこう、成長曲線が平らになってくる時が、来るのもあるんじゃないかなと思ったけど。",
      "start": 1110835,
      "end": 1162772,
      "timestamp": "18:30"
    },
    {
      "speaker": "Ryo",
      "text": "最初はすごいいいよね。最初はすごい、だし、一人付き合って、別れたとして、次の人付き合うと、その人が使うボキャブラリーが違ったりするから、その最初のほう、最初の1年ぐらいは確かにやっぱめちゃくちゃなんか喋る機会も多くなるし、おーって感じになるけど、その後は確かになんかその2人の言葉みたいなのとか、言葉を使わなくて、通じるものがどんどん増えてって、てのはあるかも。でも、それでもなんか、今とか僕、なんだろうな、仕事とかで言えなかったこととかを軽く聞いたりとかなんかそのわざわざ調べないけどこれってどういうふうに言ったらよかったんだろうみたいなのをたまに会話でする時とかもあるからそういう意味で言うとまあなんかその確かにその成長曲線みたいなのはまあ良くないけどまあそういうのがなんか普段から聞ける環境にあるっていうのはいいなっていうのとなんかこれ結構カナダ特有、バンクーバー特有なのかもしれないけど、アジア人、日本人も含めてアジア人めちゃくちゃ多いじゃないですか。ワンチャンなんだろう、バンクーバーって日本語だけで生きていけちゃうじゃないですか。全く喋らなくても全然。そうですね。ジャパレスで働いてさ、買い物とかも別に英語なんか使わなくてもいいし、もちろんなんかリスニングちょっとは必要だし、とかはあるけど、全然いけちゃうじゃん。だからなんか、そういう人とかにはまあ、おすすめって言ったらいいね。なんか一人でできるもんでもないから付き合うって、あれだけど。",
      "start": 1162772,
      "end": 1270211,
      "timestamp": "19:22"
    },
    {
      "speaker": "Ayaka",
      "text": "日常会話がすごいカバーされる気がする。恋人、恋人じゃなくてもそのルームメイトとかでもいいと思うんだけど、すごい身近に英語を話す人がいる。かゆいところに手が届かないけど、普段すごい身近にあるのに言えないことって結構あると思うけど、それが普段一緒に生活してると使うからやっぱり。",
      "start": 1270211,
      "end": 1300714,
      "timestamp": "21:10"
    },
    {
      "speaker": "Yuto",
      "text": "でもエンジニアとして何か必要な単語とかが増えるかっていうとそれはあんまり関係ないですよねパートナー。",
      "start": 1301283,
      "end": 1308927,
      "timestamp": "21:41"
    },
    {
      "speaker": "Ayaka",
      "text": "がエンジニアだったらバラシャンそう。",
      "start": 1308927,
      "end": 1310728,
      "timestamp": "21:48"
    },
    {
      "speaker": "Yuto",
      "text": "ですね確かにパートナーがエンジニアのネイティブだったらめっちゃ強いですねでもちょっと嫌だけどなパートナーが同じ職業嫌です。",
      "start": 1310728,
      "end": 1320794,
      "timestamp": "21:50"
    },
    {
      "speaker": "Ayaka",
      "text": "よどうだろうなぁ。",
      "start": 1320794,
      "end": 1323756,
      "timestamp": "22:00"
    },
    {
      "speaker": "Yuto",
      "text": "絶対、エンジニア一緒なの嫌だな。",
      "start": 1325564,
      "end": 1327756,
      "timestamp": "22:05"
    },
    {
      "speaker": "Ryo",
      "text": "確かに、エンジニア二人でっていうのは微妙かも。特にエンジニアっていうのが、あれだけど。でも、それが日本人じゃなかったら、わかんない、違うかもしれないしね。仕事は仕事、家は家みたいな人も結構いるし、わかんないけど。でも、仕事のやっぱり英語は、職場で一番身につくってのはあるよね。二人とも一緒目か。だから、僕、今3社目なんだけど、1社目、2社目、3社目で、それぞれなんか、やっぱ、毎回、英語難しいなっていう、最初の3ヶ月、4ヶ月ぐらいはあって、なんか、そのチーム特有、それこそさっき言ったようになんか、その、パートナー、そのパートナーが使うボキャブラリーみたいなのが、やっぱ会社だったり、チームの単位でもあって、その人たちの、なんて言うんだろう、まあすごい簡単なこととかはね、誰が言っても、グッドモーニングは誰が言ってもグッドモーニングだと思うんだけど、なんか、そのよく使われる言葉みたいなのとかがあって、それを覚えるのに結構時間が、まあ時間かかるというか、最初難しいなって感じたりとか、僕、1社目すごいインターナショナルな、特にスペイン系のアクセントの強い上司だったんだけど、2社目はみんなカナダ人の、特にトロントの会社だったから全然アジア人もなくて、すごい英語。で、3社目はみんな僕、アメリカのチームに配属されたから、みんなアメリカ人。結構もっと大変だった。なんか仕事のボキャブラリーとかはやっぱ仕事で一番覚えられる。",
      "start": 1327756,
      "end": 1423588,
      "timestamp": "22:07"
    },
    {
      "speaker": "Yuto",
      "text": "のかなとでもなんかそれこそ日本にいる人がこれ聞いてるとしたら結構どうしようもないところもあるのか確かに確かに。",
      "start": 1423588,
      "end": 1433333,
      "timestamp": "23:43"
    },
    {
      "speaker": "Ryo",
      "text": "でもそれこそその基盤があればなんとかなるんじゃないその最初確かにやっぱ苦労はするけどその日常会話はまあちょっと話せてそのボキャブラリーと文法力はありますって言ったらまあなんか入ってからなんとかなりはするじゃんそうですね、確かに、。",
      "start": 1433333,
      "end": 1452067,
      "timestamp": "23:53"
    },
    {
      "speaker": "Yuto",
      "text": "それもめっちゃある。",
      "start": 1452067,
      "end": 1453548,
      "timestamp": "24:12"
    },
    {
      "speaker": "Ayaka",
      "text": "どっちかっていうと、伝えたいことがある方が大事な気がしてて、私、エンジニアにこっちでなって、英語で勉強してやり始めたんだけど、やっぱり元々のバックグラウンドがないと、エンジニアとしての。ディスカッションとかで意見を求められても、なんかエンジニアとして働いたことないから、なんて言うべきなんだろう、ここで、。",
      "start": 1453548,
      "end": 1479904,
      "timestamp": "24:13"
    },
    {
      "speaker": "Yuto",
      "text": "みたいな。",
      "start": 1479904,
      "end": 1481024,
      "timestamp": "24:39"
    },
    {
      "speaker": "Ayaka",
      "text": "になることも多くて、最初の頃は特に。で、やっぱり日本でそういう、同じエンジニアとしての経歴がある人は、多分、わかる、何言ったらいいかわかると思うし、。",
      "start": 1481024,
      "end": 1494534,
      "timestamp": "24:41"
    },
    {
      "speaker": "Ryo",
      "text": "技術的にこう。ジャバスクリプト喋れるよね、。",
      "start": 1494534,
      "end": 1498497,
      "timestamp": "24:54"
    },
    {
      "speaker": "Yuto",
      "text": "みたいな。なんかエンジニアのコミュニケーションの仕方って多分あるじゃないですか日本でもなんかエンジニアが質問する時はこうやって質問しないといけないみたいな例えばなんか全部聞きすぎないである程度実装して自分で調べた上で聞くとかあ、。",
      "start": 1498497,
      "end": 1514980,
      "timestamp": "24:58"
    },
    {
      "speaker": "Ayaka",
      "text": "そうなるんだ?",
      "start": 1514980,
      "end": 1516361,
      "timestamp": "25:14"
    },
    {
      "speaker": "Yuto",
      "text": "いや、まぁなんかその聞きすぎずみたいなこっちのベイブレーに聞けよ。",
      "start": 1516361,
      "end": 1520705,
      "timestamp": "25:16"
    },
    {
      "speaker": "Ayaka",
      "text": "みたいなこれはなんか例、なんだろうなんて言うんだ日本語が出てこないと?礼儀?マナーとかあんまこっちは気にされてないよね。",
      "start": 1520705,
      "end": 1533362,
      "timestamp": "25:20"
    },
    {
      "speaker": "Yuto",
      "text": "え、でもあれじゃないですか、なんか例えば、それこそ今あったチャットGPDとかあるし、なんかあまりに簡単すぎることを聞くのはちょっと個人的には、これはちょっと調べようとはなるんですか?",
      "start": 1533362,
      "end": 1546743,
      "timestamp": "25:33"
    },
    {
      "speaker": "Ayaka",
      "text": "めっちゃ普通に、Oh,tismgbeaverysilquton,bIhavetoaskみたいな感じで聞くときもあるよ。",
      "start": 1546743,
      "end": 1554269,
      "timestamp": "25:46"
    },
    {
      "speaker": "Yuto",
      "text": "えー、。",
      "start": 1554269,
      "end": 1554999,
      "timestamp": "25:54"
    },
    {
      "speaker": "Ryo",
      "text": "あ、。",
      "start": 1554999,
      "end": 1555199,
      "timestamp": "25:54"
    },
    {
      "speaker": "Yuto",
      "text": "そうなんだ。",
      "start": 1555199,
      "end": 1557165,
      "timestamp": "25:55"
    },
    {
      "speaker": "Ryo",
      "text": "あと、リモートか現地にいるかっていうのもあって、隣にいて携帯いじってたら、もう聞けばよくねってなったりするのと、あとなんか、周りの人がすげえそういう質問を結構してると、。",
      "start": 1557175,
      "end": 1572543,
      "timestamp": "25:57"
    },
    {
      "speaker": "Ayaka",
      "text": "あれ、。",
      "start": 1572543,
      "end": 1573233,
      "timestamp": "26:12"
    },
    {
      "speaker": "Ryo",
      "text": "じゃあいいんじゃね?みたいになったりもするかな。",
      "start": 1573233,
      "end": 1576535,
      "timestamp": "26:13"
    },
    {
      "speaker": "Yuto",
      "text": "うん、。",
      "start": 1576535,
      "end": 1578056,
      "timestamp": "26:16"
    },
    {
      "speaker": "Ayaka",
      "text": "周りの人は結構そういう人多いかも。",
      "start": 1578056,
      "end": 1579557,
      "timestamp": "26:18"
    },
    {
      "speaker": "Ryo",
      "text": "なんか僕も割と聞いちゃう。",
      "start": 1579557,
      "end": 1581848,
      "timestamp": "26:19"
    },
    {
      "speaker": "Ayaka",
      "text": "すごい。何がこう、知ってて当たり前だろうなのかわかんないよね。",
      "start": 1581848,
      "end": 1590652,
      "timestamp": "26:21"
    },
    {
      "speaker": "Ryo",
      "text": "でもなんか、そもそもそんな知ってて当たり前だろうはなくない?なんかその聞きたくないっていうのは多分、こいつもこんなことも知らないエンジニアなんだって思われたくないとかっていうのがあるから、たまに聞かないこととかはあるけど、でもなんか割と聞けるかも、なんでも。",
      "start": 1590652,
      "end": 1607167,
      "timestamp": "26:30"
    },
    {
      "speaker": "Ayaka",
      "text": "うん、めっちゃ前置きするけど。",
      "start": 1607167,
      "end": 1611387,
      "timestamp": "26:47"
    },
    {
      "speaker": "Yuto",
      "text": "なんかメッセージ書く方が時間長くなりそうだなみたいな時に調べたりするじゃないですか?",
      "start": 1611397,
      "end": 1616861,
      "timestamp": "26:51"
    },
    {
      "speaker": "Ayaka",
      "text": "それは直接、あ、そうだ、その何だろう会議とかでパッて思って調べるんじゃなくてそのまま聞いちゃうはあるけど一人でわざわざメッセージするんだったらその前に調べる。",
      "start": 1616861,
      "end": 1629089,
      "timestamp": "26:56"
    },
    {
      "speaker": "Yuto",
      "text": "かもそうそうそうそうだから。",
      "start": 1629089,
      "end": 1631550,
      "timestamp": "27:09"
    },
    {
      "speaker": "Ryo",
      "text": "なんかそこが大変だなあ、。",
      "start": 1631550,
      "end": 1634792,
      "timestamp": "27:11"
    },
    {
      "speaker": "Ayaka",
      "text": "そうなのどうだろう、場合によるか。",
      "start": 1634792,
      "end": 1638635,
      "timestamp": "27:14"
    },
    {
      "speaker": "Ryo",
      "text": "あとは関係性にもよるくない?そのそういう人がいれば聞きやすい人僕あの今の会社で一番仲良い友達は会社の中で仲良い人は普通にプライベートでも遊ぶくらい仲良いんだけどその人はpmなんだけどpmだからやっぱなんかコミュニケーション能力がそもそも高いしなんかニュースがちゃんと入ってってるんだよねその人になんかエンジニアって結構会社で何が起こってるかわかんないみたいなあるじゃんわかんないある僕はあるんだけどそういう人なんでも結構オフィスのこととか新しい人とかもなんでも知ってるしなんかあのrsuじゃなくてえっとespsなんだっけ忘れちゃったあの自社株買うタイミングとかってあるんだけどそういうのとかもなんかなんかよくちゃんと情報仕入れてるから結構その仕事以外のこととかはその人にあれこれいつだったっけとか結構仲良いっていうのもあってもう調べずにいくみたいなのをやってるけどだから関係性にもよるのかなってのはあります。ちょっと英語のことから外れてきちゃったんで、ちょっと戻すと、なんか、この勉強法すごいよかったなとか、こういう勉強法おすすめだよ、みたいなのってあります。さっきなんか、あやかさん、シャドーイングとリピーティングって言ってたんだけど、。",
      "start": 1641127,
      "end": 1724578,
      "timestamp": "27:21"
    },
    {
      "speaker": "Ayaka",
      "text": "これをやったのは、耳をとりあえず鳴らすために、シャドーウィングはオススメだし、いろんな人が言ってるもんだって。けど、シャドーウィングだけじゃダメだなと思ったのが、日々英語をよく聞く機会があると、聞き流すのも得意になってきて、職場とかで長い会議とかに出てると、ちゃんと聞かなきゃいけないんだけど、すごい重要じゃないな、これとか思った瞬間にシャットアウトして、全然聞いてない時とかがあったりして、プラプラプラって早く言われた時とかに、聞き返すのも慣れてきたら、聞き返すのデフォになるとかも、良くないと思ったからちょっと一発でしっかり聞き取ってで長いことを喋られてもこうちゃんと追いついて全部聞けるっていう状態にしたいなって思った時にそのリピーティングはその耳に入ってきたことを1回自分の頭の中に留めてそれを自分の口から出すから留めてる間にちょっと解釈する間があるからちょっと内容を追いやすいなと思ってやってました。結構難しいんだけど、リピーティングに。日本語でも、なんか、バーって言われて、そのまま喋るの難しいから。",
      "start": 1724588,
      "end": 1817543,
      "timestamp": "28:44"
    },
    {
      "speaker": "Ryo",
      "text": "教材とかはどういうのを使ってる?",
      "start": 1817543,
      "end": 1820154,
      "timestamp": "30:17"
    },
    {
      "speaker": "Ayaka",
      "text": "教材は、私はあんまりお金かけたくなくて、英語のリソース、すごいいろんなところに今、転がってるから、YouTbeとかPodcastで、よく聞くのが好きな人のやつを選んで、で、自分が興味ない内容だと、どんどん、続かないので興味あるなんか心理学とかのことを。",
      "start": 1820154,
      "end": 1845496,
      "timestamp": "30:20"
    },
    {
      "speaker": "Yuto",
      "text": "聞いてますそれってでもなんか何回も同じのを聞いたりするんですか?なんか自分的にシャドーイングが自分もやったことあるんですけど続かなかった理由がなんか基本的に1回見たことあるやつとかを2回目とかでシャドーイングするみたいな感じだと思うんですけどそうなると全然面白くないなと思って全然通かなくてコツを。",
      "start": 1845496,
      "end": 1871992,
      "timestamp": "30:45"
    },
    {
      "speaker": "Ayaka",
      "text": "教えてほしいです同じコンテンツででも最初はやるかなそのシャドーイングもなんかこう詰まってたりする場所があると次のところに行ってもあんまり意味ないのかなだから短いやつを選ぶ方がいいんじゃないかななんかテッドトークとかでなんか10分とか、いやもう5分はないか、テッドトークだと。まあ短いやつ選んで、すぐに1回終えられる、1周終えられるやつにすると、なんか筋トレみたいな感じで、こう繰り返すのも甘くじゃないのかなって。長いやつをなんか、今回はその30分の中の5分しかできなかったとか、。",
      "start": 1871992,
      "end": 1910470,
      "timestamp": "31:11"
    },
    {
      "speaker": "Yuto",
      "text": "いったとだんだんね、。",
      "start": 1910470,
      "end": 1911031,
      "timestamp": "31:50"
    },
    {
      "speaker": "Ryo",
      "text": "しんどくなってくるから。",
      "start": 1911031,
      "end": 1911281,
      "timestamp": "31:51"
    },
    {
      "speaker": "Yuto",
      "text": "いや、そうですね、。",
      "start": 1911281,
      "end": 1912541,
      "timestamp": "31:51"
    },
    {
      "speaker": "Ayaka",
      "text": "それやってましたね。私も長いやつは続かなかった。",
      "start": 1912541,
      "end": 1918378,
      "timestamp": "31:52"
    },
    {
      "speaker": "Ryo",
      "text": "僕なんか、この頃シャドーテンをやったんだけど、コスパとかを考えると、相対的にはまぁなんかうんって感じだけど、良かったなって思うのは、そのフィードバックがやっぱりあって、自分がどこで詰まってて、どういう風にするとその詰まってるのが取れるのかみたいなのが分かるようになって、るからシャドーテンはすごい良かったなあっていうのがあってその後そのシャドーテンを僕は3ヶ月やってみたのかな中でやっぱ結構同じようなところで詰まるんだよねなんでその自分のパターンみたいなが見えてくるから1回シャドーテンをやってみてちょっと2人がやったことあるかどうかわかんないけどやってみてそれからなんかその他のものにその経験を生かしてみるといいかもしれないシャドウイングその短くやるとかっていうのもまあ多分いろいろ多分そのポイントみたいなのはいろいろあるんだけどその2回目3回目やってもわーっとなんかできなんかできてるようにはなるけどそのちゃんとここがうまくなったとかっていうのはあんまりないのとあとなんかその詰まるポイントがあってその詰まるポイントはいつも詰まってる感じないやってるときその他のその前後がうまくなることによってそのついていけるようにはなってるんだけど詰まるタイミングみたいなのは変わってないみたいなのが僕の場合はあってそこらへんそういうのをなんかそのシャドー10で何回も指摘されることによってあまたこれだとかっていうのがあって1回だけなんかそのあれシャドー10ってなんか1ヶ月2万5千円するから私やったこと。",
      "start": 1918388,
      "end": 2016015,
      "timestamp": "31:58"
    },
    {
      "speaker": "Ayaka",
      "text": "あるんですよ結構長いでやってたけど、高くて費用対効果としての大きな伸びみたいなものがなかったし、さっきもりょうさん言ってたみたいな、ある程度やったら自分のパターンとかも深めてきて、別にそれがわかってれば他の教材使っても、ね、そこを気をつけた方がいいのかってできるから、いいかとか思ってやめちゃった。",
      "start": 2016015,
      "end": 2042395,
      "timestamp": "33:36"
    },
    {
      "speaker": "Ryo",
      "text": "シャドウイングのやり方の矯正を、なんか、その、するのにはありだよね、最初の方。2、3ヶ月やってみてってあると思う。",
      "start": 2042395,
      "end": 2050081,
      "timestamp": "34:02"
    },
    {
      "speaker": "Ayaka",
      "text": "シャドウテンの添削の人たちもチェックリストがあって、なんかリンキングとか、なんか太鼓の音の消失とか、そういうので多分チェックしてて、なんかそれをコンプリートさえすれば多分シャドウテンの何も言われなくなっちゃうと思うからなんかゲーム感覚でえ、。",
      "start": 2050081,
      "end": 2073349,
      "timestamp": "34:10"
    },
    {
      "speaker": "Yuto",
      "text": "それってAIとかじゃないんですか?",
      "start": 2073349,
      "end": 2075340,
      "timestamp": "34:33"
    },
    {
      "speaker": "Ryo",
      "text": "ほぼ使われてるよね、シャドウ10をやってるのとあと多分ちょっと僕それAIで作れるんじゃないと思ったんだけど調べてみたらなんかちょっと難しそうでなんか発音記号とかそこら辺なんか発音とかを確認するのがあんまりそこまで正確にまだできない多分技術的にもしかしたらできるのかもしれないけど、僕が調べた中ではできなくて、やっぱりその人がやるのにはまだ勝てないなっていう印象だったわ。だからできなそうなのと。ちなみになんか僕、彩香さんがお金をかけない、英語のリソースいっぱいあるからお金をかけないって言ったのに、ちょっと僕は逆だなって思って、僕は逆にお金をかけるようにしてて、それモチベーションもあるんだけど、なんか自分で集めようと思ったら確かに絶対集められるんだけどその集める時間を省略できるのとあとなんかお金をかけることでやっぱそのモチベーションの自分へのプレッシャーになるみたいなっていうのがあってそうお金やっぱかけたほうが僕にはねいいのかなって思うどうですか、ゆうとくんはどっち派です。",
      "start": 2075340,
      "end": 2148671,
      "timestamp": "34:35"
    },
    {
      "speaker": "Yuto",
      "text": "かいやー自分はなんか日本行った時そもそも全然お金がなかったのでお金をかける選択肢がなかったっていうのはあるんですけどでもまあなんかその話聞いてやっぱりモチベーションをお金を払うことによってモチベーションは得れるなぁとはめっちゃ思いますだからなんかまあ今日本行った時よりはお金あるんでもしなんかがっつりそれこそPRのためにあの英語をちょっと伸ばさないとみたいな話になったらけっこうお金かけるのはけようかなとは思います。",
      "start": 2148671,
      "end": 2188611,
      "timestamp": "35:48"
    },
    {
      "speaker": "Ryo",
      "text": "さっき言ったイングリッシュカンパニーっていうのが3ヶ月で55万から60万ぐらいするんだよね。だから、もうそれは元取らないといけないと思って頑張れたっていうのもあるし。",
      "start": 2188611,
      "end": 2206014,
      "timestamp": "36:28"
    },
    {
      "speaker": "Ayaka",
      "text": "3ヶ月とか決まってて、そこで集中してできる。",
      "start": 2206014,
      "end": 2210814,
      "timestamp": "36:46"
    },
    {
      "speaker": "Ryo",
      "text": "でもサブスクリプションも結構僕それを同じようなのを感じて、さっきのシャドーテンもそうだし、25,000円か、じゃあちょっと毎日やるかみたいなのもあるから、僕は何だろう、お金もちろんお金をかけれるならっていうのと、かけなくても多分モチベーションを保てる人とかはいいんだろうけど、モチベーションやっぱちょっと管理に結構つまずいてる人たちは、ワンチャンちょっとお金かけてみてもいいんじゃないのかなっていうのはちょっとおすすめだったり。",
      "start": 2210824,
      "end": 2242882,
      "timestamp": "36:50"
    },
    {
      "speaker": "Ayaka",
      "text": "あとあの、デュオリンゴの戦略ってやっぱすごいなぁと思う。",
      "start": 2242882,
      "end": 2246935,
      "timestamp": "37:22"
    },
    {
      "speaker": "Yuto",
      "text": "すごいすげー。",
      "start": 2246935,
      "end": 2247575,
      "timestamp": "37:26"
    },
    {
      "speaker": "Ayaka",
      "text": "今フランス語をデュオリンゴでやってるんだけど、絶対毎日やるもん。あのなんかストリートをちょっと止めたくないから。",
      "start": 2247575,
      "end": 2257271,
      "timestamp": "37:27"
    },
    {
      "speaker": "Ryo",
      "text": "し、。",
      "start": 2257271,
      "end": 2257441,
      "timestamp": "37:37"
    },
    {
      "speaker": "Ayaka",
      "text": "怒られるしなんか。",
      "start": 2257441,
      "end": 2259493,
      "timestamp": "37:37"
    },
    {
      "speaker": "Yuto",
      "text": "めっちゃ悲しんだりしちゃうし。",
      "start": 2259493,
      "end": 2261522,
      "timestamp": "37:39"
    },
    {
      "speaker": "Ayaka",
      "text": "そう、11時45分ぐらいになったらなんか、カウントダウン始まるし、やらなきゃって思うから、その感じでやっぱ、英語も、なんだろう、自分のこう、ハビットトラッカーとかで毎日つけていってて、そのアップができるの嫌だからとかって言われる人もいるかも。",
      "start": 2261532,
      "end": 2282706,
      "timestamp": "37:41"
    },
    {
      "speaker": "Ryo",
      "text": "そのデュオリングほどハビットトラッカーのストリークの、あれうまくいってなくない?ハビットトラッカーとかさ、番号とかは出るしさ、ウィジェットに追加とかはできるけどさ、デュオリンゴほどのなんか強制力というかさ。",
      "start": 2282706,
      "end": 2296540,
      "timestamp": "38:02"
    },
    {
      "speaker": "Ayaka",
      "text": "なんだろうね、デュオリンゴの強制力って。いや、。",
      "start": 2296540,
      "end": 2299352,
      "timestamp": "38:16"
    },
    {
      "speaker": "Yuto",
      "text": "デュオリンゴすごいですね。あれ多分もうガッツリそれこそなんかメンタル系の人が関わってそうですね、。",
      "start": 2299352,
      "end": 2305625,
      "timestamp": "38:19"
    },
    {
      "speaker": "Ryo",
      "text": "開発。",
      "start": 2305625,
      "end": 2305976,
      "timestamp": "38:25"
    },
    {
      "speaker": "Ayaka",
      "text": "うん、なんかテッドトークでデュオリンゴの社長が語ってたんだよな。えー。俺も最初に見たか忘れちゃった。",
      "start": 2305976,
      "end": 2313440,
      "timestamp": "38:25"
    },
    {
      "speaker": "Ryo",
      "text": "でもさ、なんか、僕デュオリンゴ、僕もポルトガル語をやってるんだけどさ、なんなら今もうすぐ500いくぐらい、500日いくぐらいやってるんだけどさ、日付、回数をためることが目的になっちゃうよね。",
      "start": 2313450,
      "end": 2330276,
      "timestamp": "38:33"
    },
    {
      "speaker": "Yuto",
      "text": "うん、。",
      "start": 2330276,
      "end": 2330637,
      "timestamp": "38:50"
    },
    {
      "speaker": "Ryo",
      "text": "なりますね。勉強あんまりできてない、ぶっちゃけ。もう僕そこは割り切って、確かに、割り切ればOK。でも、効率はよくはないよなっていうのは、ちょっと思っちゃってる。なんか、最初は特に単語だけやってて、特に英語と違って、ポルトガル語って全然僕たちが日常に接してこなかった言語だから、やっぱ単語はすごい大変で、だから単語を覚えるためにと思って最初やってたんだけど、で、なんか途中から、モチベーションが下がって、でもストリークは続けたいっていうので、結構適当にやるようになっちゃって。",
      "start": 2330637,
      "end": 2368391,
      "timestamp": "38:50"
    },
    {
      "speaker": "Ayaka",
      "text": "で、。",
      "start": 2368391,
      "end": 2369012,
      "timestamp": "39:28"
    },
    {
      "speaker": "Ryo",
      "text": "この頃は適当にやってるんだけど、スピーキングだけをやるようにしてて、だから毎日絶対喋って、発音の勉強にはなってる、発音の練習はし続けてるみたいな状態をやってるんだけど、でもなんかすごい、デュオリンゴすごいし、いいけど、なんだろう、やれる人からしたら効率は良くないのかもしれないかな。",
      "start": 2369012,
      "end": 2393197,
      "timestamp": "39:29"
    },
    {
      "speaker": "Ayaka",
      "text": "デュオリンゴはちなみに課金してますか?",
      "start": 2393197,
      "end": 2399328,
      "timestamp": "39:53"
    },
    {
      "speaker": "Ryo",
      "text": "課金してます。",
      "start": 2399338,
      "end": 2400868,
      "timestamp": "39:59"
    },
    {
      "speaker": "Yuto",
      "text": "全部課金してる。",
      "start": 2400868,
      "end": 2405150,
      "timestamp": "40:00"
    },
    {
      "speaker": "Ryo",
      "text": "でも、デオリンゴはそうだね、家族でうちのお母さんが使い始めて、ちょっとそれを助ける意味もあるみたいな。なんかちょっとうちのお母さんは、英語とか、うちの家族は弟2人は英語喋れるけど、親が喋れなくて、で、僕のパートナーと喋るためにちょっと英語の勉強を始めてくれたから、なんか助けられればいいなみたいなので、家族のを契約してるから、もう切れないっていうのも。今、その沼に陥ってる。",
      "start": 2405150,
      "end": 2438382,
      "timestamp": "40:05"
    },
    {
      "speaker": "Ayaka",
      "text": "すぐにいいよね、シェアできる。あと何でしたっけね、海外で働くのに必要な英語力はどれくらいでしたっけ?",
      "start": 2438382,
      "end": 2446660,
      "timestamp": "40:38"
    },
    {
      "speaker": "Ryo",
      "text": "確かに、めちゃくちゃ大切。どのくらいあったら出るんだろう?",
      "start": 2446660,
      "end": 2450899,
      "timestamp": "40:46"
    },
    {
      "speaker": "Yuto",
      "text": "でもそれこそ結構職場によるっていうのはありますよね。ネイティブが多いところとか、りょうさんのところみたいにアメリカの会社でこっちだったらアメリカの人とかもいっぱいいて、こっちにいたとしても大企業だったらだいたいネイティブの人が多くなるじゃないですか。ってなると求められるレベルというかは結構上がりますよね。",
      "start": 2450909,
      "end": 2476819,
      "timestamp": "40:50"
    },
    {
      "speaker": "Ryo",
      "text": "確かに、なんかバンクーバーっていうのがすごい多分、英語が第一言語だけど、すごい海外の人に優しい英語をしゃべるというか、もうみんななんかその半分ぐらい、半分ぐらいは嘘かもしんないけど、アジア人と半々っていうのもあるし、その移民がめちゃくちゃ多いから、もともとしゃべれない人たちとしゃべるのに慣れてる環境みたいなのがあるから、でもなんかミニマムでしゃべると、ミニマムどのぐらいいけたらいけるんだろうね。",
      "start": 2476829,
      "end": 2508608,
      "timestamp": "41:16"
    },
    {
      "speaker": "Ayaka",
      "text": "働くのにでしょ。なんか喋るっていうよりかは、リスニングの方が大事なのかな。なんかスピーキングってその人の、なんだろう、性格にもよるのかなと思って、なんか結構度胸ある人が、別になんか間違ってもいいやっていう結構強気な人は、スピーキングは別に下手でもコミュニケーション取れるじゃない。",
      "start": 2508618,
      "end": 2534064,
      "timestamp": "41:48"
    },
    {
      "speaker": "Yuto",
      "text": "そうですね。",
      "start": 2534064,
      "end": 2534404,
      "timestamp": "42:14"
    },
    {
      "speaker": "Ayaka",
      "text": "でもやっぱなんか、聞こえてきたことをちゃんと理解せずに、なんかコミュニケーション取っちゃうと、こいつ何のこっちゃになっちゃうから。確かに。最初はやっぱ、ミニマムは言われていること、全部じゃなくてもいいけど、聞き取って、わからないことを聞けるぐらいじゃないとだめ。信用に関わってくる。",
      "start": 2534404,
      "end": 2563606,
      "timestamp": "42:14"
    },
    {
      "speaker": "Yuto",
      "text": "いいのを思いつきました。youtbeで、youtbeとかyudemとかで、普通にチュートリアルなり何なり、ネイティブの人の講座とかを完全に分かれば最低じゃないですか。",
      "start": 2563616,
      "end": 2584334,
      "timestamp": "42:43"
    },
    {
      "speaker": "Ryo",
      "text": "結構難しくない?僕が僕が思いついたのは、あの、教育特有の勉強をせずに、教育の点数で800点取ればいけるかもしれない。",
      "start": 2584334,
      "end": 2597724,
      "timestamp": "43:04"
    },
    {
      "speaker": "Ayaka",
      "text": "あー、。",
      "start": 2597724,
      "end": 2598074,
      "timestamp": "43:17"
    },
    {
      "speaker": "Yuto",
      "text": "いいかもいいかも。",
      "start": 2598074,
      "end": 2599926,
      "timestamp": "43:18"
    },
    {
      "speaker": "Ryo",
      "text": "英語の、英語系の勉強とかなんかそのテスト系ってやっぱりさ、その対策ができちゃうじゃん。その対策することで、例えば、教育だと100点から200点ぐらい上げられたりするじゃん。",
      "start": 2599926,
      "end": 2611164,
      "timestamp": "43:19"
    },
    {
      "speaker": "Yuto",
      "text": "たぶん。",
      "start": 2611164,
      "end": 2612359,
      "timestamp": "43:31"
    },
    {
      "speaker": "Ryo",
      "text": "だからその対策っていうのをせずに、本当にもう自分の英語力だけで、別にスピーキングをちょっと1回抜いて、ソスで800点取れたら、まあ働けはするかもね。その、やっぱ言ってることは理解できそうだよね。",
      "start": 2612369,
      "end": 2626709,
      "timestamp": "43:32"
    },
    {
      "speaker": "Yuto",
      "text": "ありそう。",
      "start": 2626709,
      "end": 2629821,
      "timestamp": "43:46"
    },
    {
      "speaker": "Ayaka",
      "text": "まあ、そうね、単語力とか文法力。",
      "start": 2629821,
      "end": 2634515,
      "timestamp": "43:49"
    },
    {
      "speaker": "Ryo",
      "text": "単語と文法やっぱめちゃくちゃ大切じゃん。やっぱその理解しないといけないから。",
      "start": 2634515,
      "end": 2637917,
      "timestamp": "43:54"
    },
    {
      "speaker": "Ayaka",
      "text": "文法全くわからないとか、だと本当にむずいよね、。",
      "start": 2637917,
      "end": 2643258,
      "timestamp": "43:57"
    },
    {
      "speaker": "Yuto",
      "text": "何言われてもわかんないですね。",
      "start": 2643258,
      "end": 2646218,
      "timestamp": "44:03"
    },
    {
      "speaker": "Ryo",
      "text": "確かに。でもエンジニアじゃなければ多分もっと簡単なのとかあると、なんだろう、カフェとか難しいのかな?",
      "start": 2646218,
      "end": 2656100,
      "timestamp": "44:06"
    },
    {
      "speaker": "Yuto",
      "text": "いや、カフェ、自分一回働いてたことあるんですけど、それこそワーホリの大学2年生の時のワーホリカフェだったんですけど、やっぱり基本的に同じ言葉しか喋らないので、結構、エンジニアの方が高いと思いますね。エンジニアだけの英語とかもあるし。",
      "start": 2656100,
      "end": 2678716,
      "timestamp": "44:16"
    },
    {
      "speaker": "Ayaka",
      "text": "今、私が聞いたことないよ。",
      "start": 2678716,
      "end": 2681961,
      "timestamp": "44:38"
    },
    {
      "speaker": "Ryo",
      "text": "言うならば、コーヒーかお茶。出せればいいみたいな感じだ。",
      "start": 2681961,
      "end": 2690929,
      "timestamp": "44:41"
    },
    {
      "speaker": "Yuto",
      "text": "もんね最悪何か詰めたら。",
      "start": 2690929,
      "end": 2693230,
      "timestamp": "44:50"
    },
    {
      "speaker": "Ryo",
      "text": "どっちって言って難しいけどねきっと難しいけどでもやっぱその単語さえ分かれば分かりそうだ。",
      "start": 2693230,
      "end": 2699435,
      "timestamp": "44:53"
    },
    {
      "speaker": "Yuto",
      "text": "もんねそうですね確かに。",
      "start": 2699435,
      "end": 2702617,
      "timestamp": "44:59"
    },
    {
      "speaker": "Ayaka",
      "text": "職種によるになっちゃうの。",
      "start": 2702617,
      "end": 2704378,
      "timestamp": "45:02"
    },
    {
      "speaker": "Ryo",
      "text": "かなでも僕たちの場合ITの今バックグラウンドがあるんでやっぱエンジニアとかデザイナーデザイナーちょっと入れたくないなデザイナーめちゃくちゃ難しそうだからソフトウェアエンジニアだったらっていうのがいい。",
      "start": 2704378,
      "end": 2716107,
      "timestamp": "45:04"
    },
    {
      "speaker": "Yuto",
      "text": "んじゃないデザイナー確かに結構難しいですね。自分はそのカレッジデザイン系のやつ半年行ってたんですけど、なんかデザインの方が英語の求められるレベルは高いかなと思います。",
      "start": 2716107,
      "end": 2732920,
      "timestamp": "45:16"
    },
    {
      "speaker": "Ryo",
      "text": "デザイナーはビジネスのこともわかんないといけないしそうです。",
      "start": 2732930,
      "end": 2736353,
      "timestamp": "45:32"
    },
    {
      "speaker": "Yuto",
      "text": "ねなんかUXのこととかもガッツリ話すんでそうしたらビジネス側のもガッツリ話せるようにならないといけないし実際なんかその求められるIRとかの方はもうあのデザインのあれが一番高かった。",
      "start": 2736353,
      "end": 2750544,
      "timestamp": "45:36"
    },
    {
      "speaker": "Ryo",
      "text": "うんめちゃくちゃ難しいとうーんまあだからどうなんだろうスピーキングはなんかIELTSで4。\n5とかあればワンチャンいけんじゃないかなって僕は思ってるえ?6あったらもう結構いいと思うえ?",
      "start": 2750544,
      "end": 2772422,
      "timestamp": "45:50"
    },
    {
      "speaker": "Ayaka",
      "text": "4。\n5?",
      "start": 2772432,
      "end": 2773822,
      "timestamp": "46:12"
    },
    {
      "speaker": "Yuto",
      "text": "いや、いけるでしょ?",
      "start": 2773822,
      "end": 2775503,
      "timestamp": "46:13"
    },
    {
      "speaker": "Ayaka",
      "text": "4。",
      "start": 2775503,
      "end": 2775833,
      "timestamp": "46:15"
    },
    {
      "speaker": "Yuto",
      "text": "5はまずいじゃないですか?",
      "start": 2775833,
      "end": 2778334,
      "timestamp": "46:15"
    },
    {
      "speaker": "Ayaka",
      "text": "いや、。",
      "start": 2778334,
      "end": 2778624,
      "timestamp": "46:18"
    },
    {
      "speaker": "Ryo",
      "text": "いけるよ。いける、いける。",
      "start": 2778624,
      "end": 2780785,
      "timestamp": "46:18"
    },
    {
      "speaker": "Yuto",
      "text": "4。",
      "start": 2780785,
      "end": 2781125,
      "timestamp": "46:20"
    },
    {
      "speaker": "Ryo",
      "text": "5ってどれくらいなんですか?",
      "start": 2781125,
      "end": 2782726,
      "timestamp": "46:21"
    },
    {
      "speaker": "Ayaka",
      "text": "だって、6じゃないとPR取れないしね。いや、。",
      "start": 2782726,
      "end": 2785186,
      "timestamp": "46:22"
    },
    {
      "speaker": "Ryo",
      "text": "6じゃないとPRは取れないけど、だからリスニングは、リスニングっていうか、トイック800点自力で取れて、スピーキングは全然できないけど、4。\n5で生き残れはするんじゃないかなって。5か。じゃあ5でいこう。4。\n5、たしかにあんま聞いたことない。",
      "start": 2785186,
      "end": 2803502,
      "timestamp": "46:25"
    },
    {
      "speaker": "Ayaka",
      "text": "エンジニアはね、インタビューを乗り切らないといけないから、。",
      "start": 2803502,
      "end": 2806994,
      "timestamp": "46:43"
    },
    {
      "speaker": "Ryo",
      "text": "そもそも。",
      "start": 2806994,
      "end": 2808105,
      "timestamp": "46:46"
    },
    {
      "speaker": "Ayaka",
      "text": "インタビューって、たぶん、最初はワンオンワンで、。",
      "start": 2808105,
      "end": 2812448,
      "timestamp": "46:48"
    },
    {
      "speaker": "Ryo",
      "text": "たぶん、。",
      "start": 2812448,
      "end": 2812738,
      "timestamp": "46:52"
    },
    {
      "speaker": "Ayaka",
      "text": "ハイアリングマネージャーみたいな人がお話する。ワンオンワンは、絶対、椅子でこう、何だろう、会話の滞りなくできないと、。",
      "start": 2812738,
      "end": 2822294,
      "timestamp": "46:52"
    },
    {
      "speaker": "Ryo",
      "text": "まずいと思う。そこまでかな。",
      "start": 2822294,
      "end": 2825706,
      "timestamp": "47:02"
    },
    {
      "speaker": "Ayaka",
      "text": "グループトークになると、え、ダメかな?",
      "start": 2825706,
      "end": 2830276,
      "timestamp": "47:05"
    },
    {
      "speaker": "Ryo",
      "text": "多分、あやかさんは結構特殊なケースで、1冊目で結構いいところ行って、確かにその難しいと思う。でも、そのワンオワンでも、例えば上司が第一言語じゃなくて、その苦労を知ってたら結構汲み取ってくれたりするよ。",
      "start": 2830276,
      "end": 2848795,
      "timestamp": "47:10"
    },
    {
      "speaker": "Ayaka",
      "text": "本当?優しいな。",
      "start": 2848795,
      "end": 2850496,
      "timestamp": "47:28"
    },
    {
      "speaker": "Ryo",
      "text": "だから、いやそう、そういう多分優しい世界線もあるし、。",
      "start": 2850496,
      "end": 2856259,
      "timestamp": "47:30"
    },
    {
      "speaker": "Ayaka",
      "text": "優しい世界線あるんだ。",
      "start": 2856259,
      "end": 2858538,
      "timestamp": "47:36"
    },
    {
      "speaker": "Yuto",
      "text": "上司が、上司がスピーキング5。\n5とかあったら、5でも余裕かもしれない。それはない、。",
      "start": 2858548,
      "end": 2865032,
      "timestamp": "47:38"
    },
    {
      "speaker": "Ryo",
      "text": "それはない、さすがにそれはない。それは、やばいでしょ。でも、でもなんか、確かにワンワンで喋れないって、でもそれさっき多分、あやかさんがさっき言ってたように、言いたい気持ちみたいなのが強ければ、伝えたい気持ちが強ければ、その、なんとかはなるじゃん。だって、800点の文法力と単語力はあるわけだから、。",
      "start": 2865032,
      "end": 2889157,
      "timestamp": "47:45"
    },
    {
      "speaker": "Ayaka",
      "text": "確かに。つなぎ合わせることができるのかな。",
      "start": 2889167,
      "end": 2891818,
      "timestamp": "48:09"
    },
    {
      "speaker": "Ryo",
      "text": "そう。だからなんとか多分エンジニアだったら5で。",
      "start": 2891818,
      "end": 2896341,
      "timestamp": "48:11"
    },
    {
      "speaker": "Yuto",
      "text": "5。",
      "start": 2896341,
      "end": 2896501,
      "timestamp": "48:16"
    },
    {
      "speaker": "Ryo",
      "text": "5じゃないですか。5。",
      "start": 2896501,
      "end": 2898112,
      "timestamp": "48:16"
    },
    {
      "speaker": "Ayaka",
      "text": "5じゃないですか。",
      "start": 2898112,
      "end": 2899153,
      "timestamp": "48:18"
    },
    {
      "speaker": "Ryo",
      "text": "いやいやいや、5でいけるでしょ。俺も結構まだ4。\n5よりだけど。",
      "start": 2899153,
      "end": 2905586,
      "timestamp": "48:19"
    },
    {
      "speaker": "Yuto",
      "text": "なるほど。でもみんな違うっていう。",
      "start": 2905586,
      "end": 2910699,
      "timestamp": "48:25"
    },
    {
      "speaker": "Ryo",
      "text": "でもサバイブだからね。うまくやれるじゃないよ。それがそこからもちろんその人は成長しないといけないけど、4。\n5から始められるんじゃないかなって、。",
      "start": 2910699,
      "end": 2922853,
      "timestamp": "48:30"
    },
    {
      "speaker": "Ayaka",
      "text": "僕は。",
      "start": 2922853,
      "end": 2923964,
      "timestamp": "48:42"
    },
    {
      "speaker": "Ryo",
      "text": "確かに。",
      "start": 2923964,
      "end": 2924645,
      "timestamp": "48:43"
    },
    {
      "speaker": "Ayaka",
      "text": "その会社でも、そういう、組み取ってくれるような。",
      "start": 2924645,
      "end": 2928407,
      "timestamp": "48:44"
    },
    {
      "speaker": "Ryo",
      "text": "そうそう。だから、どこでも入れるじゃなくて、そういう、ゆるいって言ったら、英語の優しい世界線の上司がいる会社に、引っかかるかもっていう意味です、。",
      "start": 2928407,
      "end": 2941025,
      "timestamp": "48:48"
    },
    {
      "speaker": "Ayaka",
      "text": "僕は。ネイティブスピーカーじゃない人が起用した会社とかだったら、そこまでかも。バンクーバーとか、結構多いもんね。",
      "start": 2941025,
      "end": 2950284,
      "timestamp": "49:01"
    },
    {
      "speaker": "Ryo",
      "text": "ファンクーはそういう人が多いし、その上司がやっぱり第一言語が英語じゃないって、その苦労したのを知ってるから、エンジニアだから、書く行動さえ良ければみたいな、そこまでじゃないけど、書く行動が良くて、あと結構、スピーキングだけじゃなくて、スラックとかで結構しゃべれたりするから、で、この800あれば、トイック800あれば、そこらへんはなんとかなりそうじゃん。",
      "start": 2950294,
      "end": 2979936,
      "timestamp": "49:10"
    },
    {
      "speaker": "Ayaka",
      "text": "文法力を駆使して書く内容はすごいちゃんとしてるってなれば、結構印象は違うかも。やっぱりスラックでメッセージすることも頻繁にあるから。あとなんかこっちあるあるかもしれないけど、相手のコミュニケーション能力が高すぎて、全然伝わってないかもしれないのに、向こうが全部汲み取ってくれるパターン。そんなことある?でも、たぶん、本人もそこまでわかってないと思うんだけど、たぶん、番組はあるあるかな。なんかやっぱり、自分の親とかが、そんなに英語が上手じゃない。",
      "start": 2979936,
      "end": 3018834,
      "timestamp": "49:39"
    },
    {
      "speaker": "Ryo",
      "text": "とかっていう人が、。",
      "start": 3018834,
      "end": 3021535,
      "timestamp": "50:18"
    },
    {
      "speaker": "Ayaka",
      "text": "すごい理解能力高くて、断片断片でしか多分伝わってないはずなのに、すっごい頭の中で繋ぎ合わせて、こういうことだよねとか言った時に全て合ってて、すげーこの人って思うとか。いるいるいる。",
      "start": 3021535,
      "end": 3037204,
      "timestamp": "50:21"
    },
    {
      "speaker": "Ryo",
      "text": "僕、よく中国系の3世、4世、2世、3世とかが多いじゃん、やっぱりカナダって。その人たちの、英語はちゃんと上手なのに、僕たちの英語を理解してくれる能力は、確かにめちゃくちゃすごいかもしれない。",
      "start": 3037214,
      "end": 3052839,
      "timestamp": "50:37"
    },
    {
      "speaker": "Ayaka",
      "text": "すごいよね、感動したもん。すごい初期に、なんかすごい助けられた。",
      "start": 3052839,
      "end": 3061737,
      "timestamp": "50:52"
    },
    {
      "speaker": "Ryo",
      "text": "そしたら最後に、2人ともこっちでもう仕事されてると思うんですけど、仕事してる中でこういうところ苦労したよ、英語で苦労したよみたいなのあります?たくさんあると思う、特にあれば。",
      "start": 3061747,
      "end": 3076461,
      "timestamp": "51:01"
    },
    {
      "speaker": "Yuto",
      "text": "はい苦労したのなんか自分がその知らない領域とかを任された時にそれこそなんか英単語とかもあんまり知らないしでなんかミーティングの時に知らない領域なんでめちゃめちゃ頭を使わないといけなくてでかつ英語でそれを喋らないといけない説明しないといけないみたいなになったとき。",
      "start": 3078243,
      "end": 3102636,
      "timestamp": "51:18"
    },
    {
      "speaker": "Ryo",
      "text": "例えば違う領域ってどういう領域。",
      "start": 3102636,
      "end": 3104096,
      "timestamp": "51:42"
    },
    {
      "speaker": "Yuto",
      "text": "なのなんか自分今2社目なんですけどあの1社目の時はもうめちゃめちゃフルスタックでデザインもやってみたいのをやらされててでなんかそのサーバー周りとか全然自分得意じゃないんですけど人数がいないから自分がそっちもやらないといけないクラウドがとかもやらないといけないってなって上司にどんな感じって報告してる時とかでめっちゃ掘られたりしてあーもうもうダメちょっと待って待って待ってみたいなちょっとゆっくり説明させて俺もあんま分かってないからみたいな確か。",
      "start": 3104096,
      "end": 3141949,
      "timestamp": "51:44"
    },
    {
      "speaker": "Ryo",
      "text": "に僕たち英語だとさ知らない分野になると途端に幼稚園児みたいになっ。",
      "start": 3141949,
      "end": 3147053,
      "timestamp": "52:21"
    },
    {
      "speaker": "Yuto",
      "text": "ちゃうじゃんマジで全然分かんない。",
      "start": 3147053,
      "end": 3152917,
      "timestamp": "52:27"
    },
    {
      "speaker": "Ryo",
      "text": "確かにその知らない分野っていうのはめっちゃなんかその英語でメモリ使うしその知らない単語多くてメモリ使うしめちゃくちゃメモリー使う感じが出て、全然口から出てこないみたいなのになる。",
      "start": 3152917,
      "end": 3166641,
      "timestamp": "52:32"
    },
    {
      "speaker": "Yuto",
      "text": "なんかもう脳がショートしてる感じになりますね。わかる。煙出てる感ある。それが一番きついですね、やっぱり英語。",
      "start": 3166641,
      "end": 3177087,
      "timestamp": "52:46"
    },
    {
      "speaker": "Ayaka",
      "text": "エンジニアだと余計にね、頭を使わないと。",
      "start": 3177087,
      "end": 3182470,
      "timestamp": "52:57"
    },
    {
      "speaker": "Yuto",
      "text": "そうですね。",
      "start": 3182470,
      "end": 3185870,
      "timestamp": "53:02"
    },
    {
      "speaker": "Ayaka",
      "text": "私はね、エンジニアとして黙々と仕事する分には良いんだけど、人の前で発表したりとか、リベートじゃないけど、自分がいろいろ決めないといけないプロジェクトをどう進めていくとか、自分の持ってる、なんだろう、自分がこの、分野担当しますか?ってリードしないといけない時とかに、なんかどう思う?なんか、いつまでに終わると思う?とかなんか、その突発的にパッて質問されて、パッて答えないといけないんだけど、ある程度こう、考えて、ものを言わないといけないとかに、それこそショートするじゃないけど、考えつつ、これも考えないといけないよな、これも考慮しないといけないよな、とかっていうのを、頭ん中で考えつつ、人にわかるように話すってなったときに、途中で、自分が何言ってるかわからなくなってきて、笑われるみたいな、人に、そうだな、大きい会議とかになってくると、偉い人とかもいると、ちょっと緊張するのもあるし、質問されて答えるっていう単純なことなんだけど、それらしいことを言うのが難しくて、今も苦労します。それは。めっちゃ準備しないとって思う。",
      "start": 3187510,
      "end": 3281118,
      "timestamp": "53:07"
    },
    {
      "speaker": "Ryo",
      "text": "あれだよね、発表はいいけど、発表の後に何か質問あるって言った時に、こっちの人たちめっちゃ質問してくるじゃん。",
      "start": 3281128,
      "end": 3288013,
      "timestamp": "54:41"
    },
    {
      "speaker": "Ayaka",
      "text": "発表の後が一番しんどい。",
      "start": 3288013,
      "end": 3290074,
      "timestamp": "54:48"
    },
    {
      "speaker": "Yuto",
      "text": "で、。",
      "start": 3290074,
      "end": 3290134,
      "timestamp": "54:50"
    },
    {
      "speaker": "Ayaka",
      "text": "言い切りできないじゃん、何聞かれるか。だから、まあ発表だけは準備頑張っていくんだけど、何聞かれるか、予想外のカーボールを出された時に、ってなっちゃう。",
      "start": 3290134,
      "end": 3303804,
      "timestamp": "54:50"
    },
    {
      "speaker": "Ryo",
      "text": "確かに確かに。僕なんか、あの、入った当時、今の会社入った当時、みんなアメリカにチームの人たちはいるから、なんかバンクーバーの人たちのオールハンズって言ってみんなが集まるミーティングがあるんだけど、そこで各チームがやってることを紹介するみたいな、紹介してそれについて説明して質問して終わりみたいなのが5分くらいあるんだけど、僕はバンクーバーチーム1人だからいつも僕が発表で、でいつも質問でみんなそのチームについてあんまり知らないからいつもちゃんと質問くるんだよねもうすっごいもう3ヶ月にしかもそれが3ヶ月か4ヶ月に1回あるからもうすっごい嫌ででバンクーバーって言っても100人ぐらいいるから結構緊張もするしさちょっと確かにそういうのはめっちゃ苦労するよねもうこれからもうすっごい必死になってあのありなんか来そうな質問考えてで答え用意し。",
      "start": 3303804,
      "end": 3358847,
      "timestamp": "55:03"
    },
    {
      "speaker": "Yuto",
      "text": "とくみたいな用意するんです。",
      "start": 3358847,
      "end": 3361196,
      "timestamp": "55:58"
    },
    {
      "speaker": "Ryo",
      "text": "ね一応っていうのを最初はしてたで途中の方からまあ別にワンチャンわかんないでいけるなみたいなのもありすぐ出ないものは後で返すって終わるようにでちょっとずつは楽になったけどでも最初の3回ぐらいはもうなんか嫌。",
      "start": 3361196,
      "end": 3379140,
      "timestamp": "56:01"
    },
    {
      "speaker": "Ayaka",
      "text": "な気持ちだよね爆風を踏まない突然というのも上達しないけど時々しか起きないイベントとかだったね。",
      "start": 3379140,
      "end": 3392331,
      "timestamp": "56:19"
    },
    {
      "speaker": "Ryo",
      "text": "そうなんだよね。",
      "start": 3392331,
      "end": 3393552,
      "timestamp": "56:32"
    },
    {
      "speaker": "Ayaka",
      "text": "良くなったと思ったら、次ダメで、みたいな。そこで、英語暗黒期に入る。",
      "start": 3393552,
      "end": 3401828,
      "timestamp": "56:33"
    },
    {
      "speaker": "Ryo",
      "text": "僕が困ったではないけど、たまに困るのは、ファシリテーター、ミーティングのファシリテーターは結構なんか、やだったね。それもなんか、毎週やってると慣れたりするけど、やなやだったなってかなんかたまにでも今でも今でもなんかそのずっとやんないで久しぶりにやってを準備もしてないみたいになっちゃうとなんかを追ってあとそのなんか形式が決まってないミーティングのファシリティーだとか結構やらね。",
      "start": 3401828,
      "end": 3434570,
      "timestamp": "56:41"
    },
    {
      "speaker": "Yuto",
      "text": "うーんファシリテーターが毎回いるんですかミーティングにいる。",
      "start": 3434570,
      "end": 3440512,
      "timestamp": "57:14"
    },
    {
      "speaker": "Ryo",
      "text": "なんかその、例えば、あの、スプリントのリストロスペクティブみたいな、あの、反省会みたいなのも、その人が決まってたりだとか、あとなんか、うちのチームだと、今日、みんなで、その、エスティメート、なんだろう、どのくらい時間かかるかみたいな、そう、プランニングの時に、なんか、この、トピックはみんなでコスト医者なんかエスティメイトしようみたいなのがあってそれのファシリテーターもいるし1個割とファシリテーターがいてで割とみんな1個ぐらいはそのファシリテーターのあれを持つみたいなのがあるからでもそれはね割となんか毎週か毎スプリントあるからその1,2回では慣れる3回目ぐらいからはなんかまあ。",
      "start": 3440512,
      "end": 3489775,
      "timestamp": "57:20"
    },
    {
      "speaker": "Ayaka",
      "text": "前は英語嫌いになった時どうするって話してた。",
      "start": 3501981,
      "end": 3506330,
      "timestamp": "58:21"
    },
    {
      "speaker": "Ryo",
      "text": "確かに実は僕たちこれ今回2回目で1回目のデータが消えちゃったんで確かに僕結構それはシンプルで別になんかあんまり落ち込まないんで僕その挫折はするんだけど前言ってた挫折で言うとタブーっていうゲームがあってタブーっていうゲームってグループの10人だったら10人で半々に分かれてカードにトピックとそのトピックに近いワードが5個ぐらい並べられててそのトピックについて説明するんだけどそのトピックとその5個ぐらいリストされているワードを使わずにそれについて説明しないといけなくてで自分のチームの仲間にそのトピックのワードが何だかを当ててもらうっていうのを1分間の間に何枚当ててもらえるかみたいなゲームでそれを僕と僕のパートナーと他の人たちは全員ネイティブでしかもなんかみんな割といい大学行っててみんななんか頭いいというかボキャブラリーが多い人やって他の人たちが1分間に6枚とか7枚とか当てられていく中自分は最初0枚とか1枚とかでなんならそのトピックのワードが分からないとかっていうのがあってそれに結構挫折感を感じ帰りの車の中で、アマゾンで注文して、その後2人でやるっていう。だから、そういう挫折とかはちょくちょくあるけど、あんまりそれで嫌いになったりとか落ち込んだりはしない。なんかあります?確かあれだよね、あやかさんは暗黒期みたいなのがあるって言ってたよね。",
      "start": 3506340,
      "end": 3614560,
      "timestamp": "58:26"
    },
    {
      "speaker": "Ayaka",
      "text": "私、定期的にやってきますよ。もう英語嫌。喋らない。もう耳も受け付けない。",
      "start": 3614560,
      "end": 3624574,
      "timestamp": "60:14"
    },
    {
      "speaker": "Yuto",
      "text": "家帰ってからも英語ですもんね。",
      "start": 3624584,
      "end": 3627746,
      "timestamp": "60:24"
    },
    {
      "speaker": "Ayaka",
      "text": "ずっと英語はね。家帰ってからも英語だし、あまり成長を感じなくなってくるじゃないですか、長い期間。引っ張ってると。意識的に勉強しないといけないっていうリマインダーでもあるんだけれど、難しいよね。ネイティブにもなれないし、と言って、一応日常生活とか仕事は多くできちゃうから、毎日忙しい中で、時間が取れないとき、ちゃんと勉強できてないとき、罪悪感、勉強してない時の罪悪感と、理想の高さとかにやられて、もういいって感じになるけど、どうせ日常を送らないといけないし、英語を使わないといけないから、なんか、よし、もうちょっとやってみるかっていう風に戻る時もあるんだけど、なんかこう、暗黒期に入る時は、意識的にもう聞かない、喋らない、アタッとする、そしてリセットする時もあります。別にそういうのがない人はいいけど、あっても、また戻ってやり始めればいいだけの話だから休憩してもいいんじゃないかなと個人的にはと。",
      "start": 3627746,
      "end": 3710832,
      "timestamp": "60:27"
    },
    {
      "speaker": "Ryo",
      "text": "いうことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますSpotify、ApplePodcast、YouTbeなどで番組のフォローをぜひお願いしますまたXでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお待ちしておりますありがとうございました。",
      "start": 3710832,
      "end": 3728845,
      "timestamp": "61:50"
    }
  ],
  "highlight1": "英語を勉強し続けるモチベーションを保つコツは、毎日自分の目標を思い出してみることです。",
  "highlight2": "英語が上手になることで得られるメリットの1つは、海外旅行がより楽しくなることです。",
  "highlight3": "英語を学習する際には、インプットとアウトプットのバランスを意識し、シャドウイングやリピーティングを効果的に行うことが重要です。"
}