{
  "episodeGuid": "fff05294-4f54-4e0f-a290-490b01bb949a",
  "episodeTitle": "フリーターからカナダで年収1450万へ！カナダ→日本外資で働くシニアエンジニアのキャリア論（後半）#10",
  "transcribedAt": "2025-10-19T21:01:30.365Z",
  "duration": 3257,
  "fullText": "そしたらk君に来ていただきました後半戦よろしく。お願いしますよろしくお願いしますお願いしますいつ。もはえっと就職してその後の下りから始めるんですけど結構前半が長くなって盛り盛りになってで3社目えっとカナダがカナダの中で3社目経験されてるんですよ3社経験されてるんですよね3社目のあの練習も聞いてもいいですか前回。が一応前回があれだよねあの最後を聞いた時は85系くらいっていうね話し合ったところ日本円関西で850万くらいだと思いますが3社目一体いくら。になったやろうねぇそっからでもそのインターナルで昇進してでシックスフィギュアに乗ったんですよ前の会社で。あインターナルじゃあ2社目の2社目でもうじゃあ1000。万の人そうで3社目は転職して3社目でもその給料のインクリーズが良かったんですけど一番最初の給料としては125系でしたね125。一番最初に3社目から来たオファーってこと?そうそうだよね素晴らしい1250万いきなり業界経験2年目の人ですか3年目の人ですかもうその時。で3年目の時か。な3年目、業界経験3年目の人が1250万というのが、なるほど素晴らしいですね。なんかすごいジャンプをしましたね。K君の努力を見てるから、効率いいと一概には言えないんだけど、でも大学も別に出ずに高卒で来て、ワーホリで来て、一応専門学校行ったにしろ3年目でそこまで行くとなると、効率がいいのかなって。思ってますよねだからこれを目指して来られる方々がフロップにも多いんです。よ思っちゃいますよやっぱりその。パス行きたいってそうなんかみんななんか舞台の上のスポットライト当たった姿見てるけどその舞台の遥か地下3階下から俺はロッククライミングで上がってますからねみんな梯子で上がれるところ。を落ちたら死ぬみたいな落ち。たら死ぬをずっと繰り返してたまたま落ちなかったっていうあれなのでみんなはちゃんとね梯子を張って綺麗に安定させてから登ってくるけどなのでそうリョウの言う通り飛行率は全然良くなかったですからねまあだから。効率っての最短距離で行くという意味で言うんだったらもうめちゃくちゃいいんだろうけど最安全でそうそうね確実に行くって意味あったら最低とまで言わんけれどもなかなか博打打ちやったよねっていう。とこですねとにかく再現性はないですね多分僕が使った石を全部綺麗に同じ石使って上がってきたとしても多分どっかで落ちると思うんで。ちなみに単純な疑問なんだけどKさんの周りには当然トガシさんとかだけじゃなくて未経験の人とかもいたわけじゃないですかその当時ってその人たちっていなかったの?いたの?いなかった?知り合いはいたけどでも俺と全く同じ属性の人ってあんま友達にいなかったな、言われてみれば樋口あ、ほんと?え、。その妖怪経験ゼロとかって人はいなかったってことですか?ヤンヤンいなかったっすね樋口えー、。あ、そうだったんだ、いやケイさんみたいな人って実際就職してんのかなーって聞こうかなって思った。けどヤンヤンなんか僕の下の台したむがいってか僕より後にバンクーバー来た人たちでそういう人は何人か知ってますけどその人たちは日本人ではやっぱりいろんなキャリア感があるなぁと思ってバンクーバーに残る人っていうのはやっぱりめちゃくちゃ人握りだなやっぱりでも日本帰ってからいい会社入ってとか楽しそうにしている人は多いですね。そうだよねかなりいい会社にみんな入ってるもんね日本か日本帰った人たちも樋口いや素晴らしいじゃあ3社目1250万からの?ヤンヤンからの?お金の話大好きか樋口。そりゃそうだろとりあえず食いつくのはそこやろヤンヤンとりあえず金から。入るそっから125系からあれだったんですよあの前の会社のCTOだった人から新しい事業立ち上げたから家入らないってモントリオールの会社からお話もらってそこでそう給料の交渉とかして最終的に出た数字が140系って言われてでその時働いた会社に140系でオファー出てるんだけどどうしますかっていうとカウンターオファーで145系になったので145系に入社半年で上がったみたいな感じでしたね当時は素晴らしい、。ワンチャンケイさんがモントリオ行ってた可能性があるっていう。のもちょっとあれやねリモートでしたけどね、。その会社はあーそうだったんだ、そうかそうかいやー素晴らしい、業界3年半くらいですかじゃあ、にしていや、。そことの時点で4年くらいかな、。たぶん4年くらいか、にしてっていう部分で1400万、1250万1250万台に乗っ。たという1ドル100円。換算で法律という話を。していいんだったらもう。最短距離なんだけどって話をまた無理です繰り返しやなくちゃいけないんですが。同じ話を話し話になっ。ちゃう間違いないさまじいなあっていうこれはことでもとがしさん的にもそれはそうだよねって話もはや。まあ努力してたからねずっとって感じですよねなんか。視聴者的にはほらだからその努力っていうのは果たしてねなんか自分でも可能な範囲の努力なのかみたいなところは多分聞きたいんじゃないかなと。は思うんですけどできるんじゃない?それで言うと、就職してからは可能なんじゃないですか。でも、けいくんいろんなところに顔も出してましたよね。TL界みたいなの行ったりだとか、リアクトバンクーバーだったかな、とかで喋ってみたりだとか、別にやらなくてもいいことを人前に出て喋ってでいろんな人と喋って結構リアクトバンクーバーの人とかバンジーエースの人とかかなと結構そのオーガナイザーとかもとも中仲良くしているみたい。なイメージだそうだってむしろそれ約等バンクーバーのあのサイモンっていうオーガナイザーの人僕の会社入ってましたよね最終的に入れ替わりで変わったんだけど懲戒でこの辺。は別れるよねだからトガシさんは逆にどっちかというとぶっちゃけでしょあのミートアップとかってあんまり頻繁には行ってなかったタイプでしょ行っ。てなかったし行ってないですね今でもなんか。その辺の差って確かになんか視聴者からすると気になるんじゃないかなとは思うんですがまあKさんはなんで行ってたっつったらもはや就活?就活やから普通に好きだから行ってたっていう感じがありますねなんか英語で登壇ってかっこいいじゃないですかそれをしたいなってずっと思っててで一回やってみたら楽しくてそこから定期的にこの登壇っていう機会を設けることで技術のキャッチアップにもなるし続けようっていうので続けてたらそっから就職も決まりこれってやり続けるといいじゃんみたいな感じで自分の中の発見があったのでやってたっていうのもありますしやっぱあれですね僕が崇拝しているケントシードッツっていう有名なエンジニアの方元ペイパルの人がいるんですけどその人もやっぱりその技術登壇とかはめっちゃいいよみたいな感じで進めてたのでそれを愚直に実践してたっていう部分もあるのかなと思います。ねなるほどね啓蒙してる方もいたということで。それであの逆サイドの意見から言うとそれで言うとえっと登壇するのってやっぱり恥ずかしいじゃないですかまず日本語でも恥ずかしいじゃないですかで英語で間違えたらもっと恥ずかしいじゃないですかでなんなら技術のキャッチアップもしないといけないじゃないですか結構大変ですよそれは僕にはできないですわっていうのが結構僕も含めてみんなの意見なのか。なって思ってますがだからあれなんじゃない?その恥ずかしさを超えるほどのメリットがもう目の前にぶら下がってない限りはっていう枕言葉つくのかなと思う。んですけどうーんそうですね確かにそこはなんか1。回やってみたらいいのかもね僕も1回もやってないんであの試しでねわかんないっすわ。いいのかもしれない。これ、今後ちょっと考えてみます。で、ぼくは、それでいうと、言い訳として、別に登壇しても、オファーっていうか、なんていうのそのレファレルはもらえたとしてもオファーもらえるわけじゃないから僕はあのインタビューの練習するんだと。思ってそれも怪異であの。まあ言い訳なんですよ。言い訳じゃないと思うしそっちの方がまあちゃんとトランスファラブルだしスキルとしてはなんか登壇できるからといってエンジニアとして強くなるかどうかといったら直接的にはそうではないし絶対キャリア上その面接って先で通れないもんだから面接に時間を通した方が効率はいいと思います俺もロッククライミングじゃなくてハシゴってことですよそれがで。もねでもねって言ったらかもしれないけど俺本当に東橋さんとKさんのこの2つの両極端の話はもう無茶苦茶してて実は裏でそう方ややっぱり計算はほらネットワーキングだったりとかねさっきのまああのバンジーエースの中役とバンクーバーだっけどっちか忘れちゃったけどまぁね仲の人とちょっとな仲良くなってみたいなことが食べるとかでどんどんキャリアやっぱりつなげていくタイプでまあかといってとかさも相当いい会社にね今働かれていてっていう分でじゃあその方法は何だったのつったらもう対策の部分がかなりやっぱりのメイトを占めていてそうでその対策っていうにおいてもやっぱ面接とかねあのの行動面接だったりとかやっぱりそういった部分でどう超えていくのかまあフロックのねイベントでもやっぱりエジメ買いとかやっていただいたりとかしたのでなんかすごいいい塩梅で両方の方法があるよってたくさんの視聴者に伝える場としてはここいい。かもね確かに確かに。心地良い方でやればいいんじゃないですかね苦手な。人はそこと苦手やしさそういうどっちのどっちのもうもう対策のためだけにやっぱり時間使うの苦手な人は苦手やろうし人前にずっと出るのが苦手な人も絶対苦手やろうしうそーまあで。もやっぱ楽しいっていうのがいいんじゃないですかね僕はやっぱその対策すんのは楽しいんですよね結構その対策してるうちにここはもうカバーできたなとかって思いながらやってるとそれに楽しみを覚える人だったんでその楽しみながらできるみたいなのがあったし経験も多分やっぱりみんなの前で喋ることでそれが楽しいとかキャッチアップしてなんか終わってみたら結構技術のついてだとかそれについて話せるようになったことなったぞとかって思ったらやっぱ多分楽しいんだろうし自分の楽しいに従ってやっていくのがいいのかなぁなんて感じますね。だからどっちかの方法しかないんだっていうふうにこう目なんか視野が狭くなることが一番怖いよねそういう意味でなったら確かに。全部できたらすごいですからね。まあまあ全部やるべきなのかもしれないけどさとは言ってもそう合う合わない。はあるからね全部できるスーパープレイヤーはいくらでもいます。からね世の中いや間違いないよとんでもない奴もいますからね本当怖いは特に東京みたい。なとこいるとはい、。そしたら、これまで結構やっぱり、今までの人、みんな、現在海外にいる人を中心にインタビューしてきたんですけど、けいくんは、初めて、こっちで、こっちというか、カナダで永住権を取って、3社経験して、それを踏まえて日本に帰ったんです。帰って、今は日本で働いてるんですけど、カルチャーショックというかなんか働いてみてどうですかざっくり日本で今は日本のit業界でも働いていてまあカナダの業界であのサースとかの業界でも働いてたと思うんですけどなんか違いってあります?外資っていう文脈で言うとやっぱカルチャー的には今まで自分がいたバンクーバーの会社と近いものがあるのかなと思いつつでもやっぱり日本っていう環境で日本人と一緒に働くとなんか今までなぁなぁルール的になぁなぁでまあやりやすいなぁと思ってた部分がしっかりなんか怒られたりとかこういう風に対外的に出て会社の名前出したら怒られるとか、そういう機会は増えたなと思うので、自由度っていう面では結構減ったのかなと思います。あと、9時5時じゃなくて9時6時になったのは俺は未だに不満ですね。そこの1時間、でかいのか、。やっぱ。マジでクソですね、。この1時間。それはエンジニアであっても、生化物ファーストではなく、。やっぱ時間ベースになるんですか?はそのなんだろ他のシフト制の仕事とかに比べると若干緩さはあるんですけどそれもやっぱり6時まではオンラインっていうその暗黙の了解なんかあるじゃないですかバンクバーでも5時まではとりあえずオンラインだよねみたいなあれが6時まであるので5時半にミーティングとか突っ込まれるとマジでないるみたいなあっ。たりしますねなるほどねあとあれだよね日本って割かし大金管理がすげー確か外資であったとしても確か厳しいっていうのがねあれ。僕僕の観測範囲では、僕が見てる外資のエンジニアさんたちはそんなことない。っていうか、エンジニアさんたちはそんなことないんじゃないかな。なんかそんな大金出金取るイメージはないけど。取る会社もあると思いますけど。僕の観測範囲ではいない。本当、外資だからなのかな、割と俺結構イケイケのスタートアップだねっていう風に言われる、なんか日本のスタートアップの方々と喋るけど、なんか多分法律上のは決まってるから、実は大金ちゃんとつけなくてはいけないんだよ、つけてないように見えてもねっていう風に言われたんで、へーって思ってたんだよな。へーそうなんだ。あれがもっと何もやんなくていいのかもしれないですね。確かその話あの1回目の、1回目2回目で。あの優吾君と確か話し。てたんだけど、確かにそういう意味ではなんかそういうなんか、退勤とかはけっこう明示的にあるみたいなのがあるみたいですね。でも、。そうか。5時から6時になったので、そんなに不満ですか?めちゃくちゃ不満っすね。高畑が1時間やんって思っちゃうと。いや、。でかいよ、。その1時間。毎日だからね、でかいでしょ。いや、なるほどね。これはちょっと、雇われが最近あんまり僕はないので、そうか、1時間のやっぱ重みってのがあるわけですな、。きっと。他からのプレッシャーみたいなのはあるよね?ピアープレッシャー、。あるかな?6時っていうことに対する例はないけど、他の人たちもみんなやっぱり同じ時間で働いてるからみたいな。全然、日本ではないんだけど、カナダの会社から今、僕はアメリカの会社に移って、結構、で、僕はアメリカのチームの人と働いてるから、プレッシャーみたいなのはちょっとあって、僕も結構、5時以降もたまに働いたりもしてるぐらい、サンフランシスコの人たちってやっぱり、結構頑張ろうみたいな人たちが多いし、アメリカ人って結構いっぱい働くんで、その人たちに合わせると、どうしても僕の時間は、けっこう他のバンクーバーのメンバーより長くなってるなって感じてて、それをなんか考えたときに、やっぱりなんかプレッシャーなのかなって思って、。で、。それ考えると、やっぱそれを日本人に当てはめると、やっぱ日本人ってアメリカ人よりも全然働くんで、その中でってなると、やっぱりけっこう6時までちゃんと頑張んなきゃなみたいな気持ちになりそうだなって、。僕、。思いましたね。ここは割と実は俺も聞いてみたかったところの一つが今出てきたんだけどバンクーバーでさあやっぱりそのトガシさんみたいななんだろうアメリカ日本社から会社で働くとまあアメリカチームで働く人が多いじゃないですかまあ俺が知ってる限りあとまあね朝なさんもそうだしセールスフォースもそうだしあとはアマゾンもそうだし割かしアメリカチームと一緒に働いてるんだみたいなのが多いなとは勝手に思ってるんだけど実際日本の外資で働かれてる方々ってどういう層の人たちと一緒に働く人が多いのかそれこそ日本のチームと働くことが多いのかってなんとなくの傾向分かりますか?ヤンヤン会社によりけりじゃないですかね、やっぱりひとくりに外資って言ってもデカすぎるんでその。ギャップが樋口まあねヤン。ヤン例えばアサナとか、アサナは分かんないけど、例えばセールスポーツとかだったらめちゃくちゃデカいからもはや日系企業って言われたりするじゃないです。か樋口ああまあそう、。日本にあるとねヤンヤン。そういった文脈で言うと働くのは日本のチームが主流になるだろうしそうじゃないgotmarket型のこれから作っていくぞっていう会社で働くとやっぱコミュニケーションは本社の方になるしそこは一応に外資だからこうっていうのは言いづらいですよね。なるほどねこれやっぱ日本ってマーケットがクソでかいじゃないですか言うてもだから俺がもしもアメリカのその本社の会社の気持ちになるんだったらやっぱ日本にブランチを開けるイコール日本に市場を広げたいから出すわけだろうなとは勝手に思ってはいてすると多分働くチームメンバーとしてはやっぱり日本スペシャリストの人たちが多いのかなっていうのが俺の勝手な予想ではあったんですよねいや、。実際そうだと思いますよ。日本で例えばおかかえの営業部隊がいたり、日本のCSMってカスタマーサクセスマネージャーっていうポジションがいて、そこで大口のお客さんの面倒を見る窓口があったりとか、そういう日本のビッグカスタマーを抱えるための部隊みたいなのはやっぱり多いんじゃないかな、外資っていう括りで考えると。けいくんの働き方的にはどんな感じなんですかけいくんは一応エンジニアで入ってるじゃないですかで前に聞いたところで言うと今のところ日本支社にはエンジニア二人なのかなでそれ以外の人たちそれ以外のごめんなさいエンジニアとコラボする場合も結構ある感じなの仕事の中で僕は基本。的にはその働いているエンジニアリングのチームが本社にあるチームだからその日本でのコラボレーションっていうのはあんまり発生しないかなだからなんだろううんそんなに何か外資外資強度マーケットというイメージではないなんかそれで言う。とさっきのセナさんの質問は結構サイズによるのかなーって思っててサイズが小さいと絶対アメリカのチームと働くんですよそうするとやっぱりアメリカの人となるとなりやすくてで僕の会社の中でも僕のチームはあのニューヨークとサンフランシスコとバンクーバーにいるんで、そういう働き方になってて、でもほとんどのチームはバンクーバーのチームで、結構やっぱ、。緩い、。アメリカよりも緩い働き方してて、多分、アマゾンとかもそのチームによりイケリで、そのバラバラになっているところはそのちょっと厳しいところに合うみたいなアメリカの方に合うみたいななってて多分カナダでチームが完結しているところとかはそうあの緩いというかカナダの車のカナダのなんていうの国風なのか車風なのかわかんねーけどえっとによる感じになるのかなってちょっと僕のイメージですよね。いやほらやっぱり日本のそういう外資で働く人たちと話す機会が最近増えたからさそうそうちょっと日本の外資のこともいろいろ知りたいなーって最近思うことが増えてて。なるほどありがとうございますミーティングとかってどういう感じで朝。にとか時差だよねだから日本時間と向こうのオーバーラップしてる時間に入ってくる感じだから日本の朝ってなるとオーバーラップする国っていうのは少ないからどうしても後半になりがちだ。よねそうすると逆にその9時8時っていうのがぼやけたりしないのエンジニアその多分外資系の日本にある外資系ってやっぱりセールス系とかマーケットとかが多く多いと思っててその人たちってやっぱり日本に向けに発信するから全部日本の時間じゃんそれに対してK君のエンジニアリングっていうのはそのオーバーラップしないといけないとかコラボレーションしないといけないっていうのでなんかちょっとなんかぼやけさせられるんじゃないかなみたいな一応な。んだろうあんまりぼやけないようにはなってるねなんか例えばチームのミーティングとかがあったらそれは業務時間外超えるみたいなのはないし越えたら、越えることがあってもですね断れるし、そこのバウンドリーはしっかりしてるんですよ。まあでもこれは外資っていう文脈上、やっぱポジションによってみんな違うんじゃないかなと思う。同じエンジニアっていう人たちでも違う会社では違うルールかもしれないし。なるほどねーまあ日本でやっぱり帰ってだもねそうなかなかいないよねだから日本にやっぱり帰ってねそれって返して働くっていう人ってまだまだフロッカーだってこれやな方やと正直思っちゃいるのですごい新鮮だなと思うけど他にないですかそういうなんかやっぱり海外でやっぱりずっと長いことはね語られてしかも計算の場合はこっちでキャリアを始めてに始めた人間であって日本での音そのエンジニア経験っていうのともちろん初めてだと思うんですけどなんかカルチャーショック聞いてみたいなとは思ってますけどね、。他あれば。カルチャーショック難しいな。全体的に言うと、なんだろうな。なんか細かい不便なシステムとかあったりするのかな。あんまり言えもん。感じないっていうこともね逆に言うと発見の一つかなって思うけどやっぱりそれは外資的な働き方っていう部分がカナダとも結構あっててそんなにキャリア的にもびっくりするくらいの差はなかったっていう発見。ってことですかねそうですね意外とこっち来てみてその想像してたほどの違いはなかったなっていうイメージ感はありますねでもあれかなあのこれがまたなんかそれさっき名前出したセールスフォースとかその日本でのその団体がすごいしっかりしてる会社だと雰囲気が違うのかもしれない。ですけどね確かにそういう人にも話し聞いてみたいですねそのうちあとはやっぱりその帰った理由みたいなのも聞いてみたいなと思うんですけどなんかその確か当時あのちょっと話してたと思ったんだけどその当時別のところからもオファーもらってましたよねそれをなんか今の会社を選んだ理由とかまあなんかカナダにあとはその受ける時にもうあの東京のオフィスに行くってのは決まってたわけじゃないですかそのだからそこにその日本に帰る可能性があるところを受けたなんかそのカードまあざっくり帰った理由って何な。んですかざっくり帰った理由としては1回東京っていうか日本で働いてみたかったっていう好奇心が一番最初に来て2つ目としてはやっぱり個人的に情報発信していることが海外のキャリアとか日本のみんな海外行こうぜみたいな内容だったのでそこを考えるとやっぱ日本ってどういう都市なのかなってしちょってあがったって部分も大いにありましてこれからキャリアのプロジェクトリーを考えても自分がカナダでずっと居続けるっていうよりは1回こっちも体験しておこうっていう文脈が多くてそれこそ年齢の話になってきますけどその40、50になってから日本に帰るのと今働き盛りのその20代後半で帰るっていうのではやっぱり見える景色も全然違うのかなとこの段階で日本に帰っておくと日本に合わせたキャリア形成もできるしまあ嫌になったら全然カナダ帰れるしっていうのでなんか選択肢の多さっていう点で考えてもこのタイミングなのかなと思った次第ですでもやっぱりキャリアもそうだけどそれ以上に日本好きなんで肉生活する環境としてそれがすごい良かったなっていうそのエンジニアになってこのエンジニアのなんだろう給料帯で日本っていうのを体験するっていうのも1回体験してみたかったし多角的な面で日本って1回行ってみたいなっていうのはありましたね。じゃあ帰ってきて、帰ってみて今は満足かなって感じですか?まあそうね、おおむね満足してるかななんかなんだろうでもキャリアにコミットもちろんするんだけどそれ以上にそのキャリア以上のこともやっていきたいなとは最近思いつつその個人今までは好きでその個人の情報発信とかもしてたけどそれをちゃんとなんだろう形にできるようにしていきたいなと思って最近ようやくなんかいろいろ構想を練ったりとかしているところですね。なんかいいところと悪いところとやっぱあんのかな今いわゆるとこと言い方が。あまりのプロコンだなと。思っててあれすかねやっぱ俺計算にこれ聞きたかったのよやっぱそのyoutbeとかさあのなんだろうまあねあのいろんなメディアにやっぱりお顔出されたりするかなと思うんですけどそういうのってさあやっぱりなんだかんだ言って人口の多い要するにたく他者からのやっぱ影響の多い地域にいた方がなんかそういうモチベーションで起こるのかなって気はしててなんかそういうところだとやっぱり東京に行ってさ、やっぱり人口で言うんだったらもうバカみたいな人多いわけじゃないですか、バンクーバーに比べて多分、会うエンジニアの数とか偉い人とかすごい人とかっていうのも多分ボリュームそれ違うんだろうしやっぱりそういうなんか普段の接するなんか層というか式、なんかね、あの会う人たちがやっぱり変わっていったからそういう情報発信に火がついていったのか元々の性格なのかっていう部分だとこの辺なんかあるのかな、相互関係って思ったんです。けど正直情報発信としてはバンクーバーにいた頃の方がモチベーションありましたね樋口そうなの?それって何でかっていうと多分海外に行ったら自分が他の人とは違う資産の話をしているんだなって向こうの話をするだけでやっぱりある程度価値のある情報になってたので発信しやすかったですけどこっちになるとこっちの人たちと似たような目線で物事を日々見ることになるから発信する内容もそんなに日本の人たちに寄っていってしまうなっていうのもありつつそう。だったんですねあとは。日本には東京には美味しいご飯が多いんですよあの多分あのケイくんのインスタグラムの統計取るとわかると思うんだけどあのバンクーバーにいた頃のご飯の写真と今の東京でのご飯の写真数が違いますからやっぱ取る時間なんてないですよ。東京ではインスタのストーリー。のそうね投稿頻度上がったしほぼほぼ猫か飯って。いう。いやその話すんのかなぁ俺さずっとバンクーバーから計算変える時に俺計算覚えてっかな俺ずっと賭けをしててですねしてますあの俺はカナダでキャリアを始めた人が要するに東京みたいな魅力であふれる街に帰ったらカナダにも帰ってきたくなくなるだろうというのにまあ別途してましてで割と周りので他のなんだろうあのフロッカーやの方々はやそんなことないよとやっぱりまあ例えばキャリアの上限っていう分だったらねなかなか次のステップ見るんだったらバンクーバーとカナダもまだまだ見るんじゃないのっていうので持ってくるんじゃないまた一方で言ってさあそろそろか答えの方も聞いてみたいなといやいやならないよ答え合わせこんなところで。まだわかんないですよなんか方針。はだってそろそろ結構立つっしょ。1年そう立つしその見えてきたものもあるなぁと思って確かにおっしゃる通り例えば量がずっとその量の論調として言ってたところがすごい正しいなって日々実感してて例えば量の言ってたこと何かっていうと海外の会社が日本に来てその海外の会社のgotマーケットっていう文脈で舞台作るじゃないですかしたらエンジニアのポジションってその本社で実際のメインストリームのものを作るっていう文脈じゃなくなるんですよgotマーケットになるとだからエンジニアとして幸せなのはどっちかって言われたら確実に北米なんですよああそうやっぱそこはこじこじで帰れるしゆるいしやってることも楽しいしでかいマジででかい一生モックいってるから俺これだから絶対にその僕がこれから先ずっとエンジニアとしてキャリアを形成してで走り切りたいほんともの作るの大好き一行一行の行動愛してるみたいなこの仕事を墓場まで続けていきたいだったら絶対バンクーバー帰ると思いますそう。なんだなるほどね逆説。的に言うと俺がそれをしたいかどうかってまだ答えが決まってないのでまだ何とも言えんっていうのがアンサーですねバンクーバーに帰るか帰らないかといえばエンジニアとしては絶対に給料も全然天井高いしバンクーバーの方がしかもバンクーバーにいるとアメリカっていうもっと天井の高いところが隣にあるからそこへのチャンスも絶対そっちの方が多い。しうーんそうよねしかもワーク。ライフバランスも絶対エンジニアはカナダの方がいいしそのカナダが国として完璧な国とは僕は全然思わないんですけどでもとはいえエンジニアっていうその自分の視点で考えるとやっぱりバンクーバーの生活ってほんと良かったんだなと思いますお金的。にもぜひそうなんだ。でも逆に言うとなんかカナダで例えば起業したいってなったってなってするじゃないですかしたら一番最初に思いつくのって日本人相手の商売だと思うん。ですよまあそうだね間違い。ないだってもしそのなんだろう自分でサービス作って一発当てるぜって個人開発以上のスタートアップレベルのサービス作るとかなったらそれこそシリコンバレー行った方が多分成功確率高いしバンクバレーやる意味ってあんまりないでも日本人あえての商売でいいんであれば日本から始めた方が絶対にシナシーっていうかスタートダッシュは切れるしっていう文脈で考えるとエンジニア以外っていうところの選択肢の多さで考えると東京の方が多いんじゃないかなとだからサラリーマンとして幸せなのは100%バンクーバーなんですよでもサラリーマン以外の文脈で考えると東京の方がチャンス多いなと思います。へー面白いある程度答え出てんじゃんって思ったけどね今。ですだから時間があるうちにいろいろショット打ってみてどれがその選択肢としてまだバンクーバーも日本も選べるうちにショット打ってみてどっちの方が向いているかで決まるんじゃないかなと思っていますだから今のこの現段階でどっちに行きますよみたいなはなかなか言えないでもなるほどね日本で働いていてなんかそのエンジニアとしての幸福の上限みたいなも見えてきたかなっていうのはありますね。なるほどねーいやーここは多分みんな聞いたかった聞きたかったんじゃないかなと思うので素晴らしい回答ありがとうございますい。えいえまあでもK君のこれからで言うと全然そのバンクーバーとかまあカナダに戻ってきたりだとかまあはたまたアメリカだったりヨーロッパにまだ行く可能性っていうのは全然残してのまあ今のところ日本選んでるってことですよねそう。だから全然状況によっては日本出るとかもあるしこれから先の自分の人生がどうなるかも全然今のところわかんないのでマジでわかんないのではいまあどう転ぶかですねうんなんかライフステージとかもあるだろうし。なんか僕としてはなんか強調したいのは別にけいくんとかまあ僕あのけいくんがどっち選ぼうがなんか答えとして日本がいいのか北米がいいのかっていうよりはその選択肢があるのが一番いいことなんじゃないのかなって思うんですよねそのまあけいくんはえっと1020歳で北米というかカナダに渡ったのかなあれ21だったっけ22歳か、22歳で渡って、英語力も身につけ技術も身につけ、英中研もこっちで取れて、だから何だろうね、その日本に帰ることもできるし、帰らないこともできたし、まあでも今のところは日本にいるっていうので、今後も、今はなんか日本がちょっと停滞してるみたいなで、カナダもあんまり経済的には良い状況ではないけど、今後もずっと選ぶことができるっていう、その選択肢を残せるっていうのとか、もちろん英語なんで、英語で会話だったりエンジニアリングができるんで、どこの国でも基本的には行けるっていう。その選択肢がすごいいっぱいあるこれからもまあそれを選び選ぶことができるっていうのはすごい良いことですよね。素晴らしいそうだね本当にねカナダも行けるし日本も行けるしじゃあ日本の今の時期ここちょっと嫌だからじゃあカナダ行こうとかねカナダのこの時期ちょっと厳しそうやから日本行こうみたいなのそれを選択肢と呼ぶっていう部分だったら素晴らしいことだよね別。に二択である必要もなくて別になんだろうずっとずっと点々としてもいいわけじゃないですか基本的にはおじいちゃんおばあちゃんになってもフラフラしてても別にいい。と思うんでその自信をねカナダでつけることができたっていうのもそれも含めての選択肢っていう。ことですねそうですねだからまあこれから先はどんなかわかんないですというのが短いアンサーです。ちなみにまあどうでも良いことにいきなり行っちゃっていいのかなっていうのも考えつつなんだけどやっぱりホラーさっきの音がしたのは知らないけどご飯は美味しい物価は安いねまあ交通機関もしっかりしていてまあ安心安全夜であるてもいいみたいなかそういうなんか生活的な部分でのながら良さみたいな部分なさそうなんですか東京離れたくないなぁと。かヤンヤンああないこのぶつになんだろうまあ定期的に帰ってきたいなとは思うけどなんかこのクオリティオブライフを一生守り続けたいみたいなのはなくててか正直東京という町にあまり愛着がなくてなんか最終的になんか何日本で家とか買うんなら俺多分東京では買わないと。思いますモトキうーんまあそうだね東京俺も買うイメージ。ないもんななんか本当、投資物件とかで買うんだったらまだアリなんだろうけど、なんか自分のコストっていうか、何、頭良い悪いとか、リターン度返しで自分の理想の家とか建てるんやったら、東京で建てる意味があんまりわかんないので、家以外の部分で。あとはなんか日本からまあ僕も含めてなんですけど日本からまあカナダに来た人でよく聞くのはあの通勤がすごい嫌だって。いうのが結構聞くんです。けどそこらへんはどうですか?クソゴミですねそれはそう。だよねそうだそれは。その話しないとダメだわ確かにもうクソゴミですよマジであのうそ多分日本人があの不幸な人多い理由の大半これなんじゃないかと思うぐらいゴミです。ねマジで嫌いなのでそうか、日本俺もしょっちゅう結構出張行く方やと思うけどさラッシュの時間絶対避けるからあんまり実はそこまでって思ってたんだけど働き出すと違う。ラッシュの時間避ければいいんですけど行きは避けれても帰り避けづらいじゃないですか。ヤンヤンああまあそらそうか終わるのは終わるもんねだ。って時間ヤンヤンだから帰りの時間ましそうなところで帰ることはできてもやっぱり我慢の時間は絶対どっかにあってそのモミクチャにされている時は俺なんでこんなとこいるんだろうとは思いますね。ヤンヤン間違いないよな俺も正直その満員電車の臭さが嫌でバンクーバー来た。まであるもんな若干ヤンヤンスカイトレイン乗りたいなあと思いますもんね。ついてますねいつもね。本当にね2両しかない。しやっぱりなんかエンジニアである以上やっぱりその東京は外せないじゃないですか基本的にはまあリモートとかこの頃とかあの九州のあの方になんか大きい会社ができてかりとかはしてるにしろ、やっぱり日本で長い目でキャリアって見た時に、一つの地方にある会社にずっと居続けるわけにもいかないのかな、多分だと思うし、やっぱ転職とかして、これからどういう会社で働いていこうみたいなのを見た時に考えると、やっぱり東京っていうのは絶対ね、その、住むことになると思うんだけど。で、。なんか僕が1つすごい残念だな。まあ、残念というか、日本、東京に帰るのを、なんだろう。引っかかりとして感じる部分?あの、帰りたくない理由が、やっぱその、コミュートしないといけない。コミュート、その、通勤しないといけない。で、。通勤しないっていうのを選ぶとしたら、やっぱり家賃がめちゃくちゃ高くなるっていう。それが、それだともう、全然カナダのバンクーバー以上じゃないですか。なんかバンクーバーぐらい金出してくれたら全然近く住むんすよ例えばオフィスが新宿なら全然代々木上原住むしオフィスが六本木なら全然六本木に変なアパート借りるしでもそう下がるじゃないですか東京行くとバンクーバーに比べるとどうしてもそうだねーそこであんな人混みにもみくちゃにされて通勤しろって言われたらそらもう。それはちょっとむずかしいですよ。やっぱ中心地に住もうとすると、QOLみたいなのはやっぱりさがっちゃうというか、その通勤に関してはもちろんあがるんだけど、やっぱり部屋が狭くなったりだとかもそうだし金額基本的にはやっぱすごいお金とか使うことになるんで過所分所得みたいなのも減るだろうしそこが結構やっぱり気になっちゃうところですよね帰ろうかなって考えるときにいつもやっぱりあーちょっと通勤は絶対嫌だからやっぱりもう住むとしたら近くでもそうするとまあ340万はやっぱかかっちゃうよなみたいなそこにすごい40万僕としてはそこ。が一番かなそこはちょっと覚悟しておいた方がいいね帰ってくるのに。ねちなみにまあやっぱりこれもね視聴者の方からすると期待部分の一つじゃないかなぁと思うんですけどやっぱり給料は下がるんだなぁっていうのはもちろんあるんだろうと思うんですけどどの会社もやっぱりマトリックス決まってるじゃないですかあのこのその。地域によってみたいなさ。なんどうですか計算周りにその外資の方でね働かれている方もお友達多いんじゃないかなと思うんですけどやっぱ結構その北米アメリカバンクーバーできあうか考えようかバンクーバーの同じ外資で同じポジションで働いている人と比べても何割減くらいです。かヤンヤン何割っていう数字出すの難しいなだってみんなやっぱ具体的な数字教えてくれないですからでも絶対バンクーバーの方が高いそれは確実に言えるだってスタートアップで2000万とか出るじゃないですかバンクーバーはヤンヤンどうじゃヤンヤンないもんこっちそれは絶対になんか旧人とか見てても日系企業とかだとシニアエンジニアで800万とかじゃないです。かヤンヤン難しいヤンヤンバンクーバーだと。シニアだったら大体大台湾乗るイメージあるじゃないですか少なくとも。少なくともそうだね。ちなみに、日本にある外資企業って、日本の内資企業に合わせて、給料レンジ決めてるわけではないじゃないですか。たぶん。で、SFアメリカで言うとSFとニューヨークがすごい高い、あの、家賃とかがすごい、家賃とか物価が高いところで、で、カナダで言うと、やっぱバンクーバー、トロント、まあ特にバンクーバーは結構高いんですね。だからその、カナダの中では、そこにいると、やっぱ給料レンジが高くなるんですけど、東京って今、東京っていうか日本って、その今まではその、なんだろうレンジ的には安いところにいたと思うんだけど今結構物価が上がることによってそこのレンジも上がるんじゃないのかなと思うんだけどなん。かこれ数字のマジック起こってると思ってて日本全体では低いですよ東京だけがバンクーバ並みに上がってんですよ今だから例えばお給料を決めるチームがSFにいるとするじゃないですか、そのやたちが日本がどうこうなんて式にするわけないじゃないですか。日本は日本、東京じゃなくてっていう文脈で考えると日本ってパッて見たときに、じゃあ平均給料これぐらいだな、じゃあこれぐらいのレンジでいいかって決め方をされてる気がする。これはソースがあるわけじゃないから僕の裸なんですけど、でもこういうところで変な数値のマジックが働いて、東京住んでんのに、なんだろう、こんなもんでいいんだみたいな給料感になってる気がする。それで言うとそのねカナダとかの中でも都市によってやっぱ違うからそこはなんかまあ多分それってその日本に進出してる企業がまだ少ないからそうなっちゃってるだけであってでそれがどんどん増えてきてそれに対してまあ日本の人がいや東京の物価めちゃくちゃ高いからあのカナダでSFとかニューヨークが高くてその他の地域が安いように日本の中でも買えてくださいみたいなのが起こってくるとだいぶそこらへんはマシになってくるものなの。かなどうなんだろうねでも東京以外で建てるメリットがないからさ外資企業からしたらオフィスを自動的に東京に合わせるべきなんだろうけどねでもそのスタティックスでなんか東京の金額感みたいなのがちゃんと取れてんのかなあそこちょっと疑問視してる。でもそれこそやっぱりそれを見るって言った時に、内資企業のことも考えると、じゃあこんな安くて済むんだみたいなのはやっぱりちょっと人間。の感覚的にはあるよね。確かにな、東京以外に建てるメリット、データセンターとかで地震の少ない地域とか、そんな文脈じゃないと思いつかないもんね。いやでもやっぱ働けば働くことやっぱりエンジニアとして幸せなのは北米ですよ絶対。それはそうなるほどねいや。面白いなだからそうなんか物価の違い側とかQOL側とか言うけど賞味両方バンクーバンの方が優れてると思うエンジニアっていう文脈で考えるならばね過小分所得も多いし家賃が上がるとはいえその分給料も上がるし安全性をだけはねどうしても買えないけどその代わりそのコミュートっていう点で考えたら1時間全然来じゃないしバンクーバーってこっちはもうマジで苦痛だけどなるほど。ねー確かに面白いなやっぱりこっち働いた人がねやっぱり日本に帰ると見えてくるところもやっぱりいろいろあるんだなぁ。って思ったただ一つやっぱり問題点をあげるとすればバンクーバーでやっぱり家はなかなか買うってなるとうーんちょっと難しいんじゃないかなと思いますね家を買うっていう文脈で考えると日本の方が理想の家建てれるんじゃない。かなと思うまだそれこそ。東京で働いて東京から外すっていうムーヴができるからねこっちはでもバンキューバーもどこ行ってももうなんかマップ全部赤じゃないですか金額で言うと高いね本当。にこうキットラムとかも。高いもんね今もはやなんかもう注文住宅とかも何それって感じじゃないですか中古物件を買ったみたいなみんなエンジニアとかがだからなんだろうそこの自由度はやっぱ犠牲にする必要もあるしやっぱ医療のシステムとかもやっぱバンクーバンウンチなんでバンクーバンっていうかカナダが。間違いないわそうなんだよな医療にお世話になるって話になったらもはや話が変わっちゃうんだよ。な本当にやっぱそれを考えるとその年をとっていくとやっぱ人間やっぱ病気とか怪我とか増えていくんでそうなるとやっぱり日本の医療はすごい魅力的ですけどねでも。でもあの日本これ僕もまた帰ってきてから得た知見なんですけど日本に帰るタイミングも結構大事だなと思ってと4050になってからエンジニアとして日本帰ると結構就職先大変かもって思う。年齢は僕ちょっと狙ってるん。だけどな相当エンジニアとして強いとか評判いいだったらいいけどなんか外資のエンジニアポジションってマジでパイ少ないからそこ狙いに行くっていうと結構なんかちゃんと準備して対策してもうカナダから就活終わって全部揃ってから帰るぐらいのムーブしないと大変なんじゃないかなっていうその着弾する時はいいですよ日本にその次とか年齢とかの話になってくるし本当日本に帰る時は結構な覚悟がいるんじゃないかなという部分でも感じたり。確かにそれはそうだね。あとはもう日本に行くんなら日本でも外資っていう部分にこだわるならもうエンジニアじゃなくてもいいっていうそのこだわりの捨ても必要かも下手なエンジニアよりもソリューションエンジニアとかの方がお金もらってたりする世界なん。でaあそうなんだそれは面白いねーまあでもほらトカシさんはなんかね日本帰る時ってあるでしょあのそれこそスタートアップだったりとか割とチャレンジングなことをする環境に行きたいなみたいな話じゃなかったっけ外資行きたい。なそうだねいや外資は多分行かなくてもいいかなみたいな考えてますけどでもまだちょっとまだ全然時間もあるんでちょっとよく考えたりまあケイ君みたいな人に聞いてみたいとかいろんな人に話聞いてから考えたいなって感じです。ね僕はそこらへんはまたコーヒーチャットにしましょうちなみにフロックは何?今年来るんですか?12月もう来ない?やるつもりはあるよやるつもりはあるかなきゃんドリームだけは毎年やりたいと思ってる。そうなんだじゃあまた12月ご飯いけそうですね楽しみ。ですもちろんもちろんただどういう目的でやるかまだ迷ってるんでそれはちょっとまた相談を。いろいろさせてくださいぜひぜひ。お願いします。そしたら、なんかK君って言ったら、この頃やっぱりそのテックワールドさんのビデオに出たりだとか、結構メディアの活動もしてるし、で、自分でYouTbe撮ったりもしてるし、あとあの、同じ会社で働いてる人がなんか個人開発みたいなの結構頑張ってる人じゃないですか。でなんかそういうところにも興味があると思うんですけど今後なんかキャリアとしてどういう方向にさっきあのエンジニアとしてはっていうのを結構強調されてたと思うんでエンジニアじゃない道もこれ結構考えてるのかなと思うんですけどこれからなんかどういう風な仕事をしていきたいとかこんなことに取り組んでいこうみたいなのあったらちょっと教えてほしいエンジニアとし。ては正直その行動を書くだけの仕事にはこだわりはあまりないですね今のところだからこれからその外資っていう文脈でその日本特有の僕が最大限になんだろうスキルセット使ってきたスキルセットを生かしてなんか会社会に貢献できるみたいなポジションがあったらそっち行きたいなと思うしそのなんだろう自分のポテンシャル総合的な観点で自分がどういう働き方するのが一番いいのかなというのはまだまだ模索中なのでサラリーマンとしてはそういったところを見つけていきたいなと思っているところですで、それ以外の個人的な活動としては、今まで情報発信とか、Mockインタビュー、模擬面接やったりとか、その、なんだろう、個人的な情報発信として海外のエンジニアいいよ、という啓蒙活動してきたりとかやってきたと思うんですけど、そこの、なんだろう、情報発信にもちゃんと何か落とし所をつけていきたいなと思っているところでして、個人的にもっと具体的に何をしたいかっていうと、やっぱり日本でエンジニアをやっていて、で、なんかキャリア迷ってるとか次どうしようかなってふわっと考えている人たちにこういうものがあるよっていう、なんだろう、提案というかアイディアを与えるみたいな活動をしていきたいなと思ってるんですよね。やっぱこっちで働けば働くほどバンクーバーとかアメリカの会社とかのエンジニア都市の労働環境とか生活ってすごい良かったなって思うのでその良さっていうものをみんなに伝えたいし、もしその日本っていう閉じられた環境だけではなくエンジニアとして本当の幸福の追求とかキャリアを追求っていう文脈で考えると海外って絶対に視野に入ってくると思うのでそういったところで僕にサポートさせてもらえるんであればそういった人たちをサポートしてあげたいなと思ってます例えば日本でずっとスタートアップで働いてきたけど次はメガベンで行きたいとか国際的な環境で働きたいっていう人にもアドバイスとかロードマップしてあげたりとかもできると思うしこれから先どっかのタイミングでエンジニアとして最大級海外行きたいぜとか一回海外体験してみたいんだよねとかキャリアチェンジの観点で海外行ってみたいっていう人たちにもアドバイスとかできると思うしそんな感じで今まで自分たちが自分たちが自分がやってきた発信とかその東京で見聞きしたことっていうことを一つにまとめていろんな人たちに対するそのなんかキャリア感へのなんだろうちょっとした啓蒙活動みたいなは個人的にやっていきたいなと思いますだからまぁ今までちょっとなんだろう東京っていう環境でのなんかサラリーマンにそじんでましたけどこれからはなんか情報発信というところにちゃんと力を入れていきたいなと思っている次第ですもっと具体的に言うとなんかサービスとしてなんか立ち上げたいなと思っていますこれからキャリアアップをしたい人たちもちろんエンジニアっていうスタートになると思うんですけどエンジニアがキャリアアップをさせたい時にそのキャリアアップを助けてあげる例えばもしかしたらこれから先もっとうまくいっていろんな指令ができたら会社を紹介とかできるかもしれないですしその面接に受かるための対策とかも待つまでやってあげたりとか英語をどれぐらい伸ばすべきかとかも具体的に教えてあげれると思うし例えばレジュメどうやって作るとかもできるしなんだろうビザみたいな官邸になるとサービスとしてやるのはちょっと危ないかもしれないけどそういう詳しい人を紹介してあげるぐらいはできると思うしこういうなんかブリッジになりたいなと最近俺デスストハマってるんでもうサムポーターブリッジズに。なりたいなと思ってますああああああああああああああ。ああああああああああああああ。ああああああああああああああああああああああああああああ。あああああああああ。やっぱ海外に若者が海外に出ていこうみたいな流れってやっぱ結構大きくなってんのかなっていうのはすごい感じててとはいえねそのどうしたらいいとかどういうふうに何だろう就職したらいいそれこそなんか英語の勉強だったりケイくんが教えられるそこのなんだろうやりたいっていうのとどうしたらいいみたいなののギャップがすごいあると思うんでそういうところにはすごいケイくんは確かに力になれるのか。な冒険していきたいです。ね感じますねそしたら最後の質問なんですけどまあもう本当にこれから投稿を考える海外でまあエンジニアのキャリアを進めたいみたいな人にいろんなアドバイスが多分できると思うんですけど短くまとめるとどんなアドバイスをしようか。なと思いますか以上ですいいっすねまじでなんか結婚とか車買う時と一緒やと思うんですよなんか海外行ってなんだろう大変なこともあるし後悔することもあると思うんですけどでも行かなくて良かったにはならないと思うんですよね例えば車買う前は東京って電車あるしいらんやろうとか言うんだけど買ったら買っていややっぱりなしの生活には戻れないとか結婚もバツイチの人にみんなに話し聞いて結婚しよかったと思いますか?なんだかんだ一回してよかったねって言うと思うんですよ。海外とこもそこと一緒で、一回自分の人生の中で行って挑戦しておくっていうのはめっちゃ大事だと思ってて、それのあるなしで、やっぱりコンプレックスとかにも関わってくるんで、自分は向こうに行って、こういう体験をしたから海外っていらないと思う、いかんでいいと思うっていう発言をできるっていうのはやっぱり個人的にすごい大事だ。と思うんですよね。向こうで成功して向こうにいるんならいいし向こうで就職成功してシャタライダーとやっぱ日本だなっていう結論やったら日本帰るの全然いいと思うんですよどんな結論になろうと言ったっていう言ったことによる自分への人格とか思想の変化っていうのは人生によってとても大事なので言った人の話聞くのも大事ですけど言った人の意見を自分のものにするんじゃなくて実際に自分も言ってみ聞き知ってその上で結論出した方があなたの人生で豊かになるんじゃないですかと言いたいですねだから行きましょうバラ。シーもうぐーの音も出ない感想ででもそうだねフロックにさやっぱり来る人たちもね死ぬ前に1回っていうワードが最近増え。たのよやっぱりマジでそう。いや割と最近3回か4回くらいずっとねれんちゃんって聞いててやっぱ死ぬまでに海外で働くってやらないと後悔すると思うんですよねっていうあれが増えてて。ほんまそれやし若いうちに言っとかないとダメージ取り返しつかないんで失敗した時むしろ失敗できるときにしといた方がいいと思うんですよね。本当そうだよね、俺もだってこっち来た。ときやんてとりあえずまぁ英語力もいらないし技術力もいらないからとりあえず行けと、行ってからそこは解決しろってことですかねいやだ。から行くっていうためのアクションを取りましょうってとこかなどちらかというと、今すぐチケット買って行けっていうよりは行きたいと思ってんなら準備してプラン立てて実行しろって言いたいですね素晴らしい、。もうけいさんのまんまで来てしまったら俺もうてんやまんやするだけやから俺のまんまで行くとやけどするので。それはマジで自信ある人だけにしてくださいいや間違いない、そうほったい力あるやつしか。無理なんで僕はそれでもとりあえず行くことが大切なんじゃないかなって思いますなんかやっぱその準備ばっかりで来れない人っていうのは多いと思うんでとりあえずまあそれそのまあもちろん準備できるんならした方がいいまあできるんだったらじゃああのあれですねビザ取ってまあビザっていうかチケット取ってから勉強し始めるといいかもなんですねできるだけ先のチケットをとりあえず取ってもうそこには行くってお尻を決めてでなんか準備とかできたらいいか。もしれない取り返しのないね渡航の仕方する人たまにいる。からねマジでだからこういう知識人にねリーチアウトしてこんなこと考えてますどうしましょうかっていう相談をするところから始めるのがいいんじゃないでしょうかしたらねいい人だったら相談載ってくれるかもしれんし。はいぜひぜひあのK君のツイッターかなか何かの概要欄に載せておくのでぜひそういう人はK君にリーチアウトしてちょっと相談してもらって海外に出ることを決めてもらえばいいのかなと思います。めちゃおすすめですはいはいと。いうことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcasyoubetなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお持ちしておりますありがとうございました。",
  "utterances": [
    {
      "speaker": "A",
      "text": "そしたらk君に来ていただきました後半戦よろしく。",
      "start": 28,
      "end": 3490,
      "timestamp": "00:00"
    },
    {
      "speaker": "B",
      "text": "お願いしますよろしくお願いしますお願いしますいつ。",
      "start": 3490,
      "end": 8192,
      "timestamp": "00:03"
    },
    {
      "speaker": "A",
      "text": "もはえっと就職してその後の下りから始めるんですけど結構前半が長くなって盛り盛りになってで3社目えっとカナダがカナダの中で3社目経験されてるんですよ3社経験されてるんですよね3社目のあの練習も聞いてもいいですか前回。",
      "start": 8192,
      "end": 26586,
      "timestamp": "00:08"
    },
    {
      "speaker": "C",
      "text": "が一応前回があれだよねあの最後を聞いた時は85系くらいっていうね話し合ったところ日本円関西で850万くらいだと思いますが3社目一体いくら。",
      "start": 26586,
      "end": 35990,
      "timestamp": "00:26"
    },
    {
      "speaker": "B",
      "text": "になったやろうねぇそっからでもそのインターナルで昇進してでシックスフィギュアに乗ったんですよ前の会社で。",
      "start": 35990,
      "end": 44353,
      "timestamp": "00:35"
    },
    {
      "speaker": "C",
      "text": "あインターナルじゃあ2社目の2社目でもうじゃあ1000。",
      "start": 44353,
      "end": 48535,
      "timestamp": "00:44"
    },
    {
      "speaker": "B",
      "text": "万の人そうで3社目は転職して3社目でもその給料のインクリーズが良かったんですけど一番最初の給料としては125系でしたね125。",
      "start": 48535,
      "end": 62540,
      "timestamp": "00:48"
    },
    {
      "speaker": "C",
      "text": "一番最初に3社目から来たオファーってこと?そうそうだよね素晴らしい1250万いきなり業界経験2年目の人ですか3年目の人ですかもうその時。",
      "start": 62540,
      "end": 74083,
      "timestamp": "01:02"
    },
    {
      "speaker": "B",
      "text": "で3年目の時か。",
      "start": 74083,
      "end": 75123,
      "timestamp": "01:14"
    },
    {
      "speaker": "C",
      "text": "な3年目、業界経験3年目の人が1250万というのが、なるほど素晴らしいですね。",
      "start": 75123,
      "end": 81496,
      "timestamp": "01:15"
    },
    {
      "speaker": "B",
      "text": "なんかすごいジャンプをしましたね。",
      "start": 81496,
      "end": 84372,
      "timestamp": "01:21"
    },
    {
      "speaker": "A",
      "text": "K君の努力を見てるから、効率いいと一概には言えないんだけど、でも大学も別に出ずに高卒で来て、ワーホリで来て、一応専門学校行ったにしろ3年目でそこまで行くとなると、効率がいいのかなって。",
      "start": 84372,
      "end": 104638,
      "timestamp": "01:24"
    },
    {
      "speaker": "C",
      "text": "思ってますよねだからこれを目指して来られる方々がフロップにも多いんです。",
      "start": 104638,
      "end": 109385,
      "timestamp": "01:44"
    },
    {
      "speaker": "A",
      "text": "よ思っちゃいますよやっぱりその。",
      "start": 109385,
      "end": 111876,
      "timestamp": "01:49"
    },
    {
      "speaker": "B",
      "text": "パス行きたいってそうなんかみんななんか舞台の上のスポットライト当たった姿見てるけどその舞台の遥か地下3階下から俺はロッククライミングで上がってますからねみんな梯子で上がれるところ。",
      "start": 111876,
      "end": 124183,
      "timestamp": "01:51"
    },
    {
      "speaker": "C",
      "text": "を落ちたら死ぬみたいな落ち。",
      "start": 124183,
      "end": 126944,
      "timestamp": "02:04"
    },
    {
      "speaker": "B",
      "text": "たら死ぬをずっと繰り返してたまたま落ちなかったっていうあれなのでみんなはちゃんとね梯子を張って綺麗に安定させてから登ってくるけどなのでそうリョウの言う通り飛行率は全然良くなかったですからねまあだから。",
      "start": 126944,
      "end": 141183,
      "timestamp": "02:06"
    },
    {
      "speaker": "C",
      "text": "効率っての最短距離で行くという意味で言うんだったらもうめちゃくちゃいいんだろうけど最安全でそうそうね確実に行くって意味あったら最低とまで言わんけれどもなかなか博打打ちやったよねっていう。",
      "start": 141183,
      "end": 152928,
      "timestamp": "02:21"
    },
    {
      "speaker": "B",
      "text": "とこですねとにかく再現性はないですね多分僕が使った石を全部綺麗に同じ石使って上がってきたとしても多分どっかで落ちると思うんで。",
      "start": 152928,
      "end": 160951,
      "timestamp": "02:32"
    },
    {
      "speaker": "C",
      "text": "ちなみに単純な疑問なんだけどKさんの周りには当然トガシさんとかだけじゃなくて未経験の人とかもいたわけじゃないですかその当時ってその人たちっていなかったの?",
      "start": 162719,
      "end": 173286,
      "timestamp": "02:42"
    },
    {
      "speaker": "A",
      "text": "いたの?",
      "start": 173286,
      "end": 173727,
      "timestamp": "02:53"
    },
    {
      "speaker": "C",
      "text": "いなかった?",
      "start": 173727,
      "end": 174683,
      "timestamp": "02:53"
    },
    {
      "speaker": "B",
      "text": "知り合いはいたけどでも俺と全く同じ属性の人ってあんま友達にいなかったな、言われてみれば樋口あ、ほんと?",
      "start": 174693,
      "end": 180265,
      "timestamp": "02:54"
    },
    {
      "speaker": "A",
      "text": "え、。",
      "start": 180265,
      "end": 180395,
      "timestamp": "03:00"
    },
    {
      "speaker": "C",
      "text": "その妖怪経験ゼロとかって人はいなかったってことですか?",
      "start": 180395,
      "end": 183747,
      "timestamp": "03:00"
    },
    {
      "speaker": "B",
      "text": "ヤンヤンいなかったっすね樋口えー、。",
      "start": 183747,
      "end": 186778,
      "timestamp": "03:03"
    },
    {
      "speaker": "C",
      "text": "あ、そうだったんだ、いやケイさんみたいな人って実際就職してんのかなーって聞こうかなって思った。",
      "start": 186778,
      "end": 192320,
      "timestamp": "03:06"
    },
    {
      "speaker": "B",
      "text": "けどヤンヤンなんか僕の下の台したむがいってか僕より後にバンクーバー来た人たちでそういう人は何人か知ってますけどその人たちは日本人ではやっぱりいろんなキャリア感があるなぁと思ってバンクーバーに残る人っていうのはやっぱりめちゃくちゃ人握りだなやっぱりでも日本帰ってからいい会社入ってとか楽しそうにしている人は多いですね。",
      "start": 192320,
      "end": 218919,
      "timestamp": "03:12"
    },
    {
      "speaker": "C",
      "text": "そうだよねかなりいい会社にみんな入ってるもんね日本か日本帰った人たちも樋口いや素晴らしいじゃあ3社目1250万からの?",
      "start": 218919,
      "end": 229951,
      "timestamp": "03:38"
    },
    {
      "speaker": "B",
      "text": "ヤンヤンからの?お金の話大好きか樋口。",
      "start": 229951,
      "end": 233134,
      "timestamp": "03:49"
    },
    {
      "speaker": "C",
      "text": "そりゃそうだろとりあえず食いつくのはそこやろヤンヤンとりあえず金から。",
      "start": 233134,
      "end": 236737,
      "timestamp": "03:53"
    },
    {
      "speaker": "B",
      "text": "入るそっから125系からあれだったんですよあの前の会社のCTOだった人から新しい事業立ち上げたから家入らないってモントリオールの会社からお話もらってそこでそう給料の交渉とかして最終的に出た数字が140系って言われてでその時働いた会社に140系でオファー出てるんだけどどうしますかっていうとカウンターオファーで145系になったので145系に入社半年で上がったみたいな感じでしたね当時は素晴らしい、。",
      "start": 236737,
      "end": 273896,
      "timestamp": "03:56"
    },
    {
      "speaker": "C",
      "text": "ワンチャンケイさんがモントリオ行ってた可能性があるっていう。",
      "start": 273896,
      "end": 276098,
      "timestamp": "04:33"
    },
    {
      "speaker": "B",
      "text": "のもちょっとあれやねリモートでしたけどね、。",
      "start": 276098,
      "end": 278650,
      "timestamp": "04:36"
    },
    {
      "speaker": "C",
      "text": "その会社はあーそうだったんだ、そうかそうかいやー素晴らしい、業界3年半くらいですかじゃあ、にしていや、。",
      "start": 278650,
      "end": 286906,
      "timestamp": "04:38"
    },
    {
      "speaker": "B",
      "text": "そことの時点で4年くらいかな、。",
      "start": 286906,
      "end": 288477,
      "timestamp": "04:46"
    },
    {
      "speaker": "C",
      "text": "たぶん4年くらいか、にしてっていう部分で1400万、1250万1250万台に乗っ。",
      "start": 288477,
      "end": 296953,
      "timestamp": "04:48"
    },
    {
      "speaker": "B",
      "text": "たという1ドル100円。",
      "start": 296953,
      "end": 299775,
      "timestamp": "04:56"
    },
    {
      "speaker": "C",
      "text": "換算で法律という話を。",
      "start": 299775,
      "end": 303362,
      "timestamp": "04:59"
    },
    {
      "speaker": "A",
      "text": "していいんだったらもう。",
      "start": 303362,
      "end": 304002,
      "timestamp": "05:03"
    },
    {
      "speaker": "C",
      "text": "最短距離なんだけどって話をまた無理です繰り返しやなくちゃいけないんですが。",
      "start": 304002,
      "end": 308705,
      "timestamp": "05:04"
    },
    {
      "speaker": "B",
      "text": "同じ話を話し話になっ。",
      "start": 308705,
      "end": 310106,
      "timestamp": "05:08"
    },
    {
      "speaker": "C",
      "text": "ちゃう間違いないさまじいなあっていうこれはことでもとがしさん的にもそれはそうだよねって話もはや。",
      "start": 310106,
      "end": 317430,
      "timestamp": "05:10"
    },
    {
      "speaker": "A",
      "text": "まあ努力してたからねずっとって感じですよねなんか。",
      "start": 317430,
      "end": 320732,
      "timestamp": "05:17"
    },
    {
      "speaker": "C",
      "text": "視聴者的にはほらだからその努力っていうのは果たしてねなんか自分でも可能な範囲の努力なのかみたいなところは多分聞きたいんじゃないかなと。",
      "start": 320732,
      "end": 329077,
      "timestamp": "05:20"
    },
    {
      "speaker": "B",
      "text": "は思うんですけどできるんじゃない?",
      "start": 329077,
      "end": 331928,
      "timestamp": "05:29"
    },
    {
      "speaker": "A",
      "text": "それで言うと、就職してからは可能なんじゃないですか。でも、けいくんいろんなところに顔も出してましたよね。TL界みたいなの行ったりだとか、リアクトバンクーバーだったかな、とかで喋ってみたりだとか、別にやらなくてもいいことを人前に出て喋ってでいろんな人と喋って結構リアクトバンクーバーの人とかバンジーエースの人とかかなと結構そのオーガナイザーとかもとも中仲良くしているみたい。",
      "start": 331928,
      "end": 365543,
      "timestamp": "05:31"
    },
    {
      "speaker": "B",
      "text": "なイメージだそうだってむしろそれ約等バンクーバーのあのサイモンっていうオーガナイザーの人僕の会社入ってましたよね最終的に入れ替わりで変わったんだけど懲戒でこの辺。",
      "start": 365543,
      "end": 377409,
      "timestamp": "06:05"
    },
    {
      "speaker": "C",
      "text": "は別れるよねだからトガシさんは逆にどっちかというとぶっちゃけでしょあのミートアップとかってあんまり頻繁には行ってなかったタイプでしょ行っ。",
      "start": 377409,
      "end": 387381,
      "timestamp": "06:17"
    },
    {
      "speaker": "A",
      "text": "てなかったし行ってないですね今でもなんか。",
      "start": 387381,
      "end": 390345,
      "timestamp": "06:27"
    },
    {
      "speaker": "C",
      "text": "その辺の差って確かになんか視聴者からすると気になるんじゃないかなとは思うんですがまあKさんはなんで行ってたっつったらもはや就活?",
      "start": 390345,
      "end": 399280,
      "timestamp": "06:30"
    },
    {
      "speaker": "B",
      "text": "就活やから普通に好きだから行ってたっていう感じがありますねなんか英語で登壇ってかっこいいじゃないですかそれをしたいなってずっと思っててで一回やってみたら楽しくてそこから定期的にこの登壇っていう機会を設けることで技術のキャッチアップにもなるし続けようっていうので続けてたらそっから就職も決まりこれってやり続けるといいじゃんみたいな感じで自分の中の発見があったのでやってたっていうのもありますしやっぱあれですね僕が崇拝しているケントシードッツっていう有名なエンジニアの方元ペイパルの人がいるんですけどその人もやっぱりその技術登壇とかはめっちゃいいよみたいな感じで進めてたのでそれを愚直に実践してたっていう部分もあるのかなと思います。",
      "start": 399280,
      "end": 448570,
      "timestamp": "06:39"
    },
    {
      "speaker": "C",
      "text": "ねなるほどね啓蒙してる方もいたということで。",
      "start": 448570,
      "end": 451672,
      "timestamp": "07:28"
    },
    {
      "speaker": "A",
      "text": "それであの逆サイドの意見から言うとそれで言うとえっと登壇するのってやっぱり恥ずかしいじゃないですかまず日本語でも恥ずかしいじゃないですかで英語で間違えたらもっと恥ずかしいじゃないですかでなんなら技術のキャッチアップもしないといけないじゃないですか結構大変ですよそれは僕にはできないですわっていうのが結構僕も含めてみんなの意見なのか。",
      "start": 453352,
      "end": 475119,
      "timestamp": "07:33"
    },
    {
      "speaker": "C",
      "text": "なって思ってますがだからあれなんじゃない?その恥ずかしさを超えるほどのメリットがもう目の前にぶら下がってない限りはっていう枕言葉つくのかなと思う。",
      "start": 475119,
      "end": 485284,
      "timestamp": "07:55"
    },
    {
      "speaker": "B",
      "text": "んですけどうーんそうですね確かにそこはなんか1。",
      "start": 485284,
      "end": 490506,
      "timestamp": "08:05"
    },
    {
      "speaker": "A",
      "text": "回やってみたらいいのかもね僕も1回もやってないんであの試しでねわかんないっすわ。いいのかもしれない。これ、今後ちょっと考えてみます。で、ぼくは、それでいうと、言い訳として、別に登壇しても、オファーっていうか、なんていうのそのレファレルはもらえたとしてもオファーもらえるわけじゃないから僕はあのインタビューの練習するんだと。",
      "start": 490506,
      "end": 514551,
      "timestamp": "08:10"
    },
    {
      "speaker": "B",
      "text": "思ってそれも怪異であの。",
      "start": 514551,
      "end": 516791,
      "timestamp": "08:34"
    },
    {
      "speaker": "A",
      "text": "まあ言い訳なんですよ。",
      "start": 516791,
      "end": 517971,
      "timestamp": "08:36"
    },
    {
      "speaker": "B",
      "text": "言い訳じゃないと思うしそっちの方がまあちゃんとトランスファラブルだしスキルとしてはなんか登壇できるからといってエンジニアとして強くなるかどうかといったら直接的にはそうではないし絶対キャリア上その面接って先で通れないもんだから面接に時間を通した方が効率はいいと思います俺もロッククライミングじゃなくてハシゴってことですよそれがで。",
      "start": 517971,
      "end": 541421,
      "timestamp": "08:37"
    },
    {
      "speaker": "C",
      "text": "もねでもねって言ったらかもしれないけど俺本当に東橋さんとKさんのこの2つの両極端の話はもう無茶苦茶してて実は裏でそう方ややっぱり計算はほらネットワーキングだったりとかねさっきのまああのバンジーエースの中役とバンクーバーだっけどっちか忘れちゃったけどまぁね仲の人とちょっとな仲良くなってみたいなことが食べるとかでどんどんキャリアやっぱりつなげていくタイプでまあかといってとかさも相当いい会社にね今働かれていてっていう分でじゃあその方法は何だったのつったらもう対策の部分がかなりやっぱりのメイトを占めていてそうでその対策っていうにおいてもやっぱ面接とかねあのの行動面接だったりとかやっぱりそういった部分でどう超えていくのかまあフロックのねイベントでもやっぱりエジメ買いとかやっていただいたりとかしたのでなんかすごいいい塩梅で両方の方法があるよってたくさんの視聴者に伝える場としてはここいい。",
      "start": 541421,
      "end": 591599,
      "timestamp": "09:01"
    },
    {
      "speaker": "B",
      "text": "かもね確かに確かに。",
      "start": 591599,
      "end": 593120,
      "timestamp": "09:51"
    },
    {
      "speaker": "A",
      "text": "心地良い方でやればいいんじゃないですかね苦手な。",
      "start": 594538,
      "end": 597280,
      "timestamp": "09:54"
    },
    {
      "speaker": "C",
      "text": "人はそこと苦手やしさそういうどっちのどっちのもうもう対策のためだけにやっぱり時間使うの苦手な人は苦手やろうし人前にずっと出るのが苦手な人も絶対苦手やろうしうそーまあで。",
      "start": 597280,
      "end": 609548,
      "timestamp": "09:57"
    },
    {
      "speaker": "A",
      "text": "もやっぱ楽しいっていうのがいいんじゃないですかね僕はやっぱその対策すんのは楽しいんですよね結構その対策してるうちにここはもうカバーできたなとかって思いながらやってるとそれに楽しみを覚える人だったんでその楽しみながらできるみたいなのがあったし経験も多分やっぱりみんなの前で喋ることでそれが楽しいとかキャッチアップしてなんか終わってみたら結構技術のついてだとかそれについて話せるようになったことなったぞとかって思ったらやっぱ多分楽しいんだろうし自分の楽しいに従ってやっていくのがいいのかなぁなんて感じますね。",
      "start": 609548,
      "end": 641638,
      "timestamp": "10:09"
    },
    {
      "speaker": "C",
      "text": "だからどっちかの方法しかないんだっていうふうにこう目なんか視野が狭くなることが一番怖いよねそういう意味でなったら確かに。",
      "start": 641638,
      "end": 649493,
      "timestamp": "10:41"
    },
    {
      "speaker": "A",
      "text": "全部できたらすごいですからね。",
      "start": 649493,
      "end": 650234,
      "timestamp": "10:49"
    },
    {
      "speaker": "C",
      "text": "まあまあ全部やるべきなのかもしれないけどさとは言ってもそう合う合わない。",
      "start": 650234,
      "end": 654236,
      "timestamp": "10:50"
    },
    {
      "speaker": "B",
      "text": "はあるからね全部できるスーパープレイヤーはいくらでもいます。",
      "start": 654236,
      "end": 657377,
      "timestamp": "10:54"
    },
    {
      "speaker": "C",
      "text": "からね世の中いや間違いないよとんでもない奴もいますからね本当怖いは特に東京みたい。",
      "start": 657377,
      "end": 662880,
      "timestamp": "10:57"
    },
    {
      "speaker": "B",
      "text": "なとこいるとはい、。",
      "start": 662880,
      "end": 664996,
      "timestamp": "11:02"
    },
    {
      "speaker": "A",
      "text": "そしたら、これまで結構やっぱり、今までの人、みんな、現在海外にいる人を中心にインタビューしてきたんですけど、けいくんは、初めて、こっちで、こっちというか、カナダで永住権を取って、3社経験して、それを踏まえて日本に帰ったんです。帰って、今は日本で働いてるんですけど、カルチャーショックというかなんか働いてみてどうですかざっくり日本で今は日本のit業界でも働いていてまあカナダの業界であのサースとかの業界でも働いてたと思うんですけどなんか違いってあります?",
      "start": 664996,
      "end": 702398,
      "timestamp": "11:04"
    },
    {
      "speaker": "B",
      "text": "外資っていう文脈で言うとやっぱカルチャー的には今まで自分がいたバンクーバーの会社と近いものがあるのかなと思いつつでもやっぱり日本っていう環境で日本人と一緒に働くとなんか今までなぁなぁルール的になぁなぁでまあやりやすいなぁと思ってた部分がしっかりなんか怒られたりとかこういう風に対外的に出て会社の名前出したら怒られるとか、そういう機会は増えたなと思うので、自由度っていう面では結構減ったのかなと思います。あと、9時5時じゃなくて9時6時になったのは俺は未だに不満ですね。",
      "start": 702398,
      "end": 742049,
      "timestamp": "11:42"
    },
    {
      "speaker": "C",
      "text": "そこの1時間、でかいのか、。",
      "start": 742059,
      "end": 743770,
      "timestamp": "12:22"
    },
    {
      "speaker": "B",
      "text": "やっぱ。マジでクソですね、。",
      "start": 743770,
      "end": 745521,
      "timestamp": "12:23"
    },
    {
      "speaker": "C",
      "text": "この1時間。",
      "start": 745521,
      "end": 748822,
      "timestamp": "12:25"
    },
    {
      "speaker": "A",
      "text": "それはエンジニアであっても、生化物ファーストではなく、。",
      "start": 748822,
      "end": 753675,
      "timestamp": "12:28"
    },
    {
      "speaker": "B",
      "text": "やっぱ時間ベースになるんですか?はそのなんだろ他のシフト制の仕事とかに比べると若干緩さはあるんですけどそれもやっぱり6時まではオンラインっていうその暗黙の了解なんかあるじゃないですかバンクバーでも5時まではとりあえずオンラインだよねみたいなあれが6時まであるので5時半にミーティングとか突っ込まれるとマジでないるみたいなあっ。",
      "start": 753675,
      "end": 775314,
      "timestamp": "12:33"
    },
    {
      "speaker": "C",
      "text": "たりしますねなるほどねあとあれだよね日本って割かし大金管理がすげー確か外資であったとしても確か厳しいっていうのがねあれ。",
      "start": 775314,
      "end": 784800,
      "timestamp": "12:55"
    },
    {
      "speaker": "B",
      "text": "僕僕の観測範囲では、僕が見てる外資のエンジニアさんたちはそんなことない。っていうか、エンジニアさんたちはそんなことないんじゃないかな。なんかそんな大金出金取るイメージはないけど。取る会社もあると思いますけど。僕の観測範囲ではいない。",
      "start": 784800,
      "end": 802757,
      "timestamp": "13:04"
    },
    {
      "speaker": "C",
      "text": "本当、外資だからなのかな、割と俺結構イケイケのスタートアップだねっていう風に言われる、なんか日本のスタートアップの方々と喋るけど、なんか多分法律上のは決まってるから、実は大金ちゃんとつけなくてはいけないんだよ、つけてないように見えてもねっていう風に言われたんで、へーって思ってたんだよな。",
      "start": 802767,
      "end": 818785,
      "timestamp": "13:22"
    },
    {
      "speaker": "B",
      "text": "へーそうなんだ。",
      "start": 818785,
      "end": 820316,
      "timestamp": "13:38"
    },
    {
      "speaker": "A",
      "text": "あれがもっと何もやんなくていいのかもしれないですね。確かその話あの1回目の、1回目2回目で。",
      "start": 820316,
      "end": 825599,
      "timestamp": "13:40"
    },
    {
      "speaker": "C",
      "text": "あの優吾君と確か話し。",
      "start": 825599,
      "end": 827540,
      "timestamp": "13:45"
    },
    {
      "speaker": "A",
      "text": "てたんだけど、確かにそういう意味ではなんかそういうなんか、退勤とかはけっこう明示的にあるみたいなのがあるみたいですね。",
      "start": 827540,
      "end": 836513,
      "timestamp": "13:47"
    },
    {
      "speaker": "B",
      "text": "でも、。",
      "start": 836513,
      "end": 836683,
      "timestamp": "13:56"
    },
    {
      "speaker": "C",
      "text": "そうか。5時から6時になったので、そんなに不満ですか?",
      "start": 836683,
      "end": 840805,
      "timestamp": "13:56"
    },
    {
      "speaker": "B",
      "text": "めちゃくちゃ不満っすね。",
      "start": 840805,
      "end": 842956,
      "timestamp": "14:00"
    },
    {
      "speaker": "C",
      "text": "高畑が1時間やんって思っちゃうと。",
      "start": 842956,
      "end": 845098,
      "timestamp": "14:02"
    },
    {
      "speaker": "B",
      "text": "いや、。",
      "start": 845098,
      "end": 845608,
      "timestamp": "14:05"
    },
    {
      "speaker": "A",
      "text": "でかいよ、。",
      "start": 845608,
      "end": 846158,
      "timestamp": "14:05"
    },
    {
      "speaker": "B",
      "text": "その1時間。",
      "start": 846158,
      "end": 846569,
      "timestamp": "14:06"
    },
    {
      "speaker": "A",
      "text": "毎日だからね、でかいでしょ。",
      "start": 846569,
      "end": 848720,
      "timestamp": "14:06"
    },
    {
      "speaker": "C",
      "text": "いや、なるほどね。これはちょっと、雇われが最近あんまり僕はないので、そうか、1時間のやっぱ重みってのがあるわけですな、。",
      "start": 848720,
      "end": 854424,
      "timestamp": "14:08"
    },
    {
      "speaker": "A",
      "text": "きっと。他からのプレッシャーみたいなのはあるよね?",
      "start": 854424,
      "end": 857495,
      "timestamp": "14:14"
    },
    {
      "speaker": "B",
      "text": "ピアープレッシャー、。",
      "start": 857495,
      "end": 859256,
      "timestamp": "14:17"
    },
    {
      "speaker": "A",
      "text": "あるかな?6時っていうことに対する例はないけど、他の人たちもみんなやっぱり同じ時間で働いてるからみたいな。全然、日本ではないんだけど、カナダの会社から今、僕はアメリカの会社に移って、結構、で、僕はアメリカのチームの人と働いてるから、プレッシャーみたいなのはちょっとあって、僕も結構、5時以降もたまに働いたりもしてるぐらい、サンフランシスコの人たちってやっぱり、結構頑張ろうみたいな人たちが多いし、アメリカ人って結構いっぱい働くんで、その人たちに合わせると、どうしても僕の時間は、けっこう他のバンクーバーのメンバーより長くなってるなって感じてて、それをなんか考えたときに、やっぱりなんかプレッシャーなのかなって思って、。",
      "start": 859256,
      "end": 901215,
      "timestamp": "14:19"
    },
    {
      "speaker": "C",
      "text": "で、。",
      "start": 901215,
      "end": 901326,
      "timestamp": "15:01"
    },
    {
      "speaker": "A",
      "text": "それ考えると、やっぱそれを日本人に当てはめると、やっぱ日本人ってアメリカ人よりも全然働くんで、その中でってなると、やっぱりけっこう6時までちゃんと頑張んなきゃなみたいな気持ちになりそうだなって、。",
      "start": 901326,
      "end": 914925,
      "timestamp": "15:01"
    },
    {
      "speaker": "C",
      "text": "僕、。",
      "start": 914925,
      "end": 915485,
      "timestamp": "15:14"
    },
    {
      "speaker": "A",
      "text": "思いましたね。",
      "start": 915485,
      "end": 917212,
      "timestamp": "15:15"
    },
    {
      "speaker": "C",
      "text": "ここは割と実は俺も聞いてみたかったところの一つが今出てきたんだけどバンクーバーでさあやっぱりそのトガシさんみたいななんだろうアメリカ日本社から会社で働くとまあアメリカチームで働く人が多いじゃないですかまあ俺が知ってる限りあとまあね朝なさんもそうだしセールスフォースもそうだしあとはアマゾンもそうだし割かしアメリカチームと一緒に働いてるんだみたいなのが多いなとは勝手に思ってるんだけど実際日本の外資で働かれてる方々ってどういう層の人たちと一緒に働く人が多いのかそれこそ日本のチームと働くことが多いのかってなんとなくの傾向分かりますか?",
      "start": 917222,
      "end": 954191,
      "timestamp": "15:17"
    },
    {
      "speaker": "B",
      "text": "ヤンヤン会社によりけりじゃないですかね、やっぱりひとくりに外資って言ってもデカすぎるんでその。",
      "start": 954201,
      "end": 958364,
      "timestamp": "15:54"
    },
    {
      "speaker": "C",
      "text": "ギャップが樋口まあねヤン。",
      "start": 958364,
      "end": 959045,
      "timestamp": "15:58"
    },
    {
      "speaker": "B",
      "text": "ヤン例えばアサナとか、アサナは分かんないけど、例えばセールスポーツとかだったらめちゃくちゃデカいからもはや日系企業って言われたりするじゃないです。",
      "start": 959045,
      "end": 967071,
      "timestamp": "15:59"
    },
    {
      "speaker": "A",
      "text": "か樋口ああまあそう、。",
      "start": 967071,
      "end": 967521,
      "timestamp": "16:07"
    },
    {
      "speaker": "C",
      "text": "日本にあるとねヤンヤン。",
      "start": 967521,
      "end": 967991,
      "timestamp": "16:07"
    },
    {
      "speaker": "B",
      "text": "そういった文脈で言うと働くのは日本のチームが主流になるだろうしそうじゃないgotmarket型のこれから作っていくぞっていう会社で働くとやっぱコミュニケーションは本社の方になるしそこは一応に外資だからこうっていうのは言いづらいですよね。",
      "start": 967991,
      "end": 985356,
      "timestamp": "16:07"
    },
    {
      "speaker": "C",
      "text": "なるほどねこれやっぱ日本ってマーケットがクソでかいじゃないですか言うてもだから俺がもしもアメリカのその本社の会社の気持ちになるんだったらやっぱ日本にブランチを開けるイコール日本に市場を広げたいから出すわけだろうなとは勝手に思ってはいてすると多分働くチームメンバーとしてはやっぱり日本スペシャリストの人たちが多いのかなっていうのが俺の勝手な予想ではあったんですよねいや、。",
      "start": 985356,
      "end": 1008423,
      "timestamp": "16:25"
    },
    {
      "speaker": "B",
      "text": "実際そうだと思いますよ。日本で例えばおかかえの営業部隊がいたり、日本のCSMってカスタマーサクセスマネージャーっていうポジションがいて、そこで大口のお客さんの面倒を見る窓口があったりとか、そういう日本のビッグカスタマーを抱えるための部隊みたいなのはやっぱり多いんじゃないかな、外資っていう括りで考えると。",
      "start": 1008423,
      "end": 1030595,
      "timestamp": "16:48"
    },
    {
      "speaker": "A",
      "text": "けいくんの働き方的にはどんな感じなんですかけいくんは一応エンジニアで入ってるじゃないですかで前に聞いたところで言うと今のところ日本支社にはエンジニア二人なのかなでそれ以外の人たちそれ以外のごめんなさいエンジニアとコラボする場合も結構ある感じなの仕事の中で僕は基本。",
      "start": 1030605,
      "end": 1050857,
      "timestamp": "17:10"
    },
    {
      "speaker": "B",
      "text": "的にはその働いているエンジニアリングのチームが本社にあるチームだからその日本でのコラボレーションっていうのはあんまり発生しないかなだからなんだろううんそんなに何か外資外資強度マーケットというイメージではないなんかそれで言う。",
      "start": 1050857,
      "end": 1066066,
      "timestamp": "17:30"
    },
    {
      "speaker": "A",
      "text": "とさっきのセナさんの質問は結構サイズによるのかなーって思っててサイズが小さいと絶対アメリカのチームと働くんですよそうするとやっぱりアメリカの人となるとなりやすくてで僕の会社の中でも僕のチームはあのニューヨークとサンフランシスコとバンクーバーにいるんで、そういう働き方になってて、でもほとんどのチームはバンクーバーのチームで、結構やっぱ、。",
      "start": 1066066,
      "end": 1090968,
      "timestamp": "17:46"
    },
    {
      "speaker": "C",
      "text": "緩い、。",
      "start": 1090968,
      "end": 1091228,
      "timestamp": "18:10"
    },
    {
      "speaker": "A",
      "text": "アメリカよりも緩い働き方してて、多分、アマゾンとかもそのチームによりイケリで、そのバラバラになっているところはそのちょっと厳しいところに合うみたいなアメリカの方に合うみたいななってて多分カナダでチームが完結しているところとかはそうあの緩いというかカナダの車のカナダのなんていうの国風なのか車風なのかわかんねーけどえっとによる感じになるのかなってちょっと僕のイメージですよね。",
      "start": 1091228,
      "end": 1117160,
      "timestamp": "18:11"
    },
    {
      "speaker": "C",
      "text": "いやほらやっぱり日本のそういう外資で働く人たちと話す機会が最近増えたからさそうそうちょっと日本の外資のこともいろいろ知りたいなーって最近思うことが増えてて。",
      "start": 1117160,
      "end": 1125445,
      "timestamp": "18:37"
    },
    {
      "speaker": "A",
      "text": "なるほどありがとうございますミーティングとかってどういう感じで朝。",
      "start": 1126697,
      "end": 1131058,
      "timestamp": "18:46"
    },
    {
      "speaker": "B",
      "text": "にとか時差だよねだから日本時間と向こうのオーバーラップしてる時間に入ってくる感じだから日本の朝ってなるとオーバーラップする国っていうのは少ないからどうしても後半になりがちだ。",
      "start": 1131058,
      "end": 1144883,
      "timestamp": "18:51"
    },
    {
      "speaker": "A",
      "text": "よねそうすると逆にその9時8時っていうのがぼやけたりしないのエンジニアその多分外資系の日本にある外資系ってやっぱりセールス系とかマーケットとかが多く多いと思っててその人たちってやっぱり日本に向けに発信するから全部日本の時間じゃんそれに対してK君のエンジニアリングっていうのはそのオーバーラップしないといけないとかコラボレーションしないといけないっていうのでなんかちょっとなんかぼやけさせられるんじゃないかなみたいな一応な。",
      "start": 1144883,
      "end": 1174872,
      "timestamp": "19:04"
    },
    {
      "speaker": "B",
      "text": "んだろうあんまりぼやけないようにはなってるねなんか例えばチームのミーティングとかがあったらそれは業務時間外超えるみたいなのはないし越えたら、越えることがあってもですね断れるし、そこのバウンドリーはしっかりしてるんですよ。まあでもこれは外資っていう文脈上、やっぱポジションによってみんな違うんじゃないかなと思う。同じエンジニアっていう人たちでも違う会社では違うルールかもしれないし。",
      "start": 1174872,
      "end": 1203803,
      "timestamp": "19:34"
    },
    {
      "speaker": "C",
      "text": "なるほどねーまあ日本でやっぱり帰ってだもねそうなかなかいないよねだから日本にやっぱり帰ってねそれって返して働くっていう人ってまだまだフロッカーだってこれやな方やと正直思っちゃいるのですごい新鮮だなと思うけど他にないですかそういうなんかやっぱり海外でやっぱりずっと長いことはね語られてしかも計算の場合はこっちでキャリアを始めてに始めた人間であって日本での音そのエンジニア経験っていうのともちろん初めてだと思うんですけどなんかカルチャーショック聞いてみたいなとは思ってますけどね、。",
      "start": 1203813,
      "end": 1233162,
      "timestamp": "20:03"
    },
    {
      "speaker": "B",
      "text": "他あれば。カルチャーショック難しいな。全体的に言うと、なんだろうな。なんか細かい不便なシステムとかあったりするのかな。あんまり言えもん。",
      "start": 1233162,
      "end": 1249818,
      "timestamp": "20:33"
    },
    {
      "speaker": "C",
      "text": "感じないっていうこともね逆に言うと発見の一つかなって思うけどやっぱりそれは外資的な働き方っていう部分がカナダとも結構あっててそんなにキャリア的にもびっくりするくらいの差はなかったっていう発見。",
      "start": 1249828,
      "end": 1260816,
      "timestamp": "20:49"
    },
    {
      "speaker": "B",
      "text": "ってことですかねそうですね意外とこっち来てみてその想像してたほどの違いはなかったなっていうイメージ感はありますねでもあれかなあのこれがまたなんかそれさっき名前出したセールスフォースとかその日本でのその団体がすごいしっかりしてる会社だと雰囲気が違うのかもしれない。",
      "start": 1260816,
      "end": 1280337,
      "timestamp": "21:00"
    },
    {
      "speaker": "A",
      "text": "ですけどね確かにそういう人にも話し聞いてみたいですねそのうちあとはやっぱりその帰った理由みたいなのも聞いてみたいなと思うんですけどなんかその確か当時あのちょっと話してたと思ったんだけどその当時別のところからもオファーもらってましたよねそれをなんか今の会社を選んだ理由とかまあなんかカナダにあとはその受ける時にもうあの東京のオフィスに行くってのは決まってたわけじゃないですかそのだからそこにその日本に帰る可能性があるところを受けたなんかそのカードまあざっくり帰った理由って何な。",
      "start": 1280337,
      "end": 1321097,
      "timestamp": "21:20"
    },
    {
      "speaker": "B",
      "text": "んですかざっくり帰った理由としては1回東京っていうか日本で働いてみたかったっていう好奇心が一番最初に来て2つ目としてはやっぱり個人的に情報発信していることが海外のキャリアとか日本のみんな海外行こうぜみたいな内容だったのでそこを考えるとやっぱ日本ってどういう都市なのかなってしちょってあがったって部分も大いにありましてこれからキャリアのプロジェクトリーを考えても自分がカナダでずっと居続けるっていうよりは1回こっちも体験しておこうっていう文脈が多くてそれこそ年齢の話になってきますけどその40、50になってから日本に帰るのと今働き盛りのその20代後半で帰るっていうのではやっぱり見える景色も全然違うのかなとこの段階で日本に帰っておくと日本に合わせたキャリア形成もできるしまあ嫌になったら全然カナダ帰れるしっていうのでなんか選択肢の多さっていう点で考えてもこのタイミングなのかなと思った次第ですでもやっぱりキャリアもそうだけどそれ以上に日本好きなんで肉生活する環境としてそれがすごい良かったなっていうそのエンジニアになってこのエンジニアのなんだろう給料帯で日本っていうのを体験するっていうのも1回体験してみたかったし多角的な面で日本って1回行ってみたいなっていうのはありましたね。",
      "start": 1321097,
      "end": 1396861,
      "timestamp": "22:01"
    },
    {
      "speaker": "A",
      "text": "じゃあ帰ってきて、帰ってみて今は満足かなって感じですか?",
      "start": 1399563,
      "end": 1402355,
      "timestamp": "23:19"
    },
    {
      "speaker": "B",
      "text": "まあそうね、おおむね満足してるかななんかなんだろうでもキャリアにコミットもちろんするんだけどそれ以上にそのキャリア以上のこともやっていきたいなとは最近思いつつその個人今までは好きでその個人の情報発信とかもしてたけどそれをちゃんとなんだろう形にできるようにしていきたいなと思って最近ようやくなんかいろいろ構想を練ったりとかしているところですね。",
      "start": 1402355,
      "end": 1426360,
      "timestamp": "23:22"
    },
    {
      "speaker": "C",
      "text": "なんかいいところと悪いところとやっぱあんのかな今いわゆるとこと言い方が。",
      "start": 1428163,
      "end": 1432246,
      "timestamp": "23:48"
    },
    {
      "speaker": "B",
      "text": "あまりのプロコンだなと。",
      "start": 1432246,
      "end": 1434008,
      "timestamp": "23:52"
    },
    {
      "speaker": "C",
      "text": "思っててあれすかねやっぱ俺計算にこれ聞きたかったのよやっぱそのyoutbeとかさあのなんだろうまあねあのいろんなメディアにやっぱりお顔出されたりするかなと思うんですけどそういうのってさあやっぱりなんだかんだ言って人口の多い要するにたく他者からのやっぱ影響の多い地域にいた方がなんかそういうモチベーションで起こるのかなって気はしててなんかそういうところだとやっぱり東京に行ってさ、やっぱり人口で言うんだったらもうバカみたいな人多いわけじゃないですか、バンクーバーに比べて多分、会うエンジニアの数とか偉い人とかすごい人とかっていうのも多分ボリュームそれ違うんだろうしやっぱりそういうなんか普段の接するなんか層というか式、なんかね、あの会う人たちがやっぱり変わっていったからそういう情報発信に火がついていったのか元々の性格なのかっていう部分だとこの辺なんかあるのかな、相互関係って思ったんです。",
      "start": 1434008,
      "end": 1482449,
      "timestamp": "23:54"
    },
    {
      "speaker": "B",
      "text": "けど正直情報発信としてはバンクーバーにいた頃の方がモチベーションありましたね樋口そうなの?それって何でかっていうと多分海外に行ったら自分が他の人とは違う資産の話をしているんだなって向こうの話をするだけでやっぱりある程度価値のある情報になってたので発信しやすかったですけどこっちになるとこっちの人たちと似たような目線で物事を日々見ることになるから発信する内容もそんなに日本の人たちに寄っていってしまうなっていうのもありつつそう。",
      "start": 1482449,
      "end": 1519539,
      "timestamp": "24:42"
    },
    {
      "speaker": "C",
      "text": "だったんですねあとは。",
      "start": 1519539,
      "end": 1522051,
      "timestamp": "25:19"
    },
    {
      "speaker": "A",
      "text": "日本には東京には美味しいご飯が多いんですよあの多分あのケイくんのインスタグラムの統計取るとわかると思うんだけどあのバンクーバーにいた頃のご飯の写真と今の東京でのご飯の写真数が違いますからやっぱ取る時間なんてないですよ。",
      "start": 1522051,
      "end": 1538044,
      "timestamp": "25:22"
    },
    {
      "speaker": "C",
      "text": "東京ではインスタのストーリー。",
      "start": 1538044,
      "end": 1540285,
      "timestamp": "25:38"
    },
    {
      "speaker": "B",
      "text": "のそうね投稿頻度上がったしほぼほぼ猫か飯って。",
      "start": 1540285,
      "end": 1543888,
      "timestamp": "25:40"
    },
    {
      "speaker": "A",
      "text": "いう。",
      "start": 1543888,
      "end": 1543988,
      "timestamp": "25:43"
    },
    {
      "speaker": "C",
      "text": "いやその話すんのかなぁ俺さずっとバンクーバーから計算変える時に俺計算覚えてっかな俺ずっと賭けをしててですねしてますあの俺はカナダでキャリアを始めた人が要するに東京みたいな魅力であふれる街に帰ったらカナダにも帰ってきたくなくなるだろうというのにまあ別途してましてで割と周りので他のなんだろうあのフロッカーやの方々はやそんなことないよとやっぱりまあ例えばキャリアの上限っていう分だったらねなかなか次のステップ見るんだったらバンクーバーとカナダもまだまだ見るんじゃないのっていうので持ってくるんじゃないまた一方で言ってさあそろそろか答えの方も聞いてみたいなといやいやならないよ答え合わせこんなところで。",
      "start": 1546497,
      "end": 1589414,
      "timestamp": "25:46"
    },
    {
      "speaker": "B",
      "text": "まだわかんないですよなんか方針。",
      "start": 1590620,
      "end": 1593261,
      "timestamp": "26:30"
    },
    {
      "speaker": "C",
      "text": "はだってそろそろ結構立つっしょ。",
      "start": 1593261,
      "end": 1595022,
      "timestamp": "26:33"
    },
    {
      "speaker": "B",
      "text": "1年そう立つしその見えてきたものもあるなぁと思って確かにおっしゃる通り例えば量がずっとその量の論調として言ってたところがすごい正しいなって日々実感してて例えば量の言ってたこと何かっていうと海外の会社が日本に来てその海外の会社のgotマーケットっていう文脈で舞台作るじゃないですかしたらエンジニアのポジションってその本社で実際のメインストリームのものを作るっていう文脈じゃなくなるんですよgotマーケットになるとだからエンジニアとして幸せなのはどっちかって言われたら確実に北米なんですよああそうやっぱそこはこじこじで帰れるしゆるいしやってることも楽しいしでかいマジででかい一生モックいってるから俺これだから絶対にその僕がこれから先ずっとエンジニアとしてキャリアを形成してで走り切りたいほんともの作るの大好き一行一行の行動愛してるみたいなこの仕事を墓場まで続けていきたいだったら絶対バンクーバー帰ると思いますそう。",
      "start": 1595022,
      "end": 1667277,
      "timestamp": "26:35"
    },
    {
      "speaker": "C",
      "text": "なんだなるほどね逆説。",
      "start": 1667277,
      "end": 1669198,
      "timestamp": "27:47"
    },
    {
      "speaker": "B",
      "text": "的に言うと俺がそれをしたいかどうかってまだ答えが決まってないのでまだ何とも言えんっていうのがアンサーですねバンクーバーに帰るか帰らないかといえばエンジニアとしては絶対に給料も全然天井高いしバンクーバーの方がしかもバンクーバーにいるとアメリカっていうもっと天井の高いところが隣にあるからそこへのチャンスも絶対そっちの方が多い。",
      "start": 1669198,
      "end": 1689615,
      "timestamp": "27:49"
    },
    {
      "speaker": "C",
      "text": "しうーんそうよねしかもワーク。",
      "start": 1689615,
      "end": 1692996,
      "timestamp": "28:09"
    },
    {
      "speaker": "B",
      "text": "ライフバランスも絶対エンジニアはカナダの方がいいしそのカナダが国として完璧な国とは僕は全然思わないんですけどでもとはいえエンジニアっていうその自分の視点で考えるとやっぱりバンクーバーの生活ってほんと良かったんだなと思いますお金的。",
      "start": 1692996,
      "end": 1710420,
      "timestamp": "28:12"
    },
    {
      "speaker": "C",
      "text": "にもぜひそうなんだ。",
      "start": 1710420,
      "end": 1712881,
      "timestamp": "28:30"
    },
    {
      "speaker": "B",
      "text": "でも逆に言うとなんかカナダで例えば起業したいってなったってなってするじゃないですかしたら一番最初に思いつくのって日本人相手の商売だと思うん。",
      "start": 1714021,
      "end": 1726465,
      "timestamp": "28:34"
    },
    {
      "speaker": "C",
      "text": "ですよまあそうだね間違い。",
      "start": 1726465,
      "end": 1728326,
      "timestamp": "28:46"
    },
    {
      "speaker": "B",
      "text": "ないだってもしそのなんだろう自分でサービス作って一発当てるぜって個人開発以上のスタートアップレベルのサービス作るとかなったらそれこそシリコンバレー行った方が多分成功確率高いしバンクバレーやる意味ってあんまりないでも日本人あえての商売でいいんであれば日本から始めた方が絶対にシナシーっていうかスタートダッシュは切れるしっていう文脈で考えるとエンジニア以外っていうところの選択肢の多さで考えると東京の方が多いんじゃないかなとだからサラリーマンとして幸せなのは100%バンクーバーなんですよでもサラリーマン以外の文脈で考えると東京の方がチャンス多いなと思います。",
      "start": 1728326,
      "end": 1768415,
      "timestamp": "28:48"
    },
    {
      "speaker": "C",
      "text": "へー面白いある程度答え出てんじゃんって思ったけどね今。",
      "start": 1768415,
      "end": 1771958,
      "timestamp": "29:28"
    },
    {
      "speaker": "B",
      "text": "ですだから時間があるうちにいろいろショット打ってみてどれがその選択肢としてまだバンクーバーも日本も選べるうちにショット打ってみてどっちの方が向いているかで決まるんじゃないかなと思っていますだから今のこの現段階でどっちに行きますよみたいなはなかなか言えないでもなるほどね日本で働いていてなんかそのエンジニアとしての幸福の上限みたいなも見えてきたかなっていうのはありますね。",
      "start": 1774080,
      "end": 1803769,
      "timestamp": "29:34"
    },
    {
      "speaker": "C",
      "text": "なるほどねーいやーここは多分みんな聞いたかった聞きたかったんじゃないかなと思うので素晴らしい回答ありがとうございますい。",
      "start": 1803769,
      "end": 1810801,
      "timestamp": "30:03"
    },
    {
      "speaker": "A",
      "text": "えいえまあでもK君のこれからで言うと全然そのバンクーバーとかまあカナダに戻ってきたりだとかまあはたまたアメリカだったりヨーロッパにまだ行く可能性っていうのは全然残してのまあ今のところ日本選んでるってことですよねそう。",
      "start": 1810801,
      "end": 1823440,
      "timestamp": "30:10"
    },
    {
      "speaker": "B",
      "text": "だから全然状況によっては日本出るとかもあるしこれから先の自分の人生がどうなるかも全然今のところわかんないのでマジでわかんないのではいまあどう転ぶかですねうんなんかライフステージとかもあるだろうし。",
      "start": 1823440,
      "end": 1840351,
      "timestamp": "30:23"
    },
    {
      "speaker": "A",
      "text": "なんか僕としてはなんか強調したいのは別にけいくんとかまあ僕あのけいくんがどっち選ぼうがなんか答えとして日本がいいのか北米がいいのかっていうよりはその選択肢があるのが一番いいことなんじゃないのかなって思うんですよねそのまあけいくんはえっと1020歳で北米というかカナダに渡ったのかなあれ21だったっけ22歳か、22歳で渡って、英語力も身につけ技術も身につけ、英中研もこっちで取れて、だから何だろうね、その日本に帰ることもできるし、帰らないこともできたし、まあでも今のところは日本にいるっていうので、今後も、今はなんか日本がちょっと停滞してるみたいなで、カナダもあんまり経済的には良い状況ではないけど、今後もずっと選ぶことができるっていう、その選択肢を残せるっていうのとか、もちろん英語なんで、英語で会話だったりエンジニアリングができるんで、どこの国でも基本的には行けるっていう。その選択肢がすごいいっぱいあるこれからもまあそれを選び選ぶことができるっていうのはすごい良いことですよね。",
      "start": 1842400,
      "end": 1912714,
      "timestamp": "30:42"
    },
    {
      "speaker": "C",
      "text": "素晴らしいそうだね本当にねカナダも行けるし日本も行けるしじゃあ日本の今の時期ここちょっと嫌だからじゃあカナダ行こうとかねカナダのこの時期ちょっと厳しそうやから日本行こうみたいなのそれを選択肢と呼ぶっていう部分だったら素晴らしいことだよね別。",
      "start": 1912714,
      "end": 1925700,
      "timestamp": "31:52"
    },
    {
      "speaker": "A",
      "text": "に二択である必要もなくて別になんだろうずっとずっと点々としてもいいわけじゃないですか基本的にはおじいちゃんおばあちゃんになってもフラフラしてても別にいい。",
      "start": 1925700,
      "end": 1938961,
      "timestamp": "32:05"
    },
    {
      "speaker": "C",
      "text": "と思うんでその自信をねカナダでつけることができたっていうのもそれも含めての選択肢っていう。",
      "start": 1938961,
      "end": 1943486,
      "timestamp": "32:18"
    },
    {
      "speaker": "B",
      "text": "ことですねそうですねだからまあこれから先はどんなかわかんないですというのが短いアンサーです。",
      "start": 1943486,
      "end": 1948593,
      "timestamp": "32:23"
    },
    {
      "speaker": "C",
      "text": "ちなみにまあどうでも良いことにいきなり行っちゃっていいのかなっていうのも考えつつなんだけどやっぱりホラーさっきの音がしたのは知らないけどご飯は美味しい物価は安いねまあ交通機関もしっかりしていてまあ安心安全夜であるてもいいみたいなかそういうなんか生活的な部分でのながら良さみたいな部分なさそうなんですか東京離れたくないなぁと。",
      "start": 1950831,
      "end": 1972309,
      "timestamp": "32:30"
    },
    {
      "speaker": "B",
      "text": "かヤンヤンああないこのぶつになんだろうまあ定期的に帰ってきたいなとは思うけどなんかこのクオリティオブライフを一生守り続けたいみたいなのはなくててか正直東京という町にあまり愛着がなくてなんか最終的になんか何日本で家とか買うんなら俺多分東京では買わないと。",
      "start": 1972309,
      "end": 1995734,
      "timestamp": "32:52"
    },
    {
      "speaker": "C",
      "text": "思いますモトキうーんまあそうだね東京俺も買うイメージ。",
      "start": 1995734,
      "end": 1999757,
      "timestamp": "33:15"
    },
    {
      "speaker": "B",
      "text": "ないもんななんか本当、投資物件とかで買うんだったらまだアリなんだろうけど、なんか自分のコストっていうか、何、頭良い悪いとか、リターン度返しで自分の理想の家とか建てるんやったら、東京で建てる意味があんまりわかんないので、家以外の部分で。",
      "start": 1999757,
      "end": 2019942,
      "timestamp": "33:19"
    },
    {
      "speaker": "A",
      "text": "あとはなんか日本からまあ僕も含めてなんですけど日本からまあカナダに来た人でよく聞くのはあの通勤がすごい嫌だって。",
      "start": 2019952,
      "end": 2027596,
      "timestamp": "33:39"
    },
    {
      "speaker": "B",
      "text": "いうのが結構聞くんです。",
      "start": 2027596,
      "end": 2029256,
      "timestamp": "33:47"
    },
    {
      "speaker": "A",
      "text": "けどそこらへんはどうですか?",
      "start": 2029256,
      "end": 2030387,
      "timestamp": "33:49"
    },
    {
      "speaker": "B",
      "text": "クソゴミですねそれはそう。",
      "start": 2030387,
      "end": 2034159,
      "timestamp": "33:50"
    },
    {
      "speaker": "C",
      "text": "だよねそうだそれは。",
      "start": 2034159,
      "end": 2035179,
      "timestamp": "33:54"
    },
    {
      "speaker": "B",
      "text": "その話しないとダメだわ確かにもうクソゴミですよマジであのうそ多分日本人があの不幸な人多い理由の大半これなんじゃないかと思うぐらいゴミです。",
      "start": 2035179,
      "end": 2048364,
      "timestamp": "33:55"
    },
    {
      "speaker": "C",
      "text": "ねマジで嫌いなのでそうか、日本俺もしょっちゅう結構出張行く方やと思うけどさラッシュの時間絶対避けるからあんまり実はそこまでって思ってたんだけど働き出すと違う。",
      "start": 2048364,
      "end": 2062108,
      "timestamp": "34:08"
    },
    {
      "speaker": "B",
      "text": "ラッシュの時間避ければいいんですけど行きは避けれても帰り避けづらいじゃないですか。",
      "start": 2062108,
      "end": 2066228,
      "timestamp": "34:22"
    },
    {
      "speaker": "C",
      "text": "ヤンヤンああまあそらそうか終わるのは終わるもんねだ。",
      "start": 2066500,
      "end": 2068502,
      "timestamp": "34:26"
    },
    {
      "speaker": "B",
      "text": "って時間ヤンヤンだから帰りの時間ましそうなところで帰ることはできてもやっぱり我慢の時間は絶対どっかにあってそのモミクチャにされている時は俺なんでこんなとこいるんだろうとは思いますね。",
      "start": 2068502,
      "end": 2083193,
      "timestamp": "34:28"
    },
    {
      "speaker": "C",
      "text": "ヤンヤン間違いないよな俺も正直その満員電車の臭さが嫌でバンクーバー来た。",
      "start": 2083193,
      "end": 2089297,
      "timestamp": "34:43"
    },
    {
      "speaker": "B",
      "text": "まであるもんな若干ヤンヤンスカイトレイン乗りたいなあと思いますもんね。",
      "start": 2089297,
      "end": 2092801,
      "timestamp": "34:49"
    },
    {
      "speaker": "C",
      "text": "ついてますねいつもね。",
      "start": 2093969,
      "end": 2094909,
      "timestamp": "34:53"
    },
    {
      "speaker": "B",
      "text": "本当にね2両しかない。",
      "start": 2094909,
      "end": 2096873,
      "timestamp": "34:54"
    },
    {
      "speaker": "A",
      "text": "しやっぱりなんかエンジニアである以上やっぱりその東京は外せないじゃないですか基本的にはまあリモートとかこの頃とかあの九州のあの方になんか大きい会社ができてかりとかはしてるにしろ、やっぱり日本で長い目でキャリアって見た時に、一つの地方にある会社にずっと居続けるわけにもいかないのかな、多分だと思うし、やっぱ転職とかして、これからどういう会社で働いていこうみたいなのを見た時に考えると、やっぱり東京っていうのは絶対ね、その、住むことになると思うんだけど。",
      "start": 2096873,
      "end": 2134291,
      "timestamp": "34:56"
    },
    {
      "speaker": "B",
      "text": "で、。",
      "start": 2134291,
      "end": 2134402,
      "timestamp": "35:34"
    },
    {
      "speaker": "A",
      "text": "なんか僕が1つすごい残念だな。まあ、残念というか、日本、東京に帰るのを、なんだろう。",
      "start": 2134402,
      "end": 2141438,
      "timestamp": "35:34"
    },
    {
      "speaker": "B",
      "text": "引っかかりとして感じる部分?",
      "start": 2141438,
      "end": 2142939,
      "timestamp": "35:41"
    },
    {
      "speaker": "A",
      "text": "あの、帰りたくない理由が、やっぱその、コミュートしないといけない。コミュート、その、通勤しないといけない。",
      "start": 2142939,
      "end": 2149625,
      "timestamp": "35:42"
    },
    {
      "speaker": "B",
      "text": "で、。",
      "start": 2149625,
      "end": 2150115,
      "timestamp": "35:49"
    },
    {
      "speaker": "A",
      "text": "通勤しないっていうのを選ぶとしたら、やっぱり家賃がめちゃくちゃ高くなるっていう。それが、それだともう、全然カナダのバンクーバー以上じゃないですか。",
      "start": 2150115,
      "end": 2158637,
      "timestamp": "35:50"
    },
    {
      "speaker": "B",
      "text": "なんかバンクーバーぐらい金出してくれたら全然近く住むんすよ例えばオフィスが新宿なら全然代々木上原住むしオフィスが六本木なら全然六本木に変なアパート借りるしでもそう下がるじゃないですか東京行くとバンクーバーに比べるとどうしてもそうだねーそこであんな人混みにもみくちゃにされて通勤しろって言われたらそらもう。",
      "start": 2158647,
      "end": 2182155,
      "timestamp": "35:58"
    },
    {
      "speaker": "A",
      "text": "それはちょっとむずかしいですよ。やっぱ中心地に住もうとすると、QOLみたいなのはやっぱりさがっちゃうというか、その通勤に関してはもちろんあがるんだけど、やっぱり部屋が狭くなったりだとかもそうだし金額基本的にはやっぱすごいお金とか使うことになるんで過所分所得みたいなのも減るだろうしそこが結構やっぱり気になっちゃうところですよね帰ろうかなって考えるときにいつもやっぱりあーちょっと通勤は絶対嫌だからやっぱりもう住むとしたら近くでもそうするとまあ340万はやっぱかかっちゃうよなみたいなそこにすごい40万僕としてはそこ。",
      "start": 2185171,
      "end": 2231559,
      "timestamp": "36:25"
    },
    {
      "speaker": "B",
      "text": "が一番かなそこはちょっと覚悟しておいた方がいいね帰ってくるのに。",
      "start": 2231559,
      "end": 2235460,
      "timestamp": "37:11"
    },
    {
      "speaker": "C",
      "text": "ねちなみにまあやっぱりこれもね視聴者の方からすると期待部分の一つじゃないかなぁと思うんですけどやっぱり給料は下がるんだなぁっていうのはもちろんあるんだろうと思うんですけどどの会社もやっぱりマトリックス決まってるじゃないですかあのこのその。",
      "start": 2235460,
      "end": 2248863,
      "timestamp": "37:15"
    },
    {
      "speaker": "A",
      "text": "地域によってみたいなさ。",
      "start": 2248863,
      "end": 2249884,
      "timestamp": "37:28"
    },
    {
      "speaker": "C",
      "text": "なんどうですか計算周りにその外資の方でね働かれている方もお友達多いんじゃないかなと思うんですけどやっぱ結構その北米アメリカバンクーバーできあうか考えようかバンクーバーの同じ外資で同じポジションで働いている人と比べても何割減くらいです。",
      "start": 2251031,
      "end": 2268371,
      "timestamp": "37:31"
    },
    {
      "speaker": "B",
      "text": "かヤンヤン何割っていう数字出すの難しいなだってみんなやっぱ具体的な数字教えてくれないですからでも絶対バンクーバーの方が高いそれは確実に言えるだってスタートアップで2000万とか出るじゃないですかバンクーバーはヤンヤンどうじゃヤンヤンないもんこっちそれは絶対になんか旧人とか見てても日系企業とかだとシニアエンジニアで800万とかじゃないです。",
      "start": 2268371,
      "end": 2291040,
      "timestamp": "37:48"
    },
    {
      "speaker": "C",
      "text": "かヤンヤン難しいヤンヤンバンクーバーだと。",
      "start": 2291040,
      "end": 2293380,
      "timestamp": "38:11"
    },
    {
      "speaker": "B",
      "text": "シニアだったら大体大台湾乗るイメージあるじゃないですか少なくとも。",
      "start": 2293380,
      "end": 2296702,
      "timestamp": "38:13"
    },
    {
      "speaker": "C",
      "text": "少なくともそうだね。",
      "start": 2297602,
      "end": 2299885,
      "timestamp": "38:17"
    },
    {
      "speaker": "A",
      "text": "ちなみに、日本にある外資企業って、日本の内資企業に合わせて、給料レンジ決めてるわけではないじゃないですか。たぶん。で、SFアメリカで言うとSFとニューヨークがすごい高い、あの、家賃とかがすごい、家賃とか物価が高いところで、で、カナダで言うと、やっぱバンクーバー、トロント、まあ特にバンクーバーは結構高いんですね。だからその、カナダの中では、そこにいると、やっぱ給料レンジが高くなるんですけど、東京って今、東京っていうか日本って、その今まではその、なんだろうレンジ的には安いところにいたと思うんだけど今結構物価が上がることによってそこのレンジも上がるんじゃないのかなと思うんだけどなん。",
      "start": 2299885,
      "end": 2346290,
      "timestamp": "38:19"
    },
    {
      "speaker": "B",
      "text": "かこれ数字のマジック起こってると思ってて日本全体では低いですよ東京だけがバンクーバ並みに上がってんですよ今だから例えばお給料を決めるチームがSFにいるとするじゃないですか、そのやたちが日本がどうこうなんて式にするわけないじゃないですか。日本は日本、東京じゃなくてっていう文脈で考えると日本ってパッて見たときに、じゃあ平均給料これぐらいだな、じゃあこれぐらいのレンジでいいかって決め方をされてる気がする。これはソースがあるわけじゃないから僕の裸なんですけど、でもこういうところで変な数値のマジックが働いて、東京住んでんのに、なんだろう、こんなもんでいいんだみたいな給料感になってる気がする。",
      "start": 2346290,
      "end": 2383976,
      "timestamp": "39:06"
    },
    {
      "speaker": "A",
      "text": "それで言うとそのねカナダとかの中でも都市によってやっぱ違うからそこはなんかまあ多分それってその日本に進出してる企業がまだ少ないからそうなっちゃってるだけであってでそれがどんどん増えてきてそれに対してまあ日本の人がいや東京の物価めちゃくちゃ高いからあのカナダでSFとかニューヨークが高くてその他の地域が安いように日本の中でも買えてくださいみたいなのが起こってくるとだいぶそこらへんはマシになってくるものなの。",
      "start": 2383986,
      "end": 2414219,
      "timestamp": "39:43"
    },
    {
      "speaker": "B",
      "text": "かなどうなんだろうねでも東京以外で建てるメリットがないからさ外資企業からしたらオフィスを自動的に東京に合わせるべきなんだろうけどねでもそのスタティックスでなんか東京の金額感みたいなのがちゃんと取れてんのかなあそこちょっと疑問視してる。",
      "start": 2414219,
      "end": 2431507,
      "timestamp": "40:14"
    },
    {
      "speaker": "A",
      "text": "でもそれこそやっぱりそれを見るって言った時に、内資企業のことも考えると、じゃあこんな安くて済むんだみたいなのはやっぱりちょっと人間。",
      "start": 2433608,
      "end": 2442431,
      "timestamp": "40:33"
    },
    {
      "speaker": "C",
      "text": "の感覚的にはあるよね。確かにな、東京以外に建てるメリット、データセンターとかで地震の少ない地域とか、そんな文脈じゃないと思いつかないもんね。",
      "start": 2442431,
      "end": 2453345,
      "timestamp": "40:42"
    },
    {
      "speaker": "B",
      "text": "いやでもやっぱ働けば働くことやっぱりエンジニアとして幸せなのは北米ですよ絶対。",
      "start": 2453355,
      "end": 2458436,
      "timestamp": "40:53"
    },
    {
      "speaker": "C",
      "text": "それはそうなるほどねいや。",
      "start": 2458436,
      "end": 2461557,
      "timestamp": "40:58"
    },
    {
      "speaker": "B",
      "text": "面白いなだからそうなんか物価の違い側とかQOL側とか言うけど賞味両方バンクーバンの方が優れてると思うエンジニアっていう文脈で考えるならばね過小分所得も多いし家賃が上がるとはいえその分給料も上がるし安全性をだけはねどうしても買えないけどその代わりそのコミュートっていう点で考えたら1時間全然来じゃないしバンクーバーってこっちはもうマジで苦痛だけどなるほど。",
      "start": 2461557,
      "end": 2490999,
      "timestamp": "41:01"
    },
    {
      "speaker": "C",
      "text": "ねー確かに面白いなやっぱりこっち働いた人がねやっぱり日本に帰ると見えてくるところもやっぱりいろいろあるんだなぁ。",
      "start": 2490999,
      "end": 2498101,
      "timestamp": "41:30"
    },
    {
      "speaker": "B",
      "text": "って思ったただ一つやっぱり問題点をあげるとすればバンクーバーでやっぱり家はなかなか買うってなるとうーんちょっと難しいんじゃないかなと思いますね家を買うっていう文脈で考えると日本の方が理想の家建てれるんじゃない。",
      "start": 2498101,
      "end": 2512576,
      "timestamp": "41:38"
    },
    {
      "speaker": "C",
      "text": "かなと思うまだそれこそ。",
      "start": 2512576,
      "end": 2515137,
      "timestamp": "41:52"
    },
    {
      "speaker": "B",
      "text": "東京で働いて東京から外すっていうムーヴができるからねこっちはでもバンキューバーもどこ行ってももうなんかマップ全部赤じゃないですか金額で言うと高いね本当。",
      "start": 2515137,
      "end": 2525238,
      "timestamp": "41:55"
    },
    {
      "speaker": "C",
      "text": "にこうキットラムとかも。",
      "start": 2525238,
      "end": 2526479,
      "timestamp": "42:05"
    },
    {
      "speaker": "B",
      "text": "高いもんね今もはやなんかもう注文住宅とかも何それって感じじゃないですか中古物件を買ったみたいなみんなエンジニアとかがだからなんだろうそこの自由度はやっぱ犠牲にする必要もあるしやっぱ医療のシステムとかもやっぱバンクーバンウンチなんでバンクーバンっていうかカナダが。",
      "start": 2526479,
      "end": 2543103,
      "timestamp": "42:06"
    },
    {
      "speaker": "C",
      "text": "間違いないわそうなんだよな医療にお世話になるって話になったらもはや話が変わっちゃうんだよ。",
      "start": 2543103,
      "end": 2547884,
      "timestamp": "42:23"
    },
    {
      "speaker": "A",
      "text": "な本当にやっぱそれを考えるとその年をとっていくとやっぱ人間やっぱ病気とか怪我とか増えていくんでそうなるとやっぱり日本の医療はすごい魅力的ですけどねでも。",
      "start": 2547884,
      "end": 2562227,
      "timestamp": "42:27"
    },
    {
      "speaker": "B",
      "text": "でもあの日本これ僕もまた帰ってきてから得た知見なんですけど日本に帰るタイミングも結構大事だなと思ってと4050になってからエンジニアとして日本帰ると結構就職先大変かもって思う。",
      "start": 2564105,
      "end": 2578811,
      "timestamp": "42:44"
    },
    {
      "speaker": "A",
      "text": "年齢は僕ちょっと狙ってるん。",
      "start": 2578811,
      "end": 2581252,
      "timestamp": "42:58"
    },
    {
      "speaker": "B",
      "text": "だけどな相当エンジニアとして強いとか評判いいだったらいいけどなんか外資のエンジニアポジションってマジでパイ少ないからそこ狙いに行くっていうと結構なんかちゃんと準備して対策してもうカナダから就活終わって全部揃ってから帰るぐらいのムーブしないと大変なんじゃないかなっていうその着弾する時はいいですよ日本にその次とか年齢とかの話になってくるし本当日本に帰る時は結構な覚悟がいるんじゃないかなという部分でも感じたり。",
      "start": 2581252,
      "end": 2615427,
      "timestamp": "43:01"
    },
    {
      "speaker": "A",
      "text": "確かにそれはそうだね。",
      "start": 2615427,
      "end": 2617028,
      "timestamp": "43:35"
    },
    {
      "speaker": "B",
      "text": "あとはもう日本に行くんなら日本でも外資っていう部分にこだわるならもうエンジニアじゃなくてもいいっていうそのこだわりの捨ても必要かも下手なエンジニアよりもソリューションエンジニアとかの方がお金もらってたりする世界なん。",
      "start": 2617028,
      "end": 2630717,
      "timestamp": "43:37"
    },
    {
      "speaker": "C",
      "text": "でaあそうなんだそれは面白いねーまあでもほらトカシさんはなんかね日本帰る時ってあるでしょあのそれこそスタートアップだったりとか割とチャレンジングなことをする環境に行きたいなみたいな話じゃなかったっけ外資行きたい。",
      "start": 2630717,
      "end": 2645739,
      "timestamp": "43:50"
    },
    {
      "speaker": "A",
      "text": "なそうだねいや外資は多分行かなくてもいいかなみたいな考えてますけどでもまだちょっとまだ全然時間もあるんでちょっとよく考えたりまあケイ君みたいな人に聞いてみたいとかいろんな人に話聞いてから考えたいなって感じです。",
      "start": 2645739,
      "end": 2661326,
      "timestamp": "44:05"
    },
    {
      "speaker": "B",
      "text": "ね僕はそこらへんはまたコーヒーチャットにしましょうちなみにフロックは何?今年来るんですか?12月もう来ない?",
      "start": 2661326,
      "end": 2670845,
      "timestamp": "44:21"
    },
    {
      "speaker": "C",
      "text": "やるつもりはあるよやるつもりはあるかなきゃんドリームだけは毎年やりたいと思ってる。",
      "start": 2670845,
      "end": 2677239,
      "timestamp": "44:30"
    },
    {
      "speaker": "B",
      "text": "そうなんだじゃあまた12月ご飯いけそうですね楽しみ。",
      "start": 2677239,
      "end": 2679901,
      "timestamp": "44:37"
    },
    {
      "speaker": "C",
      "text": "ですもちろんもちろんただどういう目的でやるかまだ迷ってるんでそれはちょっとまた相談を。",
      "start": 2679901,
      "end": 2685084,
      "timestamp": "44:39"
    },
    {
      "speaker": "A",
      "text": "いろいろさせてくださいぜひぜひ。",
      "start": 2685084,
      "end": 2686465,
      "timestamp": "44:45"
    },
    {
      "speaker": "B",
      "text": "お願いします。",
      "start": 2686465,
      "end": 2687045,
      "timestamp": "44:46"
    },
    {
      "speaker": "A",
      "text": "そしたら、なんかK君って言ったら、この頃やっぱりそのテックワールドさんのビデオに出たりだとか、結構メディアの活動もしてるし、で、自分でYouTbe撮ったりもしてるし、あとあの、同じ会社で働いてる人がなんか個人開発みたいなの結構頑張ってる人じゃないですか。でなんかそういうところにも興味があると思うんですけど今後なんかキャリアとしてどういう方向にさっきあのエンジニアとしてはっていうのを結構強調されてたと思うんでエンジニアじゃない道もこれ結構考えてるのかなと思うんですけどこれからなんかどういう風な仕事をしていきたいとかこんなことに取り組んでいこうみたいなのあったらちょっと教えてほしいエンジニアとし。",
      "start": 2689673,
      "end": 2729081,
      "timestamp": "44:49"
    },
    {
      "speaker": "B",
      "text": "ては正直その行動を書くだけの仕事にはこだわりはあまりないですね今のところだからこれからその外資っていう文脈でその日本特有の僕が最大限になんだろうスキルセット使ってきたスキルセットを生かしてなんか会社会に貢献できるみたいなポジションがあったらそっち行きたいなと思うしそのなんだろう自分のポテンシャル総合的な観点で自分がどういう働き方するのが一番いいのかなというのはまだまだ模索中なのでサラリーマンとしてはそういったところを見つけていきたいなと思っているところですで、それ以外の個人的な活動としては、今まで情報発信とか、Mockインタビュー、模擬面接やったりとか、その、なんだろう、個人的な情報発信として海外のエンジニアいいよ、という啓蒙活動してきたりとかやってきたと思うんですけど、そこの、なんだろう、情報発信にもちゃんと何か落とし所をつけていきたいなと思っているところでして、個人的にもっと具体的に何をしたいかっていうと、やっぱり日本でエンジニアをやっていて、で、なんかキャリア迷ってるとか次どうしようかなってふわっと考えている人たちにこういうものがあるよっていう、なんだろう、提案というかアイディアを与えるみたいな活動をしていきたいなと思ってるんですよね。やっぱこっちで働けば働くほどバンクーバーとかアメリカの会社とかのエンジニア都市の労働環境とか生活ってすごい良かったなって思うのでその良さっていうものをみんなに伝えたいし、もしその日本っていう閉じられた環境だけではなくエンジニアとして本当の幸福の追求とかキャリアを追求っていう文脈で考えると海外って絶対に視野に入ってくると思うのでそういったところで僕にサポートさせてもらえるんであればそういった人たちをサポートしてあげたいなと思ってます例えば日本でずっとスタートアップで働いてきたけど次はメガベンで行きたいとか国際的な環境で働きたいっていう人にもアドバイスとかロードマップしてあげたりとかもできると思うしこれから先どっかのタイミングでエンジニアとして最大級海外行きたいぜとか一回海外体験してみたいんだよねとかキャリアチェンジの観点で海外行ってみたいっていう人たちにもアドバイスとかできると思うしそんな感じで今まで自分たちが自分たちが自分がやってきた発信とかその東京で見聞きしたことっていうことを一つにまとめていろんな人たちに対するそのなんかキャリア感へのなんだろうちょっとした啓蒙活動みたいなは個人的にやっていきたいなと思いますだからまぁ今までちょっとなんだろう東京っていう環境でのなんかサラリーマンにそじんでましたけどこれからはなんか情報発信というところにちゃんと力を入れていきたいなと思っている次第ですもっと具体的に言うとなんかサービスとしてなんか立ち上げたいなと思っていますこれからキャリアアップをしたい人たちもちろんエンジニアっていうスタートになると思うんですけどエンジニアがキャリアアップをさせたい時にそのキャリアアップを助けてあげる例えばもしかしたらこれから先もっとうまくいっていろんな指令ができたら会社を紹介とかできるかもしれないですしその面接に受かるための対策とかも待つまでやってあげたりとか英語をどれぐらい伸ばすべきかとかも具体的に教えてあげれると思うし例えばレジュメどうやって作るとかもできるしなんだろうビザみたいな官邸になるとサービスとしてやるのはちょっと危ないかもしれないけどそういう詳しい人を紹介してあげるぐらいはできると思うしこういうなんかブリッジになりたいなと最近俺デスストハマってるんでもうサムポーターブリッジズに。",
      "start": 2729081,
      "end": 2939998,
      "timestamp": "45:29"
    },
    {
      "speaker": "C",
      "text": "なりたいなと思ってますああああああああああああああ。",
      "start": 2939998,
      "end": 2942618,
      "timestamp": "48:59"
    },
    {
      "speaker": "A",
      "text": "ああああああああああああああ。",
      "start": 2942618,
      "end": 2943059,
      "timestamp": "49:02"
    },
    {
      "speaker": "C",
      "text": "ああああああああああああああああああああああああああああ。",
      "start": 2943059,
      "end": 2945239,
      "timestamp": "49:03"
    },
    {
      "speaker": "B",
      "text": "あああああああああ。",
      "start": 2945239,
      "end": 2945939,
      "timestamp": "49:05"
    },
    {
      "speaker": "A",
      "text": "やっぱ海外に若者が海外に出ていこうみたいな流れってやっぱ結構大きくなってんのかなっていうのはすごい感じててとはいえねそのどうしたらいいとかどういうふうに何だろう就職したらいいそれこそなんか英語の勉強だったりケイくんが教えられるそこのなんだろうやりたいっていうのとどうしたらいいみたいなののギャップがすごいあると思うんでそういうところにはすごいケイくんは確かに力になれるのか。",
      "start": 2959879,
      "end": 2982911,
      "timestamp": "49:19"
    },
    {
      "speaker": "B",
      "text": "な冒険していきたいです。",
      "start": 2982911,
      "end": 2983671,
      "timestamp": "49:42"
    },
    {
      "speaker": "A",
      "text": "ね感じますねそしたら最後の質問なんですけどまあもう本当にこれから投稿を考える海外でまあエンジニアのキャリアを進めたいみたいな人にいろんなアドバイスが多分できると思うんですけど短くまとめるとどんなアドバイスをしようか。",
      "start": 2983671,
      "end": 3001966,
      "timestamp": "49:43"
    },
    {
      "speaker": "B",
      "text": "なと思いますか以上ですいいっすねまじでなんか結婚とか車買う時と一緒やと思うんですよなんか海外行ってなんだろう大変なこともあるし後悔することもあると思うんですけどでも行かなくて良かったにはならないと思うんですよね例えば車買う前は東京って電車あるしいらんやろうとか言うんだけど買ったら買っていややっぱりなしの生活には戻れないとか結婚もバツイチの人にみんなに話し聞いて結婚しよかったと思いますか?なんだかんだ一回してよかったねって言うと思うんですよ。海外とこもそこと一緒で、一回自分の人生の中で行って挑戦しておくっていうのはめっちゃ大事だと思ってて、それのあるなしで、やっぱりコンプレックスとかにも関わってくるんで、自分は向こうに行って、こういう体験をしたから海外っていらないと思う、いかんでいいと思うっていう発言をできるっていうのはやっぱり個人的にすごい大事だ。",
      "start": 3001966,
      "end": 3065318,
      "timestamp": "50:01"
    },
    {
      "speaker": "C",
      "text": "と思うんですよね。",
      "start": 3065318,
      "end": 3067298,
      "timestamp": "51:05"
    },
    {
      "speaker": "B",
      "text": "向こうで成功して向こうにいるんならいいし向こうで就職成功してシャタライダーとやっぱ日本だなっていう結論やったら日本帰るの全然いいと思うんですよどんな結論になろうと言ったっていう言ったことによる自分への人格とか思想の変化っていうのは人生によってとても大事なので言った人の話聞くのも大事ですけど言った人の意見を自分のものにするんじゃなくて実際に自分も言ってみ聞き知ってその上で結論出した方があなたの人生で豊かになるんじゃないですかと言いたいですねだから行きましょうバラ。",
      "start": 3067308,
      "end": 3100935,
      "timestamp": "51:07"
    },
    {
      "speaker": "C",
      "text": "シーもうぐーの音も出ない感想ででもそうだねフロックにさやっぱり来る人たちもね死ぬ前に1回っていうワードが最近増え。",
      "start": 3100935,
      "end": 3111711,
      "timestamp": "51:40"
    },
    {
      "speaker": "B",
      "text": "たのよやっぱりマジでそう。",
      "start": 3111711,
      "end": 3114995,
      "timestamp": "51:51"
    },
    {
      "speaker": "C",
      "text": "いや割と最近3回か4回くらいずっとねれんちゃんって聞いててやっぱ死ぬまでに海外で働くってやらないと後悔すると思うんですよねっていうあれが増えてて。",
      "start": 3114995,
      "end": 3128518,
      "timestamp": "51:54"
    },
    {
      "speaker": "B",
      "text": "ほんまそれやし若いうちに言っとかないとダメージ取り返しつかないんで失敗した時むしろ失敗できるときにしといた方がいいと思うんですよね。",
      "start": 3128518,
      "end": 3137040,
      "timestamp": "52:08"
    },
    {
      "speaker": "C",
      "text": "本当そうだよね、俺もだってこっち来た。",
      "start": 3139073,
      "end": 3140934,
      "timestamp": "52:19"
    },
    {
      "speaker": "A",
      "text": "ときやんてとりあえずまぁ英語力もいらないし技術力もいらないからとりあえず行けと、行ってからそこは解決しろってことですかねいやだ。",
      "start": 3140934,
      "end": 3148639,
      "timestamp": "52:20"
    },
    {
      "speaker": "B",
      "text": "から行くっていうためのアクションを取りましょうってとこかなどちらかというと、今すぐチケット買って行けっていうよりは行きたいと思ってんなら準備してプラン立てて実行しろって言いたいですね素晴らしい、。",
      "start": 3148639,
      "end": 3161270,
      "timestamp": "52:28"
    },
    {
      "speaker": "C",
      "text": "もうけいさんのまんまで来てしまったら俺もうてんやまんやするだけやから俺のまんまで行くとやけどするので。",
      "start": 3161270,
      "end": 3166961,
      "timestamp": "52:41"
    },
    {
      "speaker": "B",
      "text": "それはマジで自信ある人だけにしてくださいいや間違いない、そうほったい力あるやつしか。",
      "start": 3166961,
      "end": 3171529,
      "timestamp": "52:46"
    },
    {
      "speaker": "A",
      "text": "無理なんで僕はそれでもとりあえず行くことが大切なんじゃないかなって思いますなんかやっぱその準備ばっかりで来れない人っていうのは多いと思うんでとりあえずまあそれそのまあもちろん準備できるんならした方がいいまあできるんだったらじゃああのあれですねビザ取ってまあビザっていうかチケット取ってから勉強し始めるといいかもなんですねできるだけ先のチケットをとりあえず取ってもうそこには行くってお尻を決めてでなんか準備とかできたらいいか。",
      "start": 3171529,
      "end": 3199063,
      "timestamp": "52:51"
    },
    {
      "speaker": "C",
      "text": "もしれない取り返しのないね渡航の仕方する人たまにいる。",
      "start": 3199063,
      "end": 3202645,
      "timestamp": "53:19"
    },
    {
      "speaker": "B",
      "text": "からねマジでだからこういう知識人にねリーチアウトしてこんなこと考えてますどうしましょうかっていう相談をするところから始めるのがいいんじゃないでしょうかしたらねいい人だったら相談載ってくれるかもしれんし。",
      "start": 3202645,
      "end": 3215272,
      "timestamp": "53:22"
    },
    {
      "speaker": "A",
      "text": "はいぜひぜひあのK君のツイッターかなか何かの概要欄に載せておくのでぜひそういう人はK君にリーチアウトしてちょっと相談してもらって海外に出ることを決めてもらえばいいのかなと思います。",
      "start": 3217220,
      "end": 3231030,
      "timestamp": "53:37"
    },
    {
      "speaker": "B",
      "text": "めちゃおすすめですはいはいと。",
      "start": 3231030,
      "end": 3235554,
      "timestamp": "53:51"
    },
    {
      "speaker": "A",
      "text": "いうことで最後まで聞いてくださりありがとうございました海外キャリアログは毎週月曜日に更新されますspotifyapplepodcasyoubetなどで番組のフォローをぜひお願いしますまたxでつぶやきがあるととても嬉しいですハッシュタグ海外キャリアログでお持ちしておりますありがとうございました。",
      "start": 3235554,
      "end": 3254994,
      "timestamp": "53:55"
    }
  ],
  "highlight1": "カナダの外資で3年目で1250万円からの給料をもらったという話から、海外でのキャリアの可能性について考える機会になった",
  "highlight2": "何事も最初が一番難しいというが、登壇することにもそういうものがあるのかなと思った、恥ずかしさを超えるメリットがあるならやってみる価値はある",
  "highlight3": "3社目で1250万、6ヶ月で給料が上がったという話から、海外でのキャリアアップのスピードが日本と比べてどう違うのかという話が聞きたくなった"
}